{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter two 8 1/2x4 1/2x2 1/2-inch metal loaf pans. Spray with nonstick spray; dust with flour. Mix dates and next 5 ingredients in medium bowl. Let stand 15 minutes. Sift flour, baking powder, coarse kosher salt, nutmeg, cloves, and cinnamon into another medium bowl.",
        "Whisk yogurt and oil in small bowl. Using electric mixer, beat butter and sugar in large bowl until blended. Add eggs 1 at a time, beating well after each addition. Beat in flour mixture in 3 additions alternately with yogurt mixture in 2 additions, beginning and ending with flour mixture. Stir in walnuts, pistachios, and dried-fruit mixture. Divide batter between prepared pans. Smooth tops.",
        "Bake cakes until tester inserted into centers comes out clean and cakes begin to pull away from sides of pans, about 50 minutes. Cool in pans 30 minutes. Turn cakes out onto racks. Cool completely. DO AHEAD: Can be made up to 1 month ahead. Wrap in foil, then enclose in resealable plastic bags. Store at room temperature up to 3 days or freeze up to 1 month. Thaw frozen cakes in refrigerator. Bring to room temperature before serving."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/4 cups chopped pitted Medjool dates",
        "3/4 cup chopped candied orange peel",
        "1/3 cup chopped dried Mission figs",
        "10 oil-cured olives",
        "2 tablespoons Nocello (walnut liqueur) or Frangelico (hazelnut liqueur)",
        "2 tablespoons water",
        "1 3/4 cups all purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon coarse kosher salt",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground cloves",
        "1/4 teaspoon ground cinnamon",
        "1/2 cup plain whole-milk yogurt",
        "2 tablespoons olive oil",
        "3/4 cup (11/2 sticks) unsalted butter, room temperature",
        "3/4 cup sugar",
        "3 large eggs",
        "2 cups coarsely chopped walnuts",
        "3/4 cup shelled unsalted natural pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Olive",
        "Dessert",
        "Bake",
        "Christmas",
        "Yogurt",
        "High Fiber",
        "Dried Fruit",
        "Date",
        "Fig",
        "Pistachio",
        "Walnut",
        "Spice",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "A Fruitcake to Love",
    "url": "http://www.epicurious.com/recipes/food/views/a-fruitcake-to-love-240697"
}
