{
    "directions": [
        "Position an oven rack in the center of the oven and preheat the oven to 350 degrees F.",
        "In a large bowl, sift together the flour, baking soda and salt; set aside. In the bowl of an electric mixer, cream the butter and granulated sugar until light and fluffy. Add the cooled chocolate and vanilla and beat for 3 minutes to incorporate. Beat in the eggs one at a time. Scrape down the sides of the bowl and beat for another 3 minutes. Gradually mix in the dry ingredients in three batches, alternating with the cold water. Beat for 1 minute after each addition to incorporate the ingredients. Mix until the batter is smooth.",
        "Coat two 9-inch round cake pans with nonstick cooking spray. Cut 2 circles of parchment paper to fit the pan bottoms and place them inside the pans; then spray the paper for added non-stick insurance. Pour the batter into the prepared pans and smooth the surface with a spatula; the pans should be two-thirds full. Bake for 30 to 35 minutes. The cake is cooked when a toothpick inserted in the center comes out clean and the cake springs back when touched. Leave to cool for 40 minutes.",
        "Turn the cakes out of the pans and remove the paper. Drizzle them with a few tablespoons of raspberry liqueur. With a metal spatula, spread 1/2 cup Chocolate Chip Buttercream on top of one of the layers. Start in the center and work your way out. Carefully place the second layer on top. Smooth the sides with buttercream, and then spread the rest over the top so that the cake is completely covered. Refrigerate for 5 minutes before decorating or cutting.",
        "With a large knife, scrape some shavings from a block of dark chocolate. Scatter the shavings over the cake.",
        "In the bowl of an electric mixer, dissolve the powdered sugar and water at low speed. Beat in the dark chocolate and vanilla. Add the butter gradually in small bits. Mix until everything is completely incorporated. Using a spatula, fold in the chopped chocolate and give a final quick spin."
    ],
    "ingredients": [
        "2 1/2 cups cake flour",
        "1 1/2 teaspoons baking soda",
        "1 teaspoon salt",
        "1 1/2 sticks unsalted butter, at room temperature",
        "2 cups granulated sugar",
        "3 1/2 ounces dark chocolate, melted and cooled",
        "1 teaspoon vanilla extract",
        "2 eggs",
        "1 1/2 cups cold water",
        "Raspberry liqueur, such as Chambord, for drizzling",
        "Nonstick cooking spray",
        "Chocolate Chip Buttercream, recipe follows",
        "Dark chocolate shavings, for decoration",
        "3 cups powdered sugar",
        "7 tablespoons hot water",
        "4 ounces dark chocolate, melted and cooled",
        "2 teaspoons vanilla extract",
        "1/2 stick unsalted butter, at room temperature",
        "1/4 cup semisweet dark chocolate, finely chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Baking",
        "Dessert",
        "Mixer Recipes",
        "Dairy Recipes",
        "Fruit",
        "Raspberry Recipes"
    ],
    "title": "A Gooey, Decadent Chocolate Cake",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/a-gooey-decadent-chocolate-cake-recipe"
}
