{
    "directions": [
        "Pour warm water and honey into a large bowl, and stir to dissolve the honey. Sprinkle the yeast over the top of the liquid, and let stand until the yeast bubbles and forms a creamy layer, about 10 minutes.",
        "In a bowl, stir together the whole wheat flour, gluten, flax seeds, flax meal, rolled oats, sesame seeds, quinoa, sunflower seeds, and salt until the seeds are dispersed evenly. Pour the flour mixture into the yeast mixture, add the coconut oil, and mix everything together. Scoop the dough out onto a well-floured surface, and knead until smooth and springy, about 15 minutes. Allow dough to rest for 15 minutes, then knead for another 10 minutes.",
        "Form the dough into a ball, place in an oiled bowl, and turn the dough over several times to coat with oil. Cover and let rise in a warm place until doubled, 30 to 45 minutes.",
        "Grease 2 9x5-inch loaf pans. Punch down the dough, and cut into 2 pieces. Form each piece into a loaf, place into the loaf pans, seam sides down, and cover the pans with plastic wrap. Let rise until doubled, about 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C). Bake the loaves in the preheated oven until the loaves are golden brown and sound hollow when tapped, 30 to 35 minutes. Let cool in pans about 10 minutes before turning out to finish cooling on racks."
    ],
    "ingredients": [
        "1 3/4 cups warm water (110 degrees F (43 degrees C))",
        "1/4 cup honey",
        "2 teaspoons instant yeast",
        "6 cups stone ground whole wheat flour",
        "6 tablespoons vital wheat gluten",
        "1 tablespoon flax seeds",
        "1 tablespoon flax seed meal",
        "1 tablespoon rolled oats",
        "1 tablespoon sesame seeds",
        "1 tablespoon quinoa",
        "1 tablespoon sunflower seeds",
        "1 teaspoon salt",
        "2 tablespoons coconut oil, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "100 Percent Whole Wheat Bread",
    "url": "http://allrecipes.com/recipe/212457/100-percent-whole-wheat-bread/"
}
