{
    "directions": [
        "In a saucepan bring the broth to a boil, add the carrots, the potatoes, and the celery, and simmer the vegetables, uncovered, for 10 to 15 minutes, or until they are tender. Transfer the vegetables with a slotted spoon to a large bowl, reserving the broth, and add the chicken to the bowl. In another saucepan cook the onion in the butter over moderately low heat, stirring, until it is softened, add the flour, and cook the roux, stirring, for 3 minutes. Add 3 cups of the reserved broth in a stream, whisking, reserving any remaining broth for another use, and bring the mixture to a boil, whisking. Add the thyme and simmer the sauce, stirring occasionally, for 5 minutes. Stir in the nutmeg, the parsley, and salt and pepper to taste, pour the sauce over the chicken mixture, and stir the mixture gently until it is just combined. Transfer the mixture to a 2-quart shallow baking dish or divide it among four 2-cup shallow baking dishes. The filling may be made 1 day in advance and kept covered and chilled. Bring the mixture to room temperature before continuing with the recipe.",
        "Into a bowl sift together the flour, the baking powder, the baking soda, and the salt, add the butter and the shortening, and blend the mixture until it resembles meal. Add the Cheddar and toss the mixture. Into a liquid measuring cup break the egg, add enough of the buttermilk to measure a total of 1/2 cup, and beat the mixture with a fork. Add the egg mixture to the flour mixture, stirring until the mixture just forms a dough, gather the dough into a ball, and on a floured surface pat it out 1/2 inch thick. Cut out as many rounds as possible with a 2-inch fluted round cutter dipped in flour, gathering the scraps and patting the dough out again in the same manner.",
        "Arrange the rounds on the chicken mixture, brush the tops of the rounds with the egg wash, and prick the rounds with a fork. Bake the pie in the middle of a preheated 450°F. oven for 15 to 25 minutes, or until the biscuits are puffed and golden and the filling is bubbling."
    ],
    "ingredients": [
        "4 cups chicken broth",
        "3 carrots, cut crosswise into 1/4-inch slices",
        "3/4 pound red potatoes, quartered lengthwise and cut crosswise into 1/2-inch pieces",
        "2 large ribs of celery, cut crosswise into 1/2-inch pieces",
        "2 1/2 cups cubed cooked chicken (the meat from a 3-pound chicken)",
        "1 onion, chopped",
        "3/4 stick (6 tablespoons) unsalted butter",
        "6 tablespoons all-purpose flour",
        "1/4 teaspoon dried thyme, crumbled",
        "1/4 teaspoon freshly grated nutmeg, or to taste",
        "1/2 cup minced fresh parsley leaves",
        "1 1/3 cups all-purpose flour",
        "1 1/2 teaspoons double-acting baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "2 tablespoons cold unsalted butter, cut into bits",
        "2 tablespoons cold vegetable shortening, cut into bits",
        "1/3 cup grated sharp Cheddar",
        "1 large egg",
        "about 1/3 cup buttermilk",
        "an egg wash made by beating 1 large egg yolk with 1 tablespoon milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Potato",
        "Bake",
        "Winter",
        "Chill",
        "Simmer",
        "Boil",
        "Gourmet"
    ],
    "title": "1985 Chicken Pie with Biscuit Crust",
    "url": "http://www.epicurious.com/recipes/food/views/1985-chicken-pie-with-biscuit-crust-11056"
}
