{
    "directions": [
        "In a food processor grind the almonds, scraping the bowl occasionally, for 5 minutes, or until they are the consistency of a nut butter, and reserve the mixture. In a bowl set over a saucepan of barely simmering water melt the chocolate and the butter, stirring occasionally, and remove the bowl from the pan. In the large bowl of an electric mixer beat the eggs until they are pale, add the sugar gradually, beating, and beat the mixture until it is very thick and pale. Beat in the chocolate mixture, the framboise, and the reserved almond butter and beat the mixture until it is combined well. Into the bowl sift together the flour, the baking powder, and the salt, beat the mixture until it is combined well, and fold in 1 cup of the raspberries gently. Turn the mixture into a well-buttered 8 1/2-inch springform pan, spreading it evenly and smoothing the top, and bake the torte in the middle of a preheated 350°F. oven for 40 to 45 minutes, or until a tester comes out clean. let the torte cool in the pan on a rack and remove the side of the pan.",
        "In a small heavy saucepan combine the jam and the sugar, bring the mixture to a boil, stirring, and boil it, stirring, for 3 minutes. Force the mixture through a fine sieve into a small bowl, pressing hard on the seeds, and discard the seeds.",
        "Invert the torte onto the rack, set over wax paper, remove the bottom of the pan, and spread the glaze on the top and side of the torte. Let the torte stand at room temperature for 2 hours or chill it for 30 minutes, or until the glaze is set. The torte may be prepared up to this point 1 day in advance and kept on the rack, covered with an inverted bowl, at room temperature.",
        "In a small heavy saucepan bring the cream to a boil and remove the pan from the heat. Stir in the chocolate, stirring until the mixture is smooth, and let the ganache cool for 3 minutes.",
        "Pour the ganache over the torte, smoothing it with a spatula and letting the excess drip down the side, and let the torte stand for 1 hour, or until the ganache is set. Transfer the torte carefully to a serving plate, garnish it with some of the additional raspberries and some of the lemon leaves, and serve the remaining raspberries, garnished with the remaining lemon leaves, separately."
    ],
    "ingredients": [
        "1/2 cup blanched almonds, toasted lightly",
        "2 ounces unsweetened chocolate",
        "2 tablespoons unsalted butter",
        "2 large eggs",
        "1 cup sugar",
        "1 tablespoon framboise or other raspberry brandy",
        "3/4 cup all-purpose flour",
        "1 teaspoon double-acting baking powder",
        "1/2 teaspoon salt",
        "1 cup raspberries plus additional for garnish and as an accompaniment",
        "1/3 cup raspberry jam",
        "1 tablespoon sugar",
        "1/4 cup heavy cream",
        "6 ounces fine-quality bittersweet chocolate, chopped",
        "lemon leaves (available at most florists) for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Raspberry",
        "Almond",
        "Gourmet"
    ],
    "title": "1989 Chocolate Raspberry Almond Torte",
    "url": "http://www.epicurious.com/recipes/food/views/1989-chocolate-raspberry-almond-torte-11037"
}
