{
    "directions": [
        "Sprinkle both sides of eggplant slices with 2 tablespoons salt, and layer them in a large baking dish with paper towels between each layer.",
        "Place a smaller baking dish on top of the eggplant slices, and weigh it down with several heavy food cans. Let sit for at least an hour or until the paper towels are visibly moist.",
        "Rinse eggplant slices with fresh water and pat dry with paper towels.",
        "Heat a large skillet on medium heat and pour in 2 tablespoons of canola oil.",
        "Working in batches if necessary, cook both sides of eggplant slices until they are slightly browned, about 5 minutes per side. Set cooked eggplant aside.",
        "Prepare sauce by combining the crushed tomatoes, tomato paste, oregano, basil, 1 teaspoon garlic powder, 1 teaspoon onion powder, 1 tablespoon olive oil, salt, and black pepper in a separate bowl. Set aside.",
        "Heat 1 teaspoon olive oil in a skillet over medium heat; cook and stir onion until translucent, about 5 minutes.",
        "Add frozen spinach and shredded carrots to onion. Cook until mixture is dry, 5 to 8 minutes. Set aside to cool.",
        "Combine ricotta cheese, eggs, Romano cheese, 1 teaspoon garlic powder, 1 teaspoon onion powder, and 1/2 teaspoon salt in a separate bowl.",
        "Spoon cooled spinach and carrot mixture into ricotta mixture and combine.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Begin lasagna assembly by pouring a thin layer of tomato sauce into a 9x13 inch baking dish.",
        "Place half the eggplant slices in a layer on top of tomato sauce.",
        "Spread half the ricotta cheese mixture on top of eggplant layer.",
        "Add another layer of tomato sauce, then layer on the remaining eggplant slices and remaining ricotta mixture.",
        "Finish with a final layer of tomato sauce, and spread mozzarella cheese over the top.",
        "Bake in the preheated oven for 45 minutes or until the mozzarella cheese is browned. Let sit for 10 minutes before serving."
    ],
    "ingredients": [
        "2 eggplants, sliced lengthwise into 1/4-inch thick slices",
        "2 tablespoons salt",
        "2 tablespoons canola oil",
        "1 (28 ounce) can crushed tomatoes",
        "1 (6 ounce) can tomato paste",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "1 tablespoon olive oil",
        "salt and ground black pepper to taste",
        "1 teaspoon olive oil",
        "1 onion, diced",
        "1 cup frozen chopped spinach",
        "1 cup shredded carrot",
        "1 (15 ounce) container ricotta cheese",
        "2 eggs",
        "1/2 cup freshly grated Romano cheese",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "1/2 teaspoon salt",
        "1 cup shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "3-Cheese Eggplant Lasagna",
    "url": "http://allrecipes.com/recipe/220067/3-cheese-eggplant-lasagna/"
}
