{
    "directions": [
        "Finely grate 1 orange to yield 1 Tbsp. zest; transfer to a small bowl. Slice oranges into 1/2\"-thick rounds; transfer to a resealable plastic bag and chill until ready to use. Add salt, pepper, and chopped sage to zest and stir to combine.",
        "Place turkey, breast side down, on a large cutting board. Cut along each side of backbone with kitchen shears—this will take some force (you can ask your butcher to do this). Discard backbone or reserve for another use.",
        "With turkey skin side down, use a knife to score down the long oblong bone in center of breast. Turn turkey skin side up, then firmly press down with both hands on breastbone until you hear a cracking sound. Rub zest mixture all over turkey, under skin, and inside cavity. Transfer turkey skin side up to a rimmed baking sheet, cover with plastic wrap, and chill 6–18 hours.",
        "Arrange a rack in middle of oven; preheat to 450°F. Tuck sage sprigs and reserved orange slices in an even layer under turkey. Let sit at room temperature 30–60 minutes to air dry.",
        "Brush turkey with oil, add 1/2 cup water to pan, and roast 30 minutes. Reduce oven temperature to 350°F. Rotate pan, add 1/2 cup water to pan, and brush turkey with more oil. Continue to roast, brushing with oil after 30 minutes, until skin is deep golden brown and crisp and an instant-read thermometer inserted into the thickest part of the breast right against breastbone registers 160°F, 55–65 minutes more.",
        "Transfer turkey to clean cutting board, tent with foil, and let rest at least 30 minutes before carving."
    ],
    "ingredients": [
        "2 navel oranges",
        "2 tablespoons kosher salt",
        "1 tablespoon freshly ground black pepper",
        "1 tablespoon finely chopped sage, plus 4 sprigs",
        "1 (12–14-pound) turkey, neck and giblets removed",
        "Olive oil (for brushing)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Thanksgiving",
        "3-Ingredient Recipes",
        "turkey",
        "Sage",
        "Orange",
        "Roast"
    ],
    "title": "3-Ingredient Thanksgiving Turkey With Orange and Sage",
    "url": "http://www.epicurious.com/recipes/food/views/3-ingredient-thanksgiving-turkey-with-orange-and-sage"
}
