{
    "directions": [
        "Cook green beans in a large pot of boiling salted water until crisp-tender, 5–7 minutes. Drain, then immediately transfer to a large bowl filled with ice water. Drain again and pat dry.",
        "Meanwhile, zest lemons to yield 1 Tbsp. zest. Juice lemons to yield 1/4 cup juice, then slice any remaining lemons into wedges. Cut leeks crosswise into 4\" sections, then thinly slice lengthwise into matchsticks.",
        "Heat oil in a large deep-sided skillet over medium-high until shimmering. Cook half of leeks, stirring occasionally, until lightly golden brown and crispy, about 5 minutes. Using a slotted spoon, transfer to paper towels; season with salt. Repeat with remaining leeks; reserve oil in skillet.",
        "Cook green beans, pepper, lemon zest, and remaining 1 tsp. salt in reserved oil over medium heat, tossing occasionally, just until warmed through, about 5 minutes. Add lemon juice and toss to coat, then transfer to a platter. Drizzle about 1/2 cup oil from pan over; reserve remaining oil for another use. Top with leeks and serve with lemon wedges alongside.",
        "Green beans can be blanched 1 day ahead; let dry, then transfer to an airtight container and chill."
    ],
    "ingredients": [
        "2 1/2 pounds green beans, preferably haricot verts, trimmed",
        "1 teaspoon kosher salt, plus more",
        "3 lemons",
        "2 large leeks, white and light-green parts only",
        "1 1/2 cups olive oil",
        "1/2 teaspoon freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "3-Ingredient Recipes",
        "Thanksgiving",
        "Green Bean",
        "Leek",
        "Side",
        "Lemon",
        "Wheat/Gluten-Free",
        "Vegan",
        "Vegetarian",
        "Dairy Free"
    ],
    "title": "3-Ingredient Lemony Green Beans With Frizzled Leeks",
    "url": "http://www.epicurious.com/recipes/food/views/3-ingredient-lemony-green-beans-with-frizzled-leeks"
}
