{
    "directions": [
        "Preheat oven to 400°F. Finely chop half of 1 fennel bulb. Chop 2 Tbsp. fronds, transfer to a small bowl, and set aside.",
        "Heat 3 Tbsp. oil in a 3–4-qt. heavy saucepan over medium. Cook chopped fennel, 1/2 tsp. salt, and 1/4 tsp. pepper, stirring, until softened, about 5 minutes.",
        "Add lentils, 1 tsp. salt, and 4 1/2 cups water, bring to a boil, then reduce heat and simmer, uncovered, until lentils are just tender but not falling apart, 15–25 minutes.",
        "Meanwhile, cut remaining 1 1/2 fennel bulbs into 1\" wedges.",
        "Heat 1 Tbsp. oil in a large ovenproof skillet over medium-high. Cook sausages, turning occasionally, until golden brown on all sides but still undercooked, about 8 minutes. Transfer sausages to a plate.",
        "Heat 2 Tbsp. oil in same skillet over medium-high. Cook fennel wedges and remaining 1 tsp. salt and 1/4 tsp. pepper, stirring, until golden brown on both sides, about 5 minutes. Nestle sausages among fennel wedges, then transfer skillet to oven and roast until sausages are firm and fully cooked through, about 8 minutes more.",
        "Cut sausages diagonally into 1/2\"-thick slices. Divide lentils among bowls, then top with sliced sausage, roasted fennel, a drizzle of oil, and reserved fennel fronds."
    ],
    "ingredients": [
        "2 medium fennel bulbs with fronds",
        "6 tablespoons olive oil, divided, plus more for serving",
        "2 1/2 teaspoons kosher salt, divided",
        "1/2 teaspoon freshly ground black pepper, divided",
        "1 cup dried lentils (preferably French green lentils; about 7 ounces)",
        "4 sweet Italian sausages"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "3-Ingredient Recipes",
        "Sausage",
        "Dinner",
        "Lentil",
        "Fennel",
        "Spring"
    ],
    "title": "3-Ingredient Sausage Dinner With Lentils and Fennel",
    "url": "http://www.epicurious.com/recipes/food/views/3-ingredient-sausage-dinner-with-lentils-and-fennel"
}
