{
    "directions": [
        "Prick each potato in several places with a fork. Microwave on high for about 9 minutes, or according to the microwave manufacturer instructions. Once tender, carefully move to a cutting board and cut each in half. Let cool.",
        "While the potatoes are cooking in the microwave, get started on cooking the sausage. Place the sausage in a medium skillet over medium-high heat. Stir it occasionally, breaking it into small pieces. Cook until no longer pink, about 10 minutes.",
        "While the sausage is cooking, chop all your vegetables and herbs. Roughly chop the spinach. Finely chop the cilantro. Slice the green onions and separate the whites and the greens.",
        "As the sausage finishes cooking, add the eggs to a medium bowl. Whisk in 1/4 teaspoon of black pepper, the garlic powder and chili powder. Continue to whisk until the whites and yolks are blended, about 15 seconds.",
        "Heat 1 tablespoon of the oil in a large skillet over medium heat. Add the eggs. Cook, stirring occasionally for about 5 minutes. Stir in the spinach and cook just until the eggs cook through and the spinach begins to wilt, 1 or 2 more minutes.",
        "While the eggs cook, you can begin to work on the potatoes. Roughly chop the potatoes (leave the skins on) and place in a medium bowl. Stir in the white portions of the green onions, 1/2 of the chopped cilantro, the remaining 1 tablespoon of olive oil, the remaining 1/4 teaspoon of black pepper and the sea salt. The ingredients should be mixed into the potatoes, but the potatoes should still be chunky.",
        "To assemble, arrange an equal portion of potatoes, eggs and sausage in each of 4 bowls. Crumble the cotija cheese and sprinkle an equal amount over each bowl. Divide the remaining cilantro and the green portions of the green onions and sprinkle them into each bowl. Add your favorite toppings and serve."
    ],
    "ingredients": [
        "4 medium red potatoes (about 4 ounces each)",
        "3/4 pound bulk ground breakfast sausage",
        "2 cups spinach leaves, coarsely chopped",
        "1 cup fresh cilantro leaves, finely chopped, divided",
        "3 green onions, sliced, white parts and tops separated",
        "6 large eggs",
        "1/2 teaspoon ground black pepper, divided",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon chili powder",
        "1/4 teaspoon fine sea salt",
        "2 tablespoons extra virgin olive oil, divided",
        "3 ounces crumbled cotija cheese",
        "Optional Toppings:",
        "Salsa",
        "Sour cream or plain Greek yogurt",
        "Hot pepper sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "30 Minute Potato Breakfast Bowls",
    "url": "http://allrecipes.com/recipe/245450/30-minute-potato-breakfast-bowls/"
}
