{
    "directions": [
        "Boil potatoes in salted water until tender, about 12 minutes. Drain potatoes and pour them into a bowl. Combine sour cream, egg yolk and cream. Add the cream mixture into potatoes and mash until potatoes are almost smooth.",
        "While potatoes boil, preheat a large skillet over medium high heat. Add oil to hot pan with beef or lamb. Season meat with salt and pepper. Brown and crumble meat for 3 or 4 minutes. If you are using lamb and the pan is fatty, spoon away some of the drippings. Add chopped carrot and onion to the meat. Cook veggies with meat 5 minutes, stirring frequently. In a second small skillet over medium heat cook butter and flour together 2 minutes. Whisk in broth and Worcestershire sauce. Thicken gravy 1 minute. Add gravy to meat and vegetables. Stir in peas.",
        "Preheat broiler to high. Fill a small rectangular casserole with meat and vegetable mixture. Spoon potatoes over meat evenly. Top potatoes with paprika and broil 6 to 8 inches from the heat until potatoes are evenly browned. Top casserole dish with chopped parsley and serve."
    ],
    "ingredients": [
        "2 pounds potatoes, such as russet, peeled and cubed",
        "2 tablespoons sour cream or softened cream cheese",
        "1 large egg yolk",
        "1/2 cup cream, for a lighter version substitute vegetable or chicken broth",
        "Salt and freshly ground black pepper",
        "1 tablespoon extra-virgin olive oil, 1 turn of the pan",
        "1 3/4 pounds ground beef or ground lamb",
        "1 carrot, peeled and chopped",
        "1 onion, chopped",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1 cup beef stock or broth",
        "2 teaspoons Worcestershire, eyeball it",
        "1/2 cup frozen peas, a couple of handfuls",
        "1 teaspoon sweet paprika",
        "2 tablespoons chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheesy Potatoes",
        "Cheese",
        "Potato",
        "Vegetable",
        "Comfort Food",
        "British",
        "European Recipes",
        "Shepherd's Pie Recipes",
        "Meat",
        "Dairy Recipes",
        "Beans and Legumes",
        "Pea Recipes",
        "Lamb Recipes",
        "Beef",
        "Cream Cheese Recipes",
        "Carrot Recipes",
        "Main Dish Recipes"
    ],
    "title": "30 Minute Shepherd's Pie",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/30-minute-shepherds-pie-recipe"
}
