{
    "directions": [
        "Sift the flour, sugar, kosher salt, baking powder and garlic powder into the bowl of a food processor. With the processor running, slowly add the butter, then the egg and then the milk. Process until the dough becomes elastic and can stretch without tearing, about 1 minute.",
        "Remove the dough from the processor and shape into a ball. On a lightly floured work surface, roll out the dough into a round 1/8 inch thick. Oil an 11-inch microwavable dinner plate with the 1 tsp. olive oil. Place the dough on the plate and trim the edges to fit. Microwave at 100% power until the dough is cooked through, about 6 minutes; it should be opaque with no transparent spots. Transfer the dough to a wire cooling rack.",
        "Preheat an oven to 450ºF.",
        "Cut the cheese into 6 slices, each about 3/8 inch thick. Place in a single layer in a glass bowl or baking dish and cover tightly with plastic wrap, leaving a small opening for the nozzle of a handheld smoking gun. Fill the chamber of the smoking gun with hickory chips, place the nozzle in the bowl and wrap with plastic wrap so that no smoke can escape. Smoke the cheese according to the manufacturer’s instructions. Repeat the smoking with another chamber of chips. Let stand, covered, for 5 minutes.",
        "Set the wire rack holding the dough on a baking sheet and brush the dough with the 1 Tbs. olive oil. Spread the pizza sauce on the dough and sprinkle with 1/2 tsp. of the sea salt. Arrange the cheese slices on top. Transfer to the oven and bake until the crust is crispy, 7 to 10 minutes. Remove the pizza from the oven and let cool for 2 to 3 minutes. Garnish with the basil leaves and sprinkle with the remaining 1/2 tsp. sea salt. Cut into 8 slices and serve immediately. Serves 2.",
        "Recipe by Chef Michael Voltaggio"
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1 tsp. sugar",
        "1 tsp. kosher salt",
        "1 tsp. baking powder",
        "1/4 tsp. roasted garlic powder",
        "4 Tbs. (1/2 stick) unsalted butter, melted and cooled",
        "1 egg",
        "1/4 cup plus 1 tsp. milk",
        "1 tsp. plus 1 Tbs. extra-virgin olive oil",
        "6 oz. fresh buffalo mozzarella cheese",
        "1/2 cup prepared pizza sauce or tomato sauce",
        "1 tsp. sea salt",
        "10 to 12 fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "30-Minute Pizza",
    "url": "http://www.williams-sonoma.com/recipe/30-minute-pizza.html"
}
