{
    "directions": [
        "Rinse the meat and pat it dry. Trim off all but 1/2 inch (12 mm) of the fat cap, but don’t remove the fat layer between the flat and the point of the brisket. Slice off any of the tough, thin membrane, called silverskin, from the meaty side. Apply the rub all over the brisket, making sure to coat the meat evenly. Let it sit for 1 hour to allow it to come to room temperature before cooking.",
        "If you are using a charcoal grill, start with a chimney half full of charcoal and light the chimney. When the charcoal is ready, dump it into the grill. Adjust the vents on the bottom of the grill so half of them are open and half are closed and the lid vents are open. Set the grate in place and cover the grill with the lid. Continue to burn the charcoal in a pile until the embers are red hot with a white ash. Add about 1/2 cup of wood chips to the fire and wait about 5 minutes, until the smoke escaping through the vents is white. Put the brisket on the grill and close the lid.",
        "If you are using a gas grill, preheat it with the lid closed until the temperature reaches 225°F (110°C), then turn off the heat on one side. Wrap 2 cups of wood chips in an aluminum foil packet, poke holes in the foil, and put the wood chips on the hot side of the grill. Make 4 or 5 more packets to add during the cooking time. Alternatively, put the wood in a smoker box. Set the grill grate in place and cover the grill with the lid for 5 to 10 minutes, until you see white smoke escaping from the vents. Open the lid and put the brisket on the side of the grill that is turned off. Close the lid.",
        "Cook the brisket for 2 hours. If you are using a charcoal grill, add a handful of charcoal and a handful of wood chips to the fire every 30 to 40 minutes; when you notice that smoke is no longer escaping through the vents, that means you need to add more chips to the fire. If you are using a gas grill, add a fresh packet of wood chips to the fire when you notice that white smoke is no longer escaping through the vents. If you are using a smoker box, remove the box and replenish it when you no longer see white smoke escaping.",
        "After 2 hours, open the lid and use a barbecue mop or a large basting brush to apply the mop sauce on all sides of the brisket. Rotate the brisket 180 degrees and close the lid.",
        "Cook the brisket for an additional 2 1/2 hours, or until it registers an internal temperature of 150°F (65°C) when probed with an instant-read thermometer. (For best results, insert the thermometer in a few places, aiming for the thickest part of the meat each time; avoid inserting it into the fat.)",
        "Remove the brisket from the grill and place on a doubled piece of heavy-duty aluminum foil that is large enough to wrap the brisket. Generously mop the brisket all over with the mop sauce. Wrap the brisket tightly in the foil and return to the grill. Close the lid and cook for another 3 to 4 hours, continuing to feed the grill with charcoal if necessary, until the internal temperature registers 190°F (90°C). You’ll also know your brisket is done when the thermometer stem slides into and out of your meat without resistance, like a knife through butter.",
        "Alternatively, after wrapping the brisket in foil you can transfer it to a 225°F (110°C) oven to finish the cooking; the brisket has all the smoke flavor it’s going to get at this point, so now all you’re doing is cooking the meat.",
        "When the brisket has finished cooking, line a cooler with a towel. Leaving the thermometer in place, place the wrapped brisket in the cooler on top of the towel. Fold the towel over the brisket and close the cooler. Let the meat rest in the cooler for 1 to 3 hours, or until you are ready to eat. (This lets you take the meat off when it is ready and hold it until the guests are ready.)",
        "To serve, unwrap the brisket and place it on a cutting board. Run a knife between the flat and the point to separate the two muscles of the brisket. Trim the excess fat from each muscle and slice each against the grain into pieces about the thickness of a pinky finger. The meat should hold together, not crumble. If the first slice falls apart, cut thicker slices. Pile the brisket on a platter and serve it with the barbecue sauce on the side. Serves 12 or more.",
        "Adapted from",
        "Taming the Feast: Ben Ford’s Field Guide to Adventurous Cooking",
        ", by Ben Ford and Carolynn Carreño (Atria Books, 2014)."
    ],
    "ingredients": [
        "1 whole untrimmed (packer-cut) beef brisket, 12 to 14 lb. (5.5 to\n  6.5 kg)",
        "1 cup (6 oz./185 g) Texas BBQ Dry Rub",
        "BBQ Mop Sauce",
        "Spicy Texas BBQ Sauce, warmed"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "8-Hour Smoked Brisket",
    "url": "http://www.williams-sonoma.com/recipe/8-hour-smoked-brisket.html"
}
