{
    "directions": [
        "1. Put 8 cups of the peas and 4 cups of the water in a large saucepan or Dutch oven. Add the salt, pepper, mace, cloves, thyme, and marjoram, cover, and bring to a boil. Reduce the heat, and simmer for about 45 minutes, until the peas are very tender.",
        "2. Drain the peas, reserving the cooking liquid in the sauceupan. Puree the peas in a food processor or with a food mill. If using a food mill, discard the skins. Press the puree through a sieve into the reserved liquid, stirring to combine thoroughly. Cover and set aside to keep warm.",
        "3. Combine the remaining 2 cups of peas with the remaining 2 cups of water in a medium saucepan. Cover and bring to a boil. Reduce the heat and simmer for 20 to 25 minutes, until the peas are just tender.",
        "4. While the second batch of peas is cooking, melt the butter in a sauté pan. Add the green onions, and sauté for about 2 minutes. Add the spinach and mint and stir together, cooking until the spinach has just wilted. Blend in the flour, and cook for about 1 minute.",
        "5. Drain the peas, reserving the cooking liquid, and stir the peas into the warm soup along with the spinach mixture. Heat until it begins to simmer, adding the reserved pea-cooking liquid—a little at a time—if the soup is too thick. Season with additional salt and pepper, if necessary.",
        "6. Pour the soup into a tureen, and garnish with diced toast and shredded calendula blossoms, if desired."
    ],
    "ingredients": [
        "10 cups fresh or frozen peas or petits pois (small, young green peas), divided",
        "6 cups water, divided",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon ground black pepper",
        "1/2 teaspoon ground mace",
        "2 cloves",
        "2 teaspoons dried thyme",
        "1 teaspoon dried marjoram",
        "4 tablespoons unsalted butter",
        "3 to 4 green onions, trimmed and sliced crosswise into 1/2-inch pieces",
        "1/4 pound fresh baby spinach, coarsely chopped",
        "2 teaspoons minced fresh mint",
        "3 tablespoons all-purpose flour",
        "Diced toast for garnish (optional)",
        "Shredded fresh calendula blossoms for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Food Processor",
        "Leafy Green",
        "Herb",
        "Vegetable",
        "Vegetarian",
        "Dinner",
        "Mint",
        "Spinach",
        "Legume",
        "Pea",
        "Spring",
        "Boil",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "A Green Peas Soup, without Meat",
    "url": "http://www.epicurious.com/recipes/food/views/a-green-peas-soup-without-meat-394705"
}
