{
    "directions": [
        "Stir potatoes, sour cream, cream cheese, 1 tablespoon butter, egg yolk, 1/2 teaspoon salt, and 1/2 teaspoon black pepper together in a bowl until smooth.",
        "Heat olive oil in a cast iron skillet or nonstick pan over medium-high heat. Add ground lamb, reduce heat to medium, and cook, stirring frequently, until browned and crumbly, 4 to 5 minutes. Pour off excess grease and season lamb with salt and black pepper to taste.",
        "Stir tomatoes with juice, onion, and carrot into ground lamb; simmer until vegetables are tender, 5 to 10 minutes. Add peas, reduce heat to low, and cook, stirring frequently, until peas are warmed, 2 to 3 minutes.",
        "Heat beer in a saucepan over medium heat; add beef bouillon. Cook and stir beer mixture until bouillon is dissolved, about 5 minutes.",
        "Heat remaining 1 tablespoon butter in a separate pan over medium-low heat until sizzling. Whisk flour into butter until thick and paste-like, about 1 minute. Stir beer mixture and Worcestershire sauce into flour mixture until gravy is smooth and thickened, 2 to 3 minutes. Stir gravy into lamb mixture and simmer until mixture is thickened, at least 5 minutes.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Grease a 9x12-inch baking dish.",
        "Pour lamb mixture into the prepared baking dish. Carefully spoon mashed potatoes over lamb mixture, covering like a crust. Sprinkle Cheddar cheese, parsley, and paprika over mashed potatoes.",
        "Broil in the preheated oven until crust is browned and cheese is melted, 4 to 5 minutes. Cool for about 5 minutes before serving."
    ],
    "ingredients": [
        "5 cups mashed, boiled potatoes",
        "1/2 cup sour cream",
        "2 ounces cream cheese",
        "2 tablespoons butter, softened, divided",
        "1 egg yolk",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 1/2 teaspoons olive oil",
        "1 pound ground lamb",
        "1 pinch salt and ground black pepper to taste",
        "1 (16 ounce) can stewed tomatoes with juice, chopped",
        "1 small onion, chopped",
        "1 small carrot, peeled and chopped",
        "1/2 cup peas",
        "1 cup Irish stout beer (such as Guinness®)",
        "1 cube beef bouillon",
        "1 tablespoon all-purpose flour",
        "1 tablespoon Worcestershire sauce",
        "3/4 cup shredded sharp Cheddar cheese",
        "2 teaspoons chopped fresh parsley",
        "2 teaspoons smoked paprika"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "A Scotsman's Shepherd Pie",
    "url": "http://allrecipes.com/recipe/235985/a-scotsmans-shepherd-pie/"
}
