{
    "directions": [
        "Preheat oven to 450°F. Set a rack inside a large roasting pan. Pour 4 cups water into pan. Pat turkey dry with paper towels. Tuck tips of wings under bird. If turkey is not brined, rub bird inside and out with salt. Season inside and out with pepper and place on rack in pan. Place onion and celery in cavity. Rub 3 tablespoons butter over turkey. Roast turkey, uncovered, for 30 minutes.",
        "Meanwhile, stir remaining 3 tablespoons butter, soy sauce, and mirin (or substitute store-bought teriyaki sauce for soy sauce and mirin) in a small saucepan over medium heat until melted and smooth. Add rosemary. Cover; keep glaze warm over lowest heat.",
        "Reduce oven to 325°F. Baste turkey with pan juices; add more water if needed to maintain at least 1/4\" liquid in pan. Roast for 30 minutes; baste with pan juices. Brush lightly with glaze.",
        "Continue roasting turkey, basting with pan juices and brushing with glaze every 30 minutes, and tenting with foil if turning too dark, until an instant-read thermometer inserted into thickest part of the thigh without touching bone registers 165°F (juices should run clear when thermometer is removed), about 2 3/4 hours total.",
        "Transfer turkey to a platter. Tent with foil; let rest for 1 hour before carving."
    ],
    "ingredients": [
        "1 12-14-pound turkey, giblets and neck removed, at room temperature for 1 hour",
        "3 tablespoons kosher salt (optional)",
        "1 1/2 tablespoons freshly ground black pepper",
        "1 medium onion, quartered",
        "2 celery stalks, coarsely chopped",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature, divided",
        "3 tablespoons reduced-sodium soy sauce",
        "1 tablespoon mirin",
        "3 sprigs rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Rosemary",
        "Celery",
        "Soy Sauce",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "A Simple Roast Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/a-simple-roast-turkey-51122680"
}
