{
    "directions": [
        "Heat the ghee in a large pot over medium-high heat and stir in the lamb meat. Cook and stir until evenly browned. Season with allspice, cinnamon, cloves, nutmeg, and cardamom and mix well.",
        "Place a layer of onion on top of the lamb in the pot, but do not stir. Top with layers of potato, eggplant, zucchini, and tomatoes.",
        "Repeat the layers of vegetables until you have used them up, ending with tomatoes on top. Place the chile pepper in the center of the tomatoes. Season with salt. Dilute the tomato paste in the water, and pour it over the vegetables. Bring to a boil, reduce heat to low, and simmer 1 hour, until vegetables are tender.",
        "With a mortar and pestle, crush together the garlic, a pinch of salt, and the dried mint. Mix with 2 tablespoons of liquid from the pot, and drop by spoonfuls over the vegetables in the pot, but do not stir. Simmer for 5 minutes more.",
        "Transfer the stew to a wide bowl or serving dish by gently tipping the pot and letting it slide out into the serving dish, while maintaining its layers. Sprinkle with ghee, if desired."
    ],
    "ingredients": [
        "1 tablespoon ghee (clarified butter)",
        "1 pound lamb meat, cut into small pieces",
        "Spice Mix:",
        "1 teaspoon ground allspice",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground nutmeg",
        "1 pinch ground cardamom",
        "2 onions, sliced",
        "1 potato, peeled and sliced",
        "1 pound eggplant, peeled and cubed",
        "1 pound zucchini, thickly sliced",
        "2 pounds tomatoes, cubed",
        "1 green chile pepper",
        "salt to taste",
        "1 tablespoon tomato paste",
        "1/4 cup water",
        "6 cloves cloves garlic, crushed",
        "salt to taste",
        "3 tablespoons dried mint",
        "1 tablespoon ghee (clarified butter), melted (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "A Vegetable Stew - Tabakh Rohoo",
    "url": "http://allrecipes.com/recipe/73138/a-vegetable-stew---tabakh-rohoo/"
}
