{
    "directions": [
        "Position oven rack in lower third of oven and preheat to 350 degrees F (175 degrees C).  (Using an oven thermometer will ensure proper baking temperature since ovens vary.)  Line cushion-type baking sheets with baking parchment; set aside.  (Professional bakeries double their baking sheets and use baking parchment.)",
        "In a medium bowl, whisk together flour, salt, baking soda and baking powder; set aside.  In a large mixer bowl, cream together butter, sugars and vanilla at medium speed until creamy and light.  Add eggs, one at a time, beating well after each addition.  Beat in corn syrup and cream or milk.  Reduce mixer speed to low.  Add flour mixture, in 3 separate batches, scraping down bowl after each addition.  Mix well to ensure full incorporation of flour mixture.  Stir in chocolate chips (or chopped chocolate) and nuts.",
        "For each cookie, using a 1- 3/8 inch spring-loaded scoop (or 1 tablespoon measuring spoon), scoop 2 level spoonfuls of dough and roll into a ball with wet hands.  (Dough will be very sticky.  Wetting hands between every 3 rollings of dough will prevent sticking. Simply hold hands under running tap water and shake hands 10 times over sink before handling dough.  Don't worry, this will not harm the cookies.  I guarantee that this added effort will be worth it for these cookies!)   Arrange at least 2 inches apart on prepared baking sheets.  (Cookies will spread a bit during baking.)  Flatten each ball of dough slightly with heel of hand or fingers.",
        "Bake for 14 minutes or until light golden brown around edges and centers are still a little puffy.  (Do not underbake this particular cookie or they will be too soft.)  Allow cookies to cool at least 5 minutes while on baking sheets before transferring (with a thin, metal cookie spatula) to wire racks to cool completely.  Repeat with remaining dough and fresh sheets of baking parchment.  Store cookies in an airtight container at room temperature.  (These chewy chocolate chip cookies keep better than traditional types.)",
        "Note:  Professional chefs and pastry chefs use coarse kosher salt and I use it in my everyday cooking and baking.  It really does have a better flavor.  However, you may substitute 1 teaspoon regular table salt for 1- 1/4 teaspoons coarse kosher salt.",
        "To Toast Nuts:  Toasting nuts brings out their flavor and makes them crisp.  It is easy to do.  Preheat oven to 350 degrees F (175 degrees C).  Place nuts, in a single layer, on an ungreased baking sheet.  (I like to use my round non-stick pizza pan because it has a lip on it which prevents the nuts from rolling off.)  Bake for 7 to 8 minutes, stirring halfway through baking time, or until nuts become fragrant and are lightly browned.  (Watch nuts closely to prevent burning.)  Cool nuts completely before chopping and adding to recipe.  (You can speed up the cooling process by immediately placing hot, toasted nuts onto a plate and place in the freezer for 5 to 8 minutes.  Halfway through chilling time, stir the nuts to aid the cooling process.)"
    ],
    "ingredients": [
        "3 cups unbleached all-purpose flour",
        "1 1/4 teaspoons kosher salt",
        "1 teaspoon baking soda",
        "1/4 teaspoon baking powder",
        "3/4 cup unsalted butter, softened",
        "1 cup dark brown sugar",
        "1/2 cup white sugar",
        "1 tablespoon vanilla extract",
        "2 eggs",
        "2 tablespoons dark corn syrup",
        "1 tablespoon half-and-half cream",
        "2 cups semisweet chocolate chips",
        "1 1/2 cups chopped walnuts, toasted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "ABC (Absolute Best Chewy) Chocolate Chippers",
    "url": "http://allrecipes.com/recipe/10918/abc-absolute-best-chewy-chocolate-c/"
}
