{
    "directions": [
        "Preheat an oven to 350°F. Butter the bottom and sides of a 9-inch round cake pan with 2-inch sides. Line the bottom with parchment paper and dust the sides with flour, shaking out the excess.",
        "Sift together the flour and baking powder in a bowl.",
        "In a bowl, whisk together the yogurt, oil, zest, vanilla, and salt.",
        "In a stand mixer fitted with a whip, beat the eggs on medium speed until frothy and well blended. Add the sugar gradually. Raise the speed to medium-high and whip until the sugar dissolves and the mixture is thick and pale, stopping the machine to scrape down the sides of the bowl at least once. Lower the mixer speed and add the yogurt mixture gradually. Add the dry ingredients gradually and beat just until well blended.",
        "Pour the batter into the prepared cake pan, spreading it evenly. Bake on a center rack until the surface is golden brown and firm to the touch and a toothpick comes out clean, about 40 minutes. Cool on a rack for 10 minutes, and then unmold and finish cooling, top side up, on the rack.",
        "To make the yogurt cream: In a bowl, whisk together the yogurt, honey, and vanilla. Gently fold in the whipped cream.",
        "Slice the cake into wedges to serve, topping each portion with a dollop of the yogurt cream, if desired."
    ],
    "ingredients": [
        "1 1/2 cups sifted all-purpose flour",
        "2 1/2 teaspoons baking powder",
        "1 cup plain whole-milk yogurt",
        "1/2 cup vegetable oil",
        "1 1/2 teaspoons grated lemon, Meyer lemon, or orange zest, or a combination",
        "3/4 teaspoon vanilla extract",
        "3/8 teaspoon kosher or sea salt",
        "3 eggs",
        "1 1/4 cups sugar",
        "1 cup plain drained yogurt or Greek yogurt (not nonfat)",
        "1/4 cup honey",
        "1/2 teaspoon vanilla extract",
        "1 cup heavy cream, whipped to firm peaks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Yogurt",
        "Lemon",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Absinthe's Golden Yogurt Cake",
    "url": "http://www.epicurious.com/recipes/food/views/absinthes-golden-yogurt-cake-56389457"
}
