{
    "directions": [
        "In a large bowl let the salt cod soak in enough cold water to cover it by 3 inches, changing the water several times, for an least 8 hours or overnight. Drain the salt cod well in a sieve and in a food processor purée it. Add the flour, the milk, the egg, the baking powder, the allspice, and the garlic and blend the mixture well. Transfer the mixture to a bowl and stir in the chili, the scallions, and the coriander. In a deep fryer or large deep skillet heat 1 1/2 inches of the oil to 360°F. on a deep-fat thermometer and in it fry teaspoons of the mixture in batches, stirring and turning them occasionally, for 1 to 2 minutes, or until they are golden and cooked through. Transfer the fritters as they are fried with a slotted spoon to paper towels to drain. The fritters may be made 2 days in advance and kept covered and chilled. Reheat the fritters on a rack in a shallow roasting pan in a preheated 450°F. oven for 5 minutes. Serve the fritters with the sauce.",
        "In a heatproof bowl combine the onion, the scallions, the bell pepper, the garlic, the chili, the salt, and the thyme. In a small saucepan bring the water to a boil with the vinegar, pour the vinegar mixture over the vegetable mixture, and let the mixture cool. Stir in the lime juice and the oil. The sauce may be made 2 days in advance and kept covered and chilled. Let the sauce come to room temperature, stir in the chopped coriander, and garnish the sauce with the coriander sprigs. Makes about 2 cups."
    ],
    "ingredients": [
        "1/2 pound skinless boneless salt cod, cut into 2-inch pieces and rinsed",
        "1 cup all-purpose flour",
        "1/4 cup milk",
        "1 large egg",
        "3/4 teaspoon double-acting baking powder",
        "a rounded 1/4 teaspoon ground allspice",
        "2 garlic cloves, minced",
        "a 4-inch-long fresh hot red or green chili, seeded and minced (wear rubber gloves)",
        "3 scallions, chopped fine",
        "1 tablespoon finely chopped fresh coriander if desired",
        "vegetable oil for deep-frying",
        "sauce chien as an accompaniment (Caribbean Spicy Dipping Sauce)",
        "1 small onion, minced",
        "3 scallions, minced",
        "1/3 cup minced red bell pepper",
        "2 garlic cloves, minced",
        "1 Scotch bonnet or habañero chili, seeded and minced (wear rubber gloves), or 1 teaspoon Scotch Bonnet Pepper Sauce*",
        "1 teaspoon salt",
        "1/4 teaspoon dried thyme, crumbled",
        "7/8 cup water",
        "2 tablespoons white-wine vinegar",
        "1/4 cup fresh lime juice",
        "2 tablespoons vegetables oil",
        "2 tablespoons chopped fresh coriander, or to taste, plus a coriander sprigs for garnish if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Appetizer",
        "Side",
        "Fry",
        "Cod",
        "Gourmet"
    ],
    "title": "Accras de Morue",
    "url": "http://www.epicurious.com/recipes/food/views/accras-de-morue-11455"
}
