{
    "directions": [
        "Whisk first 3 ingredients in medium saucepan to blend. Scrape in seeds from vanilla bean; add bean. Bring to simmer. Whisk yolks and sugar in bowl to blend. Gradually whisk in hot cream mixture; return to saucepan. Stir over medium heat until mixture coats back of spoon, about 3 minutes (do not boil). Stir in brandy; chill until cold.",
        "Process custard in ice cream maker according to manufacturer's instructions. Transfer ice cream to container; cover and freeze until firm.",
        "Whisk cocoa powder and sugar in heavy large saucepan to blend. Gradually whisk in water and espresso powder. Whisk over medium heat until mixture comes to boil. Remove from heat. Add chocolate; whisk until smooth. Whisk in bourbon. (Can be made 1 day ahead. Cover; chill. Rewarm over low heat until just pourable.)",
        "Stir wine and sugar in medium saucepan over medium-low heat until sugar dissolves. Add cherries; simmer until liquid is almost evaporated, about 20 minutes.",
        "Divide half of hot fudge sauce among 8 cups. Top with a few cherries, then scoop of ice cream. Repeat layering with ice cream, sauce, and cherries. Top each with whipped cream and serve."
    ],
    "ingredients": [
        "2 1/4 cups whipping cream",
        "1 cup whole milk",
        "1/4 cup malted milk powder",
        "1 vanilla bean, split lengthwise",
        "5 large egg yolks",
        "3/4 cup sugar",
        "2 tablespoons brandy",
        "1 cup unsweetened cocoa powder",
        "1/2 cup sugar",
        "1 cup water",
        "1 tablespoon instant espresso powder or instant coffee powder",
        "10 ounces bittersweet or semisweet chocolate, chopped",
        "1/2 cup bourbon",
        "1 1/2 cups Merlot",
        "1/4 cup sugar",
        "1 cup dried tart cherries",
        "Sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Coffee",
        "Milk/Cream",
        "Ice Cream Machine",
        "Chocolate",
        "Dessert",
        "Frozen Dessert",
        "Cherry",
        "Brandy",
        "Red Wine",
        "Summer",
        "Simmer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Acme Hot Fudge Sundaes",
    "url": "http://www.epicurious.com/recipes/food/views/acme-hot-fudge-sundaes-107100"
}
