{
    "directions": [
        "Heat oven to 375°. Cut a thin slice off round side of each squash half to create a stable base. Sprinkle with salt and pepper; coat with cooking spray. Place squash flesh side down on a baking sheet lined with aluminum foil; bake until golden and tender, 30 minutes. Remove from oven; flip squash and set aside. Heat broiler. In a large nonstick skillet over medium heat, heat 1 teaspoon oil. Add sausage; cook, breaking into coarse pieces, until brown, 6 minutes; transfer to a bowl. To same skillet, add remaining 2 teaspoons oil and leek; cook until leek is soft, 3 minutes. Add garlic; cook, 30 seconds. Add kale and toss; add broth. Cover and cook until kale is tender, 5 minutes; stir in sausage. Divide kale-sausage filling among squash. In a bowl, combine walnuts, Parmesan and panko; sprinkle evenly over squash bowls and coat with cooking spray. Broil until panko is golden, 2 minutes."
    ],
    "ingredients": [
        "2 medium acorn squash, halved down the middle, seeds removed",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "Olive oil cooking spray",
        "3 teaspoons olive oil, divided",
        "8 ounces hot Italian turkey sausage, casings removed",
        "1 large leek, white and light green parts only, halved and sliced",
        "2 cloves garlic, finely chopped",
        "4 cups tightly packed torn kale",
        "1/3 cup reduced-sodium chicken broth",
        "1/4 cup chopped walnuts",
        "2 tablespoons grated fresh Parmesan",
        "2 tablespoons panko breadcrumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Thanksgiving",
        "Dinner",
        "Sausage",
        "Kale",
        "Squash",
        "Fall",
        "Healthy",
        "Self",
        "Sugar Conscious"
    ],
    "title": "Acorn Squash with Kale and Sausage",
    "url": "http://www.epicurious.com/recipes/food/views/acorn-squash-with-kale-and-sausage-51203850"
}
