{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Place squash, pointed-side up, on a baking sheet.",
        "Bake in the preheated oven until squash is tender, about 1 hour. Cool squash until easily handled. Cut squash in half, remove seeds and stringy parts of meat, and peel skin from the squash and discard.",
        "Mash the squash meat in a bowl and measure 1 cup meat.",
        "Combine 1 cup squash meat and butter in a saucepan; add enough water to make squash stir-able. Cook squash mixture over low heat until squash softens, adding more water if needed to thin the squash, about 15 minutes. Remove saucepan from heat and cool squash mixture.",
        "Beat egg yolks and brown sugar together in a bowl using a whisk until thickened.",
        "Heat cream and milk together in a saucepan over low heat until mixture begins to simmer. Gradually pour cream mixture into the egg yolk mixture and beat until smooth to temper the eggs. Pour the cream-egg mixture into the saucepan; simmer over low heat until mixture is thickened and easily coats the back of a spoon, about 20 minutes. Strain cream mixture through a fine-mesh strainer into a large bowl and cool to room temperature.",
        "Beat squash mixture into cream mixture until smooth; stir in vanilla extract, ginger, salt, and allspice. Cover bowl with plastic wrap and refrigerate until completely chilled, at least 4 hours.",
        "Stir cream mixture and transfer to an ice cream maker and follow manufacturer's instructions for making ice cream."
    ],
    "ingredients": [
        "1 acorn squash",
        "2 tablespoons butter",
        "1 tablespoon water, or as needed",
        "4 egg yolks",
        "1/2 cup light brown sugar",
        "2 cups heavy whipping cream",
        "2 cups milk",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon ground allspice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Acorn Squash Ice Cream",
    "url": "http://allrecipes.com/recipe/239443/acorn-squash-ice-cream/"
}
