{
    "directions": [
        "Preheat the oven to 400 degrees F. Line a rimmed baking sheet with Reynolds Wrap(R) Aluminum Foil. Rinse the black rice. Add rice to 1 1/2 cups of water. Bring it to a boil then reduce to a simmer. Cover and cook for 45 minutes until cooked through. Remove the lid, fluff with a fork and leave the lid ajar to cool.",
        "While the rice cooks, roast the squash. With a sharp knife split the squash into quarters. Remove seeds and rub both the flesh and skin with olive oil and sprinkle with sea salt. Spread them on the foil-lined baking sheet cut side up and roast for 40 minutes until tender and browned in spots.",
        "Prepare the stuffing. Warm 2 teaspoons of the oil over medium heat in a pan, saute the onion and celery until just softened, about 4 minutes. Transfer to a mixing bowl. Grind the fennel seed or chop well with a sharp knife. Add fennel, 1/2 cup of the walnuts and raisins and drizzle with the remaining oil, maple syrup and vinegar. Toss to coat. This much can be done a day in advance and brought to room temperature before serving.",
        "When ready to serve, arrange the squash wedges on a platter. Toss the arugula in with the rice stuffing along with a few pinches of salt and pepper and toss again. Fill the insides of the squash with the stuffing; it is ok if a bit spills over. Garnish with the remaining walnuts and fresh shaved Parmesan and serve."
    ],
    "ingredients": [
        "1/2 cup black (forbidden) rice",
        "2 medium acorn squash",
        "3 tablespoons walnut or extra virgin olive oil, divided",
        "Sea salt to taste",
        "1/2 yellow onion, finely chopped",
        "2 ribs celery, finely chopped",
        "1 teaspoon fennel seeds",
        "3/4 cup chopped toasted walnuts, divided",
        "1/3 cup golden raisins",
        "1 teaspoon maple syrup",
        "1 tablespoon white wine vinegar",
        "2 cups baby arugula, or as needed",
        "Salt and pepper to taste",
        "Shaved Parmesan cheese, for garnish",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Acorn Squash with Rice and Arugula Stuffing",
    "url": "http://allrecipes.com/recipe/244892/acorn-squash-with-rice-and-arugula-st/"
}
