{
    "directions": [
        "To make the dal, in a Balti dish or deep sauté pan over medium heat, warm the vegetable oil. Add the onion and sauté until softened, about 3 minutes. Add the garlic, cumin, coriander and cayenne and cook, stirring frequently, until fragrant, about 2 minutes. Add the squash, tomatoes, dried chile, lentils, 4 cups (32 fl. oz./1 l) water and a pinch of salt; stir to combine. Bring to a boil, then reduce the heat to a simmer. Simmer, uncovered, until the squash and lentils are tender, about 30 minutes.",
        "While the dal is cooking, make the rice: In a saucepan or Dutch oven over medium heat, melt the ghee. Add the garlic and cook, stirring, until fragrant, about 30 seconds. Add the turmeric, cumin and salt and cook until fragrant, about 30 seconds more. Add the rice and stir to coat with the butter and spices. Cook, stirring occasionally, until the rice is toasted, about 3 minutes. Add 3 cups (24 fl. oz./750 ml) water and the bay leaf and cover the pan. Bring to a boil, then reduce the heat to a simmer and cook, covered, for 20 minutes. Remove from the heat and let stand, covered, for 10 minutes. Remove the lid, fluff the rice with a fork and stir in the cashews and cilantro.",
        "To serve, remove the dried chile from the dal and discard. Divide the dal and rice among individual plates and serve immediately. Serves 4.",
        "Williams Sonoma Test Kitchen"
    ],
    "ingredients": [
        "2 Tbs. vegetable oil",
        "1 yellow onion, finely chopped",
        "2 garlic cloves, minced",
        "1 tsp. ground cumin",
        "1 tsp. ground coriander",
        "1/4 tsp. cayenne pepper",
        "1 acorn squash, peeled, seeded and cut into 1 1/2-inch (4-cm) cubes",
        "1 can (14 oz./440 g) crushed tomatoes",
        "1 dried red chile",
        "1 cup (7 oz./220 g) dried red lentils",
        "Kosher salt and freshly ground black pepper",
        "2 Tbs. ghee or unsalted butter",
        "2 garlic cloves, minced",
        "1/2 tsp. ground turmeric",
        "1/2 tsp. ground cumin",
        "1/2 tsp. kosher salt",
        "2 cups (14 oz./440 g) basmati rice",
        "1 bay leaf",
        "1/2 cup (2 1/2 oz./75 g) coarsely chopped toasted cashews",
        "1/2 cup (1/2 oz./15 g) fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Acorn Squash Dal with Cashew-Cilantro Rice",
    "url": "http://www.williams-sonoma.com/recipe/acorn-squash-dal-with-cashew-cilantro-rice.html"
}
