{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Rinse the duck, remove any pieces of excess fat from around the cavity, and prick the duck's skin all over with a fork or sharp skewer, being careful not to puncture the meat.",
        "Rub the skin of the duck and inside the duck cavity with 1 tablespoon of orange juice concentrate. Rub 1 teaspoon  of minced garlic inside and outside the duck, and sprinkle the duck, inside and outside, with salt and pepper.",
        "Mix together about 2 tablespoons of chopped onion, the raisins, and apple in a bowl, and lightly stuff the cavity of the duck with the raisin mixture. Truss the duck, and place it onto a rack set in a roasting pan. Scatter the remaining chopped onion and slices of large carrot in the roasting pan around the duck.",
        "To make basting mixture, whisk together remaining orange juice concentrate, 1/2 cup of chicken broth, 1/4 cup lemon juice, and salt and pepper in a bowl.",
        "Roast the duck in the preheated oven for 1 hour, basting occasionally with the basting mixture. After 1 hour, pour off the rendered fat, and roast, basting occasionally, until no longer pink at the bone and the juices run clear, about 1 more hour. An instant-read thermometer inserted into the thickest part of the thigh should read 165 degrees F ( 74 degrees C).  Reserve any left-over basting mixture.",
        "While the duck is roasting, prepare duck stock. Heat olive oil in a saucepan, and brown the reserved neck and giblets over medium heat. Stir in 1 onion, 2 garlic cloves, and 1 carrot, and cook and stir until the onion is translucent, about 5 minutes. Stir in 1 cup chicken broth, 1/2 cup lemon juice, orange juice, parsley, and salt and pepper, bring to a boil, and cover. Reduce heat and simmer for 1 hour; strain the stock and set aside.",
        "Remove the duck from the oven and place on a warm platter. Arrange cooked vegetables around the duck, if desired. Remove stuffing to a serving bowl. Let the duck rest about 15 minutes before carving.",
        "While the duck is resting, finish the sauce. Skim fat out of the roasting pan, and pour reserved basting mixture into the pan, stirring and scraping to dissolve the brown bits of flavor from the bottom of the pan. Bring the mixture to a boil over medium heat, and stir in the reserved duck stock. Bring back to a boil, and cook the sauce down by about half, stirring constantly to prevent burning, about 10 minutes. Whisk in sour cream to make a smooth, glossy sauce. Pour the sauce over the carved duck to serve."
    ],
    "ingredients": [
        "1 (5 pound) whole duck, neck and giblets reserved",
        "1 (6 ounce) can orange juice concentrate, thawed, divided",
        "1 teaspoon minced garlic",
        "salt and freshly ground black pepper to taste",
        "Stuffing:",
        "1 onion, coarsely chopped, divided",
        "1 cup raisins",
        "1 apple - peeled, cored, and cut into chunks (optional)",
        "1 large carrot, thickly sliced",
        "Basting sauce:",
        "1/2 cup chicken broth",
        "1/4 cup lemon juice (see Cook's Note)",
        "salt and freshly ground black pepper to taste",
        "Duck Stock:",
        "1 tablespoon olive oil",
        "1 onion, coarsely chopped",
        "2 cloves garlic, minced",
        "1 carrot, thickly sliced",
        "1 cup chicken broth",
        "1/2 cup lemon juice (see Cook's Note)",
        "1 cup orange juice",
        "1 sprig fresh parsley, chopped",
        "salt and freshly ground black pepper to taste",
        "1 tablespoon sour cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Adams Family Duck",
    "url": "http://allrecipes.com/recipe/212667/adams-family-duck/"
}
