{
    "directions": [
        "Adjust rack in oven to lower third. Preheat oven to 425 degrees F (220 degrees C).",
        "Combine 3 cups flour, 1 1/2 cup plus 1 tablespoon cold butter, 2 tablespoons sugar, and salt in a food processor. Pulse until coarse meal forms. Add remaining 1 cup flour; pulse to incorporate. Alternate adding vodka and water to flour mixture a tablespoon at a time, pulsing until dough forms into a ball.",
        "Divide the dough in half and shape into balls. Roll out each ball to fit a 12-inch deep-dish pie plate. Place bottom crust in pie plate. Brush 1/2 of egg wash over bottom pie crust.",
        "Bring 3 quarts water to a boil in a large stock pot. Remove from heat. Add apples and let stand 10 minutes; drain. Toss lemon juice and zest together with apples in a large bowl.",
        "Combine 1 cup sugar, 2 tablespoons flour, apple pie spice, and cinnamon together in a small bowl.",
        "Place 1 layer of apples onto pie crust; sprinkle with some of the spice mixture. Repeat with remaining apples and spice mixture, reserving 1 tablespoon of the spice mixture for top crust. Cover apples with top pie crust; brush with remaining egg wash and sprinkle with remaining spice mixture.",
        "Bake in the preheated oven for 20 minutes. Reduce temperature to 350 degrees F (175 degrees C); bake until golden brown, 25 to 30 minutes more."
    ],
    "ingredients": [
        "Crust:",
        "4 cups all-purpose flour, divided",
        "1 1/2 cups cold butter",
        "1 tablespoon cold butter",
        "2 tablespoons white sugar",
        "1 teaspoon salt",
        "1/4 cup vodka, or as needed",
        "1/4 cup cold water, or as needed",
        "Egg Wash:",
        "1 egg, beaten",
        "Filling:",
        "4 pounds Granny Smith apples - peeled, cored, and sliced",
        "1/2 lemon, zested and juiced",
        "1 cup white sugar",
        "2 tablespoons all-purpose flour",
        "2 teaspoons apple pie spice (such as Penzeys®)",
        "1/2 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Adam's 12-inch Deep-Dish Apple Pie",
    "url": "http://allrecipes.com/recipe/245582/adams-12-inch-deep-dish-apple-pie/"
}
