{
    "directions": [
        "Place the rice in a bowl, and cover with water. Soak the rice for about 3 hours, and drain off the water. Bring the rice, 1/2 teaspoon salt,  and 4 cups water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is partially cooked, about 10 minutes. Drain the liquid from the rice, and set the rice aside.",
        "Bring 2 more cups of water and a pinch of salt to a boil in a saucepan, and stir in the lentils. Bring to a boil, and cook over medium heat until tender, 15 to 20 minutes. Remove from heat.",
        "Heat 2 tablespoons of vegetable oil in a large skillet over medium heat, and fry the onions, stirring frequently, until golden brown, about 20 minutes. Set the onions aside. Dissolve the saffron in 1/3 cup of hot water, and set aside.",
        "In a large nonstick pot with deep sides, heat 2 tablespoons of vegetable oil until shimmering, and spoon in half the rice to cover the bottom of the pot. Top the rice with the lentils, and cover the lentils with the remaining rice. Reduce heat to low, cover the pot, and cook until the rice is completely tender and there is a golden brown, crusty layer of rice on the bottom of the pot, about 20 minutes. Pour the saffron water over the rice and lentils, cover, and allow to cook until absorbed, about 10 more minutes.",
        "To serve, spoon the polow into a serving dish, and peel off and place pieces of the crusty rice layer on top of the polow. Decorate the polow with dates, raisins, and fried onions."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1704&h=892&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5266724.jpg",
    "ingredients": [
        "1 pound uncooked white rice",
        "4 cups water, or as needed",
        "½ teaspoon salt",
        "2 cups water, or more as needed",
        "salt to taste",
        "2 cups dry lentils, rinsed",
        "¼ cup vegetable oil, divided",
        "2 large onions, thinly sliced",
        "½ teaspoon saffron",
        "⅓ cup hot water",
        "¾ cup pitted, chopped dates",
        "¾ cup raisins"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Adas Polow (Persian Rice and Lentils)",
    "url": "http://allrecipes.com/recipe/215387/adas-polow-persian-rice-and-lentils/"
}