{
    "directions": [
        "Preheat oven to 250 degrees F (120 degrees C).",
        "Gently mix corn, rice, and wheat squares, oat rings, mixed nuts, mini pretzels, goldfish crackers, and sesame snacks in two 13x24-inch aluminum roasting pans, taking care not to break cereal.",
        "Stir bacon drippings, unsalted butter, Worcestershire sauce, MSG, liquid smoke, cayenne pepper, seasoned salt, chili powder, garlic powder, and hot pepper sauce together in a microwave-safe bowl. Cook on high in microwave for 3 or 4 30-second intervals, stirring each time, until mixture is warm, liquid, and fully combined.",
        "Stir seasoning sauce continuously as you pour half over the cereal mixture in each pan. Gently stir the snack mix and seasonings with a slotted spoon until thoroughly coated; do not crush cereal.",
        "Bake in the preheated oven until sauce is completely absorbed and the snack mix is crisp, about 2 hours; stir gently every 15 minutes. Cool completely and store in airtight containers. The snack mix stores well in freezer in airtight freezer bags, if it makes it that long."
    ],
    "ingredients": [
        "1 (14 ounce) package bite-size corn square cereal (such as Corn Chex®)",
        "1 (14 ounce) package crispy rice cereal squares (such as Rice Chex ®)",
        "1 (14 ounce) package bite-size wheat square cereal (such as Wheat Chex®)",
        "1 (8.9 ounce) box toasted oat cereal rings (such as Cheerios®)",
        "3 cups salted mixed nuts",
        "1 (15 ounce) package mini pretzel twists",
        "2 (6 ounce) packages goldfish crackers",
        "1 (12 ounce) package sesame snack sticks (optional)",
        "1 cup warm (liquid) bacon drippings",
        "1 cup unsalted butter, melted",
        "1/4 cup Worcestershire sauce",
        "2 tablespoons monosodium glutamate (MSG)",
        "2 tablespoons liquid smoke flavoring",
        "1 tablespoon cayenne pepper",
        "4 teaspoons seasoned salt",
        "4 teaspoons chili powder",
        "4 teaspoons garlic powder",
        "4 teaspoons hot pepper sauce (such as Tabasco®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Addictive Texas Trash",
    "url": "http://allrecipes.com/recipe/228417/addictive-texas-trash/"
}
