{
    "directions": [
        "In a large mixing bowl, dissolve yeast in warm water (110 degrees F, 45 degrees C). Let stand until creamy, about 10 minutes.",
        "Add the vegetable oil, sugar, 3 cups of the flour and the salt to the yeast mixture; stir well to combine. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
        "Generously oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.",
        "While the dough is rising: Place the potatoes in a small sauce pan, cover with water, bring to a boil and cook until tender; about 15 minutes. Place the drained potatoes in a bowl and mash. Combine with the shredded cheese and season to taste with salt and pepper. Set aside to cool.",
        "Preheat oven to 400 degrees F (200 degrees C). Grease a 14 inch pizza pan of baking sheet. Deflate the dough and turn it out onto a lightly floured surface. Knead for a few turns, then form it into a round, cover and let rest for 10 minutes.",
        "On a lightly floured surface roll the dough out into a circle slightly larger than the pan, and place onto the prepared pan with the dough draped over the sides. Spoon the potato filling into the center of the dough, leaving a 2 inch space around the edges. Stir together the egg yolk and water to make an egg wash. Brush egg wash around the exposed edge of the circle. Fold dough from the edge into the center about every 6 to 8 inches, until the whole edge has been folded in to form a pinwheel pattern. Press to seal after each fold. Brush the top of the loaf with the remaining egg wash.",
        "Bake at 400 degrees F (200 degrees C) for 15 minutes then lower the temperature to 350 degrees F (175 degrees C) and bake for an additional 20 to 25 minutes or until golden brown on top and bottom. Remove the bread to a wire rack and let cool for 15 minutes before slicing into wedges and serving."
    ],
    "ingredients": [
        "1 (.25 ounce) package active dry yeast",
        "1 3/4 cups warm water (110 degrees F)",
        "1 tablespoon vegetable oil",
        "2 teaspoons white sugar",
        "6 cups all-purpose flour",
        "2 teaspoons salt",
        "6 potatoes, peeled and cubed",
        "3/4 cup shredded Cheddar cheese",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 egg yolk, beaten",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Adzimka Bread",
    "url": "http://allrecipes.com/recipe/16668/adzimka-bread/"
}
