{
    "directions": [
        "Finely slice the peppers and onions. Make a paste out of the garlic and 1 teaspoon of salt. Seed and slice the Scotch bonnet pepper, dice the tomatoes and set them aside. Soften the onions and peppers in the sunflower oil over high heat for 5 minutes, stirring frequently. Add the pasted garlic, Scotch bonnet pepper, tomatoes, and dry seasonings and cook for another 10 minutes over medium heat, stirring frequently. Add the tomato paste, cook for another minute or so, then remove from the heat.",
        "Blend the mixture with a generous 3/4  cup of chicken stock. If this was prepared in advance, reheat it first. Add another 3/4 cup of stock and blend until the mixture is smooth. Add the palm oil, a final teaspoon of salt, and then pour 2 1/2 cups of this mixture back into the pot. Heat the sauce until it is lightly bubbling. Measure out your rice, then add to the pot. The pot should have a tight-fitting lid, but if it doesn’t you can use some foil with the shiny side facing down to retain the heat. Stir gently so that all the rice is coated with the red sauce, then reduce the heat to a very low flame—the lowest possible.",
        "Cover and simmer for 10 minutes. Open the lid and stir gently again. It is important to get under the center of the pan so all the rice cooks at the same rate. Cover and simmer for another 10 minutes. Open and stir for a final time, then simmer for a final 10 minutes. This makes 30 minutes cooking time in total. Turn the heat off and allow to steam, covered, for another 15 minutes. It’s tempting to open the pot here but it’s very important to trust the process and allow the rice to cook residually. This improves the final taste and texture of the rice.",
        "Open the lid then leave to stand for 5 minutes, uncovered. Then fluff with a fork to separate the rice, slowly working inward from the edge of the pan in a swirling motion. If the rice is not completely cooked, add the remaining 1/2  cup stock, stir gently, then place back over low heat for another 10 minutes. Spoon the rice out onto a separate dish and serve."
    ],
    "ingredients": [
        "4 red bell peppers",
        "2 medium to large onions",
        "3 bulbs of garlic",
        "2 teaspoons salt",
        "1/2 a Scotch bonnet pepper",
        "1/4 pound plum tomatoes",
        "1/4 cup sunflower oil",
        "1 teaspoon dried thyme",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon cayenne pepper\nor alternative",
        "1/4 teaspoon smoked paprika",
        "1 heaping teaspoon tomato paste",
        "Generous 2 cups chicken stock",
        "1 teaspoon red palm oil",
        "1 1/4 cups white basmati rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Rice",
        "Side",
        "Chile Pepper",
        "Onion",
        "Tomato",
        "Spice",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Jollof Rice",
    "url": "http://www.epicurious.com/recipes/food/views/african-jollof-rice"
}
