{
    "directions": [
        "Mix first 5 ingredients in small bowl. Add butter and rub in with fingertips until well blended. Set aside.",
        "Preheat oven to 350° F. Butter and flour 12-cup Bundt pan. Mix flour and baking powder in small bowl. Finely grind almonds in processor. Using electric mixer, beat butter and almond paste in large bowl until blended. Gradually beat in 1 1/3 cups sugar. Continue beating until fluffy. Beat in extract. Stir in dry ingredients alternately with milk. Mix in ground almonds. Using electric mixer fitted with clean dry beaters, beat whites in another large bowl to medium peaks. Gradually add remaining 1/3 cup sugar and beat until stiff but not dry. Fold meringue into batter in 2 additions. Transfer half of batter to prepared Bundt pan. Sprinkle streusel over. Spoon remaining batter over. Bake cake until tester inserted near center comes out clean, about 1 hour. Cool cake in pan on rack 20 minutes. Turn out cake onto rack and cool completely. (Cake can be prepared 1 day ahead. Cover and let stand at room temperature.)",
        "Stir powdered sugar, whipping cream and instant espresso powder in small bowl until well blended. Drizzle glaze over cake, allowing excess to run down sides. Sprinkle cake with sliced almonds."
    ],
    "ingredients": [
        "1/2 cup firmly packed brown sugar",
        "1/2 cup chopped toasted almonds",
        "1/3 cup old-fashioned oats",
        "1 1/2 teaspoons instant espresso powder or instant coffee powder",
        "3/4 teaspoon ground cinnamon",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into pieces",
        "3 cups sifted cake flour",
        "1 tablespoon baking powder",
        "1 cup whole almonds, toasted",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1/2 cup almond paste",
        "1 2/3 cups sugar",
        "1/2 teaspoon almond extract",
        "1 cup milk",
        "6 large egg whites, room temperature",
        "1 cup powdered sugar, sifted",
        "1/4 cup whipping cream",
        "1 teaspoon instant espresso powder or instant coffee powder",
        "1/3 cup toasted sliced almonds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Dessert",
        "Bake",
        "Almond",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Age of Lincoln Almond-Streusel Bundt Cake with Coffee Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/age-of-lincoln-almond-streusel-bundt-cake-with-coffee-glaze-2630"
}
