{
    "directions": [
        "Combine 1/2 cup cream (for fresh peas) or 3 tablespoons cream (for frozen), sugar, garlic, salt, and pepper in medium saucepan; bring to boil. Add peas and cook until tender, about 10 minutes for fresh and 3 minutes for frozen. Transfer mixture to processor and purée until smooth, scraping sides of bowl occasionally, about 3 minutes. Transfer mixture to bowl; mix in both cheeses and thyme. Chill filling at least 1 hour. Do ahead Can be made 1 day ahead. Cover and keep chilled.",
        "Blend flour and salt in processor. Add yolks, whole egg, and olive oil; process until soft dough forms, adding water by tablespoonfuls if dry. Turn dough out onto lightly floured work surface and knead until smooth, about 8 minutes. Wrap in plastic wrap; let rest at room temperature 30 minutes to 1 hour.",
        "Cut dough into 4 equal pieces. Turn pasta machine to widest setting. Flatten 1 dough piece into rectangle. Cover remaining dough pieces with plastic wrap. Run dough through machine 4 times. Adjust machine to next narrower setting. Run dough through machine 4 times. Repeat running dough strip through machine 4 times on each narrower setting, cutting dough strip in half crosswise for easier handling when strip becomes very long and dusting dough with flour as needed if sticky. Continue rolling until pasta strips are 22 to 24 inches long, dusting lightly with flour as needed. Repeat rolling with remaining 3 dough pieces. Let dough strips dry slightly on floured work surface until no longer sticky to touch for easier handling, about 10 minutes.",
        "Line 2 baking sheets with parchment paper; dust lightly with flour. Cut each dough strip into 3-inch squares (about 8 from each dough strip). Place 1 teaspoon filling in center of each square. Brush 2 adjacent dough edges with water; fold 1 long side over filling, enclosing filling and pressing to seal, forming rectangle. Transfer to prepared baking sheets, arranging in single layer. Do ahead Can be made 2 hours ahead. Cover with towel and let stand at room temperature.",
        "Melt butter in large skillet over medium heat; remove from heat. Bring large pot of salted water to boil. Add half of agnolotti and cook just until tender, about 5 to 6 minutes. Using slotted spoon, transfer agnolotti to large sieve and drain well, then add to skillet with butter. Repeat with remaining agnolotti. Toss agnolotti over medium-high heat until coated with butter and heated through, about 3 minutes. Season with salt and pepper. Sprinkle lightly with chopped thyme. Divide among 6 bowls; sprinkle with Parmesan shavings and serve."
    ],
    "ingredients": [
        "1/2 cup heavy whipping cream for fresh peas or 3 tablespoons for frozen",
        "1 tablespoon sugar",
        "1 garlic clove, flattened",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 cup fresh green peas (from about 16 ounces in pods) or 1 1/4 cups frozen petite peas",
        "1/4 cup soft fresh goat cheese (about 2 ounces)",
        "2 tablespoons mascarpone cheese (italian cream cheese)",
        "2 teaspoons chopped fresh thyme",
        "1 3/4 cups all purpose flour",
        "1 1/2 teaspoons salt",
        "6 large egg yolks",
        "1 whole egg",
        "1 1/2 teaspoons olive oil",
        "2 tablespoons (about) water",
        "3/4 cup (1 1/2 sticks) butter",
        "Chopped fresh thyme",
        "Parmesan cheese shavings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta Maker",
        "Cheese",
        "Herb",
        "Pasta",
        "Vegetable",
        "Vegetarian",
        "Dinner",
        "Goat Cheese",
        "Pea",
        "Noodle",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Agnolotti with Sweet Peas and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/agnolotti-with-sweet-peas-and-goat-cheese-236846"
}
