{
    "directions": [
        "Preheat oven to 350°F. Combine first 8 ingredients on rimmed baking sheet; drizzle with olive oil and toss to coat. Roast until all meats are cooked through, stirring occasionally, about 45 minutes.",
        "Meanwhile, melt butter in large skillet over medium heat. Add shallot; sauté 3 minutes. Working in batches, add spinach to skillet and toss until wilted before adding more, about 5 minutes total. Remove from heat and cool.",
        "Remove skin and bones from chicken thigh and discard. Coarsely dice chicken, veal, and pork; transfer to processor. Add meat pan juices, spinach, Parmesan, salt, pepper, and nutmeg. Process until meats and spinach are finely chopped, stopping often to scrape down sides of bowl. Transfer mixture to bowl. Do ahead Can be made 1 day ahead. Cover and chill.",
        "Blend 1 3/4 cups flour and salt in processor. Add whole eggs and yolks and blend until dough forms, adding more flour by tablespoonfuls if too wet. Turn out dough on lightly floured surface; knead until smooth and elastic, sprinkling with flour if needed to prevent sticking, about 8 minutes. Wrap dough in plastic wrap and refrigerate 1 hour.",
        "Cut dough into 4 equal pieces. Turn pasta machine to widest setting. Flatten 1 dough piece into rectangle. Cover remaining dough pieces with plastic wrap. Run dough through machine 4 times. Adjust machine to next narrower setting. Run dough through machine 4 times. Repeat running dough strip through machine 4 times on each narrower setting, cutting dough strip in half crosswise for easier handling when strip becomes very long and dusting dough with flour as needed to prevent sticking. Continue rolling until pasta strips are 22 to 24 inches long, dusting lightly with flour as needed. Repeat rolling with remaining 3 dough pieces. Let dough strips dry slightly on work surface until no longer sticky to touch for easier handling, about 10 minutes.",
        "Line 2 baking sheets with parchment paper; dust lightly with flour. Cut each dough strip into 3-inch squares (about 7 to 8 per strip). Place 1 generous teaspoon filling in center of each square. Brush 2 adjacent dough edges with water. Fold 1 long side over filling, enclosing filling and pressing to seal, forming rectangle. Transfer to prepared baking sheets, arranging in single layer. Do ahead Can be made 2 hours ahead. Cover with towel and let stand at room temperature.",
        "Melt butter with chopped sage in large skillet over medium-high heat; remove from heat. Bring large pot of salted water to boil. Add half of agnolotti to pot and cook just until tender, about 8 minutes. Using slotted spoon transfer agnolotti to sieve to drain, then add to skillet with melted butter. Repeat with remaining agnolotti. Toss over medium-high heat until coated and heated through, about 3 minutes. Season with salt and pepper. Divide agnolotti among 8 bowls; sprinkle with Parmesan shavings and serve."
    ],
    "ingredients": [
        "1 large chicken thigh with skin and bones",
        "1 8-ounce boneless veal rib chop",
        "1 8-ounce piece pork tenderloin",
        "1 celery stalk, coarsely chopped",
        "1/2 carrot, peeled, coarsely chopped",
        "1/2 onion, cut into wedges",
        "4 large fresh sage leaves",
        "1 large sprig fresh rosemary",
        "3 tablespoons extra-virgin olive oil",
        "1 tablespoon butter",
        "1 large shallot, minced",
        "6 ounces fresh spinach leaves (about 6 cups packed)",
        "2 tablespoons freshly grated Parmesan cheese",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon ground nutmeg",
        "1 3/4 cups (or more) all purpose flour",
        "1/2 teaspoon salt",
        "3 large eggs",
        "2 large egg yolks",
        "3/4 cup (1 1/2 sticks) butter",
        "8 fresh sage leaves, chopped",
        "Parmesan cheese shavings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta Maker",
        "Cheese",
        "Dairy",
        "Leafy Green",
        "Onion",
        "Pasta",
        "Pork",
        "Vegetable",
        "Meat",
        "Veal",
        "Pork Tenderloin",
        "Spinach"
    ],
    "title": "Agnolotti with Meat and Spinach Filling",
    "url": "http://www.epicurious.com/recipes/food/views/agnolotti-with-meat-and-spinach-filling-236847"
}
