{
    "directions": [
        "In electric juicer, juice tomatoes. (Alternatively, purée tomatoes with 1/2 cup water in blender or food processor until liquid.)",
        "Line sieve with double layer of cheesecloth and set over large bowl. Pour tomato juice/purée into sieve and sprinkle with kosher salt. Refrigerate until tomato water has drained completely, at least 2 hours or overnight.",
        "Cut each tomato into 16 wedges, place in large bowl, and generously season with salt and pepper. In medium bowl, whisk together balsamic vinegar, olive oil, and shallots. Pour half of mixture over tomatoes, tossing gently to coat. Keep at room temperature, allowing tomatoes to marinate, at least 20 minutes and up to 1 hour.",
        "Lay a long strip of plastic wrap on work surface and brush with olive oil. Place 1 tuna slice on plastic and brush with olive oil. Top with another sheet of plastic wrap.",
        "Using flat meat mallet or heavy-bottom sauté pan, gently pound tuna starting in the middle and working to outside edges in circular motion. Continue working until tuna is about 1/8 inch thick. Repeat with remaining tuna. Stack tuna slices (leave in plastic) on plate and refrigerate until ready to use.",
        "Fill large bowl with ice cubes and water. Have strainer ready in sink. Bring medium pot of water to boil. Add pinch (1/16 teaspoon) of kosher salt and allow to dissolve. Lower basil leaves into water and stir 1 minute. Pour into strainer, then immediately plunge into ice bath to stop cooking. Once leaves are completely cool, drain and dry between layers of paper towel, pressing thoroughly.",
        "Coarsely chop basil. In blender on high speed, purée basil, garlic, pine nuts, and 2 cups olive oil until smooth. Scrape down sides of blender and add additional oil as needed to achieve smooth purée. Pour into small bowl and stir in cheese. Season with salt, pepper, and red pepper to taste. Cover and refrigerate until ready to use.",
        "In large pot of boiling salted water, boil fettuccine until al dente. While fettucine is cooking, fill large bowl with ice and tomato water. Drain fettuccine in colander, then submerge in iced tomato water to stop cooking and add additional flavor. Gently stir until well chilled. Drain well and place in large bowl. Toss with pesto and garnish with additional grated cheese as desired.",
        "Carefully remove top layer of plastic from each tuna carpaccio and invert onto large chilled plate. Generously season with salt and pepper. Use 8 tomato wedges to form a circle around tuna. Use fork to twirl fettuccine into small, tight bunches and place in center of each tomato circle, on top of tuna. Garnish with sprigs of watercress and drizzle with remaining balsamic vinegar mixture and any pesto left in bottom of fettuccine bowl."
    ],
    "ingredients": [
        "20 ripe Roma or heirloom tomatoes, cored and halved",
        "2 tablespoons kosher salt",
        "1 large yellow heirloom tomato, cored",
        "2 large red heirloom tomatoes, cored",
        "1 large green heirloom tomato, cored",
        "Kosher salt",
        "Freshly ground black pepper",
        "1/2 cup balsamic vinegar",
        "1 cup extra virgin olive oil",
        "2 large shallots, minced",
        "2 pounds sushi-grade ahi tuna steaks, cut into 16 even slices",
        "1/4 cup extra virgin olive oil",
        "Leaves from 4 bunches fresh basil",
        "4 garlic cloves",
        "1/4 cup pine nuts, toasted",
        "3 to 4 cups extra virgin olive oil",
        "1/2 cup freshly grated Parmesan cheese, plus more for garnish",
        "Kosher salt",
        "Freshly ground black pepper",
        "Red pepper flakes, optional",
        "2 pounds dried fettuccine",
        "1 bunch watercress",
        "Kosher salt",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Garlic",
        "Pasta",
        "Tomato",
        "Parmesan",
        "Basil",
        "Pine Nut",
        "Tuna",
        "Watercress"
    ],
    "title": "Ahi Tuna Carpaccio with Basil Pesto Fettuccine and Heirloom Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/ahi-tuna-carpaccio-with-basil-pesto-fettuccine-and-heirloom-tomatoes-235524"
}
