{
    "directions": [
        "Mix together the saffron, cardamom, cinnamon, allspice, white pepper, and lime powder in a small bowl, and set the spice mix aside.",
        "Melt the butter in a large stock pot or Dutch oven over medium heat. Stir in the garlic and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the chicken pieces and brown them over medium-high heat until lightly browned, about 10 minutes. Mix in the tomato puree.",
        "Stir in the canned tomatoes with their juice, the grated carrots, whole cloves, nutmeg, cumin, coriander, salt, black pepper, and the Kabsa spice mix. Cook for about 3 minutes; pour in the water,  and add the chicken bouillon cube.",
        "Bring the sauce to a boil, then reduce the heat to simmer and cover the pot. Simmer until chicken is no longer pink and the juices run clear, about 30 minutes.",
        "Gently stir in the rice. Cover the pot and simmer until rice is tender and almost dry, about 25 minutes; add the raisins and a little more hot water, if necessary. Cover and cook for an additional 5 to 10 minutes or until the rice grains are separate.",
        "Transfer the rice to a large serving platter and arrange the chicken pieces on top. Sprinkle the toasted slivered almonds over the dish."
    ],
    "ingredients": [
        "Kabsa Spice Mix:",
        "1/2 teaspoon saffron",
        "1/4 teaspoon ground cardamom",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon ground white pepper",
        "1/2 teaspoon dried whole lime powder",
        "1/4 cup butter",
        "1 onion, finely chopped",
        "6 cloves garlic, minced",
        "1 (3 pound) whole chicken, cut into 8 pieces",
        "1/4 cup tomato puree",
        "1 (14.5 ounce) can diced tomatoes, undrained",
        "3 carrots, peeled and grated",
        "2 whole cloves",
        "1 pinch ground nutmeg",
        "1 pinch ground cumin",
        "1 pinch ground coriander",
        "salt and freshly ground black pepper to taste",
        "3 1/4 cups hot water",
        "1 cube chicken bouillon",
        "2 1/4 cups unrinsed basmati rice",
        "1/4 cup raisins",
        "1/4 cup toasted slivered almonds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Al Kabsa - Traditional Saudi Rice and Chicken",
    "url": "http://allrecipes.com/recipe/216889/al-kabsa---traditional-saudi-rice-and/"
}
