{
    "directions": [
        "Slice off the bottom of the pineapple and stand it upright. Remove the rind in large pieces, cutting deep enough to remove all the prickles; reserve the rind. Quarter the pineapple and remove the core. Roughly chop half of the pineapple; reserve the other half for the Pineapple-Jalapeno Salsa.",
        "To a blender, add the orange juice, vinegar, cumin, salt, oregano, smoked paprika, garlic, chipotles and adobo sauce, the roughly chopped sweet onion and the chopped pineapple. Blend until smooth. Place the pork butt in a large resealable plastic bag and add the marinade. Seal and refrigerate for 3 to 4 hours.",
        "Preheat the oven to 350 degrees F. Set a large Dutch oven over high heat and add enough canola oil to cover the bottom. Remove the meat from the marinade and wipe off the excess. Add to the pot and sear on all sides, 4 to 5 minutes per side. Pour in the chicken stock and the marinade from the bag (the liquid should come halfway up the meat; add a little water if required). Bring to a simmer, then place the reserved pineapple rinds, skin-side up, over the top to cover. Place, uncovered, in the oven and cook until the rinds are deep brown and the pork is fork-tender, 2 1/2 to 3 hours (tent with foil if necessary).",
        "Discard the rinds and roughly chop the meat into 1/4- to 1/2-inch pieces. Toss with a little braising liquid and keep warm.",
        "Serve the pork in warm corn tortillas. Garnish with finely diced onion, cilantro, Pineapple-Jalapeno Salsa and cotija. Serve with a squeeze of lime.",
        "In a medium mixing bowl, combine the pineapple, onion, cilantro, jalapeno, lime juice, salt and chile and mix well. Allow to sit for 10 to 20 minutes before serving so that all the flavors meld together."
    ],
    "ingredients": [
        "1 pineapple",
        "1/2 cup fresh orange juice",
        "2 tablespoons white vinegar",
        "2 teaspoons ground cumin",
        "2 teaspoons kosher salt",
        "1 teaspoon dried Mexican oregano",
        "1/2 teaspoon smoked paprika",
        "4 cloves garlic",
        "2 chipotle chiles in adobo plus 1 teaspoon adobo sauce",
        "1 sweet onion, half rough chopped and half finely diced",
        "One 3-pound bone-in pork butt (cross-cut shoulder works well)",
        "Canola oil",
        "2 cups low-sodium chicken stock",
        "Warm corn tortillas, for serving",
        "1/4 cup chopped fresh cilantro",
        "Pineapple-Jalapeno Salsa, recipe follows",
        "Cotija cheese, crumbled, for serving",
        "2 limes, cut into wedges",
        "2 cups small-diced pineapple",
        "1/2 cup small-diced white onion",
        "2 tablespoons finely chopped fresh cilantro",
        "2 tablespoons minced jalapeno (seeds removed)",
        "2 tablespoons fresh lime juice",
        "1 teaspoon kosher salt",
        "1 small red chile, seeded and minced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Salsa",
        "Taco Recipes",
        "Fruit",
        "Pineapples",
        "Meat",
        "Pork",
        "Pork Butt",
        "Jalapeno Recipes",
        "Vegetable",
        "Main Dish Recipes",
        "Marinating Recipes"
    ],
    "title": "Al Pastor Tacos with Pineapple-Jalapeno Salsa",
    "url": "http://www.foodnetwork.com/recipes/guy-fieri/al-pastor-tacos-with-pineapple-jalapeno-salsa"
}
