{
    "directions": [
        "In a non-reactive saucepan, combine the cider vinegar, salt, brown sugar, black pepper, cayenne pepper, and butter. Bring to a rolling boil over medium-high heat. Mix in the water, and return to boil. Sauce the pork before smoking, and then every hour or so while it cooks.",
        "Start the pork butt on a slow smoker using hardwood coals or charcoal briquettes and mesquite or apple wood chips. Smoke the pork for at least 6 hours and up to 10. The longer the smoke time, the deeper the 'smoke ring', a red ring of flavor, will penetrate.",
        "After the meat has smoked for 6 to 10 hours, use aluminum foil to wrap the meat. Fold the edges of two sheets together to form a watertight seal. Place the meat in the center and bring the edges up to the top, cupping the meat. Pour 1 cup of the sauce over the meat and then seal the foil tightly around the roast.",
        "Place the meat package back on the smoker, or in a 350 degree oven (175 degrees C). If it is on the smoker, increase the heat. Cook the package until the meat pulls easily from the bone. This can be checked easily by pushing on the top of the foil package with an oven-mitted hand to test for softness. It will take up to 2 hours.",
        "Once the meat is done, remove it from the smoker or oven and let it cool. Pull the pork from the bone and discard the fat and gristle. Pull the meat apart in large chunks about 1 inch wide by 4 inches long.",
        "Place the meat chunks in a pan and pour about one cup of sauce for every 4 pounds of meat, or to taste. Heat until simmering. Serve immediately or let marinate for several days. The meat can also be pulled into smaller pieces using 2 forks, this is locally known as 'shredded pork'."
    ],
    "ingredients": [
        "3 cups apple cider vinegar",
        "1/4 cup salt",
        "1/4 cup brown sugar",
        "4 tablespoons ground black pepper",
        "2 tablespoons cayenne pepper",
        "1/4 pound butter",
        "1 quart water",
        "5 pounds Boston butt roast"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Alabama Pulled Pig",
    "url": "http://allrecipes.com/recipe/36890/alabama-pulled-pig/"
}
