{
    "directions": [
        "In a blender or mini food processor, process all marinade ingredients until smooth. Toss shrimp with marinade in a bowl to coat well. Set aside at least 10 minutes, or up to 2 hours. Cut onion into 8 wedges, then cut each wedge lengthwise into thirds. Thread 1 chile onto each skewer. (If you prefer metal skewers, be sure to spray them first with a vegetable-oil cooking spray so shrimp and vegetables don't stick.) Add 1 shrimp, a chunk of onion and a cherry tomato to each skewer; repeat twice. Finish each skewer with a second chile. Season skewers with salt.",
        "Heat a cast-iron grill pan or an electric or gas grill over high heat. Cook skewers, covered, turning once, until shrimp are cooked through and onions are charred and just tender, about 5 minutes per side. (You can use a charcoal grill, but shrimp will cook faster.) Serve with >epi:recipeLink id=\"335501\"> Pico de Gallo Amarillo.",
        "The skinny 176 calories per 2 skewers 3.5 g fat (0.8 g saturated), 7 g carbs, 1.4 g fiber, 23.9 g protein"
    ],
    "ingredients": [
        "2 cloves garlic, smashed",
        "1 tablespoon olive oil",
        "2 teaspoon fresh lime juice",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon dried oregano",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "8 bamboo skewers, 10 inches long, soaked in water 30 minutes",
        "24 large shrimp (about 1 lb), peeled and deveined",
        "1 small red onion",
        "16 serrano chiles",
        "24 cherry tomatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Herb",
        "Onion",
        "Tomato",
        "Marinate",
        "Low Carb",
        "Quick & Easy",
        "Cinco de Mayo",
        "Shrimp",
        "Hot Pepper",
        "Healthy",
        "Self"
    ],
    "title": "Alambre de Camarones",
    "url": "http://www.epicurious.com/recipes/food/views/alambre-de-camarones-235501"
}
