{
    "directions": [
        "Preheat oven to 375°F.",
        "Stack 12 won ton wrappers together and trim stack into a 3-inch square. Repeat with remaining won tons. Transfer 1 won ton to an oiled work surface and brush top lightly with some oil. Top with another won ton and brush lightly with oil. Repeat with remaining won tons (this way both sides become lightly oiled).",
        "Put 1 won ton into cup of a muffin pan, pressing it gently into bottom and side to form a cup. Repeat with remaining won tons and sprinkle with salt to taste.",
        "Bake won ton cups in middle of oven until crisp and golden brown, 7 to 10 minutes. Transfer won ton cups to racks to cool (they will continue to crisp).",
        "Scoop flesh from avocado and mash coarsely with a fork. Stir in shallot, 1 tablespoon lime juice, and wasabi to taste. Season with salt and pepper.",
        "Remove crab meat from shell and cut into 1/2-inch cubes. Toss crab with remaining tablespoon lime juice and salt to taste.",
        "Spoon guacamole into won ton cups and top with crab."
    ],
    "ingredients": [
        "24 won ton wrappers",
        "1 tablespoon vegetable oil",
        "1 ripe California avocado",
        "1 1/2 tablespoons finely chopped shallot",
        "2 tablespoons fresh lime juice",
        "1/2 to 3/4 teaspoon wasabi paste",
        "3/4 pound cooked Alaska king crab leg in shell (1 leg), thawed if frozen and split lengthwise",
        "2 mini-muffin pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Seafood",
        "Crab",
        "Summer",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Alaska King Crab \"Nachos\"",
    "url": "http://www.epicurious.com/recipes/food/views/alaska-king-crab-nachos-103545"
}
