{
    "directions": [
        "Bring a saucepan three-fourths full of salted water to a boil over high heat. Add the potatoes and cook just until they can be pierced with a knife but are not completely tender, 8 to 10 minutes. Drain well and set aside. (The potatoes can be parboiled up to 4 hours in advance and kept at room temperature.)",
        "To make the marinade, in a shallow, nonreactive dish just large enough to hold the meat, combine the ale, broth, tomato juice, Worcestershire, hot-pepper sauce, thyme, oregano and bay leaves and mix well. Add the meat and turn to coat on all sides. Cover and refrigerate for at least 1 hour or up to 4 hours. Add the potatoes to the marinade during the last 30 minutes.",
        "Prepare a charcoal or gas grill for direct grilling over high heat. Oil the grill rack.",
        "Remove the meat and potatoes from the marinade and discard the marinade. Thread the meat and potatoes alternately onto 8 metal skewers, dividing the ingredients evenly.",
        "Grill the skewers over the hottest part of a charcoal fire or directly over the heat elements of a gas grill, turning to char all sides, until the potatoes are browned and the meat is cooked to your liking, 7 to 9 minutes total for medium-rare meat.",
        "Transfer the skewers to warmed individual plates and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma,",
        "Essentials of Grilling,",
        "by Denis Kelly, Melanie Barnard, Barbara Grunes & Michael McLaughlin (Oxmoor House, 2003)."
    ],
    "ingredients": [
        "1 lb. small red-skinned or Yukon Gold potatoes, each about 1 1/2  inches in diameter or cut if larger",
        "3/4 cup ale or beer",
        "1/3 cup beef broth",
        "1/3 cup spicy tomato juice",
        "1 Tbs. Worcestershire sauce",
        "1/2 to 1 tsp. hot-pepper sauce, such as Tabasco",
        "1 Tbs. chopped fresh thyme",
        "1 Tbs. chopped fresh oregano",
        "2 fresh or dried bay leaves, broken in half",
        "1 1/2 lb. boneless sirloin, about 1 1/2 inches thick, cut into  1 1/2-inch cubes"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Alehouse Beef-and-Potato Skewers",
    "url": "http://www.williams-sonoma.com/recipe/alehouse-beef-and-potato-skewers.html"
}
