{
    "directions": [
        "1. Preheat the oven to 350°F.",
        "2. In a large mixing bowl, combine the eggs, heavy cream, sugar, vanilla extract, orange and lemon juices, and cinnamon. Whisk the mixture until it is smooth and combined, but do not overbeat it. Place each slice of bread into the mixture and let it absorb the liquid thoroughly. Set the soaked bread aside on a plate.",
        "3. Place a griddle or a large frying pan over medium heat and coat it with butter. When the griddle is hot, cook each slice of bread until it is nicely golden on both sides, keeping the heat at a level that allows the bread to cook through evenly without burning the egg mixture. As they are cooked, set the slices aside on a plate.",
        "4. While the bread is cooking, make the pudding base: Bring the heavy cream to a simmer in a small saucepan, and then remove it from the heat. Place the tea leaves in a tea strainer and steep them in the cream for 3 minutes (or simply put the loose tea in the cream, steep for 3 minutes, and then strain carefully). Discard the tea leaves and reserve the apricot Brandy cream.",
        "5. In a medium bowl, combine the egg yolks, beaten egg, and sugar, and whisk to combine. Add a little of the egg mixture to the apricot Brandy cream and continuing to whisk, gradually add the remaining egg mixture until it's fully combined. Stir in the vanilla extract. Set the pudding base aside.",
        "6. When all the bread has been cooked on the griddle, cut the slices into 1 × 1-inch squares.",
        "7. Pour the pudding base evenly into the eight ramekins (they will be about one-fourth full), and then lay in the bread squares (the bread may extend above the edge of the ramekins). Place the ramekins on a large baking sheet, and bake for 20 minutes, or until the bread is golden and crispy and the liquid is bubbling.",
        "8. To serve, drizzle maple syrup, crème anglaise, fruit coulis, and/or confectioners' sugar on top—whatever your heart desires! Slices of fresh fruit work wonderfully as a garnish or a side. Be generous, whatever you do!"
    ],
    "ingredients": [
        "6 eggs",
        "1 cup heavy cream",
        "1 cup sugar",
        "1 1/2 tablespoons pure vanilla extract",
        "1 tablespoon freshly squeezed orange juice",
        "1 tablespoon freshly squeezed lemon juice",
        "1 1/2 teaspoons ground cinnamon",
        "1 loaf brioche (or challah, as a second choice), cut into eight 3/4-inch- thick slices",
        "Butter, for the pan",
        "1/4 cup heavy cream",
        "1 tablespoon Apricot Brandy tea leaves (see Resources)",
        "4 1/2 large egg yolks",
        "Half of 1 large beaten egg",
        "1/2 cup sugar",
        "1 1/2 tablespoons pure vanilla extract",
        "Pure maple syrup",
        "Crème anglaise",
        "Fruit coulis",
        "Confectioners' sugar",
        "Fresh fruit"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Dinner",
        "Winter"
    ],
    "title": "Alice's Curious French Toast Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/alices-curious-french-toast-bread-pudding-362651"
}
