{
    "directions": [
        "Place feed shaft, blade, and 1/4-inch die of meat grinder in the freezer until well-chilled. Arrange beef sirloin, beef chuck, and beef brisket chunks on rimmed baking sheet, leaving space between each piece and freeze for 10 minutes until meat is firm, but not frozen.",
        "Combine beef and pass meat through grinder twice. Shape ground meat evenly into four patties about 2 inches thick and 5 inches wide. Refrigerate until ready to grill.",
        "Preheat grill for medium heat and lightly oil the grate. Brush kaiser buns with melted butter.",
        "Arrange bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon on paper towels.",
        "Toast buns on the preheated grill until golden brown, 3 to 5 minutes. Remove from grill and set aside.",
        "Place beef patties on the grill and cook until burgers are hot and slightly pink in the center, about 5 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Top each patty with a slice of Cheddar cheese and continue cooking until cheese is melted, about 1 minute more.",
        "Stir mayonnaise, ketchup, mustard, dill pickle, garlic powder, and paprika in a bowl; spread mixture over toasted buns. Place patties on prepared kaiser buns and season with salt and pepper. Top burgers with 4 slices bacon, 2 slices tomato, and 1 lettuce leaf."
    ],
    "ingredients": [
        "1/2 pound beef sirloin, cubed",
        "1/4 pound beef chuck, trimmed and cubed",
        "1/4 pound beef brisket, trimmed and cubed",
        "4 seeded kaiser buns, split",
        "2 tablespoons butter, melted",
        "16 thick slices center-cut bacon",
        "4 slices sharp Cheddar cheese",
        "kosher salt and ground black pepper to taste",
        "1/2 cup mayonnaise",
        "1 tablespoon ketchup",
        "1 tablespoon mustard",
        "4 slices dill pickle, chopped",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon smoked paprika",
        "8 slices beefsteak tomato",
        "4 leaves lettuce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "All-American Here's The Beef Burgers",
    "url": "http://allrecipes.com/recipe/236113/all-american-heres-the-beef-burgers/"
}
