{
    "directions": [
        "1. Prepare the Giblet Broth a day ahead: Simmer the broth ingredients until the giblets are tender, about 1 hour, skimming off any foam. Strain broth and set aide; reserve giblets and neck. Shred the meat from the neck and mince the giblets; combine. Cover and refrigerate the broth and meats until ready to use.",
        "2. Preheat oven to 325°F. Squeeze orange halves inside turkey body and neck cavities; sprinkle with paprika, salt, and pepper. Fill cavities loosely with stuffing, using about 3 cups for the neck and 8 cups for the body. Truss the turkey. Rub with softened butter and sprinkle with paprika, salt, and pepper.",
        "3. Place the turkey, breast-side up, on a rack in a roasting pan. Pour 2 cups of the reserved Giblet Broth into the bottom of the pan and cover the turkey loosely with foil. Place in the oven and roast for 1 1/2 hours.",
        "4. Remove the foil and roast the turkey for 2 1/2 hours more, basting with the pan juices every 30 minutes.",
        "5. Raise the oven temperature to 350°F and cook for an additional 1 to 1 1/4 hours, or until a thermometer inserted into the thickest part of the thigh reads 180°F. The temperature at the thickest part of the breast should be 160°F. The juices should run clear when the thigh is pricked with a small knife.",
        "6. Prepare Giblet Gravy: Heat pan juices in roasting pan, scraping up all brown bits. Defat; pour into a measuring cup.",
        "7. Melt the butter in a saucepan over medium heat. Whisk in the flour and continue whisking for 2 to 3 minutes, or until mixture browns slightly. Slowly pour in 2 cups of the reserved pan juices, whisking constantly until smooth. Bring to a boil, reduce heat to medium-low and add remaining ingredients. Simmer for 10 minutes, stirring, until gravy has thickened. For a thinner gravy, add more broth. Adjust seasonings; heat before serving."
    ],
    "ingredients": [
        "Giblets and neck from the turkey",
        "1 cup extra giblets",
        "3 1/2 cups chicken broth",
        "1 turkey (18 pounds), rinsed",
        "1 orange, halved",
        "Paprika, to taste",
        "Salt and pepper, to taste",
        "Harvest Stuffing",
        "6 tablespoons softened butter",
        "Pan juices from the turkey",
        "1/4 cup butter",
        "1/4 cup flour",
        "2 tablespoons dry sherry",
        "1 teaspoon dark molasses",
        "1 teaspoon dried thyme",
        "Salt and freshly ground black pepper, to taste",
        "1 tablespoon chopped sage Giblet mixture (see Step 1)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Sauté",
        "Thanksgiving",
        "Orange",
        "Sherry",
        "Molasses",
        "Parade"
    ],
    "title": "All American Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/all-american-turkey-107550"
}
