{
    "directions": [
        "In a small bowl, dissolve the yeast in the lukewarm water and let stand until slightly foamy, about 10 minutes.",
        "In a large bowl, stir together the 2 3/4 cups flour and the salt and form into a mound. Make a well in the center and add the yeast mixture to the well. Using a fork and stirring in a circular motion, gradually pull the flour into the yeast mixture. Continue stirring until a dough forms.",
        "Lightly flour a work surface with some of the 1/2 cup flour and transfer the dough to it. Using the heel of your hand, knead the dough until it is smooth and elastic, about 10 minutes. Form the dough into a ball.",
        "Brush a large bowl with the olive oil and place the dough in it. Cover with plastic wrap and let rise at room temperature until doubled in size, 1 to 2 hours.",
        "Turn the dough out onto a surface dusted with the remaining flour. Punch down the dough and, using your hand, begin to press it out gently into the desired shape. Then, place one hand in the center of the dough and, with the other hand, pull, lift and stretch the dough, gradually working your way all around the edge, until it is the desired thickness, about 1/4 inch thick for a crusty pizza base and 1/2 inch thick for a softer one. Flip the dough over from time to time as your work with it. (Or roll out the dough with a rolling pin.) The dough should be slightly thinner in the middle than at the edge. Lift the edge of the pizza to form a slight rim.",
        "Transfer the dough to a baker's peel or baking sheet, cover with a kitchen towel and let rise again until almost doubled in size, about 20 minutes. Top and bake as directed in your pizza recipe. Makes 1 1/4 lb. dough, enough for a 12-inch thin-crust pizza or a 9-inch thick-crust pizza."
    ],
    "ingredients": [
        "1 Tbs. active dry yeast",
        "3/4 cup plus 2 Tbs. lukewarm water",
        "2 3/4 cups all-purpose flour, plus 1/2 cup for  working",
        "1 tsp. salt",
        "1 Tbs. extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "All-Purpose Pizza Dough",
    "url": "http://www.williams-sonoma.com/recipe/all-purpose-pizza-dough.html"
}
