{
    "directions": [
        "Finely grind cookies and sugar in processor. Add butter and blend until crumbs begin to stick together. Press crumbs firmly onto bottom and up sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Place in freezer.",
        "Grind candies in processor, leaving some small pieces. Whisk yolks, sugar and water in medium metal bowl to blend. Set bowl over saucepan of rapidly simmering water (do not allow bottom of bowl to touch water). Whisk constantly until candy thermometer inserted into mixture registers 170°F, about 6 minutes. Remove bowl from over water. Add half of ground candies and whisk until melted. Let mixture stand until cool, whisking occasionally, about 5 minutes. Mix in remaining candy and peppermint extract.",
        "Using electric mixer, beat cream in large bowl to stiff peaks. Fold cream into yolk mixture. Spoon mixture into crust; smooth top. Cover and freeze until firm, at least 6 hours or overnight.",
        "Bring 1 cup cream and corn syrup to simmer in heavy medium saucepan. Remove from heat. Add chocolate and whisk until smooth. Cool until barely lukewarm and slightly thickened, whisking occasionally, about 30 minutes.",
        "Spoon 1 cup sauce over frozen filling, spreading to edges. Freeze until firm, at least 2 hours. (Can be prepared 1 week ahead. Cover and keep torte frozen. Cover remaining sauce and refrigerate.)",
        "Rewarm sauce over low heat, stirring frequently. Run sharp knife around pan sides to loosen torte. Release pan sides. Transfer torte to platter.",
        "Beat remaining 1 cup cream in large bowl until stiff peaks form. Spoon into pastry bag fitted with star tip. Pipe rosettes of cream around top edge of torte. Place candies between rosettes. Serve with warm sauce."
    ],
    "ingredients": [
        "1 9-ounce box chocolate wafer cookies, broken",
        "2 tablespoons sugar",
        "1/2 cup (1 stick) unsalted butter, melted, cooled",
        "1 7 1/2-ounce package hard red-and- white striped peppermint candies (about 45 pieces)",
        "6 large egg yolks",
        "1/2 cup sugar",
        "1/4 cup water",
        "1/2 teaspoon peppermint extract",
        "3 cups chilled whipping cream",
        "2 cups chilled whipping cream",
        "1/2 cup dark corn syrup",
        "12 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "Additional peppermint candies"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Freeze/Chill",
        "Kid-Friendly",
        "Mint",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "All-American Peppermint Stick Torte with Fudge Topping",
    "url": "http://www.epicurious.com/recipes/food/views/all-american-peppermint-stick-torte-with-fudge-topping-3020"
}
