{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking pan.",
        "Stir yellow cake mix, 1 cup water, vegetable oil, and eggs in a mixing bowl until moistened; beat with a mixer on medium speed for 2 minutes. Pour batter into prepared baking pan.",
        "Bake cake in the preheated oven until lightly browned and a toothpick inserted into the center comes out clean, about 35 minutes. Cool completely on a wire rack. Poke holes about 1 inch apart all over the cake with a fork.",
        "Dissolve strawberry gelatin in boiling water in a bowl and pour gelatin slowly over the cake, letting gelatin seep into holes. Refrigerate cake until gelatin sets, about 1 hour. Transfer cake to a serving platter and cut in half horizontally.",
        "Mix instant vanilla pudding mix with milk in a bowl and whisk until thickened, about 2 minutes; stir in 1/2 cup blueberries. Spread blueberry filling onto bottom of cake and place top of cake over the filling. Spread 2 cups whipped topping smoothly over top and sides of cake and arrange 1/2 cup blueberries in a square in the upper left corner of the cake for stars. Arrange alternating layers of strawberries and miniature marshmallows into horizontal red and white stripes."
    ],
    "ingredients": [
        "1 (18.25 ounce) package yellow cake mix",
        "1 cup water",
        "1/3 cup vegetable oil",
        "3 eggs",
        "1 (3 ounce) package strawberry-flavored Jell-O® mix",
        "1/2 cup boiling water",
        "1 (3.5 ounce) package instant vanilla pudding mix",
        "1 1/2 cups milk",
        "1 cup frozen whipped topping, thawed",
        "1/2 cup fresh blueberries",
        "2 cups frozen whipped topping, thawed",
        "1/2 cup fresh blueberries",
        "1 1/2 cups sliced fresh strawberries",
        "1/2 cup miniature marshmallows"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "All-American Flag Cake",
    "url": "http://allrecipes.com/recipe/222691/all-american-flag-cake/"
}
