{
    "directions": [
        "Put the beans in a medium bowl, cover with about 3 inches of water, and soak overnight. Or put the beans in a saucepan, cover with water, and bring to a boil for 3 minutes. Remove from the heat and soak for 1 hour. Then drain.",
        "Meanwhile, cut the duck into 8 pieces: 2 breast halves, 2 drumsticks, 2 thighs, and 2 wings. Trim off all visible fat and excess skin and set the fat and skin aside. Season the duck pieces and lamb with the salt and pepper and set aside.",
        "Cook the duck fat and skin in a large heavy skillet over medium heat until between 1/4 and 1/3 cup fat is in the pan, about 4 minutes. Remove the solid pieces of fat and skin and discard. Brown the duck in the hot fat on both sides, about 4 minutes per side, and set aside. Brown the lamb, about 4 minutes per side, and set aside. Brown the sausage pieces on all sides, about 3 minutes per side, and set aside.",
        "Add the onion and celery to the skillet and sauté until lightly browned, about 4 minutes. Add the garlic, nutmeg, Italian seasoning, and cloves and sauté until aromatic, about 1 minute. Add the wine and bring to a boil. Add the beef broth and tomatoes, return to a boil, and remove from the heat.",
        "Layer the beans and meats, in alternating layers (4 of beans, 3 of meat), starting and ending with the beans. Pour the liquid over all, cover the cooker, and cook until the beans are tender, 8 to 10 hours on low.",
        "Preheat an oven to 350°F. Mix the breadcrumbs and parsley and scatter over the top of the cassoulet. Transfer the crock with the cassoulet to the oven and bake until the top is browned and bubbling, about 30 minutes. Serve immediately."
    ],
    "ingredients": [
        "1 pound dried large white beans, such as cannellini or baby limas",
        "1 duck (about 4 pounds)",
        "1 pound boneless leg of lamb, cut into 2-inch cubes",
        "2 teaspoons kosher salt",
        "1/2 teaspoon coarsely ground black pepper",
        "8 ounces garlic sausage, cut into 2-inch lengths",
        "8 ounces smoked sausage, such as andouille, cut into 2-inch lengths",
        "1 large onion, diced",
        "2 large celery ribs, cut into 1/4-inch-thick slices",
        "4 cloves garlic, minced",
        "1/4 teaspoon ground nutmeg",
        "1 teaspoon dried Italian seasoning",
        "Pinch of ground cloves",
        "1/2 cup dry white wine",
        "4 cups beef or chicken broth, or a mixture",
        "1 can (about 15 ounces) diced tomatoes, drained",
        "2/3 cup dried breadcrumbs",
        "1/4 cup coarsely chopped fresh Italian (flat-leaf) parsley",
        "5–6 quart slow cooker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Slow Cooker",
        "Lamb",
        "Sausage",
        "Duck",
        "Bean",
        "Breadcrumbs",
        "Soup/Stew"
    ],
    "title": "All-Day Slow-Cooker Cassoulet",
    "url": "http://www.epicurious.com/recipes/food/views/all-day-slow-cooker-cassoulet"
}
