{
    "directions": [
        "Combine the water, flour, gluten (if using), salt, and yeast in your bread machine and mix using the machine's dough cycle. The dough should pull away from the sides nicely; add more flour or water if necessary during the mixing cycle so the dough doesn't end up too sticky or dry. When the first rising cycle ends, punch the dough down and transfer the dough to a lightly floured surface.",
        "Grease a baking sheet or line it with parchment paper. Roll out the dough into a square about 3/4-inch thick and divide it into four pieces. Roll up three of the pieces jelly-roll style, and line them up seam-side down on the baking sheet to form the head, body, and tail. The ends of the connected pieces should just slightly touch. (Remember that everything will get bigger as the dough rises, so try to keep proportions in mind.)",
        "Lightly grease your hands and shape the dough like you're working with clay: elongate the tail to a slender curved tip, and then slightly elongate the nose end. Slice into the nose horizontally at the tip to form the alligator's mouth; hold the mouth open with a wedge of greased aluminum foil.",
        "From the remaining quarter of dough, trim off a tiny piece to use for the eyes. Slice the remainder into four \"logs\" for legs, flattening one end of each leg and inserting it under the alligator's body. Shape the legs into slight bends when positioning them on the baking sheet. Cut short slices into the other end of the leg to make claws. Use scissors to snip shallow cuts over the surface of the dough (this will form the alligator's spiky skin).  Roll the reserved dough into little balls for the eyes, stuffing each with a raisin.",
        "Preheat an oven to 400 degrees F (200 degrees C). Beat the egg with 1 tablespoon of warm water in a small bowl.",
        "Let the alligator rise in a warm place until fully proofed, about thirty minutes (poke your index and middle fingers into the sides of the dough; the indentation should remain. If the dough springs back, it needs to rise longer). Gently brush the dough with the egg wash and bake it in the preheated oven until golden brown, about 20 minutes. Remove the alligator from the baking sheet with a spatula and transfer it to a wire rack. Remove the aluminum foil when cool."
    ],
    "ingredients": [
        "For the dough:",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "3 cups all-purpose flour",
        "1 tablespoon vital wheat gluten (optional)",
        "1 1/2 teaspoons salt",
        "2 1/2 teaspoons instant yeast",
        "For decorating:",
        "2 raisins",
        "1 egg",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Alligator Animal Italian Bread",
    "url": "http://allrecipes.com/recipe/212892/alligator-animal-italian-bread/"
}
