{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Place a sheet of aluminum foil in a 9x13 inch baking dish.",
        "Stir together the almonds, 1/3 cup heavy cream, honey mustard, and 1/2 teaspoon rosemary in a small bowl; set aside. Season the tenderloins with salt and pepper to taste. Spread the almond mixture evenly over the tenderloins and place them into the baking dish.",
        "Bake in the preheated oven until the almond crust is golden brown and the pork is no longer pink in the center, about 90 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Allow the pork to rest for 10 minutes before slicing.",
        "While the pork is baking, prepare the apple-rosemary sauce by melting the butter in a saucepan over medium heat. Stir in the garlic, onions, and 1/4 teaspoons of rosemary; cook until the onions have softened and turned translucent, about 5 minutes. Once the onions are tender, add the apples and apple cider. Bring to a simmer over medium-high heat and cook for 5 minutes. Pour in 1 1/4 cups of heavy cream, return to a simmer, then reduce heat to medium-low and simmer uncovered until the sauce has thickened slightly and is flavorful, 5 to 10 minutes. Season to taste with salt and pepper before serving with the pork."
    ],
    "ingredients": [
        "1 cup ground almonds",
        "1/3 cup heavy cream",
        "2 tablespoons honey mustard",
        "1/2 teaspoon ground dried rosemary",
        "2 pork tenderloins, trimmed",
        "salt and pepper to taste",
        "Apple-Rosemary Sauce",
        "1 tablespoon butter",
        "2 cloves garlic, minced",
        "1 onion, diced",
        "1/4 teaspoon ground dried rosemary",
        "3 Granny Smith apples - peeled, cored and sliced",
        "1/2 cup apple cider",
        "1 1/4 cups heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Almond Crusted Pork with Apple-Rosemary Sauce",
    "url": "http://allrecipes.com/recipe/172022/almond-crusted-pork-with-apple-rosema/"
}
