{
    "directions": [
        "Dissolve 1/2 teaspoon of sugar in the warm water in a 1-cup measuring cup, and sprinkle with the yeast. Stir to mix the yeast into the water, and let stand in a warm place until frothy and doubled in volume, 10 to 15 minutes. Stir together 1/3 cup of sugar, 2 raw eggs, salt, the yeast mixture, milk, and 3 cups of flour in a large bowl, and beat with an electric mixer for 3 minutes to develop gluten. Mix the remaining flour into the batter, and beat until the dough is shiny, soft, and elastic, about 5 minutes. Scrape down the bowl, cover with plastic wrap, and refrigerate for 30 minutes.",
        "Place sticks of butter 1 inch apart between 2 large pieces of waxed paper. Roll the butter out into a square about 12 inches on a side, place the waxed paper with square of butter onto a baking sheet, and freeze for 15 minutes.",
        "Turn the dough out onto a well-floured work surface, turn the dough around to pick up flour on all sides, and sprinkle the dough with flour. Roll the dough out into a rectangle 18 inches square. Brush off excess flour from the dough, if necessary. Peel off the top layer of waxed paper from the butter square. Place the square of cold butter, remaining waxed-paper side up, catty-corner onto the dough rectangle so the corners of the dough extend out beyond the butter. Peel off the remaining waxed paper. Fold the top and bottom points over the butter, meeting in the middle; fold the left and right points over the butter. Pinch the sides and seams of the dough together to enclose the butter in the dough.",
        "Roll the flat dough envelope filled with butter, seam side down, out on the floured surface to a rectangle 12 by 24 inches, and fold the dough in half (into a 12x12 inch square), then in half again, to make a 6x12 inch square of dough with four butter layers. Chill the dough for about 5 minutes; then roll the dough out again to a 12 by 24-inch rectangle, and fold in quarters as before; chill, repeat rolling and folding the dough one more time. Refrigerate dough at least 1 more hour or overnight.",
        "Preheat oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper.",
        "Cut the dough into two pieces (you will see buttery layers). On a well-floured surface, roll out a dough piece into a rectangle 30 by 9 inches; cut the rectangle into 3 long strips, 30 by 3 inches each. Mix almond filling, 1/2 cup of butter, and 1/2 cup of sugar together in a bowl, and spread half the filling mixture all down the center of the 3 strips. Fold the strips over the filling the long way and pinch the edges closed, enclosing the filling in 3 long ropes. Braid the 3 ropes together, and arrange the braid into a ring. Pinch the ends closed. Repeat for 2nd dough piece and remaining half of filling, making two ring-shaped braided pastries.",
        "Place the pastries onto the lined baking sheets, reforming into symmetrical rings if necessary. Set 3 hard-cooked Easter eggs, wedged between braids, into top of each braided pastry. Brush pastries, eggs and all, with beaten egg; sprinkle with additional white sugar and sliced almonds.",
        "Bake in the preheated oven until browned and crisp, 40 to 45 minutes."
    ],
    "ingredients": [
        "1/2 teaspoon white sugar",
        "1/2 cup warm water - 100 to 110 degrees F (40 to 45 degrees C)",
        "2 (.25 ounce) envelopes dry yeast",
        "1/3 cup white sugar",
        "2 eggs",
        "1 teaspoon salt",
        "3/4 cup milk",
        "4 1/2 cups sifted all purpose flour, divided",
        "1 pound stick butter",
        "1 (12.5 ounce) can almond cake and pastry filling (not almond paste)",
        "1/2 cup butter, softened",
        "1/2 cup white sugar",
        "6 dyed hard-cooked Easter eggs",
        "1 egg, beaten",
        "2 tablespoons additional white sugar for sprinkling, or as desired",
        "1/2 cup sliced almonds, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Almond Easter Bread",
    "url": "http://allrecipes.com/recipe/217510/almond-easter-bread/"
}
