{
    "directions": [
        "In a large bowl, beat almond paste with an electric mixer to break it apart. Add the almonds, sugar, and salt; continue to mix until the almond paste is no longer lumpy. Stir in the butter, egg whites, almond extract and amaretto liqueur on high speed until its as fluffy as you can get it. Set aside.",
        "Using half of the dough at a time, roll it out on a lightly floured surface into a rectangle that is about 8 inches wide and 1/4 inch thick. Trim the edges of the dough. Cut the dough in half lengthwise to make two 4 inch wide strips.",
        "Preheat the oven to 400 degrees F (200 degrees C). Line baking sheets with parchment paper.",
        "Fill a pastry bag halfway with the almond filling and pipe a stripe of filling down the center of each strip. Whisk together the egg and water. Brush onto one edge of each strip. Fold each strip over the filling and press gently to seal it. Brush each piece with egg wash and sprinkle sliced almonds over the top. Cut into 3 to 4 inch pieces, then cut 1/2 inch slits into the sealed edge to make the ''claws''.  Place the bear claws at least two inches apart on baking sheets. Refrigerate and repeat with the second half of the dough.",
        "Bake in the preheated oven until almonds are toasted and pastry is golden brown, 25 to 30 minutes. Cool and dust with confectioners' sugar right before serving."
    ],
    "ingredients": [
        "1/3 cup almond paste",
        "2 3/4 cups ground almonds",
        "1/2 cup white sugar",
        "1 pinch salt",
        "2 tablespoons butter",
        "2 egg whites",
        "1/2 teaspoon almond extract",
        "2 teaspoons amaretto liqueur",
        "3 pounds puff pastry",
        "1 egg",
        "1 tablespoon water",
        "3 tablespoons sliced almonds, for garnish",
        "3 tablespoons confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Almond Bear Claws",
    "url": "http://allrecipes.com/recipe/159901/almond-bear-claws/"
}
