{
    "directions": [
        "Melt 2 tablespoons butter in heavy large saucepan over medium-high heat. Add leeks; sauté 2 minutes. Reduce heat to low; cover and cook until leeks are very tender, stirring occasionally, about 20 minutes. Increase heat to medium; add lemon juice and stir until liquid evaporates, about 1 minute. Mix in cream. Simmer until slightly reduced, about 2 minutes. Cool slightly. Transfer mixture to blender. Blend until smooth. Strain sauce into same saucepan, pressing on solids to extract as much liquid as possible. Season sauce to taste with salt and pepper. (Sauce can be made 1 day ahead. Cover and refrigerate.)",
        "Mix almonds, parsley, lemon peel, 1/2 teaspoon salt, and 1/8 teaspoon pepper on plate. Place flour on another plate. Sprinkle salmon with salt and pepper. Dredge salmon in flour, shaking off excess. Lightly brush 1 side of salmon with beaten egg. Press brushed side of salmon into almond mixture, pressing lightly to adhere. Arrange salmon, nut side up, on baking sheet.",
        "Melt 1 tablespoon butter with 1 tablespoon oil in each of 2 heavy large skillets over medium heat. Add half of salmon to each skillet, almond-coated side down, and cook until crust is brown, about 5 minutes. Turn salmon over. Sauté until salmon is cooked through and opaque in center, about 5 minutes. Transfer salmon to plates.",
        "Reheat sauce, stirring over medium heat. Spoon around salmon and serve."
    ],
    "ingredients": [
        "4 tablespoons (1/2 stick) butter",
        "2 medium leeks, halved, thinly sliced (white and pale green parts only)",
        "3 tablespoons fresh lemon juice",
        "1 cup whipping cream",
        "1 cup sliced almonds, chopped",
        "1/4 cup chopped fresh parsley",
        "1 tablespoon grated lemon peel",
        "1/2 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "1/2 cup all purpose flour",
        "6 6-ounce skinless salmon fillets",
        "1 large egg, beaten to blend",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Sauté",
        "Almond",
        "Salmon",
        "Leek",
        "Spring"
    ],
    "title": "Almond-Crusted Salmon with Leek and Lemon Cream",
    "url": "http://www.epicurious.com/recipes/food/views/almond-crusted-salmon-with-leek-and-lemon-cream-106414"
}
