{
    "directions": [
        "Bring milk to a simmer in a 4-quart heavy saucepan over medium heat. Whisk together yolks, sugar, cornstarch, and a pinch of salt in a bowl. Whisk in milk, then transfer mixture to saucepan.",
        "Bring to a boil over medium heat, whisking constantly, then boil, whisking constantly, 2 minutes. Immediately strain through a fine-mesh sieve into a clean bowl. Divide custard among 3 bowls. To make almond base, whisk 1/2 teaspoon vanilla into 1 bowl; for pistachio base, whisk almond extract and food coloring into another bowl; for chocolate base, whisk cocoa and remaining 1/2 teaspoon vanilla into third bowl.",
        "Cool to room temperature, stirring occasionally. Chill custards, surfaces covered with parchment paper (to prevent a skin from forming), until cold, at least 6 hours.",
        "Freeze each custard in ice cream maker, 1 batch at a time (white, then green, then brown). Fold almonds into vanilla custard, then fold pistachios into green custard. Transfer to a shallow 2-quart container or 3 smaller containers and put in freezer to firm up, about 4 hours."
    ],
    "ingredients": [
        "6 cups whole milk",
        "8 large egg yolks",
        "1 1/4 cups sugar",
        "1/2 cup cornstarch",
        "1 teaspoon pure vanilla extract, divided",
        "1/2 teaspoon pure almond extract",
        "2 drops green food coloring",
        "1/2 cup unsweetened cocoa powder (not Dutch-process)",
        "2/3 cup whole blanched almonds, toasted and coarsely chopped",
        "1/2 cup unsalted shelled pistachios, toasted and coarsely chopped",
        "Equipment: an ice cream maker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Chocolate",
        "Dessert",
        "Freeze/Chill",
        "Kid-Friendly",
        "Frozen Dessert",
        "Almond",
        "Pistachio",
        "Family Reunion",
        "Gourmet"
    ],
    "title": "Almond, Chocolate, and Pistachio Spumoni",
    "url": "http://www.epicurious.com/recipes/food/views/almond-chocolate-and-pistachio-spumoni-351135"
}
