{
    "directions": [
        "Preheat oven to 350°F. Butter and flour ramekins.",
        "In food processor, process almond paste and sugar until mixture resembles fine sand, 10 to 15 seconds. Transfer to bowl of stand mixer fitted with paddle attachment, then add butter and beat until light and fluffy, about 2 minutes. Add eggs, 1 at a time, beating well after each addition and scraping down bowl as necessary, about 1 minute. Add vanilla and beat until incorporated, about 30 seconds.",
        "In small bowl, whisk together flour, baking powder, and salt. Sift over almond paste mixture, then mix until incorporated, about 30 seconds.",
        "Divide batter among prepared ramekins, smoothing tops. Transfer to baking sheet and bake until cakes are golden brown and springy to touch, about 30 minutes. Transfer to rack to cool while making sauce. (Cakes can be baked ahead, removed from ramekins, and frozen, wrapped tightly in plastic wrap, up to 1 week. Allow 4 hours for cakes to thaw at room temperature. To rewarm, place on parchment-paper-lined baking sheet and bake at 350°F for 10 minutes.)",
        "Transfer chopped chocolate to small bowl.",
        "In small saucepan over moderate heat, stir together cream and passion fruit juice. Bring to boil, then pour over chocolate and let stand 30 seconds. Using heat-proof silicone spatula, stir until smooth, about 30 seconds. Cover with plastic wrap and keep warm.",
        "Pour about 2 tablespoons sauce into center of each plate.",
        "Run small, thin knife around inner edge of 1 ramekin, then invert onto palm of hand and, using other palm, smack bottom of ramekin to release cake. Transfer cake to rack and sift confectioners' sugar over, then transfer to prepared plate. Unmold remaining cakes in same manner. Serve immediately."
    ],
    "ingredients": [
        "4 ounces almond paste (not marzipan)",
        "1/2 cup sugar",
        "8 tablespoons (1 stick) unsalted butter, room temperature",
        "3 large eggs, room temperature",
        "1/2 teaspoon pure vanilla extract",
        "1/2 cup all-purpose flour",
        "3/4 teaspoon baking powder",
        "1/4 teaspoon kosher salt",
        "Confectioners' sugar for dusting",
        "5 ounces good-quality bittersweet chocolate, finely chopped",
        "1/4 cup heavy cream",
        "1/4 cup passion fruit juice, such as Loóza Passion Fruit Nectar",
        "Special equipment: 6 (1/2-cup) ramekins, food processor, stand mixer with paddle attachment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Almond",
        "Passion Fruit",
        "Ramekin",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond Cakes with Chocolate Passion-Fruit Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/almond-cakes-with-chocolate-passion-fruit-sauce-351235"
}
