{
    "directions": [
        "Preheat oven to 350°F. Spread out almonds on a rimmed baking sheet; toast, tossing halfway through, until beginning to brown, 12-15 minutes. Let cool.",
        "Transfer cooled almonds to a food processor. Add butter, almond extract, if using, and salt, and process until mixture is the texture of coarsely ground peanut butter. Set aside.",
        "Whisk sugar, cream of tartar, and 3 tablespoons water in a medium saucepan. Bring to a boil over medium-high heat, stirring to dissolve sugar. Cook, without stirring, until mixture begins to caramelize in spots. Using a heatproof spatula, stir mixture to ensure even caramelization. Cook, stirring occasionally, until mixture is the color of honey, 10-12 minutes. Reduce heat to medium-low and continue to cook, stirring occasionally, until caramel is a deep amber color, about 5 minutes longer.",
        "Remove caramel from heat; carefully whisk in butter (mixture will bubble vigorously), then cream and salt. Let cool slightly in pan, then pour into a small bowl. DO AHEAD: Caramel sauce can be made 2 weeks ahead. Let cool completely, cover, and chill. Rewarm before using.",
        "Combine half-and-half and cream in a medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring to a simmer over medium-high heat; remove from heat.",
        "Whisk egg yolks, eggs, sugar, and salt in a medium bowl to blend. Gradually whisk hot cream mixture into egg mixture. Cover custard with plastic wrap and let stand for 30 minutes for flavors to meld. Strain custard into a large bowl; discard vanilla bean.",
        "Preheat oven to 350°F. Butter cake pan; set aside. Using biscuit cutter, cut out circles from each slice of bread, reserving scraps. Arrange bread scraps in pan in an even layer and press lightly to compact.",
        "Spread each bread round with almond butter (you will have a little left over; save to spread on toast for breakfast). Place all but 1 bread round almond butter side down in pan (on top of scraps), overlapping slightly to create a shingled circle. Place the last round in the center (bread will come about 3/4\"-1\" above rim of pan).",
        "Pour custard evenly over bread. Sprinkle with almonds and raw sugar.",
        "Place cake pan in a large roasting pan. Pour hot water into roasting pan to come halfway up the sides of cake pan. Cover roasting pan with foil, tenting slightly in center if needed to avoid touching bread.",
        "Bake pudding until top no longer jiggles but center is not quite set, 25-30 minutes. Remove foil from pan and increase oven temperature to 375°F. Bake pudding until custard is set in the center and top is golden brown and crisp, about 25 minutes longer.",
        "Remove cake pan from roasting pan. Let cool slightly. Dust pudding with powdered sugar. Slice into wedges. Place on plates, drizzle caramel sauce over and top with a dollop of crème fraîche."
    ],
    "ingredients": [
        "1 cup whole blanched almonds",
        "1 tablespoon unsalted butter, room temperature",
        "1/4 teaspoon almond extract (optional)",
        "1/4 teaspoon kosher salt",
        "1 cup sugar",
        "1/8 teaspoon cream of tartar",
        "1/4 cup (1/2 stick) unsalted butter, cut into pieces",
        "1/2 cup heavy cream",
        "1 teaspoon kosher salt",
        "1 1/4 cups half-and-half",
        "1 1/4 cups heavy cream",
        "1/2 vanilla bean, split lengthwise",
        "4 large egg yolks",
        "3 large eggs",
        "3/4 cup sugar",
        "1/4 teaspoon kosher salt",
        "Unsalted butter (for coating cake pan)",
        "1 1-pound loaf brioche or challah, crust removed and discarded, cut into 3/4\"-thick slices (10-12 slices)",
        "3 tablespoons sliced almonds",
        "2 tablespoons raw sugar",
        "Powdered sugar",
        "Crème fraîche",
        "Special equipment: An 8\"-diameter cake pan with 2\"-high sides and a 3\" biscuit cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Almond",
        "Christmas Eve",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond Bread Pudding with Salted Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/almond-bread-pudding-with-salted-caramel-sauce-51140830"
}
