{
    "directions": [
        "Line a lightly oiled 8 1/2-by 4 1/2-inch loaf pan with plastic wrap, leaving a 2-inch overhang on all sides. Lightly oil a baking sheet.",
        "Cook 1/3 cup sugar in a dry small heavy skillet over medium heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork, until a deep golden caramel.",
        "Stir in almonds to coat and scrape onto baking sheet. Cool, then break into pieces. Pulse in a food processor until praline is finely ground (do not grind to a paste).",
        "Beat eggs and remaining 1/4 cup sugar with a pinch of salt in a 2-quart metal bowl set over a pot of simmering water using a handheld electric mixer at high speed until tripled in volume and very thick, about 8 minutes. Remove bowl from heat and continue to beat until mixture is cooled to room temperature, about 5 minutes. Stir in extract.",
        "With cleaned beaters, beat cream until it just holds stiff peaks. Fold about one third of whipped cream into egg mixture to lighten, then fold in remaining cream and all but 1 tablespoon praline gently but thoroughly (reserve 1 tablespoon praline for garnish). Spoon into loaf pan and freeze, covered, until firm, at least 6 hours.",
        "Bring water, sugar, and zest to a simmer in a 12-inch heavy skillet, stirring until sugar has dissolved. Simmer 5 minutes. Add grappa and return to a simmer. Toss apricots with lemon juice, then put, cut sides down, in grappa syrup and simmer 5 minutes. Turn apricots over and simmer until just tender, 1 to 3 minutes more.",
        "Transfer apricots with a slotted spoon to a 13-by 9-inch dish, arranging them in 1 layer. Boil syrup in skillet until reduced to about 1/2 cup, about 3 minutes, and pour over apricots. Cool to room temperature.",
        "Uncover semifreddo and invert onto a chilled platter, using plastic wrap to help pull it from mold. Sprinkle reserved praline on top. Slice semifreddo crosswise and serve with apricots and syrup."
    ],
    "ingredients": [
        "1/3 cup plus 1/4 cup sugar, divided",
        "1/3 cup sliced almonds with skin (1 ounce), toasted and cooled",
        "2 large eggs",
        "1/8 teaspoon pure almond extract",
        "1 1/2 cups chilled heavy cream",
        "1 cup water",
        "2/3 cup sugar",
        "1 (3-inch) strip lemon zest",
        "1/2 cup grappa",
        "8 firm-ripe apricots (1 1/2 to 1 3/4 pounds), halved and pitted",
        "1 tablespoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Egg",
        "Frozen Dessert",
        "Apricot",
        "Almond",
        "Grappa",
        "Simmer",
        "Gourmet"
    ],
    "title": "Almond Praline Semifreddo with Grappa-Poached Apricots",
    "url": "http://www.epicurious.com/recipes/food/views/almond-praline-semifreddo-with-grappa-poached-apricots-354218"
}
