{
    "directions": [
        "Pulse flour, sugar, baking powder, salt, and baking soda in a food processor 30 seconds to combine. Add butter. Pulse until butter pieces are the size of peas. Add buttermilk and almond extract; pulse until dough just comes together. Form dough into a disk, dusting lightly with flour. Cover in plastic wrap or wax paper and refrigerate 1 hour.",
        "Whisk egg white and confectioners' sugar in a bowl until frothy, about 1 minute. Add almonds, butter and almond extract. Whisk. Refrigerate.",
        "Peel and core pears, then cut into slices about 1/4 inch thick; toss in a bowl with lemon juice and zest.",
        "Heat oven to 400°F. Lightly dust a sheet of parchment paper with flour; place dough on top and lightly dust with flour; top with another sheet of parchment and roll out dough into a circle about 12 inches in diameter. Peel off top layer of parchment. Invert dough onto a baking sheet lined with third sheet of parchment. Trim around edges of dough. Spread cream over dough, leaving a 1-inch border. Arrange pear slices in concentric circles over cream. Sprinkle with sugar and cinnamon. Fold edges of dough over pears, crimping dough to enclose ends of pears. Evenly scatter bits of butter over top of filling. Bake 20 to 25 minutes or until pears are tender and crust is golden. (Cover top with a sheet of foil if it begins to overbrown.) Remove; cover edges of tart with foil. Heat broiler. Glaze top of pears under broiler, about 6 inches from heat, 1 minute or until pears are golden brown. Cool on baking sheet 5 minutes. Transfer (on parchment) to rack to cool completely. Dust with confectioners' sugar."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour, plus extra for rolling and dusting",
        "2 tablespoons sugar",
        "1/4 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/8 teaspoon baking soda",
        "5 tablespoons butter, cut into 1/2-inch cubes and frozen",
        "1/4 cup plus 2 tablespoon cultured buttermilk",
        "1/4 teaspoon pure almond extract",
        "1 large egg white",
        "3 tablespoons confectioners' sugar",
        "3 tablespoons finely ground almonds",
        "2 teaspoons melted butter",
        "1/4 teaspoon pure almond extract",
        "3 firm, ripe pears, such as Anjou or Bartlett",
        "2 tablespoon fresh lemon juice",
        "1 1/2 teaspoons grated lemon zest",
        "3 sheets parchment paper",
        "1/4 cup granulated sugar",
        "1/4 teaspoon cinnamon",
        "2 teaspoons butter, cut into small bits",
        "Confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Broil",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "Fall",
        "Winter",
        "Chill",
        "Healthy",
        "Self",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond-Pear Galette",
    "url": "http://www.epicurious.com/recipes/food/views/almond-pear-galette-236924"
}
