{
    "directions": [
        "Using an electric mixer on medium speed, cream sugar and oil in a large bowl until mixture resembles texture of wet sand, about 3 minutes. Add egg and orange zest and beat until just combined.",
        "Whisk almond flour, potato starch, cardamom, and salt in a medium bowl. Fold dry ingredients into oil mixture. Cover with plastic wrap and chill 1 hour.",
        "Spread pistachios in a single layer on a rimmed baking sheet. Divide dough into 2 balls. Roll each ball into 1 1/2\" wide logs, then roll logs in pistachios to coat; reserve remaining pistachios for decorating, if desired. Wrap logs in plastic wrap and chill at least 1 1/2 hours.",
        "Arrange racks in upper and lower thirds of oven; preheat to 350°F. Line 2 rimmed baking sheets with parchment. Using a sharp knife, slice dough into 1/4\"-thick rounds and arrange on baking sheets (about 12 per sheet). Sprinkle with reserved pistachios, pressing lightly to adhere (alternatively, drizzle with melted chocolate after cookies are baked, see below).",
        "Bake cookies, rotating sheets halfway through, until undersides are golden, 8–12 minutes. Transfer cookies to wire racks. Let 1 sheet cool completely before lining again with parchment and baking third batch.",
        "If you didn't sprinkle the cookies with pistachios, melt chocolate in a medium heatproof bowl set over a medium pot of barely simmering water, stirring occasionally, or in short bursts in the microwave, stirring in between bursts, until chocolate is smooth. Drizzle cooled cookies with chocolate and let set before serving.",
        "Dough can be formed into logs 3 days ahead; keep chilled. Cookies can be baked 3 days ahead. Store in an airtight container at room temperature."
    ],
    "ingredients": [
        "1 cup sugar",
        "1/3 cup virgin coconut oil, softened at room temperature",
        "1 large egg",
        "1 tablespoon plus 1 teaspoon finely grated orange zest (from about 2 oranges)",
        "2 cups almond flour",
        "1/4 cup potato starch",
        "1 1/2 teaspoons ground cardamom",
        "1/4 teaspoon kosher salt",
        "1/2 cup roasted, salted pistachios, finely chopped",
        "3 ounces dark chocolate (for drizzling; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Passover",
        "Kosher for Passover",
        "Almond",
        "Cardamom",
        "Orange",
        "Pistachio",
        "Chocolate",
        "Dessert",
        "Potato",
        "Wheat/Gluten-Free",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Flourless Almond Cookies With Cardamom, Orange Zest, and Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/almond-cookies-with-cardamom-orange-zest-and-pistachios"
}
