{
    "directions": [
        "Bring cream and butter to boil in heavy small saucepan. Remove from heat. Add chocolate; whisk until smooth. Whisk in amaretto. Pour into small bowl. Freeze until firm enough to form into balls, about 50 minutes.",
        "Line baking sheet with foil. Using teaspoon, scoop out level teaspoonfuls of chocolate mixture. Drop onto baking sheet. Freeze until firm, about 20 minutes. Using hands, roll chocolate into balls; return to baking sheet and freeze. (Can be made 1 week ahead. Cover and keep frozen.)",
        "Combine cream, milk and sugar in heavy large saucepan. Stir over medium heat until sugar dissolves. Bring to boil. Add chopped almonds. Cover and let steep 2 hours.",
        "Pour cream mixture through fine strainer set over bowl; discard solids in strainer. Return cream mixture to same saucepan. Bring to simmer. Whisk yolks in large bowl to blend. Gradually whisk hot cream mixture into yolks. Return mixture to saucepan. Stir over medium-low heat until custard thickens and leaves path on back of spoon when finger is drawn across, about 3 minutes (do not boil). Cool slightly. Mix in almond extract. Transfer to bowl and chill custard until cold, at least 3 hours or overnight.",
        "Line 9x5x3-inch glass loaf dish with plastic wrap, overlapping sides by 2 inches. Process custard in ice cream maker according to manufacturers instructions. Transfer ice cream to prepared dish. Press truffles into ice cream, spacing apart. Cover terrine and freeze until firm, at least 8 hours or overnight.",
        "Puree thawed raspberries in processor. Pour through strainer set over bowl, pressing with back of spoon to extract as much liquid as possible. Discard solids in strainer. Whisk sugar and amaretto into sauce. Cover and chill. (Terrine and sauce can be prepared 2 days ahead. Keep terrine frozen. Keep sauce refrigerated.)",
        "Turn terrine out onto platter. Peel off plastic. Cut terrine into 3/4-inch-thick slices. Serve with sauce and fresh berries."
    ],
    "ingredients": [
        "1/2 cup whipping cream",
        "2 tablespoons (1/4 stick) unsalted butter",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 1/2 tablespoons amaretto or other almond liqueur",
        "2 1/2 cups whipping cream",
        "1 1/4 cups whole milk",
        "3/4 cup plus 2 tablespoons sugar",
        "1 cup whole almonds, toasted, coarsely chopped",
        "7 large egg yolks",
        "1/2 teaspoon almond extract",
        "1 12-ounce package frozen unsweetened raspberries, thawed",
        "6 tablespoons sugar",
        "1/4 cup amaretto or other almond liqueur",
        "Fresh raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Chocolate",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Raspberry",
        "Almond",
        "Summer",
        "Chill",
        "Simmer",
        "Boil"
    ],
    "title": "Almond Ice Cream Terrine with Chocolate Truffles and Raspberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/almond-ice-cream-terrine-with-chocolate-truffles-and-raspberry-sauce-4245"
}
