{
    "directions": [
        "For the cake: Preheat the oven to 350 degrees. Grease and flour a 9- by 13-inch cake pan.",
        "Whisk together the flour, baking powder and salt in a large mixing bowl.",
        "Cream the butter and sugar with an electric mixer on high until it turns pale yellow. Mix in the eggs and almond extract. Slowly incorporate the dry ingredients into the wet ingredients until fully combined – avoid over-mixing. Fold in drained cherries. Pour into the prepared pan and evenly spread the batter out.",
        "Bake until the cake is has cooked through, 25 to 30 minutes. Cool slightly, then pierce the surface of the cake with a fork several times, especially the edges.",
        "Combine the heavy cream, evaporated milk and condensed milk in a small bowl or pitcher. Drizzle the milk mixture over the top and allow the cake to sit and absorb the milk mixture.",
        "For the icing: Whip heavy cream until slightly fluffy, then add sugar and almond extract. Spread it evenly over the top of the soaked cake. Top with toasted almonds.",
        "Refrigerate for at least 2 hours or until ready to serve."
    ],
    "ingredients": [
        "Cake:",
        "1 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 cup unsalted butter, softened",
        "1 cup granulated sugar",
        "5 large eggs",
        "1/2 teaspoon almond extract",
        "1 (14.5 ounce) can pitted cherries in syrup, thoroughly drained",
        "Tres Leches Mixture:",
        "1/4 cup heavy cream",
        "1 (14 ounce) can sweetened condensed milk",
        "1 (12 ounce) can evaporated milk",
        "Icing:",
        "1 1/2 cups heavy cream, chilled",
        "4 tablespoons powdered sugar",
        "1/4 teaspoon almond extract",
        "1/4 cup chopped almonds, toasted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Almond Cherry Tres Leches Cake",
    "url": "http://allrecipes.com/recipe/245885/almond-cherry-tres-leches-cake/"
}
