{
    "directions": [
        "Preheat oven to 350°F. Set aside 1/2 cup (packed) almond paste for filling. Combine remaining almond paste, graham crackers and almonds in processor and grind finely. Add butter; process until moist crumbs form. Press over bottom and 2 inches up sides of 9-inch-diameter springform pan. Bake until crust colors, about 10 minutes. Cool.",
        "Wipe out processor. Blend sugar and reserved 1/2 cup almond paste in processor until mixture resembles fine meal, about 1 minute. Add half of cream cheese and process until smooth, about 1 minute. Add remaining cream cheese and process until smooth. Add eggs, cream and almond extract and blend until just combined.",
        "Pour filling into crust. Bake cake until just set in center and beginning to crack at edges, about 40 minutes. Cool 10 minutes. Maintain oven temperature.",
        "Mix sour cream and 1 tablespoon sugar in small bowl; spoon over hot cake. Bake 3 minutes. Chill cake uncovered until cold, about 1 1/2 hours.",
        "Mix remaining 2 tablespoons plus 1/2 cup sugar and reserved berry juices in heavy small saucepan. Sprinkle 1 1/2 teaspoons gelatin over. Let stand 15 minutes. Stir mixture over low heat until sugar and gelatin dissolve (do not boil). Pour into medium bowl; mix in berries. Refrigerate berry topping until cold and beginning to set, stirring occasionally, about 1 1/2 hours.",
        "Spoon berry topping over chilled cake. Refrigerate until topping is set, at least 3 hours and up to 1 day."
    ],
    "ingredients": [
        "1 7-ounce tube almond paste",
        "6 whole graham crackers (about 3 ounces), broken up",
        "1/2 cup whole almonds (about 2 1/2 ounces), toasted, cooled",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "1/2 cup sugar",
        "2 8-ounce packages cream cheese, cut into 1-inch pieces, room temperature",
        "3 large eggs",
        "1/2 cup whipping cream",
        "1/4 teaspoon almond extract",
        "1 cup sour cream",
        "3 tablespoons plus 1/2 cup sugar",
        "1 pound frozen unsweetened blackberries, thawed, drained, juices reserved",
        "1 1/2 teaspoons unflavored gelatin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Dairy",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Blackberry",
        "Almond",
        "Spring",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Almond Cheesecake with Sour Cream and Blackberries",
    "url": "http://www.epicurious.com/recipes/food/views/almond-cheesecake-with-sour-cream-and-blackberries-100969"
}
