{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Line 2 large rimmed baking sheets with parchment paper. Melt butter in medium saucepan over medium-low heat. Mix in sugar, cream, and flour, then almonds. Stir until batter thickens, bubbles at edges, and leaves dry path when spoon is drawn through, about 10 minutes. Remove from heat. Drop 1 rounded teaspoonful batter for each cookie (about 24 total) onto prepared sheets, spacing mounds 2 to 3 inches apart.",
        "Bake cookies, 1 sheet at a time, until golden brown, turning sheet after 8 minutes, about 16 minutes total. Cool cookies completely on sheets.",
        "Do ahead: Can be made 1 day ahead. Store airtight at room temperature.",
        "Soften ice cream slightly in microwave at 10-second intervals on very low setting. Place 6 cookies, flat side up, on work surface. Mound 1/4 cup ice cream onto each; flatten gently with spatula. Top with another cookie, flat side down, and press very gently to adhere. Place sandwiches on baking sheet, cover with foil, and freeze at least 2 hours and up to 2 days."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter",
        "6 tablespoons sugar",
        "1/4 cup heavy whipping cream",
        "2 tablespoons plus 1 teaspoon all purpose flour",
        "3/4 cup sliced almonds",
        "1 pint black raspberry chip ice cream or other raspberry-flavored ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Frozen Dessert",
        "Raspberry",
        "Almond",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond Florentine and Black Raspberry Chip Ice Cream Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/almond-florentine-and-black-raspberry-chip-ice-cream-sandwiches-235559"
}
