{
    "directions": [
        "Preheat oven to 350°F. Whisk flour, sugar, and salt in a large bowl. Scrape in seeds from vanilla bean; save pod for another use. Add butter and toss to coat. Work in butter with your fingers until mixture resembles coarse meal with some pea-size pieces of butter remaining.",
        "Using a fork, gently mix in egg, then turn out onto a clean surface and gently knead just until dough comes together (do not overwork). Press dough into bottom and up sides of tart pan with your fingers, then flatten with the bottom of a large measuring cup. Cover and chill until very firm, at least 1 hour.",
        "Line dough with parchment or foil, leaving an overhang. Fill with pie weights or dried beans. Bake crust until edges are dry, 20–25 minutes. Remove parchment and weights and bake crust again until dry but not quite browned, 10–15 minutes. Transfer to a wire rack; let cool.",
        "Crust can be baked 1 day ahead. Store tightly wrapped at room temperature.",
        "Combine milk and cream in a medium saucepan, then scrape in vanilla seeds; add pod. Bring to a simmer over medium heat. Remove from heat; discard vanilla pod.",
        "Whisk egg yolks, granulated sugar, all-purpose flour, cornstarch, and salt in a medium bowl until very pale and fluffy, about 3 minutes. Whisking constantly, gradually add hot milk mixture to egg mixture. Transfer back to saucepan and cook over medium heat, whisking constantly, until mixture is thick and holds whisk marks, about 2 minutes.",
        "Press pastry cream through a finemesh sieve into a medium bowl. Cover with plastic wrap, pressing directly onto surface; chill until cold, at least 2 hours.",
        "Pulse almonds in a food processor until very finely chopped. Add powdered sugar and butter and process until smooth. Add egg whites; process just to combine. Fold into chilled pastry cream, then fold in white chocolate.",
        "Filling can be made 2 days ahead. Cover and chill.",
        "Preheat oven to 350°F. Combine almonds, butter, and 1 tablespoon granulated sugar in a small bowl. Scrape filling into cooled crust and top with almonds. Bake tart until filling is puffed and set and edges are golden brown, 45–50 minutes. Transfer to a wire rack; let cool.",
        "Just before serving, make the meringue. Using an electric mixer on medium-high speed, beat egg whites until frothy, about 1 minute. With motor running, gradually add remaining 1/4 cup granulated sugar; beat until stiff peaks form, 5–7 minutes. Mix in 1/2 teaspoon lime zest and lime juice. Serve tart topped with lime meringue, fruit, and more lime zest.",
        "Tart can be baked 2 days ahead. Store tightly wrapped at room temperature."
    ],
    "ingredients": [
        "1 2/3 cups all-purpose flour",
        "3/4 cup powdered sugar",
        "Pinch of kosher salt",
        "1/2 vanilla bean, split lengthwise",
        "6 tablespoons chilled unsalted butter, cut into pieces",
        "1 large egg, beaten to blend",
        "1 cup milk",
        "1/3 cup heavy cream",
        "1/2 vanilla bean, split lengthwise",
        "4 large egg yolks",
        "1/4 cup granulated sugar",
        "2 tablespoons all-purpose flour",
        "2 tablespoons cornstarch",
        "Pinch of kosher salt",
        "1 cup sliced almonds",
        "3/4 cup powdered sugar",
        "6 tablespoons unsalted butter, melted, slightly cooled",
        "3 large egg whites",
        "1/4 cup chopped white chocolate",
        "3/4 cup skin-on almonds, chopped",
        "2 tablespoons unsalted butter, melted, slightly cooled",
        "1 tablespoon plus 1/4 cup granulated sugar",
        "2 large egg whites",
        "1/2 teaspoon finely grated lime zest, plus more for serving",
        "1 tablespoon fresh lime juice",
        "1 pound mixed stone fruit (such as peaches, plums, and cherries), sliced",
        "A 10\" fluted tart pan with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Kid-Friendly",
        "Cherry",
        "Peach",
        "Plum",
        "Almond",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond Tart with Stone Fruit and Lime Meringue",
    "url": "http://www.epicurious.com/recipes/food/views/almond-tart-with-stone-fruit-and-lime-meringue-56389902"
}
