{
    "directions": [
        "Preheat oven to 375°F. Line a baking sheet with parchment paper. Pulse flour, oats, almonds, 1/3 cup sugar, baking powder, and salt in a food processor until finely ground. Add butter; pulse until only pea-size pieces remain. Add 1/2 cup cream and 1 teaspoon vanilla; pulse until large moist clumps form. Transfer to a work surface.",
        "Knead until dough comes together, about 4 turns. Pat into a 4x6\" rectangle. Halve lengthwise, then crosswise into thirds. Arrange on prepared baking sheet. Brush with cream; sprinkle with 1/2 tablespoon sugar.",
        "Bake, rotating sheet halfway through cooking, until golden brown around edges and a tester inserted into center comes out clean, about 20 minutes. Set biscuits on a wire rack; let cool. DO AHEAD: Biscuits can be made 8 hours ahead. Store cooled biscuits airtight at room temperature.",
        "Meanwhile, combine strawberries, 1 tablespoon sugar, and Grand Marnier, if using, in a large bowl. Toss to coat. Let strawberries sit, tossing often, until juices release. Whisk 1/2 cup cream, 1/2 tablespoon sugar, and 1/2 teaspoon vanilla in a small bowl until peaks form.",
        "Cut warm or room-temperature biscuits in half; place bottom halves on plates. Divide whipped cream and strawberries over. Top with remaining biscuit halves."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "1/2 cup old-fashioned oats",
        "1/3 cup slivered almonds",
        "1/3 cup plus 2 tablespoons sugar, divided",
        "2 teaspoons baking powder",
        "1/2 teaspoon kosher salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2\" cubes",
        "1 cup chilled heavy cream, divided, plus more for brushing",
        "1 1/2 teaspoons vanilla extract, divided",
        "4 cups fresh strawberries, hulled, sliced",
        "1 tablespoon Grand Marnier or other orange liqueur (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Berry",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Quick & Easy",
        "Strawberry",
        "Almond",
        "Oat",
        "Spring",
        "Summer",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond-Oat Strawberry Shortcakes",
    "url": "http://www.epicurious.com/recipes/food/views/almond-oat-strawberry-shortcakes-395029"
}
