{
    "directions": [
        "Preheat oven to 275°F and line 2 large baking sheets with parchment paper. Trace three 12- by 4-inch rectangles on parchment (2 on one sheet, at least 2 inches apart, and 1 on the other), then turn over.",
        "Pulse together almonds, 2 tablespoons sugar, and cornstarch in a food processor until finely ground, being careful not to grind to a paste.",
        "Beat whites with standing electric mixer at medium speed until foamy. Beat in cream of tartar and a pinch of salt, then gradually beat in remaining 3/4 cup sugar, vanilla, and almond extract. Increase speed to high and beat until meringue holds stiff, glossy peaks.",
        "Fold ground almonds gently but thoroughly into meringue in 3 batches. Spread evenly onto rectangles on parchment with a small metal spatula, filling them in. (As mixture bakes, meringue will spread slightly outside lines.)",
        "Bake meringue layers in upper and lower thirds of oven, switching position of sheets halfway through baking, until firm and pale golden, 1 hour to 1 hour and 10 minutes total. Slide meringue layers, still on parchment, onto racks, then cool completely and peel off paper.",
        "Place 1 meringue layer on a platter and spread 1 1/2 cups ice cream evenly on top with cleaned spatula. Top with second meringue layer, then with remaining 1 1/2 cups ice cream. Top with third meringue layer, then trim edges of dacquoise with a serrated knife to make even.",
        "Wrap in plastic wrap and foil and freeze at least 3 hours and up to 2 days.",
        "Just before serving, trim and thinly slice strawberries and arrange decoratively over dacquoise."
    ],
    "ingredients": [
        "1 1/4 cups whole blanched almonds (7 oz)",
        "3/4 cup plus 2 tablespoons sugar",
        "1 tablespoon cornstarch",
        "6 large egg whites",
        "1/4 teaspoon cream of tartar",
        "1 teaspoon vanilla",
        "3/4 teaspoon almond extract",
        "3 cupsfresh strawberry ice cream slightly softened",
        "1 lb strawberries (3 cups)",
        "Special equipment: a standing electric mixer and parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Egg",
        "Dessert",
        "Bake",
        "Strawberry",
        "Almond",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond Dacquoise with Strawberry Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/almond-dacquoise-with-strawberry-ice-cream-105130"
}
