{
    "directions": [
        "Preheat an oven to 275°F (135°F). Line a baking sheet with parchment paper.",
        "To make the meringue, in the bowl of a mixer fitted with the whisk attachment, whip the egg whites on medium until soft peaks form. Slowly add in the sugar and cornstarch and continue to beat on high speed until the whites hold stiff, glossy peaks. Add the vinegar, almond extract and salt and whip to combine, about 30 seconds more.",
        "Scoop the meringue onto the prepared baking sheet and shape into a round about 8 inches (20 cm) in diameter. Use the back of a spoon to create an indentation in the center of the meringue. Scatter the almonds around the edges of the round, covering a 1-inch (2.5-cm) border around the circumference of the meringue. Bake until the meringue is dry to the touch, about 1 1/4 hours. Transfer the parchment sheet with the meringue on it to a wire rack. When the meringue is cool to the touch, remove from the parchment and place directly on the rack.",
        "To make the compote, in a saucepan over medium-high heat, combine the rhubarb, sugar, salt and 2 Tbs. water. Bring to vigorous simmer, then reduce the heat to low, cover and cook until the rhubarb is softened, about 5 minutes. If the rhubarb begins to stick to the pan, add up to 2 Tbs. more water. Add the strawberries and cook, uncovered, on medium-low until the strawberries have softened slightly, about 3 minutes. Remove the pan from the heat and let cool to room temperature.",
        "To make the crème anglaise, in a small saucepan over medium heat, combine the cream, milk, sugar, vanilla bean seeds and pod, and salt. Bring to a simmer, whisking occasionally to dissolve the sugar. Once it comes to a simmer and the sugar is dissolved, remove from the heat and let steep for 5 minutes. Remove the vanilla bean pod from the custard and discard or save for another use.",
        "In a bowl, whisk the egg yolks together. Whisking constantly, slowly add the warm cream mixture to the egg yolks in a slow, steady stream. Pour the egg yolk–cream mixture back into the saucepan and place over low heat. Warm, whisking constantly, until the mixture is thickened and lightly coats the back of a spoon, about 5 minutes. Do not allow it to boil. Strain the mixture through a fine-mesh sieve into a bowl set over a larger bowl half full of ice water. Cover with plastic wrap placed directly on the surface of the crème anglaise to prevent a skin from forming until ready to use. The crème anglaise can be refrigerated, covered, for up to 2 days.",
        "To assemble the pavlova, place the meringue on a serving platter. Spoon the crème anglaise into the indentation in the meringue, spreading it evenly with the back of a spoon. Spoon the compote on top of the crème anglaise, spreading it evenly. Serve immediately. Serves 8.",
        "Williams Sonoma Test Kitchen"
    ],
    "ingredients": [
        "4 egg whites",
        "1 cup (8 oz./250 g) sugar",
        "2 tsp. cornstarch",
        "2 tsp. white vinegar",
        "1/2 tsp. almond extract",
        "Pinch of kosher salt",
        "3 Tbs. toasted slivered almonds",
        "1/2 lb. (250 g) rhubarb, trimmed and diced",
        "1/4 cup (2 oz./60 g) sugar",
        "Pinch of kosher salt",
        "1/2 lb. (250 g) strawberries, hulled and quartered",
        "1/2 cup (4 fl. oz./125 ml) heavy cream",
        "1/2 cup (4 fl. oz./125 ml whole milk",
        "1/4 cup (2 oz./60 g) sugar",
        "1 vanilla bean, split lengthwise, seeds scraped out and reserved",
        "Pinch of kosher salt",
        "2 egg yolks"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Almond Pavlova with Strawberry-Rhubarb Compote",
    "url": "http://www.williams-sonoma.com/recipe/almond-pavlova-with-strawberry-rhubarb-compote.html"
}
