{
    "directions": [
        "Preheat oven to 350°F. Butter and flour 9x5x3-inch metal loaf pan. Finely grind almonds with flour, baking soda, and salt in processor. Using electric mixer, beat sugar and butter in large bowl until blended. Beat in eggs, 1 at a time, just to blend. Stir in sour cream, lemon peel, and almond extract. Stir in flour mixture just until blended. Transfer batter to prepared pan; smooth top.",
        "Bake cake until tester inserted into center comes out clean, about 38 minutes. Cool on rack 15 minutes; turn out cake. (Can be made 1 day ahead. Cool completely. Wrap in plastic and store at room temperature. Rewarm unwrapped cake slightly in microwave.)",
        "Whisk all ingredients in small bowl to blend. (Can be made 1 day ahead. Cover and chill.)",
        "Preheat oven to 375°F. Place pineapple in 13x9x2-inch glass baking dish. Whisk brown sugar, 1/3 cup pineapple juice, cloves, and cinnamon in small bowl to blend. Pour juice mixture over pineapple. Roast until pineapple is tender and juices brown, turning and basting pineapple with juices every 20 minutes and adding more pineapple juice by tablespoonfuls as needed to prevent burning, about 1 hour 15 minutes. (Can be made 3 hours ahead. Let stand at room temperature. Rewarm in 375°F oven for 10 minutes before continuing.)",
        "Cut warm pineapple crosswise into 1/3-inch-thick slices. Cut warm cake into 8 pieces. Place 1 slice of cake on each of 8 plates. Spoon pineapple and juices atop cake, top with vanilla cream, and serve."
    ],
    "ingredients": [
        "1/4 cup blanched slivered almonds",
        "3/4 cup plus 2 tablespoons all purpose flour",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 cup sugar",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "2 large eggs",
        "6 tablespoons sour cream",
        "1/2 teaspoon grated lemon peel",
        "1/4 teaspoon almond extract",
        "1 8-ounce container crème fraîche or sour cream",
        "2 tablespoons powdered sugar",
        "1 1/4 teaspoons vanilla extract",
        "1 4 1/2-pound pineapple, peeled, quartered lengthwise, cored",
        "1/3 cup (packed) dark brown sugar",
        "1/3 cup (or more) pineapple juice",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Dessert",
        "Bake",
        "Roast",
        "Mother's Day",
        "Pineapple",
        "Almond",
        "Fall",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond Cake with Roasted Pineapple and Vanilla Cream",
    "url": "http://www.epicurious.com/recipes/food/views/almond-cake-with-roasted-pineapple-and-vanilla-cream-231448"
}
