{
    "directions": [
        "Bring grits and 4 cups water to a boil in a medium pot. Reduce heat to medium-low and gently simmer, whisking occasionally, until liquid is absorbed and grits are tender and creamy, 20–25 minutes. Season with salt and pepper.",
        "Meanwhile, pulse almonds in a food processor until texture of coarse breadcrumbs. Transfer to a shallow baking dish; season with salt and pepper.",
        "Place egg in another shallow baking dish. Season trout with salt and pepper. Working one at a time, dip skin side of fillets into egg, then in almonds, pressing to adhere. Transfer to a plate as you go.",
        "Heat oil in a large skillet over mediumhigh until very hot but not smoking. Cook 2 fillets, almond side down, pressing with a spatula occasionally to ensure contact with skillet, until almonds are well toasted and fish is nearly cooked through, about 3 minutes. Turn and cook until opaque throughout, about 1 minute more. Transfer to a plate. Repeat with remaining fillets.",
        "Wipe out skillet. Add chard and shallot and season with salt and pepper. Cook, tossing, until chard is wilted, about 2 minutes. Serve chard and trout over grits with lemon wedges."
    ],
    "ingredients": [
        "1 cup white grits (not instant)",
        "Kosher salt, freshly ground pepper",
        "1 cup whole skin-on almonds",
        "1 large egg, beaten to blend",
        "4 6-ounce trout fillets",
        "2 tablespoons vegetable oil",
        "1 bunch Swiss chard, thick ribs and stems removed, torn into pieces",
        "1 small shallot, finely chopped",
        "Lemon wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Low Carb",
        "Kid-Friendly",
        "Quick & Easy",
        "Dinner",
        "Almond",
        "Trout",
        "Healthy",
        "Low Cholesterol",
        "Chard",
        "Hominy/Cornmeal/Masa",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Almond-Crusted Trout with White Grits and Swiss Chard",
    "url": "http://www.epicurious.com/recipes/food/views/almond-crusted-trout-with-white-grits-and-swiss-chard-51264220"
}
