{
    "directions": [
        "Whisk wine, sugar and yolks in medium-size stainless steel bowl until well blended. Set bowl over saucepan of simmering water (do not allow bottom to touch water) and whisk until thermometer registers 170°F and mixture is thick enough to fall in heavy ribbon when whisk is lifted, about 5 minutes. Remove from over water; whisk until mixture is cool, about 3 minutes. In another medium bowl, whisk cream until medium-firm peaks form. Fold cream into wine mixture in 2 additions. Cover mousse; freeze until firm, at least 4 hours. (Can be made 4 days ahead; keep frozen.)",
        "Bring wine, water and sugar to boil in heavy medium saucepan over medium heat, stirring until sugar dissolves. Add apples. Simmer until apples are just tender, about 15 minutes. Remove from heat and let stand until mixture is cool, about 45 minutes. Using slotted spoon, transfer apples to plate. Boil syrup until reduced to generous 1/2 cup, about 6 minutes. Return apples to syrup. (Can be made 3 days ahead. Chill. Rewarm over low heat.)",
        "Place 1 Almond Cookie Cup on each of 6 plates. Fill each with scoop of mousse. Top with apples, syrup and nuts."
    ],
    "ingredients": [
        "3/4 cup sweet dessert wine (such as Sauternes or orange Muscat)",
        "1/2 cup sugar",
        "4 large egg yolks",
        "1 cup chilled whipping cream",
        "2 cups sweet dessert wine",
        "1 1/4 cups water",
        "3/4 cup sugar",
        "3 medium Gala apples, peeled, cored, cut into 1/2-inch wedges",
        "6 Almond Cookie Cups",
        "Toasted sliced almonds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Apple",
        "Almond",
        "Fall"
    ],
    "title": "Almond Cookie Cups with Sauternes-Poached Apples and Frozen Sauternes Mousse",
    "url": "http://www.epicurious.com/recipes/food/views/almond-cookie-cups-with-sauternes-poached-apples-and-frozen-sauternes-mousse-15559"
}
