{
    "directions": [
        "Make beurre blanc: In a small saucepan over medium heat, combine wine, vinegar, shallots, thyme and bay leaf. Boil until liquid has evaporated. Stir in cream, and boil until liquid is reduced by half; decrease heat to low. Whisk in butter, 1 piece at a time, adding each new piece before previous one has melted completely. Do not allow sauce to simmer, or it may separate.",
        "Strain sauce through a fine sieve into a heatproof bowl. Stir in chives, lemon juice, salt and pepper. Keep warm by setting bowl in a larger container of hot water.",
        "Preheat oven on broiler setting. Pat fillets dry, and season with salt and pepper.",
        "Heat oil and 1 tablespoon butter in a large skillet over medium-high heat. Saute halibut fillets for 2 to 3 minutes on each side, or until lightly browned, and just cooked through. Transfer to a baking sheet, and cool 5 minutes. In a small bowl, stir together bread crumbs, almonds and 1 tablespoon melted butter. Brush tops of fillets with egg, and spread with almond mixture.",
        "Broil fillets 1 to 2 minutes, or until browned (watch closely - every broiler has its own personality!). Place fillets on individual plates, and spoon beurre blanc around it."
    ],
    "ingredients": [
        "1/3 cup dry white wine",
        "2 tablespoons cider vinegar",
        "2 tablespoons minced shallots",
        "1 sprig fresh thyme",
        "1 bay leaf",
        "1/3 cup heavy cream",
        "10 tablespoons unsalted butter - chilled, cut into tablespoon-size pieces",
        "3 tablespoons chopped fresh chives",
        "2 teaspoons fresh lemon juice",
        "salt and pepper to taste",
        "6 (6 ounce) fillets halibut",
        "2 tablespoons vegetable oil",
        "1 tablespoon unsalted butter",
        "1/4 cup fresh bread crumbs",
        "2/3 cup minced blanched almonds",
        "1 tablespoon unsalted butter, melted",
        "1 egg, lightly beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Almond-Crusted Halibut Crystal Symphony",
    "url": "http://allrecipes.com/recipe/15409/almond-crusted-halibut-crystal-sympho/"
}
