{
    "directions": [
        "Position rack just above center of oven and preheat to 375°F. Line rimmed baking sheet with parchment. Whisk egg white and 3 tablespoons sugar in small bowl to blend. Mix in almonds.",
        "Blend 1/2 cup sugar and almond paste in processor until fine meal forms. Add flour, baking powder, lemon peel, salt, and ginger; blend 5 seconds. Add butter and cut in, using on/off turns, until coarse meal forms; transfer to large bowl. Whisk egg yolk, buttermilk, and vanilla in small bowl. Gradually add buttermilk mixture to dry ingredients, tossing until moist clumps form. Using floured hands, gather dough together.",
        "Divide dough into 8 equal pieces; roll each into 2-inch ball. Place balls on prepared baking sheet, spacing 2 to 3 inches apart. Gently press top of each ball to flatten slightly. Divide almond topping (including egg white) among biscuits; spread to cover. Bake biscuits until golden brown and tester inserted into center comes out clean, about 26 minutes (biscuits will spread). Cool on sheet 5 minutes. Transfer to rack and cool. (Can be made 8 hours ahead. Cover; store at room temperature.)",
        "Combine berries, lemon juice, and remaining 2 tablespoons sugar in medium bowl. Stir in preserves. Let stand until juices form, at least 1 hour and up to 2 hours, stirring occasionally.",
        "Cut biscuits horizontally in half. Place bottoms on plates. Top with berry mixture, cream, and biscuit tops.",
        "*Available in specialty foods stores and in the baking products section of most supermarkets."
    ],
    "ingredients": [
        "1 large egg, separated",
        "5 tablespoons plus 1/2 cup sugar, divided",
        "1/2 cup sliced almonds",
        "1/2 7-ounce log almond paste,* cut into 1/2-inch cubes",
        "2 cups all purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon grated lemon peel",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground ginger",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "2/3 cup chilled buttermilk",
        "1 teaspoon vanilla extract",
        "2 cups halved hulled strawberries",
        "1 1/2-pint container blackberries",
        "1 1/2-pint container blueberries",
        "1 1/2-pint container raspberries",
        "1 teaspoon fresh lemon juice",
        "3/4 cup red currant preserves",
        "Lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dessert",
        "Bake",
        "Almond",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond and Mixed-Berry Shortcakes",
    "url": "http://www.epicurious.com/recipes/food/views/almond-and-mixed-berry-shortcakes-109767"
}
