{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Spray 9-inch-diameter cake pan with 2-inch-high sides with nonstick spray. Line bottom of pan with parchment paper round.",
        "Finely grind almonds in processor. Transfer to medium bowl; whisk in flour, baking powder, and salt. Using electric mixer, beat butter in large bowl until fluffy. Add 1 cup sugar; beat until well blended. Add eggs 1 at a time, beating well after each addition. Beat in vanilla and almond extract, then flour mixture just until incorporated.",
        "Transfer batter to prepared pan; spread evenly and smooth top with spatula. Gently press plum slices, flesh side down, into batter in spoke pattern around outer rim and center of cake, placing close together. Mix cinnamon and 4 teaspoons sugar in small bowl. Sprinkle over plums.",
        "Bake cake until tester inserted into center comes out clean, about 50 minutes. Cool cake in pan on rack 20 minutes. Run small knife between cake and pan sides to loosen. Invert cake onto platter; remove parchment paper. Place another platter atop cake. Using both hands, hold both platters firmly together and invert cake, plum side up. Cool cake completely. Cut into wedges."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1/2 cup whole almonds (about 2 1/2 ounces)",
        "1 1/2 cups all purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon fine sea salt",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 cup plus 4 teaspoons sugar",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon almond extract",
        "1 1/4 pounds plums (about 8 medium), halved, pitted, cut into 1/2-inch-thick slices",
        "3/4 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mixer",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Plum",
        "Almond",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond-Plum Buckle",
    "url": "http://www.epicurious.com/recipes/food/views/almond-plum-buckle-235359"
}
