{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F. Generously butter a 9- by 2 inch round cake pan and dust with flour, knocking out excess.",
        "Pulse almonds with 1/3 cup sugar in a food processor until finely ground. Transfer almond sugar to a large bowl and add yolks, flour (1/2 cup), milk, vanilla, and salt, whisking until combined (batter will be thick).",
        "Beat whites with a pinch of salt in a bowl using an electric mixer at medium-high speed until they just hold soft peaks. Add remaining 1/3 cup sugar, a little at a time, beating at medium speed, then beat at high speed until whites hold stiff, glossy peaks.",
        "Fold about one third of whites into batter to lighten, then fold in remaining whites gently but thoroughly.",
        "Pour batter into cake pan and bake until cake is springy to the touch and a wooden pick or skewer inserted in center comes out clean, 18 to 20 minutes. Cool cake in pan on a rack 5 minutes, then invert onto rack and cool 10 minutes.",
        "Bring water and sugar to a boil in a 1-quart heavy saucepan, stirring until sugar is dissolved. Cool syrup 20 minutes, then stir in lemon juice and almond extract. Gently stir in berries.",
        "Arrange cake, right side up, on a plate and spoon berries over top, then slowly pour fruit syrup evenly over cake. Dust with confectioners sugar if desired."
    ],
    "ingredients": [
        "Butter for greasing pan",
        "1/2 cup all-purpose flour plus additional for dusting pan",
        "1 cup sliced almonds (preferably with skins; 3 1/2 oz)",
        "2/3 cup sugar",
        "4 large egg yolks",
        "3 tablespoons whole milk",
        "3/4 teaspoon vanilla",
        "1/4 teaspoon salt",
        "2 large egg whites",
        "1/3 cup water",
        "1/4 cup sugar",
        "1 tablespoon fresh lemon juice",
        "1/8 teaspoon almond extract",
        "2 cups blackberries (9 oz)",
        "1 cup raspberries (4 1/2 oz)",
        "Garnish: confectioners sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Blackberry",
        "Raspberry",
        "Almond",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond Cake with Berries",
    "url": "http://www.epicurious.com/recipes/food/views/almond-cake-with-berries-109468"
}
