{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).  Grease and flour a 10 inch Bundt pan.",
        "In a large bowl, cream butter and sugar together until well mixed with an electric mixer.  Add eggs, one at a time, and beat until mixture is light and fluffy.  Blend in flour and salt.  Mix in almond extract.  Turn batter into prepared pan.",
        "Bake for 60 minutes, or until a toothpick when inserted in the center of the cake comes out clean.  Cool in pan for 10 minutes.  Remove from pan, and transfer to a wire rack to continue cooling.",
        "Break off tablespoon-sized pieces of the almond paste, and shape into holly leaves.  Using the tip of a knife, score the shaped holly leaf to resemble veins in the leaves.  Mix green food coloring with a small amount of water and brush the holly leaves, repeating until desired color is reached.  Set aside on waxed paper.  Break off 2 tablespoons of almond paste, and knead in several drops of red food coloring.  When color of almond paste is a bright red, break off smaller pieces.  Roll into balls to resemble holly berries.  Place on waxed paper.",
        "In a small bowl, combine 1 cup confectioners' sugar and milk.  Mix until smooth.  When the cake has cooled, drizzle with the confectioners' sugar glaze.  Top with blanched almonds, and garnish with the marzipan holly leaves and berries."
    ],
    "ingredients": [
        "1 cup butter, softened",
        "2 cups white sugar",
        "6 eggs, room temperature",
        "1 3/4 cups all-purpose flour",
        "1/2 teaspoon salt",
        "2 teaspoons almond extract",
        "8 ounces almond paste",
        "1 cup confectioners' sugar",
        "4 tablespoons milk",
        "1/2 cup blanched almonds",
        "4 drops red food coloring",
        "4 drops green food coloring"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Almond Pound Cake",
    "url": "http://allrecipes.com/recipe/8019/almond-pound-cake/"
}
