{
    "directions": [
        "Preheat oven to 325°F. Butter pan generously and dust with flour, knocking out excess.",
        "Break almond paste into pieces and pulse in a food processor until finely ground. Sift together flour, baking powder, and salt into a bowl. Beat together butter and sugar with an electric mixer at high speed until pale and very fluffy, about 3 minutes. Add almond paste and vanilla and beat until combined well, about 2 minutes. Add eggs 1 at a time, beating well after each addition and occasionally scraping down side of bowl. Add flour mixture and mix at low speed 30 seconds. Finish mixing batter by hand with a rubber spatula, scraping bottom of bowl.",
        "Pour batter into tube pan, smoothing top. Bake in middle of oven, rotating pan halfway through baking, until a tester comes out clean and edges begin to pull away from pan, 55 minutes to 1 hour total.",
        "Cool cake completely in pan on a rack. (Cake may shrink and buckle slightly, but don't worry. This won't be visible once cake is inverted.) Run a thin knife around outside and inside edges and invert a plate over pan, then invert cake onto plate.",
        "Just before serving, beat together cream and kirsch in a chilled bowl with cleaned beaters until soft peaks form.",
        "Serve cake with kirsch cream and lingonberry preserves."
    ],
    "ingredients": [
        "7 oz almond paste (not marzipan)",
        "1 cup all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "2 sticks (1 cup) unsalted butter, softened",
        "1 1/2 cups sugar",
        "1 teaspoon vanilla",
        "8 large eggs at room temperature",
        "1 1/2 cups chilled heavy cream",
        "2 tablespoons kirsch",
        "1 cup lingonberry preserves",
        "Special equipment: an 11- by 2 1/2-inch (12-cup) springform tube pan with a decorative bottom, or a 9- by 4-inch (14-cup) tube pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Nut",
        "Dessert",
        "Bake",
        "Almond",
        "Winter",
        "Lingonberry",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond Cake with Kirsch Cream and Lingonberry Preserves",
    "url": "http://www.epicurious.com/recipes/food/views/almond-cake-with-kirsch-cream-and-lingonberry-preserves-105922"
}
