{
    "directions": [
        "Preheat oven to 350°F.",
        "Whisk together flour, sugar, baking powder, and salt in a bowl. Blend in butter with a pastry blender or your fingertips until mixture resembles coarse meal. Add whole egg, milk, and extracts, stirring with a fork until a soft dough forms, then knead in almonds.",
        "Divide dough between 2 sheets of wax paper, then form into 2 equal mounds and flatten each mound into a 5-inch disk. Put half of apricots in center of 1 disk and fold dough over apricots to enclose them (use wax paper as an aid if necessary), then transfer to a parchment-lined baking sheet. Form into a 14- by 2 1/2-inch log lengthwise on 1 side of baking sheet, spreading dough with wet hands. Make another log with remaining dough and apricots, arranging it about 4 inches from first log.",
        "Brush logs with egg wash and bake in middle of oven until pale golden and firm, about 20 minutes. Cool on baking sheet on a rack 20 minutes.",
        "Reduce oven temperature to 300°F while logs cool.",
        "Carefully transfer baked logs to a cutting board using 2 wide metal spatulas, then cut logs diagonally into 1/2-inch-wide slices with a large heavy knife.",
        "Line baking sheet with a clean sheet of parchment. Stand slices, curved sides up, 1/2 inch apart on baking sheet and bake in upper third of oven until biscotti are dry, about 30 minutes (they will become hard as they cool). Transfer biscotti to rack to cool."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "3/4 cup sugar",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 stick (1/4 cup) cold unsalted butter, cut into small pieces",
        "1 whole large egg, lightly beaten",
        "1/3 cup whole milk",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon almond extract",
        "1 cup whole almonds with skins (5 1/2 oz), toasted and cooled",
        "1 cup dried apricots (6 oz), quartered",
        "1 large egg yolk beaten with 1 tablespoon water for egg wash",
        "Special equipment: parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Fruit",
        "Nut",
        "Breakfast",
        "Dessert",
        "Bake",
        "Apricot",
        "Almond",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond Apricot Biscotti",
    "url": "http://www.epicurious.com/recipes/food/views/almond-apricot-biscotti-107441"
}
