{
    "directions": [
        "Stir sugar and 1/4 cup water in heavy small saucepan over medium heat until sugar dissolves. Increase heat to high and boil until syrup turns light golden, occasionally swirling pan and brushing down sides with wet pastry brush, about 7 minutes (time will vary according to size of pan). Add 2 packages raspberries and hibiscus flowers (mixture will harden slightly). Bring mixture to boil, stirring constantly to dissolve any caramel bits. Reduce heat to medium and simmer 3 minutes, stirring constantly. Remove from heat and let stand 15 minutes for flavors to blend. Strain raspberry sauce, pressing on solids to remove seeds. Stir in vinegar.",
        "DO AHEAD Can be made 2 days ahead. Cover and refrigerate.",
        "Roll puff pastry sheet out on lightly floured surface to 17x11-inch rectangle. Transfer to parchment lined baking sheet. Pierce dough all over with fork. Freeze 1 hour.",
        "Meanwhile, preheat oven to 400°F. Whisk sugar, flour, and egg white until blended and smooth, adding water by 1/4 teaspoonfuls to make thick but still spreadable glaze.",
        "Using small offset spatula, spread glaze thinly over frozen pastry. Sprinkle almonds evenly over glaze. Bake until glaze is dark golden and almonds are toasted, about 35 minutes. Cool. Trim pastry to form 16x10-inch rectangle. Cut crosswise into 4 equal strips. Cut each strip crosswise into 4 equal pieces to form sixteen 4x21/2-inch rectangles.",
        "DO AHEAD Can be made 4 hours ahead. Let stand at room temperature.",
        "Place red raspberries, golden raspberries, boysenberries and blueberries in large bowl. Add raspberry sauce; gently fold to coat.",
        "Whip cream in large bowl until peaks form. Place 1 pastry rectangle on each of 8 plates. Spoon 1/4 cup whipped cream over each pastry rectangle. Spoon about 3 tablespoons berry mixture over cream. Top with remaining pastry rectangles. Spread each with 1/4 cup cream, spoon remaining berry mixture over, and serve immediately.",
        "*Also called Jamaica flowers, they can be found at Latin markets or at melissas.com."
    ],
    "ingredients": [
        "3/4 cup sugar",
        "1/4 cup water",
        "2 6-ounce packages red raspberries",
        "6 dried hibiscus flowers*",
        "1 teaspoon Sherry wine vinegar",
        "1/2 17.3-ounce package frozen puff pastry (1 sheet), thawed",
        "1 1/2 cups powdered sugar",
        "3 tablespoons all purpose flour",
        "1 large egg white",
        "Water",
        "1 cup slivered almonds",
        "1 6-ounce package red raspberries",
        "1 6-ounce package golden raspberries",
        "1 5.6-ounce package boysenberries",
        "2 4.4-ounce packages blueberries",
        "2 cups chilled whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Blueberry",
        "Raspberry",
        "Almond",
        "Summer",
        "Phyllo/Puff Pastry Dough",
        "Pastry",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond Glazed Pastries with Whipped Cream and Berries",
    "url": "http://www.epicurious.com/recipes/food/views/almond-glazed-pastries-with-whipped-cream-and-berries-234958"
}
