{
    "directions": [
        "Combine sugar, 1 cup water, and orange peel strips in medium saucepan. Stir over medium heat until sugar dissolves and syrup comes to boil. Reduce heat to medium-low and simmer 1 minute. DO AHEAD: Can be made 2 days ahead. Cover and chill syrup with peel strips.",
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 325°F. Draw two 12 x 4-inch rectangles, spacing 2 inches apart, on each of 2 sheets of parchment paper (4 rectangles total). Turn over each parchment sheet onto large rimmed baking sheet (rectangles will show through). Spray parchment with nonstick spray.",
        "Place slivered almonds, 1 cup sugar, and coarse salt in processor. Scrape in seeds from vanilla bean halves. Blend until nuts are finely ground. Using electric mixer, beat egg whites in large bowl until soft peaks form. Add remaining 3 tablespoons sugar, 1 tablespoon at a time, and beat until stiff but not dry. Fold nut mixture into egg whites. Spread 1/4 of macaroon batter evenly within each rectangle, filling completely.",
        "Bake macaroon layers until golden and almost firm to touch in center, reversing sheets after 20 minutes, 35 to 40 minutes total. Cool on sheets.",
        "Place 10 tablespoons orange syrup in large saucepan and bring to simmer over medium-low heat (reserve remaining syrup). Add chocolate to saucepan and stir until chocolate is melted and smooth. Remove from heat. Cool until frosting begins to thicken, stirring often, 20 to 30 minutes.",
        "Place 1 macaroon layer on long platter. Spread 1/2 cup frosting evenly over. Top with another macaroon layer. Spread 1/2 cup frosting evenly over. Repeat 1 more time. Top with last macaroon layer, flat side up. Spread remaining frosting over top and sides of torte. Press sliced almonds onto sides of torte. DO AHEAD: Can be made 1 day ahead. Cover with foil tent; store at room temperature. Cover remaining syrup; chill.",
        "Thinly slice whole oranges crosswise into rounds. Cut slices into quarters and place in remaining reserved syrup for compote. Slice torte; place on plates. Spoon orange compote alongside."
    ],
    "ingredients": [
        "1 cup sugar",
        "1 cup water",
        "Peel of 1 large orange, removed in strips with vegetable peeler",
        "Nonstick vegetable oil spray",
        "2 1/2 cups slivered almonds",
        "1 cup plus 3 tablespoons sugar",
        "2 large pinches of coarse kosher salt",
        "2 vanilla beans, split lengthwise",
        "6 large egg whites",
        "20 ounces bittersweet chocolate (do not exceed 61% cacao), chopped",
        "1 cup sliced almonds, toasted",
        "2 large oranges, all peel and white pith cut off"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Passover",
        "High Fiber",
        "Orange",
        "Almond",
        "Low Cholesterol",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond-Macaroon Torte with Chocolate Frosting and Orange Compote",
    "url": "http://www.epicurious.com/recipes/food/views/almond-macaroon-torte-with-chocolate-frosting-and-orange-compote-358237"
}
