{
    "directions": [
        "Position racks in top third and bottom third of oven and preheat to 300°F. Using 9-inch tart pan bottom as guide, trace a circle on each of 2 sheets of parchment paper. Place papers, marked side down, on baking sheets.",
        "Blend 1/4 cup sugar, whole almonds and cornstarch in processor until nuts are finely ground. {Step One} Using electric mixer, beat egg whites and salt in large bowl until soft peaks form. Add remaining 3/4 cup sugar by tablespoonfuls, beating until meringue is stiff and glossy. Fold almond mixture into meringue.",
        "{Step Two} Spoon meringue into large pastry bag fitted with 1/2-inch-diameter plain tip. {Step Three} Starting in center of 1 circle marked on parchment and holding tip just above paper, pipe meringue in continuous spiral to fill circle completely. Repeat with remaining circle and meringue, forming 2 rounds.",
        "Bake meringues until pale golden and just firm to touch, about 30 minutes, switching position of pans after 20 minutes. Cool on pans on racks.",
        "Combine sugar, egg whites and salt in large stainless steel bowl. Set bowl over saucepan of barely simmering water (do not allow bottom of bowl to touch water); whisk constantly until thermometer registers 135°F, about 5 minutes; remove from over water. Using electric mixer, beat until firm peaks form and mixture is completely cool, about 6 minutes. Beat in butter, 1 piece at a time. Gradually beat in lemon juice. (If buttercream appears curdled, place bowl over low heat for several seconds. Remove from heat; beat until smooth. Repeat warming and beating as necessary.) Whisk cream to firm peaks; whisk into buttercream.",
        "Peel parchment off meringues. Using 9-inch tart pan bottom as guide, trim meringues. Place dabs of buttercream on tart pan bottom; top with 1 meringue. Spread 3/4 cup buttercream over meringue; top with strawberry slices. Spread 3/4 cup buttercream over berry slices. Top with second meringue. Spread remaining buttercream over top and sides of torte. Press sliced almonds into buttercream. (Can be prepared 1 day ahead. Cover and refrigerate. Let stand at room temperature 30 minutes before continuing.)",
        "Cut reserved whole strawberries into quarters. Arrange atop torte."
    ],
    "ingredients": [
        "1 cup sugar",
        "2/3 cup whole almonds",
        "4 teaspoons cornstarch",
        "1/2 cup egg whites (about 4 large)",
        "Pinch of salt",
        "3/4 cup sugar",
        "1/2 cup egg whites (about 4 large)",
        "Pinch of salt",
        "1 cup (2 sticks) unsalted butter, cut into 16 pieces, room temperature",
        "1/3 cup fresh lemon juice",
        "1/3 cup chilled whipping cream",
        "1 16-ounce basket strawberries, 4 berries reserved, remainder hulled and thickly sliced",
        "1 1/4 cups sliced almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Strawberry",
        "Lemon",
        "Almond",
        "Spring"
    ],
    "title": "Almond Meringue Torte with Lemon and Strawberry Filling",
    "url": "http://www.epicurious.com/recipes/food/views/almond-meringue-torte-with-lemon-and-strawberry-filling-5115"
}
