{
    "directions": [
        "Place garlic and ginger in a blender or food processor; puree until smooth.",
        "Heat vegetable oil in a large saucepan over medium heat; cook and stir bay leaves, cinnamon stick, coriander seeds, peppercorns, cardamom pods, and cloves in hot oil until spices change color and become fragrant, 1 to 2  minutes. Add onion and 1/2 teaspoon salt; cook and stir until onion has softened, about 5 minutes.",
        "Stir garlic-ginger puree and green chile pepper into onion mixture; cook and stir until chile pepper is tender, 1 to 2 minutes more. Stir in tomatoes. If mixture becomes too thick, add water. Season with chili powder and cumin. Remove tomato mixture from heat and allow to cool for a few minutes.",
        "Transfer mixture to the blender or food processor; puree until smooth. Pour sauce into a saucepan and add butter and fenugreek.",
        "Bring sauce to a simmer over medium heat and stir in potatoes. Simmer until potatoes are nearly tender, 10 to 15 minutes; add paneer and frozen peas. Continue to simmer until potatoes and peas are tender, about 5 minutes more. Stir in honey and remaining 1 teaspoon salt."
    ],
    "ingredients": [
        "4 cloves garlic",
        "1 (1 inch) piece fresh ginger",
        "2 tablespoons vegetable oil",
        "2 bay leaves",
        "1 (1 inch) piece cinnamon stick",
        "1 teaspoon coriander seeds",
        "6 whole black peppercorns",
        "4 pods green cardamom",
        "4 whole cloves",
        "1 large onion, minced",
        "1 1/2 teaspoons salt, divided",
        "1 green chile pepper, cut into matchsticks",
        "2 tomatoes, diced",
        "1/2 cup water, if needed (optional)",
        "2 teaspoons chili powder",
        "1 teaspoon ground cumin",
        "2 tablespoons butter",
        "1 teaspoon ground fenugreek (menthi powder)",
        "1 russet potato, cut into 1/2-inch cubes",
        "1/2 pound paneer, cut into 1/2-inch cubes",
        "1/2 cup frozen peas",
        "2 teaspoons honey"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Aloo Matar Paneer (Simmered Potatoes with Peas and Paneer)",
    "url": "http://allrecipes.com/recipe/232201/aloo-matar-paneer-simmered-potatoes/"
}
