{
    "directions": [
        "Blend flour, sugar, and salt in processor. Add butter and cut in using on/off turns until mixture resembles coarse meal. Add 6 tablespoons water and process using on/off turns until mixture forms moist clumps, adding more water by teaspoonfuls if dry. Gather dough into ball. Shape into log. Wrap in plastic and chill 1 hour.",
        "Preheat oven to 400°F. Cut dough crosswise into 12 equal slices. Roll out each slice on lightly floured surface to 6-inch round. Transfer each round to 4-inch-diameter tartlet pan with removable bottom. Press dough onto bottom and up sides of pan. Trim off excess dough. Pierce bottom with fork. Refrigerate 10 minutes. (Can be made 1 day ahead. Cover and chill.)",
        "Sauté bacon in large pot over medium heat until brown, about 9 minutes. Discard all but 3 tablespoons drippings from bacon. Add onions to bacon and sauté until tender, about 8 minutes. Cool.",
        "Melt butter in heavy medium saucepan over medium heat. Add flour and stir 2 minutes (do not brown). Gradually whisk in milk. Increase heat to medium-high and boil 1 minute, whisking constantly. Remove from heat. Whisk yolks in medium bowl to blend. Gradually whisk in hot sauce. Mix in onion mixture, salt, pepper and nutmeg. (Filling can be made 1 day ahead. Cool slightly, then cover and chill.)",
        "Preheat oven to 400°F. Place tartlets on baking sheet and bake until golden brown, pressing bottom and sides with back of fork if crust bubbles, about 18 minutes. Cool slightly. Reduce oven temperature to 350°F. Spoon filling (about 1/4 cup) into each tartlet. Bake until tops begin to brown, about 20 minutes. Transfer tartlets to racks and cool slightly. Remove from pans. Sprinkle with parsley and serve."
    ],
    "ingredients": [
        "2 1/2 cups all purpose flour",
        "2 tablespoons sugar",
        "1 teaspoon salt",
        "1 cup (2 sticks) chilled unsalted butter, cut into 1/2-inch pieces",
        "6 tablespoons (or more) ice water",
        "8 ounces bacon, cut crosswise into 1/4-inch strips",
        "1 1/2 pounds onions, chopped",
        "3 tablespoons unsalted butter",
        "3 tablespoons plus 2 teaspoons all purpose flour",
        "1 1/2 cups whole milk",
        "3 large egg yolks",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/8 teaspoon ground nutmeg",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Onion",
        "Appetizer",
        "Side",
        "Bake",
        "Sauté",
        "Bacon",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Alsatian Onion and Bacon Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/alsatian-onion-and-bacon-tartlets-105527"
}
