{
    "directions": [
        "Heat butter in a small skillet, preferably nonstick, over medium-low until it begins to foam. Add brioche and cook, turning occasionally, until golden brown on all sides, about 3 minutes total. Transfer to paper towels and let drain.",
        "Wipe out skillet and sprinkle with sugar and salt; set over medium heat. Cook (undisturbed) until edges of sugar begin to melt, about 1 minute. Stir sugar, bringing edges in toward the center to prevent burned spots, and continue cooking until all sugar is melted and turns amber color, about 4 minutes. Add brioche and quickly turn to coat all sides in caramel, about 30 seconds. Transfer to a parchment-lined rimmed baking sheet and let cool.",
        "Combine milk and cream in a 2-cup measuring glass. Pour 1/4 cup milk mixture into a small saucepan and add bittersweet chocolate and milk chocolate. Heat over medium-low, stirring occasionally, until chocolate is melted, about 2 minutes. Reserve remaining milk mixture.",
        "Meanwhile, whisk cornstarch and 2 Tbsp. cocoa powder in a small bowl. Whisk in 1/4 cup reserved milk mixture, then whisk in remaining milk mixture.",
        "When chocolate is melted, add cocoa mixture, espresso, sugar, and salt and cook, stirring often, until liquid begins to boil and thicken, about 4 minutes. Remove from heat and add amaro.",
        "Divide mocha among mugs. Top with whipped cream and dust with cocoa powder. Serve with caramelized brioche."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "1 slice brioche or Pullman bread, cut crosswise into 3/4-inch square strips",
        "1/4 cup raw sugar",
        "1 pinch kosher salt",
        "1 cup whole milk",
        "2 tablespoons heavy cream",
        "1 1/2 ounces bittersweet chocolate (at least 70% cacao), finely chopped",
        "1 1/2 ounces milk chocolate, finely chopped",
        "1 tablespoon cornstarch",
        "2 tablespoons unsweetened cocoa powder, plus more for serving",
        "1 single shot espresso (about 1 ounce)",
        "1 tablespoon sugar",
        "1 pinch kosher salt",
        "1 1/2 ounces amaro (preferably Nonino)",
        "Whipped cream (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bitters",
        "Chocolate",
        "Milk/Cream",
        "Coffee",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Amaro-Spiked Mocha With Caramelized Brioche",
    "url": "http://www.epicurious.com/recipes/food/views/amaro-spiked-mocha-with-caramelized-brioche"
}
