{
    "directions": [
        "Heat oven to 325°F with rack in middle. Grease pan with some oil, then line bottom with a round of parchment.",
        "Toast almonds in a rimmed baking sheet until fragrantly toasty and a shade darker, 10 to 12 minutes. Cool completely.",
        "Combine toasted almonds, matzoh meal, potato starch, 1/4 cup sugar, and salt in a food processor. Pulse until almonds are very finely ground.",
        "Whisk together egg yolks, olive oil, Amaretto, and half of almond mixture in a large bowl until combined (mixture will be slightly grainy from almonds).",
        "Beat whites with a pinch of salt in another bowl with an electric mixer at medium speed until they just hold soft peaks. Increase speed to medium high and add 1/2 cup sugar in a slow steady stream, beating, and continue to beat meringue until it holds stiff glossy peaks.",
        "Fold one third of meringue into yolk mixture to lighten, then fold in remaining meringue gently but thoroughly.",
        "Sprinkle remaining almond mixture evenly over the batter and fold in gently but thoroughly. Pour batter into prepared pan, and smooth the top. Sprinkle the top evenly with remaining 2 tablespoons sugar.",
        "Bake until cake is golden, the top has formed a crust, and a tester comes out clean, 40 to 45 minutes. Transfer pan to a wire rack and run a sharp knife along edge of pan. Cool cake in pan 30 minutes.",
        "If using a springform pan, remove sides of springform. Then, whether you are using the springform or a round cake pan, invert cake onto the rack. Remove bottom (if using springform) and parchment. Set another cooling rack over bottom of cake, then reinvert cake onto second rack, and cool completely.",
        "Serve cake in wedges with berries on the side."
    ],
    "ingredients": [
        "1 cup (4 1/2 ounces) blanched slivered almonds",
        "1/4 cup matzoh cake meal (see Cooks' notes)",
        "1/4 cup potato starch (see Cooks' notes)",
        "3/4 cup plus 2 tablespoons sugar, divided",
        "1/4 teaspoon salt plus more for beating whites",
        "5 large egg yolks",
        "1/2 cup extra-virgin olive oil plus more for pan",
        "3 tablespoons Amaretto liqueur",
        "4 large egg whites at room temperature",
        "Fresh raspberries for serving",
        "Special equipment: A 9-inch round cake pan (2 inches deep) or 9-inch springform pan; parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Passover",
        "Raspberry",
        "Tree Nut",
        "Almond",
        "Spirit",
        "Amaretto",
        "Kosher for Passover",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Amaretto Olive Oil Cake",
    "url": "http://www.epicurious.com/recipes/food/views/amaretto-olive-oil-cake-395395"
}
