{
    "directions": [
        "1 Place the 4 ounces of walnuts and 2 tablespoons of the sugar in the bowl of a food processor fitted with the metal blade. Process until the mixture looks sandy and the nuts are finely ground, about 15 seconds.",
        "2 Whisk together the white whole wheat flour, amaranth flour, and salt in a medium bowl. In a large bowl, beat the butter with an electric mixer at medium speed until smooth, about 30 seconds. Gradually add the remaining sugar and beat until fluffy and smooth, 1 to 2 minutes, scraping the sides with a rubber spatula as needed. Add the egg yolk, brandy, and vanilla and beat until well blended, about 30 seconds. Reduce the speed to low and beat in the nut mixture, then gradually add the flour mixture until it is just incorporated. Cover the bowl with plastic wrap and chill until the dough is firm, at least 3 hours or overnight.",
        "3 Place a rack 1 notch below the center of the oven and preheat to 350°F. Line 2 large rimless baking sheets with parchment paper. Place the amaranth seeds in a small bowl.",
        "4 Pinch off walnut-size pieces of the firm dough and roll them between your palms into smooth 1-inch balls. Roll each ball in amaranth seeds, gently pressing to adhere if needed, and place on the baking sheet, leaving 2 inches between pieces. Make an indentation with your thumb in the center of each ball, gently pressing it down about a third of its height, and then lightly press a walnut half into the center.",
        "5 Bake, 1 sheet at a time, until the cookies just turn golden brown around the edges and firm up but still yield to gentle pressure, 17 to 18 minutes. Remove from the oven and carefully slide the parchment paper with the cookies onto a wire rack to cool. The cookies will crisp as they cool."
    ],
    "ingredients": [
        "4 ounces toasted walnut pieces (about 1 slightly heaped cup)",
        "1/2 cup sugar",
        "3/4 cup white whole wheat flour (3 1/8 ounces)",
        "1/4 cup amaranth flour (1 ounce)",
        "1/4 teaspoon fine sea salt",
        "7 tablespoons unsalted butter (3 1/2 ounces), softened",
        "1 large egg yolk, at room temperature",
        "1 tablespoon brandy",
        "1 teaspoon vanilla extract",
        "About 6 tablespoons amaranth seeds, for rolling (optional)",
        "About 32 toasted walnut halves or pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Food Processor",
        "Dessert",
        "Bake",
        "Christmas",
        "Cocktail Party",
        "Easter",
        "Hanukkah",
        "Thanksgiving",
        "Mother's Day",
        "Walnut",
        "Brandy",
        "Family Reunion",
        "Poker/Game Night",
        "Shower",
        "Potluck",
        "Whole Wheat",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Amaranth-Walnut Cookies with Brandy",
    "url": "http://www.epicurious.com/recipes/food/views/amaranth-walnut-cookies-with-brandy-366652"
}
