{
    "directions": [
        "1. Preheat the oven to 350°F.",
        "2. In a large skillet, melt the butter. Pour off half of it and set aside. Add the leeks and garlic to the pan and cook over medium heat for 2 minutes. Add the amaranth, red pepper flakes, 2 generous pinches of salt, and 1/4 cup water. Cook over low heat for 3 minutes, or until the liquid has evaporated. Remove from the heat and transfer to a medium bowl. Add the feta and eggs and mix to combine.",
        "3. Lay one of the sheets of phyllo dough on a smooth work surface. Cut the sheet in half so it becomes an 8 × 12-inch rectangle. Lightly brush the top surface of the rectangle with the reserved melted butter, then fold it in half so it becomes a double-layered 4 × 12-inch sheet with the buttered parts on the inside. Divide the amaranth into 8 equal portions (about 3 tablespoons each). Place one portion on the bottom left corner of the phyllo, 1 inch from the end. Fold the corner up over the filling into a triangle shape. Press down to seal. Continue to fold up the sheet as you would fold a flag. Press the end to seal. Brush the top of the triangle with melted butter and sprinkle with grated Parmesan, if desired. Transfer to a baking sheet. Repeat with the remaining phyllo sheets.",
        "4. Bake for 20 minutes, or until the edges are golden brown. Serve warm or let cool and then freeze. To reheat, defrost on the baking sheet and then bake."
    ],
    "ingredients": [
        "4 tablespoons (1/2 stick) unsalted butter",
        "2 medium leeks, white and light green parts only, chopped",
        "2 garlic cloves, chopped",
        "4 ounces (2 cups packed) amaranth leaves, roughly chopped",
        "1 to 1 1/2 teaspoons red pepper flakes, to taste",
        "Salt",
        "4 ounces feta cheese, crumbled (1 cup)",
        "2 large eggs",
        "4 (16 x 12-inch) sheets frozen phyllo dough, defrosted",
        "1/4 cup freshly grated Parmesan cheese (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Feta",
        "Summer",
        "Party",
        "Phyllo/Puff Pastry Dough",
        "Advance Prep Required",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Amaranth and Feta Phyllo Triangles",
    "url": "http://www.epicurious.com/recipes/food/views/amaranth-and-feta-phyllo-triangles-51105060"
}
