{
    "directions": [
        "Whisk together the rice vinegar, sesame oil, 3 green onions, garlic, sugar, ginger, soy sauce, vegetable oil, coriander, and mustard in a mixing bowl until the sugar has dissolved. Pour half of the dressing into another container, and refrigerate for later. Place the chicken breasts into the remaining dressing, and coat on all sides. Cover, and refrigerate 30 minutes to 1 hour.",
        "Preheat an oven to 350 degrees F (175 degrees C). Remove the chicken breasts from the marinade, and shake off excess. Discard the remaining marinade. Place the chicken into a baking dish.",
        "Bake the chicken breasts in the preheated oven until no longer pink in the center and the juices run clear, about 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from the oven, and allow to cool. Shred the chicken using 2 forks and set aside.",
        "To assemble the salad, combine the green cabbage, red cabbage, carrots, 3 green onions, cilantro, almonds, and cooled chicken in a large mixing bowl. Pour the reserved dressing overtop and toss to coat."
    ],
    "ingredients": [
        "1/4 cup rice vinegar",
        "1/4 cup sesame oil",
        "3 green onions, chopped",
        "2 cloves garlic, minced",
        "2 tablespoons white sugar",
        "2 tablespoons ground ginger",
        "2 tablespoons soy sauce",
        "1 tablespoon vegetable oil",
        "1 teaspoon ground coriander",
        "2 teaspoons prepared yellow mustard",
        "4 skinless, boneless chicken breast halves",
        "1/4 medium head shredded green cabbage",
        "1/4 medium head shredded red cabbage",
        "2 large carrots, shredded",
        "3 green onions, chopped",
        "1/2 bunch cilantro, coarsely chopped leaves",
        "1/2 cup slivered almonds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Amazing Asian Chicken Salad",
    "url": "http://allrecipes.com/recipe/172790/amazing-asian-chicken-salad/"
}
