{
    "directions": [
        "Place the chicken breasts and barbecue sauce in a gallon-sized zip top bag and allow to marinate for 30 minutes in the refrigerator.",
        "Melt 1 tablespoon of butter in a large skillet placed over high heat, and add the chicken.  Cook the chicken until it is browned and almost cooked through, about 5 minutes per side.  Remove chicken from skillet, chop into 1 inch pieces, and place in the crock of a slow cooker.",
        "Heat the remaining 1 tablespoon of butter in the skillet over medium-high heat, add the diced onion, garlic, and roasted red pepper, and cook and stir until the onion is softened, about 5 minutes.  Stir in the tomato paste, chili powder, ancho chile powder, ground cumin, ground ginger, vanilla, and sugar.  Cook, stirring, until blended, about 2 minutes.  Transfer the mixture to the slow cooker.",
        "Drain the canned pineapple and reserve the fruit.  Stir the pineapple juice,  kidney beans, black beans, tomatoes, and chipotle salsa into the ingredients in the slow cooker and set the heat to High.  Allow the chili to cook on High until it begins to bubble, about 20 minutes.  Turn the slow cooker to Low and cook for 1 additional hour.",
        "Stir the reserved pineapple into the chili and continue to cook until the pineapple is warm, about 15 minutes.   Salt and pepper the chili to taste and serve piping hot."
    ],
    "ingredients": [
        "2 pounds skinless, boneless chicken breast halves",
        "1 cup barbeque sauce",
        "2 tablespoons butter, divided",
        "1 large onion, diced",
        "2 cloves garlic, minced",
        "1 large roasted red pepper, chopped",
        "1 (6 ounce) can tomato paste",
        "3 tablespoons chili powder",
        "1 tablespoon ancho chile powder",
        "1 tablespoon ground cumin",
        "1 teaspoon ground ginger",
        "1 tablespoon vanilla extract",
        "1/2 teaspoon white sugar",
        "1 (20 ounce) can pineapple chunks",
        "1 (15 ounce) can kidney beans, drained",
        "1 (15 ounce) can black beans, drained",
        "1 (28 ounce) can chopped tomatoes, drained",
        "1 (24 ounce) jar chipotle salsa",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Amazing Hawaiian Chicken Chili",
    "url": "http://allrecipes.com/recipe/186016/amazing-hawaiian-chicken-chili/"
}
