{
    "directions": [
        "For the marinade: Place 1/4 cup cilantro, 1 clove minced garlic, 1/4 jalapeno, lime zest, 1 1/2 teaspoons salt, onion powder, 1/4 teaspoon black pepper, 1/4 teaspoon chipotle chile powder, and 1 tablespoon olive oil in a small bowl and stir until well combined. Place the chicken breast tenderloins in a large resealable plastic bag. Pour the marinade into the bag with the chicken, seal, and shake the bag to coat. Refrigerate for 1 hour.",
        "For the salsa: Combine the tomato, 1 small onion, 2 tablespoons cilantro, 1/2 jalapeno, 1 clove garlic, 1/4 teaspoon black pepper, sea salt, 1/8 teaspoon chipotle pepper, and 1 tablespoon lime juice in a bowl. Cover with plastic wrap and refrigerate.",
        "To prepare the grilled vegetables, toss the onions and red peppers with 1 tablespoon olive oil, 1/4 teaspoon salt, and 1 clove garlic in a bowl; set aside.",
        "For the lime mayonnaise: Whisk together the mayonnaise and 2 tablespoons of lime juice; cover with plastic wrap and refrigerate.",
        "Preheat an outdoor grill for medium-high heat.",
        "Grill the marinated chicken on the prepared grill until no longer pink in the center and juices run clear, 8 to 10 minutes. Grill the red pepper and onions until tender and golden brown, 8 to 10 minutes. Remove the chicken and vegetables from the grill. Slice the grilled pepper into thin strips.",
        "Spread each slice of bread with 1 1/2 teaspoons of prepared lime mayonnaise. Layer half of the pieces of bread with sliced mango, 1 tablespoon prepared salsa, grilled chicken tenderloins, grilled peppers, grilled onions, and a slice of Monterey Jack cheese. Top off the sandwiches with the remaining slices of bread. Return the sandwiches to the grill, turning when the bottom is golden brown",
        "Return the sandwiches to the grill and grill them until the bread is toasted and the cheese melts, about 2 minutes per side."
    ],
    "ingredients": [
        "MARINADE",
        "1/4 cup finely chopped fresh cilantro",
        "1 clove garlic, minced",
        "1/4 jalapeno chile pepper, seeded and minced",
        "2 tablespoons finely grated fresh lime zest",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon onion powder",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon chipotle chile powder",
        "1 tablespoon olive oil",
        "1 pound chicken breast tenderloins or strips",
        "SALSA",
        "1 medium tomato, chopped",
        "1 small sweet onion, finely chopped",
        "2 tablespoons finely chopped fresh cilantro",
        "1/2 jalapeno chile pepper, seeded and minced",
        "1 clove garlic, finely chopped",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon sea salt",
        "1/8 teaspoon chipotle chile powder",
        "1 tablespoon fresh lime juice",
        "GRILLED VEGETABLES",
        "1 sweet onion cut into 1/2-inch slices",
        "1 red bell pepper, quartered",
        "1 tablespoon olive oil",
        "1/4 teaspoon salt",
        "1/2 teaspoon minced garlic",
        "LIME MAYONNAISE",
        "1/2 cup mayonnaise",
        "2 tablespoons fresh lime juice",
        "16 thick slices French bread",
        "2 mangos - peeled, seeded, and sliced",
        "8 slices Monterey Jack cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Amazing Southwest Cilantro Lime Mango Grilled Chicken Sandwiches",
    "url": "http://allrecipes.com/recipe/143458/amazing-southwest-cilantro-lime-mango/"
}
