{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place garlic cloves in a small oven-safe dish, and roast in the preheated oven until softened and fragrant, about 20 minutes. Set roasted garlic cloves aside to cool.",
        "Place the spinach in a large mixing bowl, and stir in the artichoke hearts.",
        "Melt butter in a skillet over medium heat, and cook and stir the mushrooms until softened, about 10 minutes. Mix in the green onions, and cook and stir until onions are soft, about 5 more minutes. Transfer the mushrooms, green onions, and butter from the skillet into the bowl with spinach mixture.",
        "Remove cream cheese from wrapping, place into a microwave-safe bowl, and cook in the microwave until warm and very soft, about 1 1/2 minutes. Stir the softened cream cheese into the spinach mixture, and add the sour cream, water chestnuts, Parmesan cheese, mayonnaise, garlic salt, and lemon juice. Squeeze the roasted garlic out of the garlic skins, and mix thoroughly into the spinach mixture. Spoon the casserole into a round 2-quart baking dish.",
        "Bake in the preheated oven until the casserole is hot and bubbly, about 30 minutes. Spread French-fried onion rings over the top, return to the oven, and bake until the onion rings are lightly browned, 5 to 10 more minutes."
    ],
    "ingredients": [
        "6 cloves garlic, unpeeled",
        "4 (10 ounce) packages frozen chopped spinach - thawed, drained and squeezed dry",
        "1 (14 ounce) can artichoke hearts, drained and chopped",
        "1/4 cup butter",
        "1 (8 ounce) package sliced fresh mushrooms",
        "3 green onions, finely chopped",
        "1 (8 ounce) package cream cheese",
        "1 cup sour cream",
        "1 (8 ounce) can water chestnuts, drained and chopped",
        "3/4 cup grated Parmesan cheese",
        "3/4 cup real mayonnaise",
        "2 teaspoons garlic salt",
        "1 tablespoon lemon juice",
        "1 cup French fried onion rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Amazing Spinach Artichoke Casserole",
    "url": "http://allrecipes.com/recipe/219129/amazing-spinach-artichoke-casserole/"
}
