{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C).  Grease and flour two 9 inch round cake pans.",
        "In a large bowl, cream together the shortening and 1 3/4 cups sugar until light and fluffy. Combine the flour, baking powder and salt; stir into the creamed mixture alternately with the milk, beginning and ending with the flour. Stir in vanilla and 1 cup coconut. In a separate glass or metal bowl, whip egg whites to soft peaks. Fold egg whites into the cake batter. Divide the batter evenly between the prepared pans.",
        "Bake for 35 minutes in the preheated oven, or until a toothpick inserted into the center of the cakes comes out clean. Cool cakes in pans over a wire rack. When cakes are cool enough to handle, tap out of the pan to cool completely. Spread the Citrus Coconut Filling between the layers, and frost the outside with fluffy white frosting.",
        "To make the Citrus Coconut Filling: Whisk together 1/2 cup sugar and cornstarch in a small saucepan. Add butter, coconut, and egg yolk, and cook over medium heat stirring constantly until the butter is melted, and the mixture has thickened. Remove from heat, and stir in the orange zest, orange juice and lemon juice.",
        "To make Fluffy White Frosting: Combine 1 cup sugar with corn syrup and water in a small saucepan over medium heat. Bring to a boil, stirring occasionally to dissolve sugar. Continue cooking without stirring, until the temperature is between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. In a large glass or metal bowl, whip remaining 2 egg whites until soft peaks form. Pour the hot syrup in a thin stream into the egg whites while continuing to whip until thick and glossy. Stir in almond extract."
    ],
    "ingredients": [
        "2/3 cup shortening",
        "1 3/4 cups white sugar",
        "2 1/2 cups sifted cake flour",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1 cup milk",
        "1 cup flaked coconut",
        "1 1/2 teaspoons vanilla extract",
        "5 egg whites",
        "1/2 cup white sugar",
        "1 1/2 teaspoons cornstarch",
        "1 tablespoon butter",
        "1 egg yolk, beaten",
        "1/3 cup flaked coconut",
        "2 tablespoons orange zest",
        "1 tablespoon orange juice",
        "1 tablespoon lemon juice",
        "1 cup white sugar",
        "1/2 cup light corn syrup",
        "1/4 cup water",
        "2 egg whites",
        "1 teaspoon almond extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ambrosia Cake",
    "url": "http://allrecipes.com/recipe/8087/ambrosia-cake/"
}
