{
    "directions": [
        "Heat olive oil in a large, heavy-bottomed pot over medium-high heat. Cook and stir celery, onion, and garlic in hot oil until translucent, about 5 minutes. Add pork and chicken and cook for 7 to 10 minutes. Combine tomato puree and tomato paste with 1 cup water, and add to meat mixture. Reduce heat to low and cook, stirring occasionally, for 2 hours, or until pork and chicken are falling off the bone. Remove meat from the pot to cool, and set sauce aside.",
        "Meanwhile, remove olive pits using a special olive pitting tool. Make a slit in one side of each olive large enough to insert stuffing.",
        "Once cooled, remove pork and chicken meat from the bones, and mince. Mix together with 2 beaten eggs, Parmesan cheese, ground nutmeg, lemon zest, and 1/4 cup of reserved sauce. Use more or less sauce as needed so that meat mixture is moist, but not too wet.",
        "Fill each olive with enough stuffing so that a small amount is pushing out of the slit. Dip each stuffed olive in flour, then beaten egg, then bread crumbs. Stuffed olives may be frozen in an air-tight container at this point until ready to use.",
        "Heat oil in deep-fryer to 375 degrees F (190 degrees C).",
        "Fry olives in hot oil for about 3 minutes, or until golden brown on the outside. Serve warm."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "1 stalk celery, minced",
        "1/2 medium onion, minced",
        "2 cloves garlic, pressed",
        "2 thick cut bone-in pork chops",
        "1 whole skinless, bone-in chicken breast",
        "1 (10.75 ounce) can tomato puree",
        "1 (12 ounce) can tomato paste",
        "1 cup water",
        "3 (8 ounce) jars colossal green olives, with pits",
        "3 eggs, divided and beaten",
        "1/4 cup grated Parmesan cheese",
        "1 teaspoon ground nutmeg",
        "1 lemon, zested",
        "flour for dredging",
        "bread crumbs",
        "vegetable oil for deep frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ameilia's Italian Stuffed Olives",
    "url": "http://allrecipes.com/recipe/48498/ameilias-italian-stuffed-olives/"
}
