{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Melt 1/4 cup butter in a large, oven-safe skillet on medium heat. Stir in onions until they are all coated in butter. Transfer skillet to the preheated oven and cook onions, stirring occasionally, until they are tender and well browned, about 1 hour.",
        "Transfer skillet to the stovetop; cook and stir onions over medium heat until they start to brown and stick to the bottom of the pan, about 5 minutes. Pour sherry and vinegar into the pan, and bring to a boil while scraping browned bits of onion off the bottom of the pan with a wooden spoon.",
        "Place caramelized onions in a large soup pot. Pour in chicken broth, beef broth, and thyme. Bring to a boil, skimming off any foam and fat that appear on top. Reduce heat  to low and simmer for about an hour. Season with salt and pepper to taste.",
        "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.",
        "Generously brush French bread slices with melted butter. Place on a baking sheet and broil in the preheated oven until crisp and golden, about 5 minutes.",
        "Ladle soup into heat-proof bowls, top each bowl with a piece of toasted bread, sprinkle with 2 to 3 tablespoons of Cheddar cheese and Monterey Jack cheese.",
        "Broil bowls of soup under the broiler until cheese is golden and bubbly, 5 to 6 minutes."
    ],
    "ingredients": [
        "1/4 cup unsalted butter",
        "6 large yellow onions, diced",
        "3 tablespoons dry sherry",
        "1 tablespoon sherry vinegar, or to taste",
        "4 cups chicken broth",
        "4 cups beef broth",
        "3 sprigs fresh thyme",
        "salt and ground black pepper to taste",
        "6 slices French bread",
        "1/4 cup butter, melted",
        "1 cup shredded extra-sharp Cheddar cheese",
        "1 cup shredded Monterey Jack cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "American French Onion Soup",
    "url": "http://allrecipes.com/recipe/223049/american-french-onion-soup/"
}
