{
    "directions": [
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.",
        "Cut the Anaheim pepper into halves lengthwise; remove and discard the stem, seeds, and ribs. Place the pepper, cut-sides down, onto the prepared baking sheet.",
        "Cook under the preheated broiler until the skin of the pepper has blackened and blistered, 5 to 8 minutes. Place the blackened pepper into a bowl and tightly seal with plastic wrap. Allow the pepper to steam as it cools, about 20 minutes. Remove and discard skins; chop pepper.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.",
        "Cook and stir sausage in a large skillet over medium-high heat until browned and crumbly, 5 to 7 minutes; remove sausage using a slotted spoon to a plate, leaving rendered fat in the skillet.",
        "Return skillet to medium-high heat. Saute onion, zucchini, bell pepper, and Anaheim pepper in hot skillet until just tender, about 4 minutes.",
        "Stir eggs, hash browns, Cheddar cheese, cottage cheese, and Swiss cheese together in a large bowl; add sausage and sauteed vegetables and stir. Pour egg mixture into prepared baking dish.",
        "Bake in the preheated oven until eggs are set and mixture is bubbling, about 70 minutes. Let cool for 10 minutes before slicing."
    ],
    "ingredients": [
        "1 large Anaheim chile pepper",
        "2 (12 ounce) packages reduced fat pork sausage (such as Jimmy Dean®)",
        "1 cup chopped sweet onion",
        "1 cup chopped zucchini",
        "1 cup chopped bell pepper",
        "18 eggs, lightly beaten",
        "1 (2 pound) package frozen southwestern-style hash brown potatoes, thawed",
        "3 cups shredded reduced-fat Cheddar cheese",
        "2 cups low-fat small curd cottage cheese",
        "1 1/2 cups shredded reduced-fat Swiss cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Amish Breakfast Bake",
    "url": "http://allrecipes.com/recipe/237137/amish-breakfast-bake/"
}
