{
    "directions": [
        "Combine 1/2 cup water and white sugar together in a small microwave-safe bowl. Warm in the microwave to dissolve sugar, about 30 seconds. Add 2 tablespoons soy sauce, 2 tablespoons rice vinegar, ketchup, lemon juice, and sesame oil; mix until dipping sauce is well-blended. Cover with plastic wrap and chill, about 30 minutes.",
        "Combine dry mustard with a few drops of water. Mix in remaining water until mixture is the consistency of hot mustard.",
        "Whisk 2 tablespoons soy sauce, brown sugar, and ½ teaspoon rice vinegar in a small bowl to make stir-fry sauce.",
        "Heat 2 tablespoons peanut oil in a wok or large skillet over high heat. Add pork; cook and stir until browned, about 5 minutes. Add remaining 1 tablespoon oil, water chestnuts, mushrooms, green onions, and garlic; saute until flavors combine, about 2 minutes. Pour in stir-fry sauce; stir to coat pork mixture evenly, 3 to 4 minutes.",
        "Cut out lettuce stem and wash thoroughly. Discard outer leaf. Carefully peel off whole leaves and slice in half lengthwise. Arrange on a plate lined with paper towels.",
        "Scoop dipping sauce into small bowls or ramekins. Mix in hot mustard and red chile paste to desired level of spiciness. Spoon pork filling into lettuce halves and roll up; top or dip wraps with dipping sauce."
    ],
    "ingredients": [
        "Dipping Sauce:",
        "1/2 cup water",
        "1/4 cup white sugar",
        "2 tablespoons soy sauce",
        "2 tablespoons rice vinegar",
        "2 tablespoons ketchup",
        "1 tablespoon lemon juice",
        "1/8 teaspoon sesame oil",
        "Hot Mustard:",
        "1 tablespoon dry mustard",
        "2 teaspoons water, divided",
        "Stir-Fry Sauce:",
        "2 tablespoons soy sauce",
        "2 tablespoons brown sugar",
        "1/2 teaspoon rice vinegar",
        "Filling:",
        "3 tablespoons peanut oil, divided",
        "1 pound ground pork",
        "1 cup minced water chestnuts",
        "8 ounces chopped fresh mushrooms",
        "3 tablespoons chopped green onion",
        "1 teaspoon minced garlic",
        "To Serve:",
        "1 head iceberg lettuce",
        "1 teaspoon red chile paste, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Amy's Lettuce Wraps",
    "url": "http://allrecipes.com/recipe/246280/amys-lettuce-wraps/"
}
