{
    "directions": [
        "1. Preheat oven to 375°F. Lightly butter a baking sheet.",
        "2. Sift the flour, baking powder and 4 tablespoons sugar into a bowl. Add the butter, using fingers to work it quickly into the flour until the mixture resembles fine crumbs. Add the cream and yolks; stir with a fork until the dough just holds together.",
        "3. Knead the dough on a floured surface until it is just smooth. Do not overwork. Roll the dough out 3/4-inch thick. Using a floured 2 1/2- or 3-inch cookie cutter, cut out 4 rounds. Gather the scraps, reroll; cut 2 more rounds.",
        "4. Put the 6 rounds on the prepared baking sheet. Brush with the melted butter and sprinkle with the remaining tablespoon of sugar. Bake in the center of the oven for 12 to 15 minutes, until the biscuits are golden brown and firm to the touch.",
        "5. For the filling, mix berries and sugar in a bowl. Chill.",
        "6. Cool the biscuits on a rack; carefully split them in half. Heap the bottoms with strawberries. Dollop with the whipped cream, then replace the biscuit tops. Serve immediately with remaining whipped cream on the side."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "3 1/2 teaspoons baking powder",
        "5 tablespoons sugar",
        "6 tablespoons cold unsalted butter, cut into small pieces",
        "3/4 cup heavy cream",
        "2 mashed hard-cooked large egg yolks",
        "2 tablespoons unsalted butter, melted",
        "3 pints strawberries, cleaned and halved (quartered, if large)",
        "2 tablespoons sugar",
        "1 cup heavy cream, whipped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Back to School",
        "Strawberry",
        "Summer",
        "Parade"
    ],
    "title": "An American Place Strawberry Shortcake",
    "url": "http://www.epicurious.com/recipes/food/views/an-american-place-strawberry-shortcake-106681"
}
