{
    "directions": [
        "Bring milk, 1 cup water and salt to boil in heavy large saucepan over medium heat. Slowly whisk in cornmeal. Cook until mixture thickens and boils, whisking constantly, about 2 minutes. Remove from heat. Whisk in molasses and 2 tablespoons butter. Transfer mixture to large bowl. Cool until thermometer inserted into center of mixture registers 115°F, whisking often, about 15 minutes.",
        "Pour 1/2 cup warm water into small bowl; sprinkle yeast over. Let stand until yeast dissolves and top looks spongy, about 13 minutes. Stir yeast mixture into cornmeal mixture. Gradually mix in 4 3/4 cups flour, about 1 cup at a time, to form soft dough that pulls away from sides of bowl. Sprinkle 1/4 cup flour onto work surface. Turn dough out onto floured surface; knead until smooth and elastic, sprinkling with more flour by tablespoonfuls if needed, about 10 minutes (dough will remain slightly sticky). Form dough into ball. Coat large bowl with 1 tablespoon butter. Add dough to bowl and turn to coat dough with butter. Cover bowl with plastic wrap. Let dough rise in warm draft-free area until doubled in volume, about 1 hour 15 minutes.",
        "Punch down dough. Cover dough with plastic wrap; let stand 10 minutes. Coat each of two 9-inch-diameter cake pans with 1/2 tablespoon butter. Roll dough into 18-inch-long log. Cut into 18 equal pieces. Using floured hands, form each dough piece into ball. Place 9 dough balls in each pan, spacing apart. Cover each pan loosely with towel. Let rolls stand in warm draft-free area until almost doubled in volume, about 30 minutes. Position rack in center of oven and preheat to 400°F. Melt 2 tablespoons butter in small saucepan over medium heat. Brush top of rolls with melted butter, then sprinkle with sesame or poppy seeds. Place rolls in oven and immediately reduce temperature to 350°F. Bake rolls until golden brown, about 30 minutes. (Can be made 1 day ahead. Cool completely. Store airtight at room temperature. Wrap rolls in foil and rewarm in 350°F oven 10 minutes.) Serve warm."
    ],
    "ingredients": [
        "1 cup whole milk",
        "1 cup water",
        "2 teaspoons salt",
        "1/2 cup yellow cornmeal",
        "1/3 cup mild-flavored (light) molasses",
        "6 tablespoons (3/4 stick) unsalted butter",
        "1/2 cup warm water (105°F to 115°F)",
        "1 envelope dry yeast",
        "5 1/2 cups (about) unbleached all purpose flour",
        "2 teaspoons sesame or poppy seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Side",
        "Bake",
        "Thanksgiving",
        "Fall",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Anadama Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/anadama-rolls-104287"
}
