{
    "directions": [
        "Mix milk, molasses, butter and salt in small saucepan. bring to simmer. Pour milk mixture into bowl of heavy-duty mixer fitted with paddle attachment. Cool to 155°F, about 30 minutes.",
        "Meanwhile place 1/4 cup warm water in measuring cup. Sprinkle yeast over and stir to blend. Let stand until yeast dissolves into milk mixture. Mix in 3/4 cup cornmeal. Mix in whole wheat flour. Mix in enough bread flour, 1/2 cup at a to form slightly sticky dough. Turn dough out onto floured surface. Knead until smooth and elastic, adding more bread flour if dough is too sticky, about 8 minutes. Form dough into ball.",
        "Butter large bowl. Place dough in bowl; turn to coat. Cover bowl with plastic wrap, then towel. Let dough rise in warm area until doubled, about 1 1/2 hours.",
        "Sprinkle 2 heavy large baking sheets generously with cornmeal. Punch down dough. Turn out onto floured surface and knead until smooth, about 3 minutes. Divide dough into 16 equal portions. Roll each portion between palms and work surface to 8-inch-long rope about 3/4 inch thick. Grasping 1 rope at both ends,tie into loose knot. Repeat with remaining ropes. Place on prepared baking sheets, spacing 2 inches apart. Cover with towels. Let rise in warm area until doubled, about 45 minutes.",
        "Position 1 rack in center and 1 rack in top third of oven and preheat to 375°F. Brush rolls with egg glaze. Sprinkle with seeds. Bake until rolls are golden and sound hollow when tapped, switching and rotating baking sheets halfway through baking, about 20 minutes. Transfer rolls to racks. (Can be made 2 weeks ahead. Cool. Wrap in foil; freeze. If desired, rewarm thawed wrapped rolls in 350°F oven 10 minutes.) Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups milk (do not use low-fat or non-fat)",
        "1/3 cup mild-flavored (light) molasses",
        "2 tablespoons (1/4 stick) unsalted butter",
        "2 teaspoons salt",
        "1/4 cup warm water (105°F to 115°F)",
        "2 envelopes dry yeast",
        "3/4 cup yellow cornmeal",
        "1 1/2 cups whole wheat flour",
        "2 3/4 cups (about) bread flour",
        "Additional yellow cornmeal",
        "1 egg, beaten to blend (glaze)",
        "Assorted seeds (such as fennel, anise, celery and/or caraway)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Milk/Cream",
        "Side",
        "Bake",
        "Vegetarian",
        "Cornmeal",
        "Molasses",
        "Seed"
    ],
    "title": "Anadama Rolls with Mixed Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/anadama-rolls-with-mixed-seeds-100345"
}
