{
    "directions": [
        "In a saucepan over high heat, bring the water to a boil. Remove from the heat and add the ancho chilies. Cover and let stand off the heat until the chilies are soft, about 15 minutes.",
        "Using tongs, remove the chilies from the water; reserve the water. When cool enough to handle, slit the chilies lengthwise and seed them. Discard the stems and seeds. Place the ancho chilies, garlic and 3 Tbs. of the cooking water in a blender and process until smooth. Set the puree aside.",
        "Place the flank steak in a shallow nonaluminum bowl. Add 1/3 cup of the ancho puree and turn the steak to coat both sides. Cover the bowl and refrigerate for at least 6 hours or up to overnight. Reserve the remaining puree in a separate covered bowl in the refrigerator.",
        "Heat a large nonstick fry pan over medium heat. Coat with nonstick cooking spray. Add the Anaheim chilies, bell peppers, red onion, cumin, salt and pepper and sauté until the vegetables are tender, about 25 minutes. Remove from the heat and keep warm.",
        "Meanwhile, heat another nonstick fry pan over medium heat. Coat the pan with nonstick cooking spray. Season the steak with salt and add to the pan. Cook until the meat is well browned on one side, about 5 minutes. Turn and continue to cook until well browned on the other side and medium-rare at the center, about 4 minutes more. Transfer the steak to a cutting board and let rest for several minutes.",
        "Thinly slice the steak across the grain and place in a bowl. Add another 3 Tbs. of the ancho puree and mix well. Transfer the vegetables and the steak to a warmed platter, arranging them separately. Serve with the hot tortillas and the condiments in small bowls for guests to help themselves."
    ],
    "ingredients": [
        "2 cups water",
        "3 ancho chilies",
        "8 garlic cloves",
        "1 lb. beef flank steak, trimmed of fat",
        "4 large Anaheim chilies, sliced crosswise",
        "2 red bell peppers, seeded and sliced",
        "1 red onion, sliced",
        "1 Tbs. ground cumin",
        "Salt and freshly ground pepper, to taste",
        "8 fat-free flour tortillas, each 6 inches in  diameter, heated",
        "Suggested condiments: fat-free sour cream, salsa, chopped green onions, chopped fresh cilantro and lime wedges"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Ancho Chili Fajitas",
    "url": "http://www.williams-sonoma.com/recipe/ancho-chili-fajitas.html"
}
