{
    "directions": [
        "To make the pickled onions, in a nonreactive bowl, whisk together the vinegar, sugar and salt until the sugar and salt are dissolved. Add the onion slices and toss to coat. Let stand at room temperature, stirring occasionally, for 30 minutes. Use immediately or store in an airtight container in the refrigerator for up to 2 weeks.",
        "Preheat an oven to 350°F (180°C). In a saucepan over high heat, bring the broth to a boil, then remove from the heat and add the chiles. Set aside to steep.",
        "In a heavy ovenproof pot over medium-high heat, warm the olive oil. Season the short ribs all over with salt and pepper. Working in batches, add the ribs to the pot and sear until browned on all sides, about 4 minutes per side. Transfer to a plate and set aside. Add the onion to the pot and cook, stirring often, until golden, about 4 minutes. Add the garlic, season with salt and pepper, and cook just until the garlic is soft, about 1 minute. Add the broth, chiles and wine, stirring to scrape up any browned bits on the bottom of the pot. Nestle the ribs in the liquid, cover the pot and transfer to the oven. Bake until the meat falls off the bones, 2 1/2 to 3 hours. Check the pot every 45 minutes or so to make sure there is enough liquid, adding more broth as needed; it should reach about three-fourths of the way up the sides of the ribs.",
        "Using tongs, transfer the ribs and the chiles to a plate to cool. Set the pot with the cooking liquid aside to cool. When cool enough to handle, using your hands or 2 forks, shred the meat and set aside. Discard the bones. Using a large spoon, skim the fat off the top of the cooled liquid in the pot. Transfer the contents of the pot and 1 of the chiles to a blender and process to a smooth puree. Return the pureed sauce to the pot and bring to a boil over high heat. Cook until the sauce reduces by half, about 5 minutes. Add the shredded meat and cook just until warmed through, about 4 minutes.",
        "To assemble, fill the tortillas with the meat and top with some drained pickled onions, a dollop of crema and some cilantro. Serve immediately. Serves 6 to 8.",
        "Adapted from Williams-Sonoma",
        "Taco Night",
        ", by Kate McMillan (Weldon Owen 2014)"
    ],
    "ingredients": [
        "6 Tbs. (3 fl. oz./90 ml) rice wine vinegar",
        "1 Tbs. sugar",
        "1 1/2 tsp. kosher salt",
        "1 large red onion, quartered and thinly sliced",
        "3 cups (24 fl. oz./750 ml) low-sodium beef broth, plus more as needed",
        "4 dried ancho chiles",
        "2 Tbs. olive oil",
        "5 lb. (2.5 kg) bone-in beef short ribs",
        "Kosher salt and freshly ground pepper",
        "1 yellow onion, finely chopped",
        "4 garlic cloves, minced",
        "1 cup (8 fl. oz./250 ml) dry red wine",
        "16 to 20 flour or corn tortillas, warmed",
        "1 cup (8 oz./250 g) Mexican crema, sour cream or crème fraîche",
        "Fresh cilantro leaves for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Ancho Short Rib Tacos with Pickled Red Onions",
    "url": "http://www.williams-sonoma.com/recipe/ancho-short-rib-tacos-with-pickled-red-onions.html"
}
