{
    "directions": [
        "Very thinly slice 4 garlic cloves (a mandoline works great) and set aside. Pulse remaining 4 garlic cloves in a food processor until finely chopped. Add bread and lemon zest and pulse until coarse crumbs form; season with salt and pepper.",
        "Heat 1/4 cup oil in a large Dutch oven or other heavy pot over medium. Cook breadcrumb mixture, stirring often, until golden brown and crisp, about 5 minutes. Transfer breadcrumb mixture with a slotted spoon to a small bowl.",
        "Heat remaining 3 Tbsp. oil in same pot over medium-low. Cook reserved sliced garlic, stirring occasionally, until golden at edges, about 1 minute. Add anchovies and chiles and cook, stirring, until anchovies are dissolved, about 1 minute. Stir in lemon juice.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 3 minutes less than package directions.",
        "Using tongs, transfer pasta to pot with sauce along with 1 cup pasta cooking liquid. Cook, tossing often, until pasta is al dente. Add 3 Tbsp. pasta cooking liquid, then gradually add cheese, tossing until melted and emulsified. Remove from heat, add parsley, butter, and half of breadcrumb mixture and toss until combined and butter is melted. If pasta seems dry, add more pasta cooking liquid and oil and toss again. Season with salt and pepper, and more lemon juice if desired.",
        "Divide pasta among bowls. Top with remaining breadcrumb mixture."
    ],
    "ingredients": [
        "8 garlic cloves, divided",
        "5 ounces sourdough or other crusty bread, crust removed, cut into 1-inch pieces (about 2 cups)",
        "1 teaspoon finely grated lemon zest",
        "Kosher salt, freshly ground pepper",
        "1/4 cup plus 3 tablespoons (or more) olive oil",
        "4 oil-packed anchovy fillets",
        "4 oil-packed Calabrian chiles, very finely chopped, or 1/2 teaspoon crushed red pepper flakes",
        "1 tablespoon (or more) fresh lemon juice",
        "12 ounces bucatini, spaghetti, or linguine",
        "2 ounces finely grated Pecorino",
        "1/2 cup finely chopped parsley",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Dinner",
        "Anchovy",
        "Breadcrumbs",
        "Garlic",
        "Lemon",
        "Chile Pepper",
        "Cheese"
    ],
    "title": "Anchovy Pasta With Garlic Breadcrumbs",
    "url": "http://www.epicurious.com/recipes/food/views/anchovy-pasta-with-garlic-breadcrumbs"
}
