{
    "directions": [
        "1. To prepare the brine, bring 6 cups water, the salt, sugar, peppercorns, garlic, thyme, bay leaves, and onion to a simmer in a medium pot over medium heat. Stir until the sugar and salt have completely dissolved. Remove from the heat and add the ice cubes to cool.",
        "2. Place the pork loin in large freezer bag (or large plastic container with a lid). Pour the brine into the freezer bag, submerging the roast completely, seal, and set aside for 2 hours.",
        "3. Preheat the grill and set up two zones-one hot for searing and another medium for cooking through.",
        "4. Using the tip of a paring knife, pierce the casing of the sausage all over (this will ensure the flavor of the sausage goes into the pork as it cooks). Remove the pork from the brine and pat it dry with paper towels. Using a clean honing steel, poke a hole into the center of the loin lengthwise and work it all the way through so it creates a cavity. Insert the sausage into the cavity so that it sits neatly within the roast. Season the roast with salt, pepper, granulated garlic, paprika, and cumin.",
        "5. Wipe down the grates of the grill with oil-blotted towels. Place the roast on the hot part of the grill and sear fat side down, 3 to 4 minutes, and then on each of the three other sides. Transfer the roast to the cooler part of the grill (indirect heat) and cook until the internal temperature hits 165°F on an instant-read thermometer, 45 to 55 minutes. Set the roast on a platter and tent with foil. Allow it to rest for 15 minutes before carving into thick slices. Served drizzled with juices from the platter and the Creole mustard."
    ],
    "ingredients": [
        "1/2 cup kosher salt",
        "1/2 cup sugar",
        "12 black peppercorns",
        "6 garlic coves, roughly chopped",
        "6 fresh thyme sprigs",
        "2 bay leaves",
        "1 small yellow onion, peeled and sliced into rings",
        "4 cups ice cubes",
        "One 3-pound boneless pork loin roast with a nice fat cap layer on top",
        "1 large (about 4-ounce) Andouille sausage link",
        "Kosher salt and freshly ground black pepper",
        "1 tablespoon granulated garlic",
        "1 tablespoon paprika",
        "1 teaspoon ground cumin",
        "1 to 2 tablespoons canola oil",
        "Creole mustard (e.g., Zatarain's)",
        "Grill with lid, large freezer bag, honing steel, instant-read meat thermometer."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Kid-Friendly",
        "Dinner",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Andouille-Stuffed Pork Loin with Creole Mustard",
    "url": "http://www.epicurious.com/recipes/food/views/andouille-stuffed-pork-loin-with-creole-mustard-56389583"
}
