{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Grease a 17x11 3/8x3/4-inch jelly roll pan; line the bottom with waxed paper. Sift 2 tablespoons confectioners' sugar onto a clean kitchen towel at least the same size as jelly roll pan.",
        "Beat cake mix and cold water with an electric mixer on Low in a large glass or metal bowl for 30 seconds; increase to Medium speed and beat for 1 minute. Pour 3/4 the batter into the prepared jelly roll pan.",
        "Bake in the preheated oven until cake is firm to the touch, 15 to 17 minutes. Loosen cake from pan and turn onto the floured towel; peel off waxed paper. Carefully trim any browned edges. Roll cake in the towel, starting from the narrow end; cool on a wire rack with seam side down for 20 minutes.",
        "Toss sliced strawberries with 2 tablespoons confectioners' sugar in a bowl until coated.",
        "Beat cream in a glass or metal bowl until foamy. Gradually add 1 1/2 tablespoons confectioners' sugar, continuing to beat until soft peaks form. Lift your beater or whisk straight up: whipped cream will form soft mounds. Measure 1 1/2 cups whipped cream and set aside. Fold sliced strawberries into the remaining whipped cream.",
        "Unroll the cooled cake and spread strawberry-whipped cream mixture onto cake, leaving 1/2-inch border of cake exposed. Roll cake (without towel) around whipped cream layer. Transfer rolled cake, seam side down, to a serving platter.",
        "Stir food coloring into the reserved 1 1/2 cups whipped cream until pink. Frost the outside of rolled cake with pink whipped cream. Garnish with whole strawberries."
    ],
    "ingredients": [
        "2 tablespoons confectioners' sugar",
        "1 (16 ounce) package angel food cake mix (such as Betty Crocker®)",
        "1 1/4 cups cold water",
        "1 pint fresh strawberries, sliced",
        "2 tablespoons confectioners' sugar",
        "1 pint heavy whipping cream",
        "1 1/2 tablespoons confectioners' sugar",
        "1 dash red food coloring, or as needed",
        "2 whole strawberries"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Angel Food Cake and Strawberry Cream Roll",
    "url": "http://allrecipes.com/recipe/230827/angel-food-cake-and-strawberry-cream/"
}
