{
    "directions": [
        "Bring a saucepan three-fourths full of water to a boil over high heat. Add the fava beans and boil for 1 minute, then use a skimmer to transfer them to a bowl. Squeeze each bean free of its tough outer skin.",
        "Lightly salt the boiling water. Add the carrots, boil for 2 minutes and transfer to a bowl of ice water to stop the cooking. Repeat with the asparagus, blanching for 1 minute, and the snap peas, blanching for 30 seconds.",
        "Bring a large pot three-fourths full of salted water to a rolling boil over high heat. Meanwhile, in a large sauté pan over medium heat, warm 3 Tbs. of the olive oil. Add the onion and cook, stirring frequently, until golden, 5 to 7 minutes. Add the broth and boil until reduced by half, 10 to 15 minutes. Add the carrots, asparagus, snap peas and fava beans. Heat until the vegetables are warmed through and just tender, 3 to 4 minutes. Season with salt and pepper.",
        "When the water is boiling, stir in the pasta and cook until al dente, 3 to 4 minutes or according to the package instructions. Drain and transfer to a bowl, then toss with the remaining 3 Tbs. olive oil. Add the pasta to the pan with the vegetables and toss well. Transfer to a warmed serving bowl and scatter the tomatoes and basil on top. Sprinkle with the cheese and serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "Healthy Dish of the Day,",
        "by Kate McMillan (Weldon Owen, 2014)."
    ],
    "ingredients": [
        "2 lb. (1 kg) fava beans, shelled",
        "Salt, to taste",
        "1 bunch baby carrots (about 6 oz./185 g), trimmed, peeled and\n  halved lengthwise",
        "1/2 lb. (250 g) asparagus, tough ends removed, spears cut into\n  2-inch (5-cm) lengths",
        "1/2 lb. (250 g) sugar snap peas, trimmed",
        "6 Tbs. (3 fl. oz./90 ml) olive oil",
        "1 yellow onion, diced",
        "3 cups (24 fl. oz./750 ml) low-sodium vegetable broth",
        "Freshly ground pepper, to taste",
        "1 lb. (500 g) angel hair pasta",
        "1/2 pint (6 oz./185 g) yellow pear tomatoes, halved lengthwise",
        "1/2 cup (1/2 oz./15 g) fresh basil leaves, cut into slivers",
        "2 oz. (60 g) Parmigiano-Reggiano cheese, shaved with a\n  vegetable peeler or grated"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Angel Hair Pasta with Spring Vegetables",
    "url": "http://www.williams-sonoma.com/recipe/angel-hair-pasta-with-spring-vegetables.html"
}
