{
    "directions": [
        "Place the chicken in a large pot and add water to cover. Bring to a boil over high heat, then reduce the heat to medium-low, cover, and simmer until the chicken pieces are no longer pink, about 10 minutes. Shred chicken by placing two forks back to back and pulling meat apart. Set the shredded chicken aside. Meanwhile, combine the cream of chicken soup, sour cream, and chili powder in a saucepan. Bring to a simmer over low heat, stirring occasionally, then turn off the heat and cover to keep warm.",
        "Heat the butter in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the shredded chicken, chopped green chilies, taco seasoning, half of the bunch of chopped green onion, and water. Allow to simmer for 10 minutes. Stir in the lime juice, onion powder, and garlic powder; simmer for an additional 10 minutes.",
        "Preheat an oven to 350 degrees F (175 degrees C). Stir 1 cup of the soup mixture into the skillet with the chicken mixture. Spread the remaining soup mixture on the bottom of a 9x13 inch baking dish.",
        "Fill each tortilla with chicken mixture. Sprinkle Cheddar cheese over the chicken filling before folding the tortillas, reserving half of the shredded cheese for topping the enchiladas.  Fold tortillas over the filling and place seam-side down in the prepared pan.",
        "Pour enchilada sauce evenly over the enchiladas. Cover with the remaining 1 1/2 cups of Cheddar cheese. Sprinkle the reserved chopped green onions and the sliced olives on top of the cheese. Bake in the preheated oven until filling is heated through and the cheese is melted and bubbling, about 25 minutes."
    ],
    "ingredients": [
        "2 pounds skinless, boneless chicken breast meat - cut into chunks",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1 1/4 cups sour cream",
        "1/4 teaspoon chili powder",
        "1 tablespoon butter",
        "1 small onion, chopped",
        "1 (4 ounce) can chopped green chilies, drained",
        "1 (1.25 ounce) package mild taco seasoning mix",
        "1 bunch green onions, chopped, divided",
        "1 cup water",
        "1 teaspoon lime juice",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon garlic powder",
        "5 (12 inch) flour tortillas",
        "3 cups Cheddar cheese, shredded, divided",
        "1 (10 ounce) can enchilada sauce",
        "1 (6 ounce) can sliced black olives"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Angela's Awesome Enchiladas",
    "url": "http://allrecipes.com/recipe/83549/angelas-awesome-enchiladas/"
}
