{
    "directions": [
        "Cook onion and garlic in oil in a 3-quart heavy saucepan over moderately low heat, stirring, until softened, about 3 minutes. Add tomatoes (with water if using canned) and sea salt and simmer, covered, stirring occasionally (and breaking up tomatoes if using canned), 40 minutes.",
        "Purée sauce in a blender (use caution when blending hot liquids), then force through a fine sieve into a bowl, discarding solids.",
        "Finely chop squid tentacles and chill until ready to use for fish stock and pasta. Cut squid bodies open with kitchen shears, then rinse insides well and pat bodies dry. Lay each body flat on a cutting board, interior side up, and cut lengthwise (including flaps) into thin spaghetti-like strips (less than 1/8 inch wide) with a sharp knife. Chill strips, covered, until ready to use.",
        "Cook onion, leek greens, and garlic in oil in a 3- to 4-quart heavy saucepan over moderately low heat, stirring, until softened, about 3 minutes. Add fish bones and trimmings and half of chopped tentacles and cook, covered, stirring occasionally, until tentacles release their liquid, about 2 minutes. Add water, wine, and sea salt and bring to a simmer, skimming froth. Remove from heat and let stand, uncovered, 15 minutes. Pour stock through fine sieve into a bowl, pressing on and discarding solids.",
        "Cook onion and garlic in oil in a deep 12-inch heavy skillet over moderate heat, stirring, until well softened, 3 to 5 minutes. Add remaining chopped tentacles and cook, stirring, until they release their liquid, about 2 minutes. Add 1 1/2 cups tomato sauce, 3 cups fish stock, and sea salt and bring to a boil, stirring occasionally. (Leftover sauce and stock can be reserved for another use.) Stir in pasta and return to a boil, stirring. Remove from heat and let stand, covered, until pasta is cooked through, about 5 minutes.",
        "Toss squid strips with sea salt. Heat oil in a 12-inch nonstick skillet over high heat until hot but not smoking, then sauté garlic, stirring, until golden, about 1 minute. Add squid and parsley and cook, stirring, 30 seconds. (Squid will still be partially translucent but will continue to cook from residual heat.)",
        "Mound squid on top of pasta and serve immediately."
    ],
    "ingredients": [
        "1/2 small onion, chopped",
        "1 garlic clove, chopped",
        "1 tablespoon olive oil",
        "1 1/2 lb fresh tomatoes, coarsely chopped, or 1 (14- to 16-oz) can whole tomatoes with juice plus 1 cup water",
        "1/2 teaspoon fine sea salt",
        "1 1/2 lb cleaned large squid, rinsed well",
        "1/2 teaspoon fine sea salt",
        "1/4 cup extra-virgin olive oil",
        "2 garlic cloves, thinly sliced",
        "1/4 cup finely chopped fresh flat-leaf parsley",
        "1/2 small onion, finely chopped",
        "1 small leek (green part only), washed well and finely chopped",
        "1 garlic clove, finely chopped",
        "1 tablespoon olive oil",
        "1/2 lb bones and trimmings of any white fish such as sole, flounder, or whiting",
        "3 cups water",
        "1 cup dry white wine",
        "1/2 teaspoon fine sea salt",
        "1 medium onion, minced",
        "2 garlic cloves, minced",
        "2 tablespoons extra-virgin olive oil",
        "1/2 teaspoon fine sea salt, or to taste",
        "8 oz very thin fideos in nests (cabello de ángel), broken up, or capellini, broken into 2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Shellfish",
        "Tomato",
        "Appetizer",
        "Sauté",
        "Dinner",
        "Seafood",
        "Squid",
        "Winter",
        "Noodle",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Angel-Hair Pasta with Sauteed Squid",
    "url": "http://www.epicurious.com/recipes/food/views/angel-hair-pasta-with-sauteed-squid-106145"
}
