{
    "directions": [
        "Preheat the oven to 300 degrees F (150 degrees C). Lightly grease a 10x15 inch jellyroll pan with cooking spray. Line with parchment paper.",
        "In a medium bowl, whisk together 1/2 cup of superfine sugar, cake flour and salt. Set aside. In a separate bowl, whip egg whites until foamy. Add vanilla and cream of tartar, and continue to whip. Gradually sprinkle in the remaining superfine sugar while continuing to whip the egg whites to firm peaks. Sift the flour mixture over the egg whites and fold in by hand using a rubber spatula. Spread the batter evenly in the prepared pan.",
        "Bake for 20 minutes in the preheated oven, or until the center of the cake springs back when lightly pressed. Cool in the pan over a wire rack. Generously sift sugar over the top of the cake, and cover with a clean towel. Run a spatula around the outside of the cake in the pan to loosen, and turn out onto the towel. Remove the parchment paper from the back of the cake, then place it back on loosely. Roll up with the towel loosely from short end to short end, and allow to cool in the rolled position.",
        "In a saucepan over medium heat, combine 1 cup of white sugar, cranberries and water. Simmer until the cranberries burst, about 5 minutes. Whisk in the cornstarch, and simmer just until thick, about 2 minutes. Transfer to a bowl, cover and refrigerate.",
        "Unroll the cake so that it is sitting flat on the towel. Spread the cooled cranberry filling over the top, leaving 1/2 inch border. Use the towel to help you keep a grip on the cake for an even roll. Roll up from short end to short end and place seam side down onto a platter. Refrigerate until serving.",
        "Whip cream with confectioners' sugar until soft peaks form. Serve slices of cake with a dollop of sweetened whipped cream."
    ],
    "ingredients": [
        "1 1/8 cups castor sugar or superfine sugar, divided",
        "3/4 cup sifted cake flour",
        "1/4 teaspoon salt",
        "9 egg whites",
        "1 1/2 teaspoons vanilla extract",
        "3/4 teaspoon cream of tartar",
        "1/4 cup confectioners' sugar for dusting",
        "1 cup white sugar",
        "2 1/3 cups fresh or frozen cranberries",
        "6 tablespoons water",
        "2 tablespoons cornstarch",
        "1/2 cup heavy cream (optional)",
        "3 tablespoons confectioners' sugar (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Angel Food Roll with Cranberry Filling",
    "url": "http://allrecipes.com/recipe/78329/angel-food-roll-with-cranberry-fillin/"
}
