{
    "directions": [
        "Bring a large pot of lightly salted water to a boil over high heat. Add the angel hair pasta, and cook until al dente, 3 to 4 minutes; drain and keep warm.",
        "Heat the olive oil in a large skillet over medium-high heat. Add the sausage slices, and cook until lightly browned on both sides, about 2 minutes per side. Reduce the heat to medium, and stir in 2 tablespoons of butter along with the onion, garlic, bell pepper, stir-fry vegetables, salt, and pepper. Cook and stir until the sausage is no longer pink in the center, and the vegetables have softened, 10-12 minutes.",
        "Meanwhile, place the clams, mussels, and shrimp in a steamer over 1 inch of boiling water, and cover. Remove the shrimp once they turn pink, after about 3 minutes. Remove the clams and mussels as soon as they open, after 3 to 5 minutes all together. Discard any clams and mussels that do not open. Set the seafood aside and keep warm.",
        "Place the scallops into the skillet with the vegetable mixture, and gently cook until the scallops are no longer opaque in the center, about 3 minutes. Gently stir in the steamed seafood, parsley, and remaining 2 tablespoons of butter. Serve the seafood and vegetable mixture over a bed of angel hair pasta."
    ],
    "ingredients": [
        "1 (8 ounce) package angel hair pasta",
        "2 tablespoons extra-virgin olive oil",
        "2 (4 ounce) links sweet Italian sausage links, cut into 1/2 inch slices",
        "2 tablespoons butter",
        "1 small sweet onion, diced",
        "2 cloves garlic, minced",
        "1 orange bell pepper, diced",
        "1 (16 ounce) package frozen stir-fry vegetables, thawed",
        "1 tablespoon sea salt",
        "1 teaspoon ground black pepper",
        "15 middleneck clams, scrubbed",
        "1/2 pound mussels, scrubbed and debearded",
        "1/2 pound peeled and deveined medium shrimp",
        "1/2 pound bay scallops",
        "1 tablespoon dried parsley",
        "2 tablespoons butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Angel Hair de la Mer",
    "url": "http://allrecipes.com/recipe/165648/angel-hair-de-la-mer/"
}
