{
    "directions": [
        "Preheat an oven to 350°F (180°C).",
        "Sift the flour, confectioners’ sugar and salt together twice onto a sheet of parchment paper.",
        "In the bowl of an electric mixer fitted with the whisk attachment, beat the egg whites on medium speed until they start to foam. Add one-third of the superfine sugar and beat until the whites are opaque. Add another one-third of the sugar and the cream of tartar and continue beating until the whites start to increase in volume and become firm. Add the remaining sugar and the vanilla, increase the speed to high and beat just until the whites form very soft peaks. Do not overbeat.",
        "Remove the bowl from the mixer. Sift one-third of the flour mixture over the egg whites and carefully fold in with a rubber spatula. Sift and fold in the remaining flour mixture in 2 more additions.",
        "Pour the batter into an ungreased angel food cake pan 10 inches (25 cm) in diameter and 4 inches (10 cm) deep. Smooth the top. Bake until the top of the cake is lightly browned and feels springy when touched, and a skewer inserted into the center comes out clean, 40 to 45 minutes.",
        "Immediately invert the cake onto a countertop if the pan has feet or, if it does not, over the neck of a wine bottle. Let cool completely. Tap the pan on the countertop to release the cake, then invert it onto a serving plate. If necessary, run a thin knife around the sides of the pan and around the tube.",
        "When ready to serve, preheat the oven to 375°F (190°C).",
        "In a fry pan over medium heat, stir together the brown sugar and 1/4 cup (2 fl. oz./60 ml) of the reserved grapefruit juice. Cook, stirring, until the mixture thickens and caramelizes, about 10 minutes. Add the grapefruit segments and gently stir to coat with the syrup. Set aside.",
        "Meanwhile, cut the cake into about 16 slices and place on a rimmed baking sheet. Toast in the oven, turning occasionally, until golden brown, 6 to 10 minutes. Place slices of the cake on individual plates. Spoon the grapefruit and syrup alongside and over the cake and serve immediately. Serves 8 to 10.",
        "Adapted from Williams-Sonoma",
        "Dessert of the Day,",
        "by Kim Laidlaw (Weldon Owen, 2013)."
    ],
    "ingredients": [
        "1 cup (4 oz./125 g) cake flour",
        "1 cup (4 oz./125 g) confectioners’ sugar",
        "1/4 tsp. kosher salt",
        "12 egg whites",
        "3/4 cup (5 1/2 oz./170 g) superfine sugar",
        "1 1/2 tsp. cream of tartar",
        "1 1/2 tsp. vanilla extract",
        "1/3 cup (2 1/2 oz./75 g) firmly packed light brown sugar",
        "3 grapefruit, peeled and segmented, juices reserved"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Toasted Angel Food Cake with Caramelized Grapefruit",
    "url": "http://www.williams-sonoma.com/recipe/angel-food-cake-with-grapefruit.html"
}
