{
    "directions": [
        "Melt 1 tablespoon butter with 1 tablespoon oil in heavy large skillet over medium-high heat. Add both bell peppers, jalapeño and minced garlic; sauté until peppers are almost tender, about 5 minutes. Add tomatoes, clam juice, 1/3 cup cilantro, wine, water, lemon juice and dried red pepper. Bring to boil. Reduce heat; simmer until flavors blend, about 5 minutes. Season with salt and pepper.",
        "Mix flour and garlic powder in shallow bowl. Season tuna with salt and pepper. Coat with flour mixture, shaking off excess. Melt remaining 1 tablespoon butter with 1 tablespoon oil in another heavy large skillet over high heat. Add tuna to skillet and sauté until just opaque on the outside, about 2 minutes per side. Bring sauce to simmer over medium heat. Add tuna; cook until opaque in center, about 2 minutes.",
        "Meanwhile, cook pasta in large pot of boiling salted water until just tender but still firm to bite. Drain pasta. Divide among 4 plates. Place tuna atop pasta. Spoon sauce over. Sprinkle with Parmesan and cilantro and serve."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter",
        "2 tablespoons olive oil",
        "1/2 red bell pepper, seeded, chopped",
        "1/2 green bell pepper, seeded, chopped",
        "1 tablespoon minced jalapeño chili",
        "2 garlic cloves, minced",
        "1 1/2 drained canned diced tomatoes",
        "1/2 cup bottled clam juice",
        "1/3 cup chopped fresh cilantro",
        "1/2 cup dry white wine",
        "1/4 cup water",
        "3 tablespoons fresh lemon juice",
        "1/4 teaspoon crushed dried red pepper",
        "1/2 cup all purpose flour",
        "1/2 teaspoon garlic powder",
        "4 6- to 8-ounce tuna steaks",
        "12 ounces angel hair pasta",
        "1/4 cup freshly grated Parmesan cheese",
        "Additional chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Sauté",
        "Valentine's Day",
        "Tuna",
        "Fall"
    ],
    "title": "Angel Hair Pasta with Tuna and Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/angel-hair-pasta-with-tuna-and-tomato-sauce-852"
}
