{
    "directions": [
        "In a small pan over high heat, toast pumpkin seeds, stirring constantly, until lightly brown, 1 to 2 minutes. In a food processor, puree raisins and 1/4 cup water 1 minute. In a large pan over medium heat, heat 1 tablespoon oil. Add onion; cook until translucent, 5 minutes. Stir in raisin puree, cherries, chipotle, 1 teaspoons garlic and cumin; cook 1 minute. Add Grand Marnier and cook, stirring, until alcohol is cooked out, 1 to 2 minutes. Add broth and bring to a boil, then reduce heat and simmer. In a bowl, dissolve cornstarch in 1 tablespoons cold water. Gradually add cornstarch mixture to broth mixture to thicken; reduce heat and simmer 7 to 10 minutes. Add shrimp; cook until pale white, 5 minutes. Stir in zest; season with salt and pepper. Transfer to a bowl and set aside. In pan, heat remaining 1 tablespoons oil. Cook kale and 3 teaspoons garlic, stirring, until kale starts to wilt, 3 to 5 minutes. Strain juices and combine with rice. Divide rice mixture, shrimp and seeds among 6 plates."
    ],
    "ingredients": [
        "2 tablespoons pumpkin seeds",
        "1/2 cup golden raisins",
        "2 tablespoons olive oil, divided",
        "3/4 cup diced white onion",
        "1/4 cup dried cherries, chopped",
        "2 teaspoons chipotle powder",
        "4 teaspoons chopped garlic, divided",
        "1/2 teaspoons ground cumin",
        "1/2 cup Grand Marnier orange liqueur",
        "20 ounces low-sodium vegetable broth",
        "1 tablespoon cornstarch",
        "2 pounds medium-large shrimp, peeled and deveined, thawed if frozen",
        "1 tablespoon orange zest",
        "6 cups kale, stems removed, chopped",
        "3 cups cooked brown rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "Leafy Green",
        "Sauté",
        "Dinner",
        "Shrimp",
        "Kale",
        "Self"
    ],
    "title": "Angry Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/angry-shrimp-51219630"
}
