{
    "directions": [
        "Combine the Wondra flour, chili powder, cayenne, and salt in a plastic bag. Set aside.",
        "Cut the live lobsters in half. Remove the claws and break the claws open to expose as much meat as possible. Remove the meat from the lobsters and place it into the seasoned flour. Shake to coat well. Remove the lobster from the flour and shake off any excess.",
        "Preheat the oven to 475 degrees.",
        "Heat the oil in a large sauté pan over high heat until smoking. Add the lobster pieces, cut side down, a few at a time, if necessary, and sear them for about 4 minutes, or until they are golden brown. Transfer the lobster to a baking sheet, and when all of the lobster is seared, place the baking sheet in the preheated oven and bake for 10 minutes.",
        "While the lobster is baking, prepare the sauce. Return the sauté pan to medium heat and add the garlic and red pepper flakes. Sauté for about 3 minutes, or until the garlic is golden brown but not burning. Add the stock and bring to a boil. Lower the heat and simmer for 5 minutes. Whisk in the butter and remove the pan from the heat. Whisk in the lemon juice, basil leaves, and the tomato julienne. Season with salt and pepper to taste.",
        "Remove the lobster from the oven. Place a mound of Lemon Rice in the center of each of six plates. Place equal portions of the lobster over the rice. Spoon the sauce over the top of each mound and garnish with Fried Basil.",
        "Serve immediately.",
        "Heat the oil in a medium saucepan over medium heat. Add the onions and allow them to sweat their liquid for 4 minutes. Add the garlic and sweat for an additional 3 minutes. Stir in the rice and sauté it for 1 minute. Add the stock (or water), lemon juice, salt, and pepper.",
        "Raise the heat and bring the stock to a boil. Boil for about 15 minutes, or until the liquid has reduced to about 1 1/2 cups. Lower the heat and tightly cover the rice. (If you don't have a tight-fitting lid, cover the rice with aluminum foil.) Simmer for 30 minutes, or until the rice has absorbed all of the liquid. Remove the pan from the heat and allow the rice to steam for 15 minutes. Do not uncover the pan. When ready to serve, fluff the rice with a fork.",
        "If using the zucchini, while the rice is resting heat the optional 2 tablespoons of olive oil in a large sauté pan over medium-high heat. Add the zucchini and sauté for 4 minutes, or just until slightly softened. Season with salt and pepper to taste. When ready to serve the rice, add the zucchini and fluff it into the rice.",
        "Heat the oil to 350 degrees on a candy thermometer in a large saucepan over high heat.",
        "Standing as far back from the pot as possible and wearing an oven mitt, drop the basil leaves into the hot oil. The oil may bubble and splatter. Fry for about 1 minute, or until the leaves are crisp. Using a slotted spoon, transfer the leaves to a double layer of paper towels to drain."
    ],
    "ingredients": [
        "2 cups Wondra flour",
        "1/4 cup chili powder",
        "2 tablespoons cayenne pepper",
        "2 tablespoons coarse salt plus more to taste",
        "3 2-pound live lobsters",
        "1 cup peanut oil",
        "8 cloves garlic, minced",
        "1 tablespoon hot red pepper flakes",
        "1 cup lobster or chicken stock",
        "2 tablespoons unsalted butter",
        "1 tablespoon fresh lemon juice",
        "1/2 loosely packed cup fresh basil leaves",
        "1/2 cup julienned Oven-Dried Tomatoes",
        "Freshly ground black pepper",
        "Lemon Rice (recipe follows)",
        "Fried Basil (recipe follows)",
        "1 1/2 tablespoons olive oil plus 2 optional tablespoons",
        "1/2 cup finely diced onions",
        "1 clove garlic, minced",
        "3 cups converted rice",
        "4 cups chicken stock or water",
        "1 cup fresh lemon juice",
        "1 1/2 teaspoons coarse salt plus more to taste",
        "1/4 teaspoon freshly ground black pepper plus more to taste",
        "1 large zucchini, trimmed, seeded, and diced, optional",
        "4 cups vegetable oil",
        "1 large bunch fresh basil, leaves only, well washed and dried"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Bake",
        "Fry",
        "Dinner",
        "Lemon",
        "Basil",
        "Lobster",
        "Candy Thermometer",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Angry Lobster with Lemon Rice and Crispy Basil",
    "url": "http://www.epicurious.com/recipes/food/views/angry-lobster-with-lemon-rice-and-crispy-basil-355916"
}
