{
    "directions": [
        "Pulse oats in a food processor until coarsely ground. Add flour, baking powder and soda, sugar, and 1/2 teaspoon salt, then pulse to mix well. Add butter and pulse until mixture resembles coarse meal. Add buttermilk and pulse until dough just forms a ball. Divide dough into quarters and cover with a kitchen towel.",
        "Preheat oven to 350°F.",
        "Roll out 1 piece of dough on a floured surface with a floured rolling pin into a 10 1/2- by 8 1/2-inch rectangle. Brush lightly with beaten egg and sprinkle evenly with 1/2 teaspoon salt and 1 teaspoon anise seeds. Gently roll pin lightly over seeds to help them adhere.",
        "Trim dough (to a 10- by 8-inch rectangle) with a fluted pastry wheel or sharp knife. Cut lengthwise in half, then crosswise into sixths for a total of 12 strips (4 by 1 2/3 inches). Arrange strips 1/2inch apart on a buttered baking sheet and make more in same manner, using another buttered baking sheet for last 2 batches.",
        "Bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until glaze is golden brown and flatbreads are crisp, 15 to 20 minutes total. Transfer to racks to cool."
    ],
    "ingredients": [
        "1 cup old-fashioned or quick-cooking rolled oats",
        "2 cups all-purpose flour",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "2 teaspoons sugar",
        "2 1/2 teaspoons fine sea salt",
        "1 stick (1/2 cup) cold unsalted butter, cut into pieces",
        "2/3 cup well-shaken buttermilk",
        "1 large egg, lightly beaten",
        "4 teaspoons anise seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Bake",
        "Cocktail Party",
        "Easter",
        "Oat",
        "Spring",
        "Anise",
        "Gourmet"
    ],
    "title": "Anise Seed Flatbreads",
    "url": "http://www.epicurious.com/recipes/food/views/anise-seed-flatbreads-104917"
}
