{
    "directions": [
        "Bring 1/2 cup cream and 1/2 cup half and half to simmer in heavy medium saucepan. Whisk sugar and yolks in medium bowl to blend. Whisk in hot cream mixture. Return mixture to saucepan; stir over medium-low heat until custard thickens and leaves path on back of spoon when finger is drawn across, about 4 minutes, do not boil. Strain into bowl. Mix in wine and 1 cup cream. Chill custard until cold.",
        "Process custard in ice cream maker according to manufacturer's instructions. Transfer to covered container (ice cream will be soft) and freeze. (Can be prepared 1 week ahead.)",
        "Preheat oven to 325°F. Lightly butter and flour heavy large nonstick baking sheet. Whisk first 6 ingredients in medium bowl. Whisk in egg whites and flour.",
        "Drop slightly rounded tablespoon of batter onto center of half of prepared baking sheet. Drop another slightly rounded tablespoon of batter onto center of second half of prepared baking sheet. Using back of spoon, spread each mound of batter to 6-inch round. Bake cookies until brown on edges (centers will be slightly pale), about 8 minutes.",
        "Working quickly and using metal spatula, lift 1 cookie off sheet. Immediately turn cookie over onto inverted custard cup. Gently flatten cookie on cup bottom; crimp sides of cookie. Repeat with second cookie. Remove cookies from cups. Rinse baking sheet under cold water; wipe sheet dry. Repeat process with remaining batter, first rinsing and drying, then buttering and flouring baking sheet between batches. (Cookies can be prepared 3 days ahead. Store in airtight container at room temperature.)",
        "Place cookie baskets on plates. Fill each with 3 small scoops of ice cream.",
        "Top with fruit and mint leaves."
    ],
    "ingredients": [
        "1 1/2 cups cream",
        "1/2 cup half and half",
        "2/3 cup sugar",
        "4 large egg yolks",
        "1 cup late harvest Riesling wine",
        "1/4 cup sugar",
        "3 tablespoons unsalted butter, room temperature",
        "2 tablespoons powdered sugar",
        "1 teaspoon finely chopped aniseed",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon grated orange peel",
        "3 tablespoons egg whites",
        "1/4 cup all purpose flour",
        "1 1-pint basket strawberries, stemmed, quartered",
        "1 cup small pineapple wedges",
        "1 kiwi fruit, peeled, cut into wedges",
        "Fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Milk/Cream",
        "Ice Cream Machine",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Frozen Dessert",
        "Strawberry",
        "Kiwi",
        "Pineapple",
        "White Wine",
        "Summer",
        "Winter",
        "Anise"
    ],
    "title": "Anise Cookie Baskets with Riesling Ice Cream and Fresh Fruit",
    "url": "http://www.epicurious.com/recipes/food/views/anise-cookie-baskets-with-riesling-ice-cream-and-fresh-fruit-1150"
}
