{
    "directions": [
        "Purée figs and dates with water and 2 tablespoons granulated sugar in a blender or food processor until almost smooth.",
        "Whisk together flour, anise, baking powder and soda, and salt in a bowl. Beat together butter, cream cheese, and remaining 1/2 cup granulated sugar in a large bowl with an electric mixer at moderate speed until pale and fluffy, about 3 minutes. Beat in vanilla and yolk until combined well. Add flour mixture and mix at low speed until just combined.",
        "Halve dough and form each half into a rectangle. Chill, wrapped in plastic wrap, until firm, about 1 hour.",
        "Roll out 1 piece of dough between 2 sheets of wax paper into a 9- by 7-inch rectangle, about 1/3 inch thick. Remove top sheet of wax paper and drop half of fig mixture by spoonfuls onto dough, then gently spread in an even layer, leaving a 1/4-inch border around edges. Starting with a long side and using wax paper as an aid, roll up dough jelly-roll style into a log. Roll log in raw sugar to coat completely. Make another log in same manner. Chill logs, wrapped in wax paper, until firm, at least 4 hours.",
        "Preheat oven to 350°F.",
        "Cut logs crosswise into 1/3-inch-thick slices and arrange slices about 2 inches apart on lightly buttered baking sheets. Bake in batches in middle of oven until pale golden, 15 to 17 minutes, then transfer to racks to cool."
    ],
    "ingredients": [
        "1 cup packed soft dried figs (8 oz), stemmed and coarsely chopped",
        "1 cup packed pitted dates (7 oz), trimmed and coarsely chopped",
        "1/3 cup water",
        "1/2 cup plus 2 tablespoons granulated sugar",
        "1 3/4 cups all-purpose flour",
        "2 teaspoons anise seeds, ground in an electric coffee/spice grinder",
        "1/4 teaspoon baking powder",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter, softened",
        "4 oz cream cheese at room temperature",
        "1 teaspoon vanilla",
        "1 large egg yolk",
        "1/4 cup granulated raw sugar such as turbinado or Demerara"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Fruit",
        "Bake",
        "Date",
        "Fig",
        "Edible Gift",
        "Anise",
        "Gourmet"
    ],
    "title": "Anise-Scented Fig and Date Swirls",
    "url": "http://www.epicurious.com/recipes/food/views/anise-scented-fig-and-date-swirls-105930"
}
