{
    "directions": [
        "Soak anise seeds in boiling-hot water until most of water is absorbed, about 15 minutes.",
        "Whisk together flour, baking soda, and salt in a bowl.",
        "Beat together butter and sugar in a large bowl with an electric mixer at medium-high speed until pale and fluffy, about 2 minutes in a stand mixer (preferably fitted with paddle attachment) or 4 minutes with a handheld. Beat in 1 egg and anise seeds with any remaining soaking liquid until combined. Reduce speed to low, then mix in flour mixture until just combined.",
        "Divide dough into 4 balls and flatten each into a 4-inch disk. Chill disks, wrapped in plastic wrap, until firm, about 3 hours.",
        "Put oven racks in upper and lower thirds of oven and preheat oven to 350°F.",
        "While oven preheats, roll out 1 piece of dough (keep remaining dough chilled) on a well-floured surface with a well-floured rolling pin into a 7-inch round (slightly less than 1/4 inch thick; if dough becomes too soft to roll out, chill on a baking sheet until firm). Cut out as many cookies as possible from dough with cutter and transfer to 2 ungreased large baking sheets, arranging cookies about 1 inch apart. Beat remaining egg in a small bowl with 1 tablespoon water to make an egg wash. Brush each cookie lightly with egg wash, then sprinkle with some of sesame seeds.",
        "Bake cookies, switching position of sheets halfway through baking, until bottoms are golden, 10 to 12 minutes total, then transfer with a metal spatula to racks to cool completely.",
        "Gather scraps and chill until firm enough to reroll. Make more cookies with remaining dough, scraps (reroll only once), and sesame seeds, then bake on cooled sheets."
    ],
    "ingredients": [
        "1 tablespoon whole anise seeds",
        "2 tablespoons boiling-hot water",
        "2 cups all-purpose flour",
        "1/8 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "2/3 cup sugar",
        "2 large eggs",
        "1/4 cup sesame seeds, lightly toasted",
        "Special equipment: a 2 1/2-inch fluted round cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Quick & Easy",
        "Fall",
        "Winter",
        "Edible Gift",
        "Anise",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Anise Sesame Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/anise-sesame-cookies-231209"
}
