{
    "directions": [
        "To make the kugel, in the bowl of a food processor fitted with the metal blade, whirl together the eggs. Add the cottage cheese, sour cream, and sugar. Process until smooth. Pour into a large bowl and stir in the milk, raisins, melted butter, vanilla, and orange and lemon zests.",
        "In a large pot, bring at least 5 quarts of water to a boil over high heat, salt, and cook the noodles until just before they are fully cooked, about 5 minutes, but check package directions for exact timing. Drain and stir the noodles into the egg-cheese mixture, then refrigerate, tightly covered, overnight. (I think this step of preparing ahead was mainly for convenience. I have baked the pudding immediately, and it turns out lighter; the noodles don't absorb as much of the custard.",
        "Lightly butter a 9- by 13-inch baking dish. Preheat the oven to 350° F.",
        "To make the topping, toss together the corn flakes, melted butter, and cinnamon in a small bowl. To bake the kugel, pour the noodle mixture into the baking dish and sprinkle evenly with the topping. Bake for 35 to 40 minutes, until lightly browned. Let stand at least 10 minutes before serving."
    ],
    "ingredients": [
        "6 eggs",
        "1 1/2 cups 4-percent-fat cottage cheese (small or large curd, or California-style)",
        "1 cup plus 2 tablespoons sour cream",
        "3/4 cup sugar",
        "2 1/4 cups whole milk",
        "3/4 cup raisins",
        "6 tablespoons butter, melted",
        "2 1/4 teaspoons vanilla extract",
        "1 teaspoon grated orange zest",
        "1 teaspoon grated lemon zest",
        "1 tablespoon salt",
        "18 ounces wide, preferably flat egg noodles",
        "1 cup coarsely crushed corn flakes",
        "2 tablespoons butter, melted",
        "2 teaspoons ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Dessert",
        "Bake",
        "Birthday",
        "Kosher",
        "Shavuot",
        "Noodle",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Anne Whiteman's Birthday Kugel",
    "url": "http://www.epicurious.com/recipes/food/views/anne-whitemans-birthday-kugel-350156"
}
