{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). (If using a countertop induction oven, preheat to 325 degrees F.) Grease 12 pumpkin-shaped cupcake molds (silicon molds work well).",
        "Sift 2 cups cake flour, cinnamon, baking soda, baking powder, and salt together in a bowl. Mix in sugar, oil, and eggs until combined. Stir carrots and pineapple into the batter.",
        "Place 1 tablespoon cake flour in a bowl. Toss walnuts and chocolate chips in flour until coated; fold into batter.",
        "Pour batter into cupcake molds to about two-thirds full; gently tap molds onto work surface to remove air bubbles.",
        "Bake in preheated oven (or countertop induction oven) until a toothpick inserted into the center of a cupcake comes out clean, 20 to 25 minutes (or 15 to 20 minutes in the countertop induction oven). Cool to room temperature, 15 to 20 minutes; remove from molds.",
        "Combine butter, cream cheese, and vanilla extract in a bowl; beat with an electric mixer until well blended, 4 to 6 minutes. Mix in confectioners' sugar on low speed, 1/2 cup at a time, until frosting is smooth and spreadable. Add lemon juice and orange food coloring; stir until combined. Refrigerate until set, 15 to 20 minutes.",
        "Frost cupcakes with the cream cheese frosting; decorate with black decorating gel."
    ],
    "ingredients": [
        "Cupcakes:",
        "2 cups cake flour",
        "2 teaspoons ground cinnamon",
        "1 1/2 teaspoons baking soda",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "2 cups white sugar",
        "1 1/2 cups vegetable oil",
        "4 eggs",
        "2 cups grated carrots",
        "1 (8 ounce) can crushed pineapple, drained",
        "1 tablespoon cake flour",
        "1/2 cup chopped walnuts",
        "1/2 cup semisweet chocolate chips",
        "Frosting:",
        "1/2 cup butter",
        "1 (8 ounce) package cream cheese, softened",
        "1 tablespoon vanilla extract",
        "2 cups confectioners' sugar, or more as needed",
        "1 tablespoon lemon juice",
        "3 drops orange food coloring",
        "1 (1.5 ounce) tube black decorating gel"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ann's Chocolate Chip Carrot Cake Pumpkins",
    "url": "http://allrecipes.com/recipe/255324/anns-chocolate-chip-carrot-cake-pump/"
}
