{
    "directions": [
        "Preheat the oven to 450˚F.",
        "Rub the bird inside and out with salt and crushed peppercorns. Stuff a 1/2-tablespoon knob of butter under the skin of each side of the breast, and under the skin of each thigh. Stuff the thyme, bay leaf, and lemon wedges into the chicken’s cavity.",
        "Use the tip of a paring knife to poke a small hole in the skin just below each of the chicken’s legs, and tuck each leg carefully into that hole. (You may also truss the chicken with butcher’s twine if you know how, but this is much simpler.)",
        "Place the chicken in a flame-proof roasting pan and roast for 30 to 40 minutes, rotating the pan, moving it to different parts of the oven to account for hot spots, and basting the bird two or three times with a bulb-top baster or long-handled metal spoon. Reduce the oven’s heat to 300˚F and continue to roast, basting frequently, for another 30 to 40 minutes or until the bird is done: When you poke the fat part of the thigh with the paring knife, the juices should run clear.",
        "Remove the bird from the oven, let it rest 15 minutes, then remove the breasts and legs from the carcass, reserving everything. Use a ladle to skim off and discard as much surface fat from the pan juices as possible. Place the roasting pan on the stovetop over high heat and stir in the wine and lemon juice, scraping the bottom of the pan with a wooden spoon to dislodge and dissolve the browned bits. Bring this mixture to a boil and cook until it is reduced by half. Stir in the stock with the wooden spoon, bring to a boil, and reduce again by half. Remove from the heat and strain this sauce through a sieve into a medium, heavy-bottom saucepan over medium heat. Whisk in the remaining 2 tablespoons butter, a tablespoon at a time, until the sauce is thick and glossy. Fold in the parsley and adjust the seasoning with salt and pepper as necessary.",
        "Serve the chicken—half of the breast plus a drumstick or a thigh per person—with the sauce ladled over, and any remaining sauce in a sauceboat on the table."
    ],
    "ingredients": [
        "1 best-quality chicken (about 2 1/2 pounds), preferably organic",
        "Sea salt to taste",
        "Crushed black peppercorns to taste",
        "4 tablespoons (1/2 stick) unsalted butter",
        "10 sprigs fresh thyme",
        "1 fresh bay leaf",
        "1/2 lemon, cut into 4 wedges",
        "1 cup dry white wine",
        "Juice of 1 lemon (about 2 tablespoons)",
        "1 1/2 cups chicken stock",
        "1/4 cup finely chopped fresh parsley",
        "Freshly ground black pepper to taste",
        "Butcher’s twine (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Anthony Bourdain",
        "Dinner",
        "Chicken",
        "Roast",
        "Thyme",
        "Lemon",
        "Butter",
        "Parsley",
        "Wheat/Gluten-Free"
    ],
    "title": "Roast Chicken With Lemon and Butter",
    "url": "http://www.epicurious.com/recipes/food/views/anthony-bourdain-roast-chicken-with-lemon-and-butter"
}
