{
    "directions": [
        "Blend first 4 ingredients in processor 5 seconds. Add butter and blend, using on/off turns, until coarse meal forms. Add 1/4 cup ice water. Blend until dough comes together in moist clumps, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball. Divide in half. Shape into disks. Wrap in plastic and chill 1 hour.",
        "Position rack in bottom third of oven and preheat to 375°F. Mix cherries and whisky in small bowl. Let stand 30 minutes, stirring occasionally. Stir apples, sugar, and cinnamon in large bowl. Fold in cherry mixture.",
        "Roll out 1 dough disk on lightly floured surface to 13-inch round. Transfer to 9-inch-diameter glass pie dish. Mound filling in crust (filling will be high). Roll out remaining dough disk to 13-inch round and drape over pie. Fold top and bottom overhangs together to seal. Crimp edge of crust decoratively. Brush glaze over top of crust, but not crust edge. Cut several small slits in top crust.",
        "Bake pie 10 minutes. Cover crust edge with foil and bake until apples are tender, about 50 minutes longer. Cool pie 30 minutes. Serve warm or at room temperature with cream or vanilla ice cream."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "3/4 cup powdered sugar",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "1/4 cup (or more) ice water",
        "1 cup dried tart cherries",
        "2 tablespoons Scotch whisky",
        "3 to 3 1/2 pounds medium-size Golden Delicious apples (about 8), peeled, halved, cored, thinly sliced",
        "1/2 cup (packed) golden brown sugar",
        "2 teaspoons ground cinnamon",
        "1 tablespoon whipping cream beaten with 1 tablespoon sugar (for glaze)",
        "Heavy cream or vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Dessert",
        "Bake",
        "Apple",
        "Cherry",
        "Whiskey",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Pie with Whisky-Soaked Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/apple-pie-with-whisky-soaked-cherries-232899"
}
