{
    "directions": [
        "Mix flour, granulated sugar, oats, brown sugar, vanilla, baking powder, cinnamon, salt, and nutmeg in a large bowl. Add butter and mix with your hands until mixture feels like damp sand and clumps form. Add almonds and mix with a wooden spoon until evenly distributed and large, walnut-sized clumps form. Freeze 30 minutes.",
        "Toss apples, cranberries, granulated sugar, flour, orange zest and juice, cinnamon, salt, and nutmeg in a large bowl. Let stand 10 minutes.",
        "Meanwhile, preheat oven to 350°F. Place baking dish on a foil-lined rimmed baking sheet (if using a Dutch oven, you don't need the baking sheet).",
        "Toss apple mixture again, then transfer to baking dish, leaving some juices behind. Break crumble into smaller pieces, leaving some larger clumps. Top apples with crumble, mounding slightly if needed.",
        "Bake apple crisp until crumble is golden brown and filling is bubbling through in the center, about 1 hour. Transfer baking dish to a wire rack and let cool 10 minutes. Serve warm with whipped cream or ice cream topped with almonds.",
        "Crumble can be made 1 week ahead; cover and freeze. Crisp can be assembled 1 day ahead; cover and chill."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "1 cup granulated sugar",
        "1 cup old-fashioned oats",
        "1/2 cup (packed) light brown sugar",
        "1 teaspoon vanilla extract",
        "3/4 teaspoon baking powder",
        "3/4 teaspoon ground cinnamon",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon freshly grated nutmeg",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into pieces, room temperature",
        "1/2 cup sliced almonds",
        "7 1/2 pounds baking apples (such as Honeycrisp, Braeburn, and/or Golden Delicious; about 16), peeled, cored, cut into 1/8\" slices",
        "1 1/4 cups fresh or frozen cranberries, thawed if frozen",
        "1 cup granulated sugar",
        "1/2 cup all-purpose flour",
        "1/2 teaspoon finely grated orange zest",
        "2 tablespoons fresh orange juice",
        "1 teaspoon ground cinnamon",
        "3/4 teaspoon kosher salt",
        "1/2 teaspoon freshly grated nutmeg",
        "Sweetened whipped cream or vanilla ice cream and toasted almonds (for serving)",
        "A 4-quart baking dish, braising pan, or Dutch oven (at least 12\" in diameter and 2 1/2\" deep)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Thanksgiving",
        "Apple",
        "Cranberry",
        "Potluck",
        "Bake",
        "Oat",
        "Almond",
        "Cobbler/Crumble"
    ],
    "title": "Apple-Cranberry Crisp With Oatmeal-Cookie Crumble",
    "url": "http://www.epicurious.com/recipes/food/views/apple-cranberry-crisp-with-oatmeal-cookie-crumble"
}
