{
    "directions": [
        "Blend flour, sugar, and salt in processor 5 seconds. Add butter. Using on/off turns, cut in until very coarse meal forms. Add 3 tablespoons ice water. Blend until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic wrap and chill 1 hour. DO AHEAD: Dough can be made 1 day ahead. Keep chilled. Soften briefly at room temperature before rolling.",
        "Preheat oven to 375°F. Roll out dough on lightly floured surface to 12- to 13-inch round. Transfer dough to 9-inch-diameter tart pan with removable bottom. Cut off all but 1/2 inch of overhang and fold in, pressing sides of dough to come 1/4 to 1/3 inch higher than pan sides. Freeze crust until firm, about 10 minutes.",
        "Line crust with foil and dried beans or pie weights. Bake until sides are set, about 25 minutes. Remove foil and beans. Continue to bake until crust is pale golden, piercing with fork if crust bubbles, 12 to 15 minutes longer. Cool 30 minutes. Reduce oven temperature to 350°F.",
        "Scatter breadcrumbs on small rimmed baking sheet. Bake until dry and crisp, about 10 minutes. Set aside.",
        "Combine golden syrup, eggs, whipping cream, lemon peel, molasses, and salt in large bowl; whisk to blend. Stir in apples and breadcrumbs. Pour filling into crust.",
        "Bake tart until filling is set in center and cracks appear at edges, about 55 minutes. Cool in pan on rack.",
        "Stir crème fraîhe, sugar, and Calvados in small bowl to blend well. Cover mixture and refrigerate until ready to use, up to 3 hours.",
        "Gently push up tart pan bottom to release tart. Serve tart slightly warm or at room temperature with a dollop of Calvados crème fraîche."
    ],
    "ingredients": [
        "1 1/4 cups all purpose flour",
        "1/2 teaspoon sugar",
        "1/4 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "3 tablespoons (or more) ice water, divided",
        "3/4 cup plus 2 tablespoons fresh breadcrumbs made from crustless whole wheat bread",
        "1 1/4 cups golden syrup*",
        "2 large eggs",
        "2 tablespoons heavy whipping cream",
        "1 tablespoon finely grated lemon peel",
        "1 tablespoon light (mild-flavored) molasses",
        "Large pinch of salt",
        "1 1/2 cups coarsely grated peeled tart apples (such as Granny Smith)",
        "1 8-ounce container crème fraîhe**",
        "2 tablespoons sugar",
        "1 tablespoon Calvados (apple brandy)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Fruit",
        "Dessert",
        "Vegetarian",
        "Condiment",
        "Apple",
        "Spirit",
        "Brandy",
        "Fall",
        "Molasses",
        "Calvados",
        "Breadcrumbs",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Treacle Tart",
    "url": "http://www.epicurious.com/recipes/food/views/apple-treacle-tart-358596"
}
