{
    "directions": [
        "Peel, core, and quarter apples.",
        "In a well-seasoned 10 1/4 by 2-inch cast-iron skillet or a 10- by 2-inch non-stick skillet melt butter over moderately low heat just until melted (butter should not separate). Stir in sugar until combined well. Arrange apple quarters decoratively, cut sides up, in skillet and sprinkle walnuts evenly in between apples. Cook mixture, undisturbed, 25 to 35 minutes, or until apples are tender in centers and sugar is a golden caramel.",
        "Preheat oven to 375°F.",
        "Peel apple and chop fine.",
        "In a bowl whisk together flour, baking powder, salt and cinnamon.",
        "In another bowl with an electric mixer beat butter and sugar until light and fluffy. Beat in vanilla and ginger and add eggs, 1 at a time, beating well after each addition. Beat in sour cream and with mixer on low speed beat in flour mixture gradually until just combined. Fold chopped apple into batter.",
        "Remove skillet from heat and spoon batter evenly over topping. With a metal spatula spread batter (being careful not to disturb topping), leaving a 1/4-inch border of cooked apples uncovered. If using a non-stick skillet with a plastic handle, wrap handle in a double thickness of foil. Put skillet in a shallow baking pan and bake cake in middle of oven 25 to 35 minutes, or until a tester comes out with crumbs adhering and cake is golden brown. Cool cake in skillet on a rack 10 minutes. Run a thin knife around edge of skillet and carefully invert cake onto a plate.",
        "Serve cake warm or at room temperature with caramel sauce and whipped cream.",
        "In a dry heavy saucepan (about 2 quarts) cook sugar over moderate heat, stirring with a fork, until melted and cook without stirring, swirling pan, until a golden caramel. Remove pan from heat and carefully add water and brandy down side of pan (caramel will bubble and steam). Return pan to heat and simmer, stirring, until caramel is dissolved. Stir in butter. Sauce may be made 3 days ahead and chilled, covered. Reheat sauce to warm before serving.",
        "Makes about 1 1/4 cups."
    ],
    "ingredients": [
        "3 to 3 1/2 Golden Delicious apples (about 1 1/2 pounds)",
        "1 1/2 sticks (3/4 cup) unsalted butter",
        "2/3 cup sugar",
        "1/2 cup coarsely chopped walnuts",
        "1/2 Golden Delicious apple",
        "1 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "3/4 teaspoon salt",
        "1/2 teaspoon cinnamon",
        "1 stick (1/2 cup), unsalted butter, softened",
        "2/3 cup sugar",
        "1 teaspoon vanilla extract",
        "2 tablespoons minced peeled fresh ginger",
        "2 large eggs",
        "1/2 cup sour cream",
        "1 1/2 cups sugar",
        "1/2 cup water",
        "3 tablespoons Calvados or other apple brandy",
        "2 tablespoons unsalted butter",
        "whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Apple",
        "Walnut",
        "Spirit",
        "Chill",
        "Gourmet"
    ],
    "title": "Apple Walnut Upside-Down Cake with Calvados Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/apple-walnut-upside-down-cake-with-calvados-caramel-sauce-13278"
}
