{
    "directions": [
        "Combine cranberries, sugar, water and kirsch in heavy medium saucepan. Bring to boil, stirring until sugar dissolves. Reduce heat to medium and cook until most of berries burst, about 10 minutes. Cool slightly. Transfer to processor and puree. (Can be prepared 1 day ahead. Cover and refrigerate. Rewarm over low heat before serving.)",
        "Combine raisins and kirsch in small bowl. Let stand 1 hour.",
        "Preheat oven to 375°F. Combine apples, 1/2 cup crumbs, 1/2 cup plus 2 tablespoons sugar and raisin mixture bowl.",
        "Brush large baking sheet with some of melted butter. Place 1 phyllo sheet on work surface with 1 long side parallel to edge of work surface (cover remaining phyllo with plastic and damp towel). Brush phyllo with melted butter. Sprinkle 1 teaspoon gingersnap crumbs over. Top with second phyllo sheet. Brush with butter; sprinkle with 1 teaspoon gingersnap crumbs. Repeat with remaining phyllo sheet, melted butter and gingersnap crumbs. Spoon apple mixture in 3-inch-wide log along 1 long side of phyllo, leaving 2-inch border at long and short edges. Fold bottom long side over filling, then fold in short sides and roll up jelly roll style. Carefully transfer strudel to prepared baking sheet, seam side down. Brush top of strudel with butter.",
        "Bake strudel 15 minutes. Brush with remaining butter. Bake until golden, about 30 minutes. Cool on sheet.",
        "Lightly sift powdered sugar over strudel. Cut strudel crosswise into thick slices. Transfer to plates. Spoon sauce around strudel and serve."
    ],
    "ingredients": [
        "2 cups fresh or frozen cranberries (about 8 ounces)",
        "1 cup sugar",
        "1 cup water",
        "3 tablespoons kirsch (clear cherry brandy)",
        "1/4 cup raisins",
        "1 1/2 tablespoons kirsch (clear cherry brandy)",
        "3 medium Granny Smith apples (about 18 ounces), peeled, cored, cut into 1/3-inch pieces",
        "1/2 cup plus 9 teaspoons gingersnap cookie crumbs",
        "1/2 cup plus 2 tablespoons sugar",
        "1/2 cup (1 stick) unsalted butter, melted",
        "9 sheets fresh phyllo pastry or frozen, thawed",
        "Powder sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cranberry",
        "Apple",
        "Kirsch",
        "Fall"
    ],
    "title": "Apple Strudel with Cranberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/apple-strudel-with-cranberry-sauce-900"
}
