{
    "directions": [
        "Position rack in center of oven and preheat to 400°F. Combine first 5 ingredients in heavy medium skillet over low heat. Cover and cook until apples are just tender, stirring occasionally, about 20 minutes. Uncover and mix in apricot jam. Increase heat to high and boil until juices thicken, stirring frequently, about 3 minutes. Place in freezer and cool 10 minutes. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Cut off about 1/3 of pastry dough, making sheet approximately 6x12 inches. (Save dough piece for another use.) Roll dough out on lightly floured surface to very thin 9x18-inch rectangle. Arrange apple filling lengthwise in center of dough in 12x3-inch log. Press walnuts over filling. Fold short ends of dough over filling. Fold 2 long sides over filling and then roll up to enclose. Arrange strudel on unbuttered baking sheet seam side down.",
        "Bake strudel 15 minutes. Reduce temperature to 375°F. and bake until deep golden brown, about 25 minutes longer. Immediately slide long spatula under strudel to loosen from baking sheet. Transfer strudel to platter. Let stand 10 minutes. Cut away 1 inch from each end of strudel. Serve warm or at room temperature."
    ],
    "ingredients": [
        "6 tablespoons sugar",
        "1/4 cup dried currants",
        "1 teaspoon grated lemon peel",
        "1/2 teaspoon ground cinnamon",
        "1 1/2 pounds pippin apples (about 4 medium), peeled, cored, each cut into 8 wedges",
        "1 tablespoon apricot jam",
        "1/2 17 1/4-ounce package frozen puff pastry (1 sheet), thawed",
        "1/2 cup toasted walnut pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Currant",
        "Apple",
        "Walnut"
    ],
    "title": "Apple, Walnut and Currant Strudel",
    "url": "http://www.epicurious.com/recipes/food/views/apple-walnut-and-currant-strudel-36"
}
