{
    "directions": [
        "Peel and core apple and cut into 1/4-inch dice. Melt butter in a 12-inch heavy skillet over moderately high heat until foam subsides, then sauté caraway seeds, stirring, 1 minute. Add onion and sauté, stirring, until softened, about 6 minutes. Add apple and celery and sauté, stirring occasionally, until crisp-tender, about 4 minutes. Remove from heat and stir in remaining stuffing ingredients. Cool stuffing completely.",
        "Preheat oven to 425°F.",
        "Pat chicken dry and arrange, skinned sides down, on a work surface. Remove tender (fillet strip on side where breast bone was) from each breast half if attached and reserve for another use.",
        "Beginning at center of thicker end of breast, insert a small knife horizontally, stopping about 1 inch from opposite end. Open incision with your fingers to create a 1-inch-wide pocket. Pack one sixth of stuffing into each pocket.",
        "Pat chicken dry and season with salt. Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown chicken in 2 batches, about 2 minutes on each side, transferring to a small roasting pan as browned (reserve skillet).",
        "Roast chicken in middle of oven until just cooked through, 14 to 16 minutes.",
        "While chicken is roasting, stir flour into fat remaining in skillet and cook roux over moderately low heat, stirring, 1 minute. Whisk in cider and broth and bring to a boil, whisking, then boil, whisking occasionally, until thickened and reduced to about 1 cup, about 8 minutes.",
        "Let chicken stand 5 minutes, then cut each breast half diagonally into thirds. Add any juices from roasting pan and salt and pepper to taste to sauce and spoon over chicken."
    ],
    "ingredients": [
        "1 Granny Smith apple",
        "3 tablespoons unsalted butter",
        "1 teaspoon caraway seeds",
        "1 medium onion, chopped",
        "1 1/2 celery ribs, sliced crosswise 1/8 inch thick",
        "1/2 cup coarse fresh rye bread crumbs (with or without seeds)",
        "1/4 cup chopped fresh flat-leaf parsley",
        "3 tablespoons dried currants",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "6 skinless boneless chicken breast halves (2 lb)",
        "1 1/2 tablespoons vegetable oil",
        "2 teaspoons all-purpose flour",
        "1 cup unfiltered apple cider",
        "1 cup chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Roast",
        "Spring",
        "Gourmet"
    ],
    "title": "Apple, Currant, and Caraway Stuffed Chicken Breasts",
    "url": "http://www.epicurious.com/recipes/food/views/apple-currant-and-caraway-stuffed-chicken-breasts-106360"
}
