{
    "directions": [
        "Preheat oven to 350°F. Butter pan and line bottom with a parchment round; butter parchment. Heat 1 Tbsp. butter, 1/2 cup brown sugar, and 2 Tbsp. water in a large skillet over medium, stirring constantly, until butter is melted and sugar is dissolved. Cook, without stirring but swirling skillet often, until large bubbles that are slow to pop form, about 2 minutes. Pour caramel into prepared pan and tilt pan to evenly coat bottom.",
        "Melt 1 Tbsp. butter in same skillet over medium heat; add half of apples and toss to separate. Cook, tossing often, until apples are softened and almost translucent, about 4 minutes. Repeat process with another 1 Tbsp. butter and remaining apples. Let apples sit until cool enough to handle, then arrange over caramel in several overlapping layers. Set pan aside.",
        "Whisk flour, baking powder, salt, cinnamon, cloves, and nutmeg in a large bowl to combine; set aside. Heat molasses, maple syrup, remaining 1/2 cup brown sugar, and remaining 1/2 cup butter in a heatproof bowl set over a saucepan of barely simmering water, stirring constantly, until butter is melted and mixture is smooth. Whisk in eggs and ginger. Stir baking soda into 1/4 cup very hot water in a small bowl until dissolved, then whisk into molasses mixture. Whisk molasses mixture into reserved dry ingredients and scrape batter over apples, spreading evenly. Evenly drizzle 1/2 cup cream over batter.",
        "Place cake on a foil-lined rimmed baking sheet and bake until center is firm to the touch and a cake tester inserted into the center comes out clean, 35–45 minutes. Transfer pan to a wire rack and let cake cool in pan 15 minutes. Run a paring knife around the sides of cake to loosen, then remove the sides of pan and invert cake onto rack. Carefully remove pan and peel away parchment (apples might stick, so work slowly). Let cool completely.",
        "Slice cake into wedges and serve drizzled with more cream.",
        "Cake can be baked 1 day ahead. Store tightly covered at room temperature. To revive apples, reheat cake slightly in a microwave and brush top with maple syrup."
    ],
    "ingredients": [
        "3 tablespoons plus 1/2 cup unsalted butter, plus more for pan",
        "1 cup (packed) light brown sugar, divided",
        "1 pound lady apples, unpeeled, very thinly sliced, seeds removed, divided",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 1/2 teaspoons kosher salt",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground nutmeg",
        "1/2 cup robust-flavored (dark) molasses",
        "1/2 cup pure maple syrup",
        "2 large eggs, room temperature",
        "2 tablespoons finely grated peeled ginger",
        "1 1/2 teaspoons baking soda",
        "1/2 cup heavy cream, plus more for serving",
        "A 10-inch springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Apple",
        "Dessert",
        "Fall",
        "Brunch",
        "Ginger",
        "Cinnamon",
        "Clove",
        "Molasses",
        "Maple Syrup",
        "Bake"
    ],
    "title": "Apple Gingerbread Cake With Cream",
    "url": "http://www.epicurious.com/recipes/food/views/apple-gingerbread-cake-with-cream"
}
