{
    "directions": [
        "Combine flour and sugar in medium bowl. Add butter and rub in with fingertips until coarse crumbs form. Mix in beaten egg. Mix in enough ice water by tablespoonfuls to form moist clumps. Divide dough in half. Gather dough into 2 balls; flatten into disks. Wrap each disk in plastic and refrigerate until firm enough to roll out, about 30 minutes. (Can be made 1 day ahead. Keep chilled. Soften slightly at room temperature before rolling out.)",
        "Preheat oven to 375°F. Mix apples, blackberries, 1/3 cup sugar and flour in large bowl.",
        "Roll out 1 dough disk on floured surface to 12-inch round. Transfer to 9-inch-diameter glass pie dish.",
        "Spoon filling into crust. Roll out second dough disk on floured surface to 12-inch round. Place dough atop filling. Fold top crust edge under bottom edge and pinch to seal. Crimp edges decoratively. Brush crust with milk. Sprinkle with remaining 2 teaspoons sugar. Cut several slits on top of pie.",
        "Bake pie until crust is golden brown and fruit is tender, covering edges of pie with aluminum foil if browning too quickly, about 55 minutes. Cool pie on rack 30 minutes. Serve pie warm with sweetened whipped cream."
    ],
    "ingredients": [
        "2 cups self-rising flour",
        "9 tablespoons sugar",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into pieces",
        "1 large egg, beaten to blend",
        "2 tablespoons (about) ice water",
        "2 pounds tart green apples (such as Granny Smith), peeled, quartered, cored, cut into 1/4-inch-thick slices",
        "1 1/2 cups frozen unsweetened blackberries, unthawed",
        "1/3 cup plus 2 teaspoons sugar",
        "2 tablespoons all purpose flour",
        "Milk",
        "Sweetened whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Blackberry",
        "Apple",
        "Spring",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple and Blackberry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-blackberry-pie-1960"
}
