{
    "directions": [
        "Put a large baking sheet in middle of oven and preheat oven to 425°F.",
        "Whisk together flour, zest, cinnamon, allspice, salt, and 2/3 cup sugar and gently toss with apples and lemon juice.",
        "Roll out 1 piece of dough (keep remaining piece chilled) on a lightly floured surface with a lightly floured rolling pin into a 13-inch round, then fit into a 9-inch (4-cup) glass or metal pie plate. Trim edge, leaving a 1/2-inch overhang. Chill shell while rolling out dough for top crust.",
        "Roll out remaining piece of dough on lightly floured surface with lightly floured rolling pin into an 11-inch round.",
        "Spoon filling into shell, then cover with pastry round and trim with kitchen shears, leaving a 1/2-inch overhang. Press edges together, then crimp decoratively. Lightly brush top of pie with egg and sprinkle all over with remaining tablespoon sugar. Cut 3 steam vents in top crust with a small sharp knife.",
        "Bake pie on hot baking sheet 20 minutes. Reduce oven temperature to 375°F and continue to bake until crust is golden and filling is bubbling, about 40 minutes more. Cool pie to warm or room temperature on a rack, 2 to 4 hours."
    ],
    "ingredients": [
        "3 tablespoons all-purpose flour",
        "1 teaspoon finely grated fresh lemon zest",
        "1/2 teaspoon cinnamon",
        "1/4 teaspoon ground allspice",
        "1/8 teaspoon salt",
        "2/3 cup plus 1 tablespoon sugar",
        "2 1/2 pounds apples, peeled, cored, and each cut into 10 wedges",
        "1 tablespoon fresh lemon juice",
        "Pastry dough",
        "1 large egg, lightly beaten"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Lemon",
        "Apple",
        "Fall",
        "Cinnamon",
        "Gourmet"
    ],
    "title": "Apple Pie",
    "url": "http://www.epicurious.com/recipes/food/views/apple-pie-107033"
}
