{
    "directions": [
        "Blend sugar and cinnamon in small bowl. DO AHEAD: Coating can be made 3 days ahead. Cover; store at room temperature.",
        "Melt butter in heavy large skillet over medium-high heat. Add apples. Sprinkle with sugar and cinnamon; toss to coat. Sauté until apples are browned in spots and tender, stirring often, about 10 minutes. Add cider and vinegar. Cook until all liquid evaporates, stirring often, about 4 minutes. Set filling aside in skillet to cool.",
        "Place double layer of paper towels on work surface. Whisk flour, sugar, lemon peel, baking powder, and spices in large bowl to blend. Whisk buttermilk, egg yolks, and melted butter in medium bowl to blend. Gradually stir buttermilk mixture into dry ingredients. Beat egg whites and coarse salt in another medium bowl until peaks form. Gently fold egg whites into fritter base, then fold in cooled apple filling.",
        "Pour enough oil into heavy large saucepan to reach depth of 1 1/2 inches (5 to 6 cups). Attach deep-fry thermometer to side of pan. Heat oil to 320°F to 330°F over medium heat. Working in batches of 5 or 6, drop batter into oil by tablespoonfuls. Fry fritters until deep golden brown and cooked through, turning fritters occasionally and adjusting heat to maintain oil temperature, about 4 minutes per batch. Using slotted spoon, transfer fritters to paper towels. Drain briefly, then toss warm fritters in cinnamon-sugar coating. Transfer to large rimmed baking sheet. Do ahead Can be made 2 hours ahead. Let stand at room temperature. Rewarm in 350°F oven 5 minutes, if desired.",
        "Mound fritters on platter. Serve with Bourbon Ice Cream ."
    ],
    "ingredients": [
        "1 cup sugar",
        "2 teaspoons ground cinnamon",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 pound Pink Lady apples (about 3), peeled, cored, cut into 1/3- to 1/2-inch cubes (about 3 cups)",
        "2 tablespoons sugar",
        "1/4 teaspoon ground cinnamon",
        "1/2 cup sparkling apple cider",
        "1 tablespoon apple cider vinegar",
        "1 3/4 cups all purpose flour",
        "1/2 cup sugar",
        "1 teaspoon finely grated lemon peel",
        "1 teaspoon baking powder",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "2/3 cup buttermilk",
        "2 large eggs, separated",
        "2 1/2 tablespoons unsalted butter, melted",
        "1/4 teaspoon coarse kosher salt",
        "Safflower oil (for deep-frying)",
        "Bourbon Ice Cream",
        "Special equipment: Deep-fry equipment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Apple",
        "Fall",
        "Deep-Fry",
        "Cinnamon",
        "Candy Thermometer",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Fritters with Bourbon Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/apple-fritters-with-bourbon-ice-cream-361262"
}
