{
    "directions": [
        "Put oven rack in upper third of oven and preheat oven to 425°F. Butter muffin cups. Peel and core apples, then cut into 1/3-inch dice.",
        "Heat 2 tablespoons butter in a 12-inch heavy skillet over moderate heat until foam subsides, then cook apples, brown sugar, and lemon juice, stirring occasionally, until liquid is reduced to a glaze and apples are tender, 5 to 6 minutes.",
        "Stir in walnuts and divide apple mixture among muffin cups.",
        "Pulse together flour, cornmeal, granulated sugar, baking powder, and salt in a food processor until combined. Add remaining 4 tablespoons butter and pulse until mixture resembles coarse meal with some small (roughly pea-size) butter lumps.",
        "Whisk together egg and milk in a large bowl. Add flour mixture and whisk until just combined.",
        "Divide batter among muffin cups and bake until golden and a wooden pick or skewer inserted into center of a cake comes out clean, 15 to 20 minutes.",
        "Run a paring knife around edge of each cake to loosen. Invert rack over muffin cups, then invert cakes onto rack. Serve warm with a dollop of whipped cream."
    ],
    "ingredients": [
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into tablespoon pieces, plus additional for greasing",
        "3 Gala apples",
        "1/3 cup packed light brown sugar",
        "1 teaspoon fresh lemon juice",
        "1/2 cup coarsely chopped walnuts (1 3/4 oz)",
        "3/4 cup all-purpose flour",
        "1/2 cup yellow cornmeal",
        "1/3 cup granulated sugar",
        "2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1 large egg",
        "3/4 cup whole milk",
        "Special equipment: a muffin pan with 6 (1-cup) muffin cups",
        "Accompaniment: lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Quick & Easy",
        "Apple",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Upside-Down Cornmeal Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/apple-upside-down-cornmeal-cakes-236016"
}
