{
    "directions": [
        "Preheat oven to 325°F. Bake bread cubes on 2 large rimmed baking sheets until lightly toasted, about 20 minutes.",
        "Sauté sausages in very large skillet over medium-high heat until cooked through, breaking into pieces with spoon, about 15 minutes. Using slotted spoon, transfer to large bowl; add bread.",
        "Add onions and celery to same skillet and sauté until golden brown, about 10 minutes; transfer to bowl with bread. Melt 1/4 cup butter in same skillet over medium-high heat. Add apples and sauté until tender, about 8 minutes; mix apples into stuffing. Melt 1/4 cup butter in same skillet over medium-high heat. Add parsnips and sauté until golden, about 10 minutes; mix into stuffing. Melt 1/4 cup butter in same skillet. Add sage and sauté until dark green, about 2 minutes. Mix sage and butter into stuffing. Season with salt and pepper.",
        "Butter 15x10x2-inch glass baking dish. Stuff turkey. Transfer remaining stuffing to prepared dish; drizzle with 1/2 cup chicken broth. Cover with foil. (Can be prepared 4 hours ahead. Cover and refrigerate.)",
        "Preheat oven to 350°F. Bake stuffing covered until heated through, about 1 hour. Uncover and bake until beginning to brown, about 10 minutes."
    ],
    "ingredients": [
        "1 1 1/2-pound loaf sliced sourdough bread with crust, cubed",
        "1 1/2 pounds sweet Italian sausages, casings removed",
        "1 1/2 pounds hot Italian sausages, casings removed",
        "6 cups chopped onions",
        "2 cups chopped celery",
        "3/4 cup (1 1/2 sticks) butter, divided",
        "3 pounds Pippin or Granny Smith apples, peeled, cored, cubed",
        "2 pounds parsnips, peeled, cubed",
        "3/4 cup packed fresh sage leaves",
        "1/2 cup low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Herb",
        "Pork",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Apple",
        "Meat",
        "Sausage",
        "Parsnip",
        "Fall",
        "Winter",
        "Sage",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Apple, Sausage, and Parsnip Stuffing with Fresh Sage",
    "url": "http://www.epicurious.com/recipes/food/views/apple-sausage-and-parsnip-stuffing-with-fresh-sage-233154"
}
