{
    "directions": [
        "Place the first 4 ingredients in a food processor and pulse until it resembles coarse cornmeal.",
        "Sprinkle the ice water, 1 tablespoon at a time, in the food processor and pulse until the dough starts to come together.",
        "Form the dough into a disk, wrap in parchment paper or plastic wrap, refrigerate for 30 minutes.",
        "Roll out the dough 1/4 inch thick.",
        "Using cookie cutters, cut out turnovers into desired shapes (If you are making 8 turnovers, you need 16 cut-outs, one for the top and one for the bottom).",
        "Place one cut-out on a parchment or silpat lined baking sheet, top with 2 tsp of apple butter (depending on the size of your shape) leaving a 1/4 inch border around the cut-out.",
        "Combine the honey and water together in a separate bowl.",
        "Brush the 1/4 inch border with the honey water, place matching pastry shape on top of the apple butter and using the tines of a fork, gently press down to seal the dough.",
        "Brush the remaining honey water on top of each turnover.",
        "Using the tip of a knife, cut several slits through the dough (to allow ventilation).",
        "Bake at 400 degrees for 20 minutes."
    ],
    "ingredients": [
        "8 tablespoons butter, chilled and cubed",
        "8 tablespoons vegetable shortening or lard, chilled and cubed",
        "2 1/2 cups all purpose flour",
        "1 teaspoon salt",
        "5 to 6 tablespoons ice water",
        "1 tablespoon honey",
        "1 tablespoon water",
        "1/2 cup apple butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Pastry",
        "Weelicious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Butter Turnovers",
    "url": "http://www.epicurious.com/recipes/food/views/apple-butter-turnovers-51262730"
}
