{
    "directions": [
        "In a large saucepan boil the cider until it is reduced to about 1 1/2 cups and let it cool. In a large bowl with an electric mixer beat together the shortening and the sugar until the mixture is fluffy and beat in the eggs, 1 at a time. Into the bowl sift together the flour, the cloves, the cinnamon, the baking soda, and a pinch of salt, stir in the reduced cider, and combine the mixture well. Divide the batter among 18 paper-lined 1/2-cup muffin tins and bake the cupcakes in the middle of a preheated 375°F. oven for 25 minutes, or until a tester comes out clean. Transfer the cupcakes to a rack, let them cool in the tins, and remove them from the tins.",
        "In a saucepan boil the cider until it is reduced to about 1/4 cup and let it cool. In a bowl with an electric mixer beat together the cream cheese, the confectioners' sugar, the reduced cider, and a pinch of salt until the icing is smooth.",
        "Spread each cupcake with some of the icing."
    ],
    "ingredients": [
        "3 cups unpasteurized apple cider",
        "3/4 cup vegetable shortening",
        "1 3/4 cups sugar",
        "2 large eggs",
        "2 cups all-purpose flour, sifted",
        "1/8 teaspoon ground cloves",
        "1 teaspoon cinnamon",
        "1 teaspoon baking soda",
        "2 cups apple cider",
        "6 ounces cream cheese, cut into bits and softened",
        "1/2 cup sifted confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Apple",
        "Fall",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Cider Cupcakes with Cider Cream Cheese Icing",
    "url": "http://www.epicurious.com/recipes/food/views/apple-cider-cupcakes-with-cider-cream-cheese-icing-10714"
}
