{
    "directions": [
        "Mix 1 cup sugar and 1 tablespoon cinnamon together in a resealable freezer bag.",
        "Bring apple cider to a boil in a saucepan; cook, stirring occasionally, until cider has reduced to 1/2 cup, about 20 minutes. Remove from heat and cool.",
        "Whisk 1 cup flour, 1 cup sugar, baking powder, 2 teaspoons cinnamon, and salt together in a large bowl. Mix butter, eggs, egg yolk, and cooled cider together in a separate bowl until smooth; stir into flour mixture. Stir remaining 2 3/4 cup flour into mixture until dough is smooth. Refrigerate dough for 10 minutes.",
        "Heat oil in a large pot or deep-fryer to 375 degrees F (190 degrees C).",
        "Turn dough onto a well-floured work surface using floured hands; pat dough into 1/2-inch thickness. Cut dough into doughnuts using a doughnut cutter or 2 round cookie cutters (1 large and 1 small). Gather scraps and re-pat dough to cut out as many doughnuts as possible.",
        "Carefully slide doughnuts, working in batches, into hot oil; fry until doughnuts rise to the surface and begin to brown, 2 to 3 minutes. Flip doughnuts and continue frying until opposite side is browned, about 1 1/2 minutes.",
        "Remove doughnuts with a slotted spoon and place on a paper towel-lined plate to cool until easily handled, about 1 minute. Toss cooled doughnuts in the reserved bag of cinnamon-sugar. Bring oil back to 375 degrees F (190 degrees C) before frying next batch."
    ],
    "ingredients": [
        "2 cups white sugar, divided",
        "1 tablespoon ground cinnamon",
        "1 1/2 cups apple cider",
        "3 3/4 cups all-purpose flour, divided",
        "2 teaspoons baking powder",
        "2 teaspoons ground cinnamon",
        "1 teaspoon salt",
        "1/4 cup butter, melted",
        "2 eggs, lightly beaten",
        "1 egg yolk, lightly beaten",
        "6 cups vegetable oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple Cider Doughnuts",
    "url": "http://allrecipes.com/recipe/235088/apple-cider-doughnuts/"
}
