{
    "directions": [
        "In a large bowl with an electric mixer cream the butter, add the sugars, a little at a time, and beat the mixture until it is light and fluffy. Beat in the applesauce and the egg. Into the butter mixture sift together the flour, the baking soda, the cinnamon, the nutmeg, and the cloves, stir the mixture until it is combined, and add the vanilla, the oats, and the coated raisins. Stir the batter until it is combined well, divide it between 2 well-buttered 8-inch round cake pans, and bake the cake layers in the middle of a preheated 350°F. oven for 25 to 30 minutes, or until a tester comes out clean. Turn the layers out onto racks and let them cool completely.",
        "In a heavy saucepan combine the brown sugar, the butter, the milk, and a pinch of salt, bring the mixture to a boil over moderate heat, stirring until the sugar is dissolved, and cook it, undisturbed, until it registers 234°F. on a candy thermometer. Let the mixture cool to room temperature and whisk it until it is thickened, lightened in color, and beginning to lose its sheen.",
        "Working quickly, before the frosting begins to harden and crystallize, frost the top of 1 of the cake layers, top it with the other layer, and frost the top and side of the cake. (If the frosting becomes too hard to spread, reheat it over low heat, stirring, until it is of spreading consistency and let it cool.)",
        "In a large heavy saucepan combine the apples, 1/2 cup water, the lemon juice, and the sugar, bring the liquid to a boil, and simmer the mixture, stirring occasionally, for 25 minutes, or until the apples are very tender. Force the mixture through a food mill fitted with the fine disk into a bowl. Serve the applesauce warm or chilled. Makes about 4 cups."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter, softened",
        "1/2 cup granulated sugar",
        "1/2 cup firmly packed light brown sugar",
        "1 3/4 cups pink applesauce or bottled applesauce",
        "3 pounds McIntosh apples (about 8), cored and quartered",
        "1/2 cup fresh lemon juice",
        "1/2 cup sugar",
        "1 large egg",
        "2 cups all-purpose flour",
        "2 teaspoons baking soda",
        "1 teaspoon cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "1/4 teaspoon ground cloves",
        "1 teaspoon vanilla extract",
        "1/4 cup old-fashioned rolled oats",
        "3/4 cup raisins, chopped and tossed in all-purpose flour to coat them",
        "3 cups firmly packed light brown sugar",
        "1 1/2 sticks (3/4 cup) unsalted butter",
        "3/4 cup milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Raisin",
        "Apple",
        "Oat",
        "Fall",
        "Cinnamon",
        "Gourmet"
    ],
    "title": "Applesauce Cake with Penuche Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/applesauce-cake-with-penuche-frosting-13207"
}
