{
    "directions": [
        "Simmer raisins and rum in small saucepan 3 minutes. Remove from heat. Ignite with match; let flames burn out, about 4 to 5 minutes. Transfer 2 tablespoons liquid to small bowl for crisp topping.",
        "Melt butter in small saucepan over medium-low heat. Simmer until butter is golden brown, about 6 minutes. Cool.",
        "Mix flour, sugar, nutmeg, and salt in medium bowl. Add browned butter and 2 tablespoons reserved liquid from rum raisins; stir until moist clumps form. DO AHEAD: Raisins and topping can be made 1 day ahead. Cover each; chill.",
        "Combine 4 cups water and 3 cups sugar in large saucepan. Stir over medium heat until sugar dissolves. Add quinces; simmer until tender, 15 minutes. Remove from syrup; cool. Reserve syrup for another use. Cut quinces into 1-inch cubes. Transfer to large bowl. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Position rack in center of oven and preheat to 350°F. Butter 13x9x2-inch glass baking dish. Add apples, lemon juice, flour, salt, remaining 1/2 cup sugar, and rum raisin mixture to bowl with quinces; toss to blend. Transfer to baking dish. Crumble topping over.",
        "Bake apple and quince crisp until golden and bubbling, about 55 minutes. Cool at least 30 minutes. Serve warm or at room temperature with softly whipped cream or ice cream."
    ],
    "ingredients": [
        "1 1/2 cups raisins",
        "1 cup dark rum",
        "3/4 cup (1 1/2 sticks) unsalted butter",
        "2 cups all purpose flour",
        "1 cup sugar",
        "1 teaspoon ground nutmeg",
        "1/4 teaspoon salt",
        "4 cups water",
        "3 1/2 cups sugar, divided",
        "2 pounds quinces (about 5 medium), peeled, quartered, cored",
        "4 large Gala apples, peeled, cut into 1-inch pieces",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon all purpose flour",
        "1/4 teaspoon salt",
        "Whipped cream or vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Raisin",
        "Apple",
        "Quince",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple and Quince Crisp with Rum Raisins",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-quince-crisp-with-rum-raisins-240426"
}
