{
    "directions": [
        "Mix flour, sugar, salt and apple pie spice in processor. Add butter and shortening and cut in until mixture resembles coarse meal. Add sour cream and blend in using on/off turns just until dough forms. Turn out dough onto lightly floured surface. Divide in half. Form each half into a ball; flatten into disk. Wrap each disk in plastic wrap and refrigerate 1 hour.",
        "Preheat oven to 400°F. Toss first 6 ingredients together in bowl.",
        "Roll out 1 dough disk between sheets of plastic wrap to 13-inch round. Peel off top sheet; invert dough into 9 1/2-inch deep-dish glass pie dish. Peel off plastic. Roll out remaining dough disk between sheets of plastic wrap to 13-inch round. Peel off top sheet of plastic. Mound filling in pie dish. Invert dough over filling. Peel off plastic. Pinch edges of dough to seal. Trim excess crust. Crimp edges decoratively. Cut 5 slashes in top of dough to allow steam to escape. Brush top with milk and sprinkle with sugar. Bake until golden brown, covering with foil if browning too quickly, about 1 hour.",
        "Let pie stand until just slightly warm, about 1 hour. Serve pie with ice cream and Cider-Bourbon Sauce.",
        "Boil apple cider in heavy medium saucepan until reduced to 3/4 cup, about 45 minutes. Add butter and sugar and whisk until butter melts. Boil 3 minutes, whisking occasionally. Remove from heat. Whisk in bourbon. Cool sauce completely before serving."
    ],
    "ingredients": [
        "2 1/2 cups unbleached all purpose flour",
        "1/4 cup sugar",
        "1 teaspoon salt",
        "1 teaspoon apple pie spice",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
        "1/3 cup chilled solid vegetable shortening",
        "7 tablespoons sour cream",
        "3 pounds Golden Delicious apples, peeled, cored, cut into 1/2-inch-thick slices",
        "2/3 cup sugar",
        "1/4 cup all purpose flour",
        "3 tablespoons minced crystallized ginger",
        "2 tablespoons bourbon",
        "1 teaspoon apple pie spice",
        "Milk",
        "Sugar",
        "Vanilla ice cream",
        "5 cups apple cider",
        "5 tablespoons unsalted butter",
        "2 tablespoons sugar",
        "3 tablespoons bourbon",
        "Makes about 1 cup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Apple",
        "Fall"
    ],
    "title": "Apple Ginger Pie with Cider-Bourbon Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/apple-ginger-pie-with-cider-bourbon-sauce-2653"
}
