{
    "directions": [
        "Position rack in center of oven; preheat to 400°F. Place rimmed baking sheet in bottom of oven to catch spills. Place sheet of parchment paper on work surface; lightly flour parchment. Place dough disk on parchment; sprinkle very lightly with flour. Cover with another sheet of parchment; roll to 9-inch round. Remove top parchment; sprinkle oats evenly over crust. Cover again with top parchment; roll to 12-inch round, rolling oats into crust. Remove top parchment. Using bottom parchment as aid, invert crust, oat side down, into 9-inchdiameter glass pie dish. Remove parchment. Press crust gently into pie dish. Turn dough overhang under, forming high-standing rim 1/2 inch above sides of dish. Crimp edges.",
        "Toss all ingredients in large bowl. Let stand while preparing topping.",
        "Blend first 6 ingredients in processor. Add butter; using on/off turns, blend until moist dough forms (mixture will resemble wet sand). Add oats; using on/off turns, mix briefly, leaving half of oats whole. Stir filling; transfer to crust, mounding in center. Sprinkle topping evenly over.",
        "Bake pie until topping is golden, about 40 minutes. Reduce oven temperature to 350°F. Bake until apples are tender when pierced with small sharp knife, covering pie loosely with foil if topping and crust are browning too quickly, about 1 hour longer. Cool pie on rack until slightly warm, at least 1 hour. Serve warm or at room temperature."
    ],
    "ingredients": [
        "3 pounds Pippin apples or Granny Smith apples, peeled, cored, cut into scant 1/4-inch-thick slices",
        "1/2 cup sugar",
        "2 tablespoons (packed) golden brown sugar",
        "3 tablespoons unsalted butter, melted",
        "2 tablespoons all purpose flour",
        "2 teaspoons ground cinnamon",
        "1/2 teaspoon ground allspice",
        "Generous pinch of salt",
        "1 Pie Crust dough disk",
        "1/4 cup old-fashioned oats",
        "3/4 cup unbleached all purpose flour",
        "1/2 cup (packed) golden brown sugar",
        "1/4 cup sugar",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground allspice",
        "7 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "1/2 cup old-fashioned oats"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Christmas",
        "Thanksgiving",
        "High Fiber",
        "Apple",
        "Oat",
        "Fall",
        "Family Reunion",
        "Cinnamon",
        "Christmas Eve",
        "Butter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Pie with Oat Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/apple-pie-with-oat-streusel-361836"
}
