{
    "directions": [
        "Preheat oven to 425°F. Roll out puff pastry sheet on lightly floured surface to 12-inch square. Transfer to 9-inch-diameter tart pan with removable bottom. Trim overhang to 1 inch. Fold in overhang to form double-thick high-standing sides. Pierce pastry all over with fork. Freeze pastry shell 15 minutes. Line shell with foil and beans or pie weights. Bake until sides are set, about 20 minutes. Remove foil and beans. Bake until bottom is golden, about 8 minutes longer. Cool pastry shell.",
        "Place apples, 1/4 cup water and 2 tablespoons sugar in heavy medium saucepan. Simmer over medium heat until mixture is reduced to 1 1/4 cups, stirring and breaking up apples with back of spoon, about 5 minutes. Set aside.",
        "Cook fennel in large saucepan of boiling, lightly salted water until tender, about 10 minutes. Remove from heat; drain fennel well.",
        "Melt butter in heavy large skillet over medium heat. Stir in 3/4 cup sugar. Cook until sugar dissolves and mixture is dark amber, stirring frequently, about 14 minutes. Stir in drained fennel (caramel mixture will harden). Cover; cook until caramel melts, stirring occasionally, about 15 minutes. Uncover and simmer until caramel thickens, about 5 minutes longer (fennel will be very tender). (Pastry shell, apple compote and caramelized fennel can be made 1 day ahead. Cover separately. Refrigerate apple and fennel mixtures; store pastry shell airtight at room temperature.)",
        "Preheat oven to 425°F. Spread apple compote evenly over bottom of pastry shell. Arrange caramelized fennel evenly over compote. Sprinkle tart with aniseed. Bake until warmed through, about 15 minutes. Serve with vanilla ice cream."
    ],
    "ingredients": [
        "1 sheet frozen puff pastry (half of 17 1/4-ounce package), thawed",
        "4 Golden Delicious apples, peeled, cored, chopped",
        "1/4 cup water",
        "2 tablespoons plus 3/4 cup sugar",
        "3 medium fennel bulbs (about 13 ounces each), halved lengthwise, stalks separated",
        "4 tablespoons (1/2 stick) unsalted butter",
        "2 teaspoons aniseed",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Vegetable",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Apple",
        "Fennel",
        "Spring",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Tart with Caramelized Fennel",
    "url": "http://www.epicurious.com/recipes/food/views/apple-tart-with-caramelized-fennel-101641"
}
