{
    "directions": [
        "Lightly butter 9-inch-diameter glass pie dish. Cut each bread slice into 4 squares. Arrange half of bread squares in single layer in prepared dish. Melt 2 teaspoons butter in large nonstick skillet over medium heat. Add apples; sauté 5 minutes. Sprinkle with 2 tablespoons sugar; sauté until apples are golden, about 6 minutes. Arrange apples atop bread in dish. Sprinkle with currants. Top with remaining bread squares in single layer.",
        "Bring milk to simmer in small saucepan. Whisk eggs and remaining 6 tablespoons sugar in medium bowl to blend. Gradually whisk in hot milk, then vanilla and cinnamon. Pour over bread and apple mixture. Let stand until milk mixture is almost absorbed, occasionally pressing down on bread with spatula to submerge, about 30 minutes.",
        "Preheat oven to 350°F. Place pie dish in roasting pan. Add enough hot water to roasting pan to come halfway up sides of pie dish. Bake bread pudding until top is golden and custard is set, about 40 minutes. Remove from water. Serve warm or at room temperature."
    ],
    "ingredients": [
        "4 4 x4-inch slices firm white sandwich bread, crusts trimmed",
        "2 teaspoons butter",
        "2 medium apples, peeled, cored, cut into 1/2-inch wedges",
        "8 tablespoons sugar",
        "1 tablespoon dried currants or raisins",
        "2 cups low-fat (1%) milk",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Low Fat",
        "Vegetarian",
        "Back to School",
        "Currant",
        "Apple",
        "Fall",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/apple-bread-pudding-5802"
}
