{
    "directions": [
        "Blend flour, sugar and salt in processor. Add butter; cut in using on/off turns until butter is cut into 1/4-inch pieces. Add 7 tablespoons water and blend until moist clumps form, adding more water by tablespoonfuls if dough is dry. Gather dough into ball; divide into 2 pieces. Flatten pieces into disks; wrap in plastic. Chill at least 30 minutes. (Can be prepared 1 day ahead. Keep refrigerated. Let soften slightly at room temperature before rolling out.)",
        "Position rack in bottom third of oven and preheat to 375°F. Combine cranberries, sugar, flour and allspice in large bowl. Mix in apples, then brandy and vanilla extract.",
        "Roll out 1 dough disk on floured surface to 13-inch round. Transfer to 9-inch-diameter glass pie dish. Spoon in apple filling, mounding slightly in center. Roll out second dough disk on floured surface to 13-inch round. Drape crust over filling. Trim overhang to 1/2 inch. Press crust edges together; fold under. Crimp edge. Stir yolk and cream in small bowl to blend. Brush over top (but not edge) of pie. Cut slits in top crust to allow steam to escape. Bake pie until apples are tender and crust is golden, about 1 hour 5 minutes. Transfer to rack; let stand 1 hour. Serve pie warm or at room temperature."
    ],
    "ingredients": [
        "2 1/2 cups all purpose flour",
        "1 tablespoon sugar",
        "1 teaspoon salt",
        "1 cup (2 sticks) chilled unsalted butter, cut into 1-inch pieces",
        "8 tablespoons (about) ice water",
        "1 cup dried cranberries",
        "2/3 cup sugar",
        "3 tablespoons all purpose flour",
        "1/4 teaspoon ground allspice",
        "2 1/4 pounds Pippin apples, peeled, quartered, cored, thinly sliced",
        "1 1/2 tablespoons brandy",
        "1 teaspoon vanilla extract",
        "1 large egg yolk",
        "1 teaspoon whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Cranberry",
        "Apple",
        "Fall"
    ],
    "title": "Apple and Dried Cranberry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-dried-cranberry-pie-15557"
}
