{
    "directions": [
        "Line 2 rimmed baking sheets with parchment paper. Roll out each puff pastry sheet on lightly floured surface to 11-inch square. Using 5-inch-diameter cookie cutter or bowl, cut out 4 rounds from each pastry sheet, forming 16 rounds total. Divide 8 pastry rounds between prepared baking sheets; pierce rounds all over with fork. Using 3 1/2-inch-diameter cookie cutter or bowl, cut out smaller rounds from center of remaining 8 rounds (reserve 3 1/2-inch rounds for another use), forming eight 5-inch-diameter rings. Brush outer 1-inch edges of 5-inch rounds on baking sheets with beaten egg; top each with 1 pastry ring. Freeze at least 30 minutes. DO AHEAD: Can be made 1 day ahead. Cover and keep frozen. Do not thaw before continuing.",
        "Preheat oven to 375°F. Mix cheese, lemon juice, and salt in bowl; spread mixture inside rings on frozen pastry rounds. Overlap apple slices atop cheese. Mix butter and 1/4 cup honey in small bowl; brush over apples. Sprinkle with allspice. Bake until apples are tender and pastry is golden, about 35 minutes. Place tartlets on plates. Drizzle 1 tablespoon honey over each and serve warm or at room temperature."
    ],
    "ingredients": [
        "2 17.3-ounce packages frozen puff pastry (4 sheets), thawed",
        "1 egg, beaten to blend",
        "6 ounces soft fresh goat cheese (about 3/4 cup packed)",
        "1 tablespoon fresh lemon juice",
        "1/4 teaspoon coarse kosher salt",
        "3 medium Gala apples, peeled, quartered, cored, cut into 1/8-inch-thick slices",
        "3 tablespoons unsalted butter, melted",
        "3/4 cup honey (preferably dark), divided",
        "1/2 teaspoon (scant) ground allspice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Goat Cheese",
        "Apple",
        "Honey",
        "Phyllo/Puff Pastry Dough",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple, Goat Cheese, and Honey Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/apple-goat-cheese-and-honey-tartlets-240112"
}
