{
    "directions": [
        "Preheat an oven to 350°F (180°C).",
        "Wrap the garlic cloves in aluminum foil and roast in the oven until soft, about 20 minutes.",
        "Meanwhile, in a small saucepan over medium heat, melt the butter. Add the flour and whisk until combined. Slowly pour in the milk, continuing to whisk over medium heat until the sauce thickens, about 10 minutes. Remove the sauce from the heat and stir in the cheese. When the garlic cloves are cool enough to handle, squeeze out the soft garlic pulp and stir into the sauce until combined. Add salt and pepper to taste. Cover and set aside until ready to assemble pizza.",
        "Preheat a Breville pizza maker on the preheat setting for 30 minutes.",
        "Meanwhile, in a sauté pan over medium-high heat, cook the bacon until browned, 4 to 5 minutes. Transfer the bacon to a paper towel–lined plate to drain.",
        "On a lightly floured surface, roll out half the dough into a 10-inch (25-cm) round. Prick the dough all over with the tines of a fork. Transfer the dough to a floured pizza peel. Spread half of the garlic sauce evenly over the dough, leaving a 1/2-inch (12-mm) border uncovered. Top with half each of the bacon, apple, onion and sage leaves. Sprinkle with pepper.",
        "Transfer the pizza to the pizza maker. Bake on the classic setting according to the manufacturer’s instructions until the crust is crisp, about 10 minutes.",
        "Using the pizza peel, transfer the pizza to a cutting board. Preheat the pizza maker again, assemble the remaining pizza and bake on the classic setting. Cut the pizza into slices and serve immediately. Makes two 10-inch (25-cm) pizzas.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "2 garlic cloves",
        "2 Tbs. unsalted butter",
        "2 Tbs. all-purpose flour",
        "1 1/2 cups (12 fl. oz./375 ml) milk",
        "1/4 cup (1 oz./30 g) grated Gruyère cheese",
        "Kosher salt and freshly ground pepper",
        "4 bacon slices, cut in half crosswise",
        "1 batch thin-crust pizza dough",
        "1/2 Pink Lady apple, thinly sliced into rounds",
        "1/4 red onion, thinly sliced",
        "Leaves from 1/2 bunch fresh sage"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Apple, Bacon and Sage Pizza",
    "url": "http://www.williams-sonoma.com/recipe/apple--bacon-and-sage-pizza.html"
}
