{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "In a microwave safe bowl, combine apples, butter and cinnamon and microwave for 3-4 minutes. The apples should be slightly tender. Microwave longer if necessary. Drain apples. Allow apples to cool. Toss with cookie crumbs and Marzetti Old Fashioned Caramel Dip.",
        "Lightly dust a work surface with flour. Roll puff pastry sheet into a 10 x 10 inch square.",
        "Cut into four squares. Lightly brush a 1/2-inch border around each square with cold water. Fill the center of each square with an equal amount of apples.",
        "Fold one corner over the fruit to the other corner to create a triangle. Press the dough together on both sides. Transfer to a baking sheet lined with parchment paper. With a fork, crimp the sides together.",
        "Repeat the process with remaining apples and dough.",
        "Lightly brush turnovers with egg glaze. With a small knife, make vent in the top of each turnover.",
        "Bake 18-22 minutes or until golden brown.",
        "In a microwave safe container, microwave Marzetti Old Fashioned Caramel Dip for 10-30 seconds, stirring every 10 seconds. Transfer warm caramel to a resealable plastic bag. Snip the end off one of the corners of the bag and drizzle the top with the warm caramel. Serve with ice cream or whipped cream."
    ],
    "ingredients": [
        "1/2 cup Marzetti's® Old Fashioned Caramel Dip",
        "4 Granny Smith apples, peeled, cored, and diced into 1/2-inch pieces",
        "2 tablespoons unsalted butter",
        "1/2 teaspoon ground cinnamon",
        "1/3 cup sugar cookie, cake, or graham cracker crumbs",
        "1 (17.3 ounce) package prepared puff pastry, thawed",
        "Egg glaze:",
        "1 egg beaten with",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple Turnovers by Marzetti®",
    "url": "http://allrecipes.com/recipe/228739/apple-turnovers-by-marzetti/"
}
