{
    "directions": [
        "Blend flour, sugar, caraway and salt in processor. Add butter and process, using on/off turns, until butter is cut into pea-size pieces. Add 5 teaspoons ice water. Blend until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Cut into 6 equal pieces. Press each piece of dough into 4 1/2-inch-diameter tartlet pan with 3/4-inch-high sides and removable bottom. (Can be made 1 day ahead. Cover each crust; chill.)",
        "Place 3/4 cup Cider-Caramel Sauce in heavy large skillet. Add apples and cinnamon. Cook over high heat until apples are crisp-tender, about 8 minutes. Cool filling completely.",
        "Place rack at lowest position in oven; preheat to 375°F Divide filling among crusts, overlapping apples, if desired. Place tartlets on oven rack; bake until apples are tender and crust is brown at edges, about 40 minutes. Transfer to rack; cool 30 minutes. Push up pan bottoms, releasing tartlets. (Can be made 8 hours ahead. Let stand at room temperature.)",
        "Rewarm remaining sauce in small saucepan. Place tartlets on plates. Top with ice cream and some warm sauce. Garnish with grapes and mint, if desired."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "3 tablespoons sugar",
        "1 teaspoon caraway seeds",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "5 teaspoons (or more) ice water",
        "Cider-Caramel Sauce",
        "2 1/2 pounds medium Granny Smith apples (about 7), peeled, halved, cored, each half cut into 4 wedges",
        "1/2 teaspoon ground cinnamon",
        "Cinnamon-Clove Ice Cream or vanilla ice cream",
        "Clusters of red grapes (optional)",
        "Fresh mint (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Apple",
        "Winter",
        "Cinnamon",
        "Caraway",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple and Caraway Tartlets with Cinnamon-Clove Ice Cream and Cider-Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-caraway-tartlets-with-cinnamon-clove-ice-cream-and-cider-caramel-sauce-102909"
}
