{
    "directions": [
        "For the pastry, place the flour, sugar, and salt in the bowl of a food processor fitted with a steel blade. Pulse a few times to combine. Add the butter and pulse 12 to 15 times, or until the butter is the size of peas. With the motor running, add the ice water all at once through the feed tube. Keep hitting the pulse button to combine, but stop the machine just before the dough becomes a solid mass. Turn the dough onto a well-floured board and form into a disk. Wrap with plastic and refrigerate for at least 1 hour.",
        "Preheat the oven to 450 degrees F.",
        "Flour a rolling pin and roll the pastry into an 11-inch circle on a lightly floured surface. Transfer it to a baking sheet.",
        "For the filling, peel, core, and cut the apples into 8ths. Cut each wedge into 3 chunks. Toss the chunks with the orange zest. Cover the tart dough with the apple chunks leaving a 1 1/2-inch border.",
        "Combine the flour, sugar, salt, cinnamon, and allspice in the bowl of a food processor fitted with a steel blade. Add the butter and pulse until the mixture is crumbly. Pour into a bowl and rub it with your fingers until it starts holding together. Sprinkle evenly on the apples. Gently fold the border over the apples to enclose the dough, pleating it to make a circle.",
        "Bake the crostata for 20 to 25 minutes, until the crust is golden and the apples are tender. Allow to cool. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "2 tablespoons granulated or superfine sugar",
        "1/4 teaspoon kosher salt",
        "1/4 pound (1 stick) very cold unsalted butter, diced",
        "2 tablespoons ice water",
        "1 1/2 pounds McIntosh, Macoun, or Empire apples (3 large)",
        "1/4 teaspoon grated orange zest",
        "1/4 cup flour",
        "1/4 cup granulated or superfine sugar",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon ground allspice",
        "4 tablespoons (1/2 stick) cold unsalted butter, diced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Apple Dessert",
        "Fruit Dessert Recipes",
        "Apple",
        "Dessert",
        "Fruit",
        "Baking",
        "Food Processor",
        "Pastry Recipes",
        "Beans and Legumes",
        "Pea Recipes",
        "Fall"
    ],
    "title": "Apple Crostata",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/apple-crostata-recipe"
}
