{
    "directions": [
        "To make the bottom crust, stir the flour and white sugar together in a bowl until well-combined. Rub the unsalted butter into the flour until the mixture resembles coarse crumbs; sprinkle with cold water, a couple of tablespoons at a time, mixing the dough together lightly with a fork until it barely holds together.",
        "Form the dough into a ball and roll it out to a circle about 1/8-inch thick. Gently ease the dough into an 8-inch pie dish. Cut off any excess pastry with a knife. Finish the edge of the crust by gently pressing the tines of a fork into the dough all the way around the edge of the pie dish. Set the crust aside.",
        "To make the pie filling, stir the apples, brown sugar, 2 tablespoons of flour, the cinnamon, nutmeg, ginger, and lemon juice together in a large bowl; set aside.",
        "To make the topping, mix 1/2 cup of flour, 1/2 cup of softened butter, and the superfine sugar together in a bowl until you have a sticky, moist dough.",
        "To assemble the pie, cover the bottom of the pie crust with a light, even layer of graham cracker crumbs. Fill the pie with the apple mixture, piling it up in a mound shape. Pinch off pieces of the topping mixture, flatten them a little with your fingers, and dot them at random all over the top of the filling, covering as much of the filling as possible.",
        "Preheat  oven to 425 degrees F (220 degrees C).",
        "Tear off 2 30-inch-long pieces of parchment paper and place them in a cross shape on a work surface. Place the filled pie in the center of the two pieces of parchment, bring the paper ends up over the pie and fold and staple the parchment paper over the pie to completely enclose and seal in the pie. The paper should not touch the top or sides of the pie. Place the parchment-wrapped pie on a baking sheet to catch any drips.",
        "Bake in the preheated oven for 1 hour. Don't peek inside the parchment paper while baking. Remove from the oven, carefully tear the parchment paper away from the pie, and let cool; serve warm. Store leftovers in refrigerator."
    ],
    "ingredients": [
        "Bottom Crust:",
        "1 cup all-purpose flour",
        "1 1/2 teaspoons white sugar",
        "6 tablespoons unsalted butter",
        "2 1/2 tablespoons cold water, or more as needed",
        "Pie Filling:",
        "5 pounds Granny Smith apples - peeled, cored and thinly sliced",
        "1/2 cup brown sugar",
        "2 tablespoons all-purpose flour",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1 pinch ground ginger",
        "2 tablespoons lemon juice",
        "2 tablespoons graham cracker crumbs",
        "Topping:",
        "1/2 cup all-purpose flour",
        "1/2 cup softened butter",
        "1/2 cup superfine sugar",
        "2 12x30-inch pieces of parchment paper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple Pie in a Brown Paper Bag",
    "url": "http://allrecipes.com/recipe/206369/apple-pie-in-a-brown-paper-bag/"
}
