{
    "directions": [
        "Bring cherries and Merlot to boil in small saucepan over medium-high heat. Remove from heat and cool. Let stand at room temperature overnight. Drain well.",
        "Combine flour, butter, sugar, and salt in bowl of electric mixer. Place bowl in freezer 15 minutes. Using electric mixer fitted with paddle attachment, beat mixture on low speed until pea-size clumps form. Drizzle 2/3 cup ice water over mixture and beat just until dough comes together. Gather dough into ball; divide into 2 pieces. Flatten each into disk. Wrap each separately in plastic; chill at least 8 hours and up to 1 day.",
        "Let 1 dough disk stand at room temperature 15 minutes to soften slightly. Roll out on lightly floured surface to 13-inch round. Transfer to 9-inch-diameter deep-dish glass pie dish. Trim overhang to 1 inch. Fold in overhang, forming double-thick sides. Refrigerate at least 30 minutes and up to 6 hours.",
        "Preheat oven to 450°F. Toss apples, 1/3 cup sugar, and cinnamon in large bowl to combine. Transfer to large rimmed baking sheet. Roast until apples soften slightly, about 15 minutes. Cool apple mixture. Reduce oven temperature to 425°F. Toss cherries, apple mixture, and hazelnuts in large bowl to combine.",
        "Let second dough disk stand at room temperature 15 minutes to soften slightly. Roll out disk on lightly floured surface to 13-inch round. Transfer filling to dough-lined dish. Brush edge of crust with egg glaze. Drape dough over filling. Trim top dough overhang to 1 inch. Press top and bottom dough edges together to seal. Crimp edges decoratively. Using sharp knife, cut 4 slashes in top of dough to allow steam to escape. Brush dough with egg glaze; sprinkle with raw sugar crystals.",
        "Bake pie 30 minutes. Reduce oven temperature to 350°F. Tent pie with foil. Continue baking until apples are tender and juices are bubbling thickly, about 25 minutes longer. Cool slightly. Serve warm or at room temperature with ice cream. (Can be made 8 hours ahead. Let stand on rack at room temperature.)"
    ],
    "ingredients": [
        "3/4 cup dried tart cherries",
        "1/2 cup Merlot",
        "3 1/4 cups all purpose flour",
        "1 3/4 cups (3 1/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "1/4 cup sugar",
        "1/2 teaspoon salt",
        "2/3 cup ice water",
        "4 pounds Golden Delicious apples, peeled, cored, cut into 1 1/2-inch chunks (about 12 cups)",
        "1/3 cup sugar",
        "1/4 teaspoon ground cinnamon",
        "1/2 cup hazelnuts, toasted, husked, coarsely chopped",
        "1 large egg, beaten to blend with 1 tablespoon water (for glaze)",
        "2 tablespoons raw sugar crystals or granulated sugar",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Thanksgiving",
        "Apple",
        "Cherry",
        "Fall",
        "Chill",
        "Hazelnut",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Pie with Hazelnuts and Dried Sour Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/apple-pie-with-hazelnuts-and-dried-sour-cherries-107335"
}
