{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch tube pan.",
        "Beat vegetable oil, 1 cup brown sugar, white sugar, and 1/2 cup butter in a bowl with an electric mixer until creamy. Beat in flour, eggs, vanilla extract, salt, baking soda, and nutmeg until batter is smooth.",
        "Toss apples with lemon juice in a bowl; coat evenly with cinnamon. Fold apples, raisins, walnuts, and coconut into the batter. Pour batter into the prepared pan; smooth the top.",
        "Bake in the preheated oven, rotating halfway, until a wooden skewer inserted into the center comes out clean, about 1 hour. Let cool, about 10 minutes. Poke holes all over the cake with a skewer.",
        "Melt 3/4 cup butter in a small saucepan over medium heat. Add 1 cup brown sugar and milk, stirring frequently until sauce comes to a boil. Cook for 3 minutes.",
        "Pour sauce slowly over the cake, filling all the holes and letting it soak in evenly. Let cake cool in the pan completely, at least 30 minutes.",
        "Stir margarita mix and confectioners' sugar together in a bowl until smooth and glossy. Invert cake onto a serving platter and drizzle glaze on top."
    ],
    "ingredients": [
        "1 cup vegetable oil",
        "1 cup brown sugar",
        "1 cup white sugar",
        "1/2 cup butter, softened",
        "3 cups all-purpose flour",
        "3 eggs",
        "2 teaspoons vanilla extract",
        "1 teaspoon salt",
        "1 teaspoon baking soda",
        "1 teaspoon ground nutmeg",
        "2 cups peeled and diced tart apples",
        "1 tablespoon lemon juice",
        "2 teaspoons ground cinnamon",
        "1 cup raisins",
        "1 cup chopped walnuts",
        "1 cup flaked coconut",
        "Sauce:",
        "3/4 cup butter",
        "1 cup brown sugar",
        "1/4 cup milk",
        "Glaze:",
        "1 cup margarita mix",
        "1/2 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple Dapple Cake with Lime Glaze",
    "url": "http://allrecipes.com/recipe/255636/apple-dapple-cake-with-lime-glaze/"
}
