{
    "directions": [
        "1. To make the apple butter: In a large saucepan, combine the apples, butter, sugar, and salt. Split the vanilla bean in half lengthwise and scrape the seeds directly into the pan (save the pods for adding to a canister of granulated sugar for vanilla sugar). Place over low heat and cook, stirring occasionally, for 30 to 40 minutes, or until the apples break down and the mixture thickens and turns golden brown. The mixture will release a lot of water at first and bubble a lot and then it will slowly start to caramelize and get a bit darker; there may still be some pieces of whole apple, which is fine. Remove from the heat and let cool. (The apple butter can be stored in an airtight container in the fridge for up to 4 days or in the freezer for up to 2 weeks.)",
        "2. Line the baking sheet with parchment paper and set aside. On a well-floured work surface, roll the puff pastry into a rectangle about 24 in/61 cm wide and 12 in/30.5 cm from top to bottom. The dough may seem pretty tough and difficult to roll out at first. Don't be afraid to be firm with the dough as you roll it into the rectangle, flip it upside down, turn it side to side, pound it with the rolling pin to flatten it. Use a chef's knife to trim away any rough edges. Then, using the knife or a bench scraper, cut the dough in half vertically. You should have two 12-in/30.5-cm squares.",
        "3. Set one square aside and place the other square on the prepared baking sheet. In the center of the square, draw an 8-in/20-cm circle with your finger or lightly with a paring knife (without cutting all the way through). Using the offset spatula or the back of a spoon, spread the frangipane evenly on the pastry, filling just the circle. Top the frangipane with an even layer of the apple butter.",
        "4. Crack the egg into a small bowl and whisk with a fork. Using the pastry brush, brush some of the egg over the pastry around the circle.",
        "5. Again on a well-floured surface, roll the second puff pastry square so that it is slightly larger than 12-in/30.5-cm square. Drape the second square directly over the top of the first square. Using your fingers, press firmly all around the edges of the pastry to seal the two squares together. There will be a big mound in the center where the frangipane and apple butter are. Again, using your fingers, press firmly all around the circle; you want to enclose the frangipane and apple butter as much as you can within the circle.",
        "6. With a small paring knife, cut a scalloped petal pattern around the edge of the puff pastry to create a circle with a total of six or seven petals. Discard the puff pastry scraps (or save them for a quick treat: sprinkle with cinnamon-sugar and bake until golden. Refrigerate the pastry for at least 30 minutes or up to 2 days to allow the puff to chill and relax. (If chilling for longer than 30 minutes, cover the pastry with plastic wrap to prevent it from drying out. At this point, you can also wrap the unbaked pastry well with plastic wrap and freeze it for up to 2 weeks.)",
        "7. Preheat the oven to 350°F/180°C, and place a rack in the center of the oven.",
        "8. Using the pastry brush, brush the entire top of the pastry, including the petals, with the remaining egg wash. Poke a hole in middle of the circular mound at the center of the pithivier and then, starting from the center of this hole, use the tip of the paring knife to trace a curved sun-ray pattern into the mound, spacing the rays 1/2 to 1 in/12 mm to 2.5 cm apart and covering the entire mound with the curved rays. You should have eighteen to twenty-four rays. Don't cut all the way through the puff; just lightly score the dough with the tip of the knife. Trace a crosshatch pattern on the petals.",
        "9. Bake for 1 hour to 1 hour and 10 minutes, or until the dough is entirely golden brown and baked through. Look at the sides of the pithivier where the puff pastry has puffed up to make sure the sides are also golden brown. Remove from the oven and let cool on the pan on a wire rack for at least 1 hour before serving to allow the filling to cool. This pastry is best served the same day, but you can hold it in an airtight container at room temperature for up to 2 days and then refresh it in a 300°F/150°C oven for 5 to 8 minutes before serving."
    ],
    "ingredients": [
        "6 apples, such as Granny Smith, peeled, halved, cored, and roughly chopped",
        "4 tbsp/55 g unsalted butter",
        "1 cup/200 g granulated sugar",
        "1/4 tsp kosher salt",
        "1/2 vanilla bean",
        "1 batch Puff Pastry dough",
        "1 cup/240 ml Frangipane",
        "1 large egg",
        "Special equipment: rimmed baking sheet, parchment paper, rolling pin, bench scraper (optional), offset spatula (optional), pastry brush"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Apple",
        "Fall",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Pithivier",
    "url": "http://www.epicurious.com/recipes/food/views/apple-pithivier-51189050"
}
