{
    "directions": [
        "Preheat oven to 350°F. Butter and flour three 9-inch-diameter cake pans with 1 1/2-inch-high sides. Combine apples and water in small saucepan. Cover; simmer over medium-low heat until apples are tender, about 20 minutes. Place in processor; purée until smooth. Cool purée. Sift 2 1/2 cups flour and next 5 ingredients into medium bowl. Toss currants with remaining 1 tablespoon flour in small bowl to coat; mix in walnuts.",
        "Using electric mixer, beat sugar, butter, brandy and vanilla in large bowl until blended. Beat in eggs 1 at a time. Beat in half of flour mixture and 1 1/4 cups apple purée, then remaining flour mixture (re-serve any remaining puree for another use). Stir in currants and walnuts. Divide batter among prepared pans.",
        "Bake cakes until tester inserted into center comes out clean, about 20 minutes. Cut around pan sides to loosen cakes; turn out onto racks and cool.",
        "Using electric mixer, beat butter and sugar in large bowl until blended. Beat in cream cheese, then maple syrup and flavoring. Chill until beginning to firm, about 20 minutes.",
        "Place 1 cake layer on platter. Spread with 3/4 cup frosting. Top with second layer; spread with 3/4 cup frosting. Top with third layer. Spread 1 cup frosting in thin layer over cake. Chill 15 minutes. Spread remaining frosting over cake. Press 2 cups walnuts halfway up sides of cake. Chill until frosting is set, at least 30 minutes. (Can be made 1 day ahead. Cover; keep chilled. Let stand at room temperature 1 hour before serving.)"
    ],
    "ingredients": [
        "1 pound Pippin apples (about 2 medium), peeled, cored, diced",
        "1/4 cup water",
        "2 1/2 cups plus 1 tablespoon all purpose flour",
        "2 teaspoons baking soda",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "1 cup dried currants",
        "1 cup walnuts (about 4 ounces), toasted, chopped",
        "2 cups sugar",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 tablespoon brandy",
        "1 1/2 teaspoons vanilla extract",
        "4 large eggs",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 cup (packed) dark brown sugar",
        "2 8-ounce packages cream cheese, room temperature",
        "1/2 cup pure maple syrup",
        "1/4 teaspoon maple flavoring",
        "2 cups walnuts, toasted, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Apple",
        "Walnut",
        "Fall",
        "Maple Syrup"
    ],
    "title": "Apple Cake with Maple-Walnut Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/apple-cake-with-maple-walnut-cream-cheese-frosting-15556"
}
