{
    "directions": [
        "Blend flour, sugar and salt in processor. Add shortening and butter and blend, using on/off turns, until coarse meal forms. Add 3 tablespoons ice water. Blend, using on/off turns, until moist clumps form, adding more water by 1/2 tablespoonfuls if dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour. (Can be made 1 day ahead. Keep chilled. Let dough soften slightly at room temperature before rolling out.)",
        "Combine prunes and Cognac in small bowl. Cover; let stand 2 hours, stirring often. Drain prunes, reserving Cognac. Cut prunes in half; set aside. Roll out dough on lightly floured surface to 12-inch round. Transfer dough to 9-inch-diameter tart pan with removable bottom. Fold overhang in and press, forming double-thick sides; refrigerate crust 30 minutes.",
        "Preheat oven to 400°F. Mix apples, sugar and 2 tablespoons butter in large bowl. Arrange apple wedges, overlapping slightly, in concentric circles in crust. Bake tart until apples are just tender, about 1 hour. Tuck prunes into spaces between apples. Brush fruit with 1 tablespoon butter. Bake tart until apples are very tender and crust is golden brown, about 20 minutes longer. Transfer tart to rack and cool 15 minutes.",
        "Blend 1 tablespoon reserved Cognac into strained preserves for glaze. Brush glaze over warm tart. Cut tart into wedges. Serve warm or at room temperature with ice cream, drizzling some of reserved Cognac over ice cream."
    ],
    "ingredients": [
        "1 1/4 cups all purpose flour",
        "1/2 teaspoon sugar",
        "1/2 teaspoon salt",
        "1/4 cup solid vegetable shortening, frozen, cut into 1/2-inch pieces",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "3 tablespoons (or more) ice water",
        "12 medium pitted prunes",
        "1/3 cup Cognac or brandy",
        "4 6- to 7-ounce Golden Delicious apples, peeled, quartered, cored, each quarter cut into 3 wedges",
        "3 tablespoons sugar",
        "3 tablespoons unsalted butter, melted",
        "1/4 cup apricot preserves, heated, strained",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Prune",
        "Apple",
        "Cognac/Armagnac",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple and Prune Tart with Vanilla Ice Cream and Cognac",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-prune-tart-with-vanilla-ice-cream-and-cognac-104612"
}
