{
    "directions": [
        "Pulse together flour, sugar, and salt in a food processor. Add butter and pulse until mixture resembles coarse meal. Sprinkle in 4 tablespoons ice water and pulse until pastry starts to hold together, adding remaining tablespoon ice water if needed. Turn dough out onto a very lightly floured surface and knead 4 or 5 times. Form dough into a disk and chill, wrapped in plastic wrap, 30 minutes.",
        "Simmer water, Calvados, and prunes, uncovered, until most of liquid is absorbed, about 10 minutes. Remove from heat and cool.",
        "Preheat oven to 400°F.",
        "Stir together cinnamon, cloves, 2 tablespoons flour, and 1/2 cup sugar.",
        "Peel and core apples and cut into 1/2-inch wedges. Halve wedges crosswise and toss with cinnamon mixture. Add lemon juice and toss to coat.",
        "Finely grind walnuts with remaining 3 tablespoons flour and remaining 1/4 cup sugar in a food processor.",
        "Roll out dough on a lightly floured surface into a 14- by 18-inch oval. Roll dough loosely onto floured rolling pin and unroll onto a large buttered baking sheet. Spinkle walnut mixture over pastry, leaving a 2 1/2- to 3-inch border.",
        "Stir stewed prunes into apple mixture and spoon over walnut mixture, evenly tucking prunes between apple pieces. Turn edge of dough over fruit to form pleats. Brush top of dough with milk and sprinkle with sugar.",
        "Bake tart, loosely covered with foil, in middle of oven 30 minutes. Remove foil and bake until crust and fruit are golden and juices are bubbling, about 30 minutes more. Cool tart on baking sheet on a rack at least 20 minutes before serving."
    ],
    "ingredients": [
        "1 2/3 cups all-purpose flour",
        "1 1/2 teaspoons sugar",
        "3/4 teaspoon salt",
        "1 1/4 sticks cold unsalted butter, cut into pieces",
        "4 to 5 tablespoons ice water",
        "1/3 cup water",
        "2 tablespoons Calvados",
        "1 cup packed pitted prunes (7 oz), halved",
        "1 teaspoon cinnamon",
        "Pinch of ground cloves",
        "5 tablespoons all-purpose flour",
        "3/4 cup sugar",
        "2 pounds tart green apples (5)",
        "1 1/2 tablespoons fresh lemon juice",
        "1/2 cup walnut pieces, toasted",
        "1 tablespoon whole milk",
        "1 tablespoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Prune",
        "Apple",
        "Fall",
        "Gourmet"
    ],
    "title": "Apple and Prune Tart",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-prune-tart-102587"
}
