{
    "directions": [
        "Adjust oven rack to lower-middle position and heat oven to 425 degrees.",
        "Mix 3 Tbs. of butter, 1/2 cup of brown sugar, 1 tsp. cinnamon and  all the nuts in a small bowl. Spoon a portion of the mixture into each hollowed-out apple core.",
        "For boxed pie crusts, unroll one of the dough sheets onto a floured work surface.  Pulling on sides of dough to straighten rounded edges, roll it into an approximate 12-inch square, then cut the dough into four 6-inch squares; brush the perimeter of each square with egg white. Set an apple half on each square. Bring up the 4 corners of dough around the apple and pinch edges to seal. Place on a large (at least 18- by 12-inch) parchment-covered baking dish. Brush dumpling tops and sides with egg white; sprinkle with sugar.  Repeat process with remaining apples and dough.",
        "Bake dumplings until pastry sets and starts to turn golden brown, about 10 minutes. Reduce heat to 375  and bake until golden brown, about 20 minutes longer.",
        "While apples bake, bring 1 cup water, the remaining 2 Tbs. butter, 1/2 cup brown sugar and 1 tsp. cinnamon to boil in asmall saucepan over medium heat. Dissolve cornstarch in 2 tsps. water; whisk into hot syrup for a smooth sauce. Cover, keep warm.",
        "For each serving, spoon a portion of sauce on a dessert plate. Set apple dumpling over warm sauce; serve immediately."
    ],
    "ingredients": [
        "5 tablespoons softened butter",
        "1 cup packed dark brown sugar",
        "2 teaspoons ground cinnamon",
        "1/4 cup chopped toasted pecans or walnuts",
        "4 apples (any variety but Red Delicious) peeled, halved, and cored, a thin sliver cut off bottoms so apples sit flat",
        "1 (15 ounce) container 9-inch pie crusts",
        "1 egg white",
        "2 tablespoons sugar",
        "2 teaspoons cornstarch"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple Dumplings with Rich Cinnamon Sauce",
    "url": "http://allrecipes.com/recipe/89853/apple-dumplings-with-rich-cinnamon-sa/"
}
