{
    "directions": [
        "Mix flour, sugar, and salt in processor. Cut in butter, using on/off turns, until mixture resembles coarse meal. Whisk yolk, 1 tablespoon ice water, and vanilla extract in small bowl to blend. Add egg mixture to processor; blend until dough clumps together, adding more ice water by teaspoonfuls if dough is dry. Form dough into ball; flatten into disk. Wrap in plastic wrap; chill at least 1 hour.",
        "Roll out dough on floured surface to 12-inch round. Transfer to 9-inch-diameter tart pan with removable bottom. Trim dough overhang to 1 inch; fold dough overhang in and press onto sides of pan. Pierce crust all over with fork. Refrigerate crust for 1 hour.",
        "Position rack in bottom third of oven and preheat to 400°F. Mix first 3 ingredients in bowl. Arrange apple slices in concentric circles in crust, overlapping and fitting tightly together. Sprinkle with sugar mixture. Dot with butter. Bake until apples are tender and beginning to brown and crust is golden, about 55 minutes. Cool tart in pan on rack at least 45 minutes. (Can be made 6 hours ahead. Let stand at room temperature.)",
        "Serve tart slightly warm or at room temperature with cheese."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1 teaspoon sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "1 large egg yolk",
        "1 tablespoon (or more) ice water",
        "1/2 teaspoon vanilla extract",
        "1/4 cup sugar",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1 1/2 pounds Fuji apples (about 3 large), peeled, quartered, cored, cut into 1/4 inch-thick slices",
        "1 tablespoon unsalted butter, cut into small pieces",
        "8 ounces sharp cheddar cheese, cut into 8 wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Cheese",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Cheddar",
        "Apple",
        "Fall",
        "Winter",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Crostata with Cheddar Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/apple-crostata-with-cheddar-cheese-106136"
}
