{
    "directions": [
        "Whisk eggs, maple syrup, brown sugar, vanilla, cinnamon, and sea salt in large bowl. Add milk, cream, and brandy and whisk until well blended. Add bread cubes and press to submerge into custard. Let soak at least 30 minutes, occasionally pressing on bread cubes to submerge.",
        "Meanwhile, position rack in bottom third of oven and preheat to 350°F. Generously butter 9x5-inch glass or ceramic loaf pan with at least 3-inch-high sides. Melt 3 tablespoons butter in large nonstick skillet over medium-high heat. Add apple slices and sauté until deep golden and beginning to soften, stirring and turning apple slices frequently, 10 to 12 minutes. Stir in 1/4 cup maple syrup, then brown sugar. Simmer until sugar dissolves and mixture thickens to syrup, about 1 minute. Remove from heat.",
        "Mix half of apple slices into breadcustard mixture. Transfer bread pudding mixture to prepared pan. Arrange remaining apple slices atop bread pudding in 2 lengthwise rows. Spoon any remaining syrup from skillet over apple slices. Place loaf pan on rimmed baking sheet (to catch any spills during baking).",
        "Bake bread pudding until puffed and cracked on top, apples are deep brown, and instant-read thermometer inserted into center of pudding registers 170°F to 180°F, about 1 hour 30 minutes (pudding will rise high above top of pan). Remove from oven and let rest at room temperature 45 minutes to 1 hour (pudding will fall). Brush apples on top of pudding with additional maple syrup. Spoon pudding into bowls and serve warm or at room temperature."
    ],
    "ingredients": [
        "6 large eggs",
        "1/2 cup pure maple syrup (preferably Grade B)",
        "1/2 cup (packed) dark brown sugar",
        "1 tablespoon vanilla extract",
        "2 teaspoons ground cinnamon",
        "1/2 teaspoon fine sea salt",
        "1 cup whole milk",
        "1 cup heavy whipping cream",
        "2 tablespoons apple brandy (such as applejack or Calvados)",
        "1 1-pound loaf pain rustique, all crust trimmed, bread cut into 3/4- to 1-inch cubes (6 1/2 to 7 cups)",
        "3 tablespoons unsalted butter",
        "2 1/2 pounds Granny Smith apples (about 5), peeled, quartered, cored, cut into 1/3-inch-thick slices (about 7 cups)",
        "1/4 cup pure maple syrup plus additional for brushing (preferably Grade B)",
        "1/4 cup (packed) dark brown sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Milk/Cream",
        "Dessert",
        "Sauté",
        "Christmas",
        "High Fiber",
        "Oscars",
        "Apple",
        "Brandy",
        "Winter",
        "Cinnamon",
        "Potluck",
        "Calvados",
        "Maple Syrup",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple and Maple Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-maple-bread-pudding-356873"
}
