{
    "directions": [
        "Place rack in top third of oven; preheat to 450°F. Butter a shallow 2-qt. baking dish and sprinkle with demerara sugar. Combine granulated sugar and zest in a medium bowl. Scrape in seeds from vanilla bean; save pod for another use. Massage zest and seeds into sugar with your fingers until mixture is very fragrant.",
        "Blend eggs in a blender until very frothy, about 1 minute. With motor running, gradually stream in milk, then brandy. Add sugar mixture, crème fraîche, flour, and 1 tsp. salt and blend just until smooth. Let custard rest while you roast the apples.",
        "Cook remaining 4 Tbsp. butter in a small saucepan over medium heat, stirring often, until butter foams, then browns (do not let it burn), about 5 minutes. Remove from heat and add apples, a pinch of salt, and remaining 2 Tbsp. demerara sugar and toss to coat.",
        "Arrange apples in a single layer on a rimmed baking sheet. Roast in oven, tossing halfway through, until caramelized and tender, 25–30 minutes. Let apples sit until they are cool enough to handle but still warm (otherwise they’ll stick), then arrange in prepared dish, reserving a few slices for placing on top. Add figs, reserving a few for on top. Place dish on a rimmed baking sheet and carefully pour custard over fruit. Arrange reserved apple slices and figs on top. Reduce oven temperature to 375°F and bake custard until golden and center is firm, 30–35 minutes. Let cool slightly before serving.",
        "Custard can be blended 1 day ahead. Cover and chill. Bring to room temperature and mix gently before pouring over fruit."
    ],
    "ingredients": [
        "4 tablespoons unsalted butter, plus more for dish",
        "2 tablespoons demerara sugar, plus more for sprinkling",
        "1/2 cup granulated sugar",
        "2 teaspoons finely grated lemon zest",
        "1 vanilla bean, halved lengthwise",
        "3 large eggs, room temperature",
        "2/3 cup whole milk, room temperature",
        "2 tablespoons apple brandy or dark rum",
        "3/4 cup crème fraîche, room temperature",
        "1/2 cup all-purpose flour",
        "1 teaspoon kosher salt, plus more",
        "2 pounds firm baking apples (about 4 large), peeled, cored, sliced into 1/2-inch-thick rings",
        "6 ounces fresh mission figs, halved lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Apple",
        "Fig",
        "Breakfast",
        "Custard",
        "Fall"
    ],
    "title": "Apple and Fig Custard",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-fig-custard"
}
