{
    "directions": [
        "Place a large skillet over medium-high heat and melt 1 tablespoon butter just until the edges of the butter look slightly browned and smells nutty, about 1 minute. Stir apples into butter and cook until they just begin to soften, about 2 minutes. Sprinkle with sugar and continue to cook until apples are soft and slightly caramelized, about 5 minutes. Transfer apples to a plate and spread out to cool.",
        "Preheat oven to 400 degrees F (200 degrees C). Grease 4 ramekins generously with butter. Place ramekins onto a sheet pan.",
        "Melt 2 tablespoons butter in a small skillet over medium heat; stir in flour and cook until mixture is smooth and raw taste of flour is cooked out of the roux, 2 to 3 minutes. Pour milk into roux, bring to a simmer, and whisk until mixture thickens to a smooth white sauce, about 2 minutes. Cook, whisking, for 1 minute more and remove from heat; cool white sauce to lukewarm temperature.",
        "Pour white sauce into a large mixing bowl and whisk in salt, black pepper, cayenne pepper, nutmeg, and egg yolks. Stir Cheddar cheese into white sauce mixture until thoroughly combined.",
        "Whisk egg whites in a glass or metal bowl until they hold soft, fluffy peaks, about 2 minutes. Gently fold half the beaten egg whites into the souffle batter. Repeat with remaining whites to make a soft, airy batter. Fold in cooled apple mixture. Divide mixture into prepared ramekins.",
        "Bake in the preheated oven until souffles have risen and tops are browned, about 22 minutes. Souffles will fall slightly as they cool. Serve warm."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=undefined",
    "ingredients": [
        "1 tablespoon butter",
        "1  Granny Smith apple - peeled, cored, and diced",
        "1 tablespoon white sugar",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1 cup 2% milk",
        "½ teaspoon salt",
        "1 pinch freshly ground black pepper",
        "1 pinch cayenne pepper",
        "1 pinch freshly grated nutmeg",
        "2  eggs, separated",
        "3 ounces sharp white Cheddar cheese, shredded"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple and Cheddar Cheese Souffles",
    "url": "http://allrecipes.com/recipe/235274/apple-and-cheddar-cheese-souffles/"
}