{
    "directions": [
        "For the filling: Preheat the oven to 400 degrees F. Toss the apples with 2 heaping tablespoons of the sugar, the flour, cinnamon and nutmeg. Add the butter, and toss. Divide the filling between two 6-ounce, 3 1/2-inch ramekins, tent each loosely with foil and bake until the apples are tender and the juice is bubbling, about 35 minutes. Remove the ramekins from the oven, remove the foil, give the apples barely a stir with a fork and press the top into the juices.",
        "For the topping: Whisk together the flour, the baking powder, salt and 1 teaspoon of the sugar in a small bowl. Quickly stir in the heavy cream, then work the dough with your fingers as if you were working butter into pie dough, to make moist, slightly flattened chunks of dough.",
        "Top each ramekin with dough, dividing evenly. Sprinkle each with 1/2 teaspoon of the remaining sugar, and bake until the topping is browned and crisp, 12 to 15 minutes. Let cool slightly, top with ice cream and serve."
    ],
    "ingredients": [
        "1 large Honeycrisp or 2 Gala apples (about 12 ounces), peeled, cored and cut into 1/4-inch pieces (2 generous cups)",
        "2 heaping tablespoons plus 1 teaspoon sugar",
        "1 teaspoon all-purpose flour",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon freshly grated nutmeg",
        "1 tablespoon cold unsalted butter, cut into small pieces",
        "1/4 cup all-purpose flour",
        "Heaping 1/4 teaspoon baking powder",
        "Pinch fine salt",
        "2 teaspoons sugar",
        "3 tablespoons heavy cream",
        "2 small scoops vanilla ice cream, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Apple Cobbler",
        "Apple",
        "Cobbler Recipes",
        "Fruit",
        "Apple Dessert",
        "Fruit Dessert Recipes",
        "Dessert"
    ],
    "title": "Apple Cobbler for Two",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/apple-cobbler-for-two"
}
