{
    "directions": [
        "Using electric mixer, beat all ingredients in small bowl until blended.",
        "Combine lemon juice and peel in bowl. Coarsely grate apples into bowl, tossing to coat with juice.",
        "Whisk flour, brown sugar, baking powder, and salt in large bowl. Make well in center of dry ingredients. Whisk in milk, eggs, and 1/4 cup melted butter until smooth. Stir in apple mixture. Cover and let batter stand at room temperature at least 30 minutes and up to 1 hour.",
        "Preheat oven to 250°F. Place baking sheet in oven. Heat heavy large nonstick griddle or skillet over medium-high heat 1 minute. Brush griddle with some of remaining 1/4 cup melted butter. For each pancake, drop 1 heaping tablespoon batter onto griddle, spacing pancakes apart. Cook until golden on bottom and bubbles start to form on surface, about 3 minutes. Turn pancakes over. Cook until golden on bottom, about 2 minutes longer. Transfer pancakes to baking sheet in oven to keep warm. Repeat with remaining batter, brushing griddle with butter before each batch of pancakes.",
        "Arrange pancakes on plates. Top each with dollop of cinnamon butter and serve."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup powdered sugar",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon grated orange peel",
        "2 teaspoons fresh lemon juice",
        "1 teaspoon grated lemon peel",
        "2 medium Granny Smith apples (scant 1 pound), peeled, halved, cored",
        "1 2/3 cups all purpose flour",
        "2 tablespoons (packed) golden brown sugar",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "3/4 cup whole milk",
        "2 large eggs",
        "1/2 cup (1 stick) unsalted butter, melted, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Breakfast",
        "Brunch",
        "Kid-Friendly",
        "Quick & Easy",
        "Lemon",
        "Apple",
        "Fall",
        "Cinnamon",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Pancakes with Cinnamon Butter",
    "url": "http://www.epicurious.com/recipes/food/views/apple-pancakes-with-cinnamon-butter-109488"
}
