{
    "directions": [
        "Arrange apples in even layer in heavy large skillet. Sprinkle with sugar, then pour apple cider over. Cover and cook over medium heat until apples are tender, gently turning apples occasionally, 8 to 10 minutes. Uncover; cook until juices evaporate, frequently but carefully turning apples to keep wedges intact, about 10 minutes. Remove from heat. Let apples cool completely in skillet. DO AHEAD: Can be made 1 day ahead. Transfer to bowl. Cover; chill.",
        "Preheat oven to 350°F. Spread breadcrumbs on large rimmed baking sheet. Bake until dried and light golden, stirring occasionally, about 20 minutes. Cool.",
        "Finely grind hazelnuts and 6 tablespoons sugar in processor. Add 3 cups breadcrumbs; process 5 seconds. Transfer mixture to large bowl. Stir in 4 tablespoons sugar, lemon peel, and salt. Combine milk and butter in small saucepan. Stir over medium heat just until butter melts. Pour milk-butter mixture over breadcrumb mixture; stir until moistened (dough will be sticky). Let dough rest in bowl until liquid is absorbed, about 15 minutes. Transfer 1 cup dough to floured work surface. Gather into ball; flatten into disk. Press out to 9-inch round; wrap in plastic. Chill at least 1 hour for top crust. Transfer remaining dough to work surface. Gather into ball; flatten into disk. Press disk onto bottom and up sides of 9-inch tart pan with removable bottom, pushing crust up to extend 1/2 inch above sides. Cover; chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
        "Preheat oven to 375°F. Fill crust with apple mixture. Place top crust over filling. Fold bottom crust overhang up over top crust edges, pressing together to seal.",
        "Bake torte until crust is deep golden and crust begins to separate from sides of pan (top crust may crack), about 1 hour. Cool in pan on rack at least 2 hours. Carefully remove sides from tart pan. Transfer to platter. Dust with powdered sugar. Cut into wedges. Serve with whipped cream."
    ],
    "ingredients": [
        "2 pounds Granny Smith apples, peeled, cored, cut into 1/2-inch wedges",
        "1/3 cup sugar",
        "1 cup hard apple cider or dry white wine",
        "8 cups fresh breadcrumbs made from crustless Italian or French bread (finely ground in processor)",
        "1 cup hazelnuts, toasted , husked",
        "10 tablespoons sugar, divided",
        "4 teaspoons finely grated lemon peel",
        "1/4 teaspoon (generous) salt",
        "3/4 cup whole milk",
        "6 tablespoons (3/4 stick) unsalted butter, cut into 1-inch pieces",
        "Powdered sugar (for dusting)",
        "Whipped cream",
        "Special equipment: 9-inch-diameter tart pan with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dessert",
        "Bake",
        "Apple",
        "Fall",
        "Hazelnut",
        "Breadcrumbs",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Torte with Breadcrumb-Hazelnut",
    "url": "http://www.epicurious.com/recipes/food/views/apple-torte-with-breadcrumb-hazelnut-361256"
}
