{
    "directions": [
        "Mix flour, sugar, and salt in medium bowl. Add butter. Cut in with back of fork until butter is reduced to oatmeal-size flakes. Add 3 tablespoons ice water. Toss until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap and chill at least 1 hour and up to 1 day.",
        "Mix flour, brown sugar, cornmeal, cinnamon, and salt in bowl. Add butter. Blend with back of fork until moist clumps form. Mix in almonds.",
        "Set rack at lowest position in oven and preheat to 400°F. Place 6 tablespoons sugar in large bowl. Scrape in seeds from vanilla bean; stir to blend well. Mix in apples. Add 2 tablespoons melted butter and toss to coat.",
        "Roll out dough on floured sheet of parchment paper to 13 1/2-inch round. Arrange apple filling in center, mounding slightly and leaving 2-inch plain border. Gently fold dough border over edge of filling, pleating loosely and pinching any cracks to seal. Brush dough border with remaining 1 tablespoon melted butter and sprinkle with remaining 1 tablespoon sugar. Sprinkle topping over exposed apple filling.",
        "Slide rimless baking sheet under parchment and crostata and place in oven. Bake until crust is crisp and apples are tender, turning baking sheet after 20 minutes, about 40 minutes total.",
        "Run knife under crostata to loosen from paper. Cool crostata completely on paper on baking sheet."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1/2 teaspoon sugar",
        "1/8 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, diced",
        "3 tablespoons (or more) ice water",
        "2/3 cup all purpose flour",
        "6 tablespoons (packed) golden brown sugar",
        "2 tablespoons yellow cornmeal",
        "1 1/4 teaspoons ground cinnamon",
        "1/8 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, diced",
        "2/3 cup blanched slivered almonds",
        "7 tablespoons sugar, divided",
        "1 vanilla bean, split lengthwise",
        "4 large Pippin or Sierra Beauty apples (2 to 2 1/4 pounds total), peeled, halved, sliced 1/4-inch thick",
        "3 tablespoons unsalted butter, melted, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Apple",
        "Almond",
        "Vanilla",
        "Cinnamon",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Crostata with Cinnamon-Almond Topping",
    "url": "http://www.epicurious.com/recipes/food/views/apple-crostata-with-cinnamon-almond-topping-232713"
}
