{
    "directions": [
        "1. To make the crumble, preheat the over to 350°F; position a rack in the middle. Line a rimmed baking sheet with parchment paper.",
        "2. In a bowl, whisk together the flour, sugar, baking powder, salt, and nutmeg until combined. Add the butter and, using a fork, cut it into the mixture until it resembles wet sand. Refrigerate for about 20 minutes, or until chilled. Sprinkle the chilled crumble mixture over the prepared baking sheet. Bake for 15 minutes, or until golden brown. Transfer the baking sheet to a wire rack and let the crumble cool completely before breaking it into small pieces. Set aside.",
        "3. To make the apples, in a saucepan, combine the apples, sugar, vanilla, cinnamon, salt, and pepper and let the fruit macerate for 30 minutes. Place the saucepan over low heat and cook until the apples are tender, about 10 minutes. Remove from heat and set aside for 5 minutes. Stir in the calvados; let cool to room temperature.",
        "4. To make the ice cream base, pour the milk into a double boiler or a heatproof bowl set over a saucepan of simmering water (the bottom of the bowl should not touch the water). Whisk in 1/2 cup (100 grams) of the sugar and the salt and stir until they have dissolved. Warm the mixture until you see stream rising from the top.",
        "5. Meanwhile, prepare an ice bath in a large bowl and set another bowl over it. Set aside.",
        "6. In a medium bowl, with a kitchen towel underneath it to prevent slipping, whisk together the egg yolks with the remaining 2 tablespoons (25 grams) sugar until uniform. While whisking, add a splash of the hot dairy mixture, whisking it in bit by bit, until you've added about half. Add the yolk mixture to the remaining dairy mixture in the double boiler. Set the heat under the double boiler to medium and cook the custard, stirring continuously with a wooden spoon and reducing the heat to medium-low as necessary, until steam begins to rise from the surface and the custard thickens enough to coat the back of the spoon. Hold the spoon horizontally and run your finger through the custard. If the trail left by your finger stays separated, the custard is ready to be cooled.",
        "7. Strain the custard into a bowl and stir in the crème fraîche. If the mixture seems a bit runny and has lost its thick consistency, return the custard to the double boiler, and cook, stirring, until the custard has thickened enough to coat the back of the spoon. Repeat the finger gap test until the trail left by your finger stays separated. Strain the custard into the bowl sitting over the prepared ice bath, add the vanilla, and stir for 3 to 5 minutes, or until the custard has cooled. Transfer the custard to a quart-size container, cover, and refrigerate for at least 4 hours or, preferably, overnight.",
        "8. Pour the chilled custard into an ice cream maker and freeze according to the manufacturer's instructions. Place the container in which you refrigerated the custard in the freezer so you can use it to store the finished ice cream. Churn the ice cream until the texture resembles \"soft serve.\" In the last 30 seconds of churning, add the crumble and the cooked apples. You can also manually fold the crumble and apples into the ice cream. Transfer the ice cream to the chilled storage container and freeze until hardened to your desired consistency. Alternatively, you can serve it immediately—it will be the consistency of gelato. The ice cream will keep, frozen, for up to 7 days."
    ],
    "ingredients": [
        "2/3 cup (83 grams) all- purpose flour",
        "6 tablespoons (75 grams) sugar",
        "1 teaspoon baking powder",
        "1/4 teaspoon (1 gram) kosher salt",
        "1/4 teaspoon (1 gram) freshly grated nutmeg",
        "12 tablespoons (1 1/2 sticks/ 170 grams) unsalted butter, melted and cooled",
        "2 cups apples (about 2 medium apples, preferably Granny Smiths, cut into 1/4-inch dice)",
        "1/4 cup (50 grams) sugar",
        "1/2 teaspoon pure vanilla extract",
        "1/8 teaspoon ground cinnamon",
        "1/8 teaspoon kosher salt",
        "1/8 teaspoon freshly ground pink peppercorns",
        "2 tablespoons calvados or other brandy",
        "1 1/2 cups whole milk",
        "1/2 cup plus 2 tablespoons (125 grams) sugar",
        "1/4 teaspoon (1 gram) kosher salt",
        "6 large egg yolks",
        "2 cups crème fraîche",
        "1/2 teaspoon pure vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Frozen Dessert",
        "Apple",
        "Summer",
        "Calvados",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Crumble with Calvados and Créme Fraîche Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/apple-crumble-with-calvados-and-creme-fraiche-ice-cream-56389915"
}
