{
    "directions": [
        "Onto an 8-inch round cake pan pour the butter, swirling the pan, and sprinkle it with brown sugar, 2 tablespoons of the ginger, and the currants. In a small bowl toss the apple slices with the lemon juice and arrange them evenly over the currants. Into another small bowl sift together the flour, the baking powder, the salt, and the cinnamon. In a bowl with an electric mixer beat the eggs with the granulated sugar and the vanilla for 3 to 5 minutes, or until the mixture is thick and pale and forms a ribbon when the beaters are lifted. Fold in the flour mixture gently but thoroughly, pour the batter over the apple slices, and bake the cake in the middle of a preheated 400°F. oven for 20 to 25 minutes, or until the tester comes out clean. Run a sharp knife around the edge of the pan, invert the cake onto a serving plate, and serve it warm with the whipped cream, sprinkled with the additional ginger."
    ],
    "ingredients": [
        "1/2 stick (1/4 cup) unsalted butter, melted",
        "1/4 cup firmly packed light brown sugar",
        "2 tablespoons finally chopped crystallized ginger plus additional for garnish",
        "2 tablespoons currants or raisins",
        "1 larger MacIntosh or Granny Smith apple, peeled, cored, and sliced thin",
        "1 tablespoon fresh lemon juice",
        "1/2 cup all-purpose flour",
        "1/2 teaspoon double-acting baking powder",
        "1/4 teaspoon salt",
        "1/2 teaspoon cinnamon",
        "2 large eggs",
        "1/4 cup plus 2 tablespoons granulated sugar",
        "1/2 teaspoon vanilla",
        "whipped cream or vanilla ice cream as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Currant",
        "Apple",
        "Winter",
        "Gourmet"
    ],
    "title": "Apple Ginger Upside-Down Cake",
    "url": "http://www.epicurious.com/recipes/food/views/apple-ginger-upside-down-cake-10281"
}
