{
    "directions": [
        "Preheat oven to 350°F with rack in middle.",
        "Stir together all chili nut ingredients in a metal pie plate. Bake, stirring occasionally, until liquid is absorbed and nuts are coated with spice mixture and dry, about 20 minutes. Cool to room temperature, stirring occasionally.",
        "Warm apples in a large bowl of warm water, turning occasionally, about 15 minutes, then drain and pat dry.",
        "Meanwhile, cook bacon in a 12-inch heavy skillet over medium heat, stirring occasionally, until browned and crisp, about 12 minutes. Transfer with a slotted spoon to paper towels to drain and reserve 6 tablespoons fat in skillet.",
        "Using slicer, cut apples into 1/8-inch-thick slices into a large bowl, rotating apple a quarter turn each time you reach core, then continuing to slice until left with nothing but core. Gently toss with lime juice.",
        "Heat fat in skillet over medium heat until hot, then pour over apples and gently toss with bacon and 1/4 teaspoon pepper. Divide among 8 shallow bowls and sprinkle with lychees, scallions, and chili nuts."
    ],
    "ingredients": [
        "1 cup unsalted dry-roasted peanuts",
        "2 tablespoons Asian fish sauce (preferably Tiparos brand)",
        "1 teaspoon chili powder",
        "1/8 teaspoon cayenne",
        "1 1/2 pounds Winesap or Gala apples (3 to 4)",
        "1 1/2 pounds Mutsu (also called Crispin) or Golden Delicious apples (3 to 4)",
        "1/2 pound slab bacon, any rind discarded, cut crosswise into 1/2-inch lardons (sticks)",
        "3 tablespoons fresh lime juice",
        "16 canned lychees (from a 20-ounce can), drained and quartered, at warm room temperature",
        "1/2 cup chopped scallions at room temperature",
        "Equipment: an adjustable-blade slicer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fruit",
        "Nut",
        "Pork",
        "Bake",
        "Dinner",
        "Lunch",
        "Apple",
        "Meat",
        "Bacon",
        "Peanut",
        "Fall",
        "Winter",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Apple and Smoked-Bacon Salad with Lychees and Chili Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-smoked-bacon-salad-with-lychees-and-chili-nuts-240261"
}
