{
    "directions": [
        "Blend together flour, sugar, salt, zest, and butter in a bowl with your fingertips or a pastry blender (or pulse in a food processor) until mixture resembles coarse meal. Whisk together egg and vanilla in a small bowl and drizzle over flour mixture, then gently stir with a fork (or pulse) until incorporated and dough begins to form large clumps.",
        "Gather all dough together, then divide dough in half and form each half into a 5- to 6-inch disk. Chill, wrapped in plastic wrap, until more firm, but not hard, about 30 minutes.",
        "Melt butter in a heavy, wide 6- to 8-quart pot over medium-high heat. Stir in brown sugar, lemon juice, cinnamon, salt, and apples, and cook, uncovered, stirring and turning apples over occasionally, until apples soften and juices thicken and begin to caramelize, 10 to 15 minutes (lower heat if apple mixture browns too quickly). Transfer to a shallow bowl and chill until cooled.",
        "Heat oven to 350°F with rack in middle. Invert bottom of springform pan (to make it easier to slide crostata off bottom), then lock pan. Generously butter springform pan and chill or freeze briefly to firm up butter.",
        "Press one disk of dough evenly onto bottom and 1 inch up side of pan (use the smooth bottom of a metal measuring cup to help make it even). Chill tart shell.",
        "Roll out remaining disk of dough between 2 sheets of wax paper into a 10-inch round (dough will be very tender). Peel off top sheet of paper, then cut dough into 10 (3/4-inch-wide) strips and slide (still on paper) onto a baking sheet. Chill until firm, about 15 minutes in refrigerator or 5 minutes in freezer.",
        "Spoon apple filling in shell, distributing slices evenly. Arrange 5 strips of dough parallel to each other, 1 inch apart, on filling, trimming edges flush with edge of pan (dough will tear easily; patch any breaks with fingers). Arrange remaining 5 strips diagonally across first strips, 1 inch apart, to form a lattice, and trim edges.",
        "Gather remaining dough and roll into several long, 1/4-inch-thick ropes. Press enough ropes around edge of crostata in a single layer, smoothing seams with fingers, to form an even edge (you will have a little dough left over).",
        "Bake crostata until pastry is pale golden, 50 minutes to 1 hour.",
        "Near end of baking, heat apricot preserves with 1 teaspoon water in a small saucepan over medium-low heat, stirring, until melted, then strain through a sieve into a small bowl.",
        "When crostata is done, brush top with warm apricot glaze. Let cool completely in pan on a wire rack, then remove side of pan.",
        "Heat cream in a small saucepan over medium heat until it just begins to simmer, then remove from heat and keep hot, covered.",
        "Stir sugars together with 1/2 teaspoon lemon juice in a heavy 2 1/2- to 3-quart saucepan, then cook undisturbed over medium heat until mixture is partially melted (reduce heat if mixture turns dark around edge). Continue to cook, stirring occasionally with a fork, until completely melted and mixture is a deep golden caramel.",
        "Carefully pour in hot cream (mixture will bubble up and caramel may harden slightly) and quickly whisk in pumpkin pie spice and salt. Reduce heat and simmer, stirring, until caramel is dissolved and sauce is reduced to about 1 cup, about 5 minutes. Remove from heat and whisk in butter until melted. Transfer to a glass measure to let cool slightly.",
        "To serve, either slide crostata from pan bottom onto a flat serving plate or serve on pan bottom."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1/3 cup granulated sugar",
        "1/4 teaspoon salt",
        "1 teaspoon grated fresh lemon zest",
        "1 1/2 sticks (3/4 cup) unsalted butter, cut into tablespoon pieces",
        "1 large egg",
        "1 teaspoon pure vanilla extract",
        "1/2 stick (1/4 cup) unsalted butter, cut into tablespoon pieces",
        "1/3 cup packed light brown sugar",
        "2 tablespoons fresh lemon juice",
        "1/4 teaspoon cinnamon",
        "1/8 teaspoon salt",
        "2 1/2 pounds apples (a combination of tart apples, such as Granny Smith, and sweeter apples, such as Honeycrisp and Gala), peeled and cut into 1/4-inch-thick slices",
        "1/3 cup apricot preserves or jam",
        "1 teaspoon water",
        "1 cup heavy cream",
        "1/4 cup granulated sugar",
        "1/4 cup packed light brown sugar",
        "1/2 teaspoon fresh lemon juice",
        "1/4 teaspoon pumpkin pie spice",
        "1/8 teaspoon salt",
        "2 tablespoons unsalted butter, cut into small pieces",
        "Accompaniment: Vanilla ice cream or whipped cream",
        "Special equipment: 9-inch springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Apple",
        "Spice",
        "Fall",
        "Cinnamon",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Crostata with Spiced Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/apple-crostata-with-spiced-caramel-sauce-51138040"
}
