{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Spray a 9-inch pie dish with cooking spray.",
        "To make the crust, beat 1/2 cup of butter with cream cheese in a mixing bowl with an electric mixer until thoroughly combined; scrape the sides of mixing bowl occasionally to incorporate all the butter and cream cheese. Beat in 1 1/4 cups flour, the white sugar, and salt on medium-low speed until the mixture looks like coarse cornmeal, about 20 seconds. Increase the speed to medium-high, and beat until the dough begins to clump together, about 30 more seconds.",
        "Lay out a 24-inch piece of waxed paper on a work surface, and scoop the dough out onto the left half of the paper. Form it into a ball, and flatten it into a 6-inch disk; fold the right side of the paper over the dough disk, covering  the dough. With the rolling pin on top of the paper, gently roll the dough out into a round crust about 1/8-inch thick; peel off the top half of the waxed paper, turn the dough out onto the prepared pie dish, and fit the dough into the dish. Peel of the remaining portion of waxed paper.",
        "To make the filling, mix together the apples and lemon juice in a bowl. In a small bowl, mix 1/4 cup of brown sugar, 2 tablespoons of flour, the cinnamon, nutmeg, and ginger together until thoroughly combined, then mix the flour mixture with the apples. Pour the apple filling into the crust.",
        "To make the topping, combine 1/4 cup of brown sugar, 2 tablespoons of flour, and the oats; with a pastry cutter, cut in 6 tablespoons of butter, until the mixture looks like coarse crumbs. Spoon the topping evenly over the apple filling.",
        "Bake in the preheated oven until the apple filling is bubbling and the topping is golden brown, about 40 minutes. If the crust begins to look  brown after about 20 minutes of baking, cover the crust edge with a strip of aluminum foil."
    ],
    "ingredients": [
        "1/2 cup butter, softened",
        "2 ounces cream cheese, softened",
        "1 1/4 cups all-purpose flour",
        "2 tablespoons white sugar",
        "1/4 teaspoon salt",
        "6 cups Granny Smith apples - peeled, cored and thinly sliced",
        "1 tablespoon lemon juice",
        "1/4 cup brown sugar",
        "2 tablespoons all-purpose flour",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon ground ginger",
        "1/4 cup brown sugar",
        "2 tablespoons all-purpose flour",
        "10 tablespoons quick cooking oats",
        "6 tablespoons butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple Crisp Pie",
    "url": "http://allrecipes.com/recipe/216022/apple-crisp-pie/"
}
