{
    "directions": [
        "Combine apples and next 11 ingredients in heavy large saucepan. Cook over medium heat until apples are tender, stirring frequently, 30 to 35 minutes. Add brandy and simmer until brandy is absorbed and apples are very tender, about 7 minutes longer. Cool apple mixture completely. DO AHEAD: Filling can be made 2 days ahead. Cover and chill.",
        "Line 2 large rimmed baking sheets with parchment paper or silicone liners. Place phyllo stack on work surface; cover with plastic wrap, then damp kitchen towel. Remove 1 phyllo sheet from stack and place on work surface; brush lightly with some of melted butter. Top with second phyllo sheet; brush lightly with melted butter. Fold phyllo in half, forming 9x7-inch rectangle. Brush lightly with melted butter and sprinkle with 2 teaspoons brown sugar; using fingers, distribute sugar evenly over phyllo. Fold phyllo in half again, forming 7 x 4 1/2-inch rectangle. Brush with butter and transfer phyllo rectangle to 1 prepared baking sheet. Using fingers, gently push in corners of phyllo pastry and fold up sides of crust, creating rustic irregular pastry shell with 2 3/4- to 3-inch plain center and 1/2-inch-high sides. Brush pastry shell lightly with melted butter. Repeat procedure with remaining phyllo sheets, melted butter, and brown sugar, placing 4 phyllo pastry shells on each prepared baking sheet, spacing apart. DO AHEAD: Phyllo pastry shells can be made 1 day ahead. Cover loosely with plastic wrap and refrigerate.",
        "Position rack in center of oven and preheat to 375°F. Divide apple filling among phyllo pastry shells (about 1/3 to scant 1/2 cup for each). Brush filling lightly with melted butter. Sprinkle 1 teaspoon brown sugar over apple filling on each. Bake until phyllo is golden brown, 20 to 22 minutes. Cool tartlets on baking sheets on racks until just warm, about 20 minutes. Serve slightly warm or at room temperature."
    ],
    "ingredients": [
        "2 pounds Pink Lady apples, peeled, cored, cut into 1/2-inch cubes (about 8 cups)",
        "1 cup dried tart cherries",
        "1/2 cup (packed) golden brown sugar",
        "1/4 cup fresh orange juice",
        "3 tablespoons butter",
        "1/2 teaspoon finely grated lemon peel",
        "1/2 teaspoon finely grated orange peel",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "Pinch of coarse kosher salt",
        "2 tablespoons brandy",
        "16 14 x 9-inch sheets frozen regular phyllo pastry or whole wheat phyllo pastry, thawed",
        "1 cup (2 sticks) unsalted butter, melted",
        "1/2 cup (about) golden brown sugar, divided",
        "Ingredient info: Whole wheat phyllo dough is available in the frozen foods section of Whole Foods markets and some natural foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "High Fiber",
        "Apple",
        "Cherry",
        "Fall",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple-Cherry Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/apple-cherry-tartlets-361818"
}
