{
    "directions": [
        "Place the flour and salt in a food processor, and process to mix. Add the butter and process until the mixture resembles coarse cornmeal. With the food processor running, slowly add the water and process just until it is combined and the mixture is crumbly. Turn it out onto a lightly floured surface and gently press it into a ball. Let the pastry sit, covered, at room temperature for 1 hour.",
        "Preheat the oven to 425°F.",
        "Lightly flour a work surface, and roll out the pastry to a 14-inch circle. Roll the pastry around the rolling pin and unroll it in a 9 1/2 inch, removable bottom tart tin, with the edges of the pastry overlapping evenly all around. Gently fit the pastry against the sides of the tart tin.",
        "Mince the rosemary. Place half the apple slices in the pastry, sprinkle with half the sugar and the rosemary. Top with the remaining apples and the remaining sugar. Bring the edges of the pastry up and over the apples- they won't completely cover the apples, which is fine.",
        "Whisk together the egg and the water, and brush the pastry with the mixture. Place the tart tin on a baking sheet, and bake in the lower third of the oven until the pastry is golden and the apples are softened and juicy, about 30 minutes.",
        "Remove from the oven and place the tart tin on an upturned bowl to remove the sides. Let the tart cool to lukewarm, or room temperature,then serve."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "Large pinch sea salt",
        "7 tablespoons unsalted butter, chilled and cut in small pieces",
        "5 to 6 tablespoons chilled water.",
        "1 tablespoon fresh rosemary leaves",
        "6 good-sized tart apples, cored, peeled and cut in 1/4-inch thick slices",
        "2/3 cup sugar",
        "1 small egg",
        "1 teaspoon water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Herb",
        "Dessert",
        "Bake",
        "Apple",
        "Rosemary",
        "Fall"
    ],
    "title": "Apple and Rosemary Tarte",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-rosemary-tarte-15616"
}
