{
    "directions": [
        "Roll out pastry on a lightly floured surface with a floured rolling pin into a rough 16-inch round (1/8 inch thick), then transfer carefully to parchment-lined large baking sheet. Loosely fold in edge of pastry where necessary to fit on baking sheet, then chill, covered loosely with plastic wrap, 30 minutes.",
        "Preheat oven to 425°F.",
        "While pastry is chilling, peel and core apples, then cut into 1/8-inch-thick slices. Toss slices with lemon juice and 1/3 cup granulated sugar.",
        "Put baking sheet with pastry on a work surface and unfold any edges so pastry is flat. Spread applesauce over pastry, leaving a 2-inch border, and top sauce with sliced apples, mounding slightly. Fold edges of dough over filling, partially covering apples (center will not be covered) and pleating dough as necessary. Dot apples with butter, then brush pastry edge lightly with water and sprinkle with remaining 1/2 tablespoon granulated sugar. Bake galette in middle of oven until pastry is golden and apples are tender, 40 to 45 minutes.",
        "While galette is baking, melt apple jelly in a very small saucepan over moderately low heat, stirring.",
        "Slide baked galette on parchment onto a rack, then brush with melted jelly and cool galette until warm or room temperature.",
        "Beat together cream and confectioners sugar in a bowl with an electric mixer until cream just holds soft peaks, then beat in Calvados. Serve galette topped with dollops of Calvados cream."
    ],
    "ingredients": [
        "All-butter pastry dough",
        "1 3/4 pound Gala apples",
        "2 teaspoons fresh lemon juice",
        "1/3 cup plus 1/2 tablespoon granulated sugar",
        "Calvados applesauce",
        "3 tablespoons unsalted butter, cut into 1/2-inch pieces",
        "1 1/2 tablespoons apple jelly",
        "1 cup chilled heavy cream",
        "1 tablespoon confectioners sugar",
        "1 1/2 tablespoons Calvados",
        "Special equipment: parchment paper; a large baking sheet (at least 14 inches wide)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fruit",
        "Dessert",
        "Bake",
        "Lemon",
        "Apple",
        "Brandy",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple and Calvados Tart",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-calvados-tart-107610"
}
