{
    "directions": [
        "Bring cider to a boil in a large saucepan. Reduce heat and simmer until reduced to about 2 cups, 15–20 minutes. Stir in butter and brown sugar continue to simmer, stirring occasionally, until reduced to about 1 1/2 cups, about 8 minutes more. Remove from heat; glaze will thicken as it sits.",
        "Bring cider to a simmer in a medium saucepan and cook until reduced to about 2 Tbsp., 20–30 minutes. Let cool.",
        "Meanwhile, combine flour, baking powder, baking soda, and salt in a large bowl.",
        "Beat granulated sugar and butter in the bowl of a stand mixer fitted with the paddle attachment on medium speed until smooth, about 3 minutes.",
        "Add egg and continue to beat, scraping down sides of bowl as needed, until incorporated. Reduce speed to low and gradually add buttermilk and reserved reduced cider, beating just until combined. Gradually add dry ingredients and beat just until dough comes together.",
        "Turn out dough onto a large piece of parchment paper and cover with a second sheet of parchment. Using a rolling pin, roll dough between parchment sheets to about 1/3\" thick. Transfer dough in parchment to a rimmed baking sheet and freeze until firm, about 20 minutes.",
        "Peel off top sheet of parchment. Working on bottom sheet, punch out as many rounds as you can with 3\" cutter, then use 1\" cutter to punch out center of each round. Gather doughnut holes and scraps and re-roll; repeat process 3–4 times until all dough has been used (you should have 12 doughnuts). Place doughnuts on a second parchment-lined baking sheet and freeze until slightly chilled, about 5 minutes.",
        "Pour oil into a heavy-duty pot to a depth of 2\" and fit pot with deep-fry thermometer. Heat oil to 375ºF. Working in batches, fry doughnuts until deep golden brown, about 1 minute per side. Transfer to a wire rack lined with paper towels and let cool 2-3 minutes. Dip warm doughnuts in Cider-Caramel Glaze. Place on rack to let glaze set, about 3 minutes, then dip again."
    ],
    "ingredients": [
        "4 cups spiced apple cider",
        "1/2 cup (1 stick) unsalted butter, cut into pieces",
        "1/2 cup (packed) dark brown sugar",
        "1 cup spiced apple cider",
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon kosher salt",
        "1/2 cup granulated sugar",
        "2 tablespoons unsalted butter, cut into pieces, room temperature",
        "1 large egg, room temperature",
        "1/3 cup buttermilk",
        "2 quarts canola oil (for frying)",
        "A 3\" round cutter, 1\" round cutter, deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Kid-Friendly",
        "Apple",
        "Fall",
        "Deep-Fry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Cider Doughnuts with Cider-Caramel Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/apple-cider-doughnuts-with-cider-caramel-glaze-56390162"
}
