{
    "directions": [
        "Combine the lemon and 4 cups water in a large bowl. Place the sliced apples in the water to keep them from browning.",
        "Melt butter in a large skillet over medium heat. Drain water from apples, and place them into the hot skillet. Cook and stir for about 2 minutes. Add brown sugar, and cinnamon, and cook, stirring, for 2 more minutes. Stir together cornstarch and 1 tablespoon water. Pour into the skillet, and mix well. Cook for another minute, or until sauce has thickened. Remove from heat to cool slightly.",
        "Preheat the oven to 400 degrees F (200 degrees C).",
        "Unfold puff pastry sheets, and repair any cracks by pressing them back together. Trim each sheet into a square. Then cut each larger square into 4 smaller squares. Spoon apples onto the center of each squares. Fold over from corner to corner into a triangle shape, and press edges together to seal. Place turnovers on a baking sheet, leaving about 1 inch between them.",
        "Bake for 25 minutes in the preheated oven, until turnovers are puffed and lightly browned. Cool completely before glazing.",
        "To make the glaze, mix together the confectioners' sugar, milk and vanilla in a small bowl. Adjust the thickness by adding more sugar or milk if necessary. Drizzle glaze over the cooled turnovers."
    ],
    "ingredients": [
        "2 tablespoons lemon juice",
        "4 cups water",
        "4 Granny Smith apples - peeled, cored and sliced",
        "2 tablespoons butter",
        "1 cup brown sugar",
        "1 teaspoon ground cinnamon",
        "1 tablespoon cornstarch",
        "1 tablespoon water",
        "1 (17.25 ounce) package frozen puff pastry sheets, thawed",
        "1 cup confectioners' sugar",
        "1 tablespoon milk",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple Turnovers",
    "url": "http://allrecipes.com/recipe/59124/apple-turnovers/"
}
