{
    "directions": [
        "Stir applesauce, brown sugar, tomato sauce, vinegar, salt, garlic powder, cinnamon, liquid smoke, chili powder, paprika, black pepper, cayenne pepper, and cloves together in a large pot; bring to a boil, reduce heat to low, and simmer until thickened, 1 1/2 to 2 hours.",
        "Sterilize jars and lids in boiling water for at least 5 minutes.",
        "Pour sauce into hot, sterilized jars, filling to within 1/4 inch of the top. Run a knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 20 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "8 cups applesauce",
        "6 cups brown sugar",
        "4 cups tomato sauce",
        "1 1/2 cups apple cider vinegar",
        "4 teaspoons salt",
        "4 teaspoons garlic powder",
        "1 tablespoon ground cinnamon",
        "2 teaspoons liquid smoke flavoring",
        "2 teaspoons chili powder",
        "2 teaspoons paprika",
        "1 teaspoon black pepper",
        "1/2 teaspoon cayenne pepper",
        "1/4 teaspoon ground cloves",
        "7 1-pint canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple BBQ Sauce for Canning",
    "url": "http://allrecipes.com/recipe/236800/apple-bbq-sauce-for-canning/"
}
