{
    "directions": [
        "Into a chilled large metal bowl sift together flour and salt. Set a grater in bowl and using largest teardrop-shaped holes coarsely grate frozen butter into flour, gently lifting and tossing flour to coat butter. Chill mixture 20 minutes. Drizzle 8 tablespoons ice water evenly over mixture and gently stir with a fork until just incorporated. Test mixture by gently squeezing a small handful: When it has proper texture it should hold together without crumbling apart. If necessary, add more water, 1 tablespoon at a time, stirring until just incorporated, and test mixture again. (If you overwork or add too much water, pastry will be tough.)",
        "Turn mixture out onto a lightly floured surface and with floured hands mound into 4 portions. With heel of hand smear each portion once in a forward motion to help distribute fat. Gather dough portions together and form it, rotating it on work surface, into a disk (dough will not be smooth). Chill dough, wrapped in plastic wrap, at least 2 hours, or until firm, and up to 2 days.",
        "On floured surface with a floured rolling pin roll out dough 1/4 inch thick (about a 15-inch round). Fit dough into a 12 1/2- by 1-inch fluted round tart pan with a removable bottom and with a rolling pin roll over top of shell to trim pastry flush with rim. With a fork prick bottom of shell all over. Chill shell 30 minutes.",
        "Preheat oven to 425° F.",
        "Line shell with foil and fill with pie weights or raw rice. Bake shell in middle of oven 20 minutes. Carefully remove weights or rice and foil and bake shell until golden, about 10 minutes more. Cool shell in pan on a rack.",
        "Peel, core, and chop 1 apple. In a saucepan cook chopped apple, apricots, 1/2 cup sugar, and water, covered, over moderately low heat, stirring occasionally, until fruit is tender, about 12 minutes. Cool mixture 20 minutes. In a food processor pulse mixture until smooth and transfer to a small bowl. Chop prunes and stir into purée. Peel remaining 4 apples and quarter. Core apples and cut lengthwise into 1/8-inch-thick slices.",
        "Spoon apricot purée evenly into shell and smooth top. Decoratively arrange apple slices, overlapping them, over purée and sprinkle with remaining 2 tablespoons sugar.",
        "Bake tart in middle of oven until apple slices are slightly browned and crust is golden brown, about 45 minutes. Cool tart slightly in pan on rack. In a small saucepan melt jam over low heat and pour through a fine sieve into a small bowl. Press hard on solids and discard. With a pastry brush, brush glaze evenly over tart.",
        "Serve tart with crème fraîche or whipped cream."
    ],
    "ingredients": [
        "2 1/4 cups cake flour (not self-rising)",
        "1/2 teaspoon salt",
        "2 sticks (1 cup) unsalted butter, frozen",
        "8 to 10 tablespoons ice water",
        "Pie weights or raw rice for weighting shell",
        "5 Granny Smith apples (about 2 1/2 pounds)",
        "1 cup dried apricots",
        "1/2 cup plus 2 tablespoons sugar",
        "1 cup water",
        "1/2 cup pitted prunes",
        "1/2 cup apricot jam",
        "Accompaniment: crème fraîche or whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Prune",
        "Apple",
        "Apricot",
        "Fall",
        "Gourmet"
    ],
    "title": "Apple, Apricot, and Prune Tart",
    "url": "http://www.epicurious.com/recipes/food/views/apple-apricot-and-prune-tart-14973"
}
