{
    "directions": [
        "Combine 2 cups flour, undissolved yeast, sugar, salt and cinnamon in a large mixer bowl. Heat milk and butter to very warm (120 degrees to 130 degrees F). Add to flour mixture with egg yolks; beat for 2 minutes at low speed. Continue adding remaining flour, until soft dough forms.",
        "Knead on a lightly floured surface until smooth and elastic (about 4 to 6 minutes). Cover and let rest for 10 minutes. Roll out dough on a lightly floured counter into a 12-inch circle, about 1/2-inch thick. Using a 3-inch cookie or biscuit cutter, cut out as many rounds as possible. Cut out center with a 1-inch cookie cutter or poke hole through the center with finger. Place doughnuts about 2 to 3 inches apart on lightly greased or parchment lined baking sheet. Re-roll and cut remaining dough. Cover doughnuts and let rise for 45 minutes to 1 hour.",
        "Heat at least 2 inches of oil in a deep fryer or deep pan to 350 degrees F. Fry 2 to 3 doughnuts at a time, turning occasionally until well browned, about 2 to 3 minutes. Remove from oil and drain on paper towels. Cool a few minutes, then transfer to wire rack. Drizzle with Apple Cider Glaze OR using tongs, dunk the doughnuts in the glaze. Serve warm.",
        "For Apple Cider Glaze:  Boil apple cider in a small saucepan until reduced in half, about 7 to 10 minutes.",
        "Place powdered sugar in medium bowl. Whisk in hot cider and corn syrup until smooth."
    ],
    "ingredients": [
        "Doughnuts:",
        "3 1/4 cups all-purpose flour, or more if needed (divided)",
        "2 envelopes Fleischmann's® RapidRise Yeast",
        "2 tablespoons sugar",
        "1 teaspoon salt",
        "1 teaspoon Spice Islands® Ground Saigon Cinnamon",
        "1 cup milk plus",
        "2 tablespoons milk",
        "1/4 cup butter or margarine",
        "3 egg yolks",
        "Mazola® Corn Oil for deep frying",
        "Apple Cider Glaze:",
        "1 cup apple cider",
        "2 cups powdered sugar",
        "1 tablespoon Karo® Light Corn Syrup"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple Cider Glazed Doughnuts",
    "url": "http://allrecipes.com/recipe/218695/apple-cider-glazed-doughnuts/"
}
