{
    "directions": [
        "Preheat oven to 350 degrees F. Line an 8x8x2-inch square baking pan with Reynolds(R) Parchment Paper*.",
        "Whisk together all-purpose flour, whole wheat flour, baking powder, cinnamon, salt, and allspice in a medium bowl. Set aside.",
        "Cream the sugar and butter with an electric mixer on medium speed in a medium bowl about 2 minutes or until light and fluffy. Add egg; beat to combine. Beat in applesauce and vanilla. Reduce speed to low and gradually add in the flour mixture. Stir in apple and the peanut butter pieces. Spread into prepared pan.",
        "Bake 35 to 40 minutes or until a toothpick inserted into the center comes out clean.",
        "Remove from oven and cool 5 minutes in the pan. Lift the cake out of the pan using the parchment paper. Place on a wire rack to cool completely. Using the parchment paper, transfer the cake to a cutting board.",
        "Drizzle with Peanut Butter Glaze. Allow cake to stand until glaze is set before slicing.",
        "Peanut Butter Glaze: In a small bowl, stir together 2/3 cups powdered sugar, 3 tablespoons creamy peanut butter, and 2 to 3 tablespoons milk to make a thick glaze of drizzling consistency."
    ],
    "ingredients": [
        "3/4 cup all-purpose flour",
        "1/4 cup whole wheat flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground allspice",
        "3/4 cup packed brown sugar",
        "2 tablespoons butter, softened",
        "1 egg",
        "1/4 cup applesauce",
        "1/2 teaspoon vanilla",
        "3/4 cup tart apple, such as Granny Smith, peeled and diced",
        "1/4 cup peanut butter chips",
        "Peanut Butter Glaze:",
        "3 tablespoons creamy peanut butter",
        "2 tablespoons milk, or more as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple Peanut Butter Cake",
    "url": "http://allrecipes.com/recipe/238406/apple-peanut-butter-cake/"
}
