{
    "directions": [
        "Place turkey neck, heart and gizzard in large pot. Add 8 cups cold water and 2 celery stalks; bring to boil. Reduce heat to medium-low and simmer 1 hour. Strain into large measuring cup. Return turkey stock to pot; simmer until reduced to 4 cups, about 30 minutes. (Can be prepared 1 day ahead. Cover; chill.)",
        "Position rack in bottom third of oven and preheat to 350°F. Rinse turkey inside and out; pat dry. Remove excess fat from neck and main cavities. Place turkey on rack set in large roasting pan. Place onion, apple and remaining 2 celery stalks in main cavity. Rub outside of turkey with bacon drippings; sprinkle with salt and pepper. Loosely tie legs together to hold shape. Cover breast portion of turkey with sheet of heavy-duty foil. Pour turkey stock into pan around turkey.",
        "Roast turkey 1 1/2 hours. Remove foil from over breast. Baste turkey with pan juices. Continue to roast turkey until thermometer inserted into thickest part of thigh registers 180°F, basting occasionally with pan juices, about 1 1/4 hours longer. Transfer turkey to platter; let stand at least 20 minutes.",
        "Pour juices from roasting pan into large glass measuring cup. Spoon off fat, reserving 2 tablespoons. If necessary, add enough chicken broth to degreased pan juices to measure 2 1/2 cups. Heat 2 tablespoons turkey fat in heavy medium saucepan over medium-high heat. Add flour; whisk until beginning to color, about 2 minutes. Gradually whisk in pan juices and any collected juices from platter holding turkey. Boil gravy until thickened enough to coat spoon, whisking often, about 8 minutes. Season with salt and pepper. Serve turkey with gravy."
    ],
    "ingredients": [
        "1 14- to 15-pound turkey; neck, heart and gizzard reserved",
        "8 cups cold water",
        "4 large celery stalks",
        "1 white onion, quartered",
        "1 tart green apple, quartered",
        "Bacon drippings or olive oil",
        "Canned low-salt chicken broth (if needed)",
        "2 tablespoons all purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Onion",
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Apple",
        "Fall"
    ],
    "title": "Apple-Onion Roast Turkey with Pan Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/apple-onion-roast-turkey-with-pan-gravy-104290"
}
