{
    "directions": [
        "Heat butter in a large skillet over medium-high heat. Add apples, 1/2 cup sugar and cranberries; cover and cook until apples release their liquid, about 5 minutes. Remove lid and continue to cook, stirring frequently, until soft apples fall apart and juices thicken to a thin-syrup consistency, about 5 minutes longer. Pour onto a large-lipped cookie sheet or jellyroll pan and cool to room temperature. (Can be refrigerated in an airtight container up to 5 days.)",
        "Adjust oven rack to low position and heat oven to 400 degrees. Open puff pastry sheet on a lightly floured work surface. Roll into a rectangle, about 10 by 16 inches. Transfer to a large cookie sheet. (I suggest lining the sheet with parchment paper; this ensures the crostada doesn't stick and allows easy cleanup.)",
        "Spread cooked apples over pastry, leaving a 2-inch border. Fold up pastry borders over apples. Unfold corners and form ruffled creases to keep dough from overlapping. Brush pastry border with egg white and sprinkle with the remaining 1 Tb. sugar. Bake until pastry is golden brown, 25 to 30 minutes. Serve warm or at room temperature with optional ice cream or whipped cream."
    ],
    "ingredients": [
        "3 tablespoons butter",
        "2 pounds Granny Smith apples (or other firm, crisp apples), peeled, quartered, cored and sliced 1/4-inch thick",
        "1 pound Macintosh apples (or other soft-textured apples that fall apart when cooked), peeled, quartered, cored, and sliced 1/4-inch thick",
        "1/2 cup sugar",
        "1/2 cup dried cranberries",
        "1 sheet frozen puff pastry, thawed but still cold (follow package directions)",
        "1 egg white, lightly beaten",
        "1 tablespoon sugar",
        "Optional: Ice cream or lightly sweetened whipped cream (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apple-Cranberry Crostada",
    "url": "http://allrecipes.com/recipe/76931/apple-cranberry-crostada/"
}
