{
    "directions": [
        "Preheat oven to 400°F. Butter 13x9x2-inch glass or ceramic baking dish. Melt 6 tablespoons butter in large nonstick skillet over medium heat. Add onions, thyme, and 2 teaspoons salt; sauté until onions are translucent, about 10 minutes. Increase heat to medium-high; sauté until onions are tender and begin to color, about 8 minutes longer. Remove from heat. Add remaining 6 tablespoons butter, 2/3 cup water, wine, and sugar to skillet; stir and swirl skillet to combine. Bring to boil. Cool onion mixture to lukewarm.",
        "Combine potatoes, apples, remaining 2 teaspoons salt, and onion mixture in large bowl; toss gently to blend. Transfer to prepared baking dish, spreading evenly. Cover dish with parchment paper, then cover with foil, shiny side down. Bake gratin until potatoes are tender, about 55 minutes. Uncover and bake until top browns and juices bubble thickly, about 20 minutes longer. (Can be made 6 hours ahead. Let stand uncovered at room temperature. Rewarm, loosely covered with foil, in 300°F oven for 20 minutes.) Let gratin stand 15 minutes before serving.",
        "This gratin is unusual for having no cream or cheese — letting the lovely seasonal flavors of the produce shine through."
    ],
    "ingredients": [
        "12 tablespoons (1 1/2 sticks) butter, divided",
        "2 pounds onions, sliced",
        "2 tablespoons (packed) chopped fresh thyme",
        "4 teaspoons fine sea salt, divided",
        "2/3 cup water",
        "2/3 cup dry white wine",
        "4 teaspoons sugar",
        "2 1/2 pounds Yukon Gold, yellow Finn, or German Butterball potatoes, peeled, cut into 1/4-inch-thick rounds",
        "2 pounds tart apples (such as Granny Smith, Pippin, or Pink Lady), peeled, halved, cored, cut into 1/4-inch-thick slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Onion",
        "Potato",
        "Side",
        "Bake",
        "Vegetarian",
        "Apple",
        "Winter",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple, Potato, and Onion Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/apple-potato-and-onion-gratin-231602"
}
