{
    "directions": [
        "Preheat the oven to 350°F. Peel and core the apples, but do not discard the peels. Slice the peeled apples into 1/4 inch slices and place into a large mixing bowl.",
        "Combine 1 cup of the sliced apples, the apple skins, the honey, 1 tablespoon flour, cinnamon, and nutmeg in the bowl of a food processor. Process on high speed until the skins are finely chopped, about 3 minutes. (This will seem like a long time.) Stop and scrape the sides of the bowl as needed. Stir the chopped mixture into the bowl of sliced apples, then spoon into a greased 8‑inch square baking pan. Set aside.",
        "To make the topping, combine all the topping ingredients in a medium mixing bowl. Stir until blended, then spoon over the apples. Place the pan on the middle rack of the oven and bake 50-60 minutes, or until the top is golden brown and the apple slices are tender. Cool 10-15 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "2 1/2 pounds apples, preferably Granny Smith or another nutritious variety",
        "1/2 cup honey",
        "1 tablespoon unbleached all-purpose flour, whole-wheat flour, or rice flour",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "3/4 cup unbleached all-purpose flour, whole-wheat flour, or rice flour",
        "3/4 cup rolled oats (not instant)",
        "1/2 cup chopped walnuts",
        "1/2 cup dark brown sugar, firmly packed, or 1/2 cup honey",
        "1/2 cup (1 stick) unsalted or salted butter, melted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Dessert",
        "Bake",
        "Apple",
        "Oat",
        "Fall",
        "Healthy",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Crisp With Apple Skins",
    "url": "http://www.epicurious.com/recipes/food/views/apple-crisp-with-apple-skins-51173610"
}
