{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Melt the butter in a large saute pan over medium heat. Toss in the apples and stir to coat them with the butter. Add the lemon juice and the apple cider. Cook until the apples have softened and the cider has reduced by half. Transfer the mixture to a food processor and pulse into a coarse paste. Reserve.",
        "In a large mixing bowl combine the flour, cinnamon, baking soda, nutmeg, both of the sugars and a pinch of salt. Make a well in the dry ingredients and add the pureed apples, the egg and vanilla. Stir to combine. Toss in the walnuts and raisins.",
        "Butter and flour a loaf pan. Pour the batter into the prepared pan and put it in the preheated oven. Bake until a toothpick, inserted in the center comes out clean, about 40 to 45 minutes.",
        "Remove the pan from the oven and let cool for 10 minutes. Remove the cake from the pan and cool completely.",
        "Cut the cake in half equatorially and spread half of the icing on the bottom layer. Replace the top half and ice the top of the cake, leave the sides bare. Slice and serve.",
        "Beat together all of the ingredients in a stand mixer or with a hand mixer until light and fluffy."
    ],
    "ingredients": [
        "1/2 stick butter, plus extra for loaf pan",
        "3 Granny Smith apples, peeled and cored, cut into 1/2-inch dice and tossed with a little lemon juice",
        "1/2 lemon, juiced",
        "1 cup apple cider",
        "1 3/4 cups all-purpose flour, plus extra for loaf pan",
        "1 teaspoon ground cinnamon",
        "1 teaspoon baking soda",
        "3 or 4 grates fresh nutmeg (about 1/2 teaspoon)",
        "3/4 cup brown sugar",
        "3/4 cup sugar",
        "Pinch kosher salt",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1/2 cup toasted and chopped walnuts",
        "1/2 cup golden raisins",
        "Cream Cheese Icing, recipe follows",
        "One 8-ounce package cream cheese, at room temperature",
        "1 stick butter, at room temperature",
        "1 cup powdered sugar",
        "1 teaspoon vanilla extract",
        "1/2 lemon, juiced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Apple Cake",
        "Apple",
        "Cake",
        "Fruit",
        "Apple Dessert",
        "Fruit Dessert Recipes",
        "Cheese",
        "Cream Cheese Recipes"
    ],
    "title": "Apple Spice Cake with Cream Cheese Icing",
    "url": "http://www.foodnetwork.com/recipes/anne-burrell/apple-spice-cake-with-cream-cheese-icing-recipe"
}
