{
    "directions": [
        "In a large bowl with a pastry blender or in a food processor blend or pulse together flour, sugar, salt, and butter until mixture resembles coarse meal. Add 2 tablespoons ice water and toss with a fork or pulse until incorporated. Add enough remaining ice water, 1 tablespoon at a time, tossing or pulsing to incorporate, until mixture begins to form a dough. On a work surface smear dough in 3 or 4 forward motions with heel of hand to slightly develop gluten in flour and make dough easier to work with. Form dough into a ball and flatten to form a 1-inch-thick disk. Wrap dough in plastic wrap and chill 30 minutes.",
        "In a small bowl with your fingertips blend butter, brown sugar, and flour until smooth and blend in nuts. Chill topping, covered.",
        "Peel and core apples. Cut apples into 1/2-inch wedges and in a bowl toss with remaining filling ingredients to coat.",
        "Preheat oven to 350°F.",
        "On a lightly floured surface roll out dough into a 15-inch round (about 1/8 inch thick) and fold into quarters for ease of handling. Unfold dough in a well-seasoned 10-inch cast-iron skillet or 10-inch deep-dish (1 1/2-quart) pie plate, easing to fit and letting dough overhang rim of skillet or pie plate. Spoon filling into shell and fold pastry overhang over filling, leaving center uncovered. Bake pie in middle of oven 1 hour (pie will not be completely cooked) and remove from oven.",
        "Crumble topping over center of pie, breaking up any large chunks. Brush crust with milk and sprinkle with sugar. Bake pie in middle of oven 30 minutes more, or until crust is golden and filling is bubbling. Cool pie on a rack.",
        "Serve pie warm or at room temperature with ice cream.",
        "In a heavy saucepan combine half-and-half, 3/4 cup sugar, and vanilla bean and bring just to a boil. Remove pan from heat. In a bowl whisk together egg yolks and remaining 1/4 cup sugar and add hot half-and-half mixture in a stream, whisking. Return custard to pan and cook over moderately low heat, stirring, until 170°F. on a candy thermometer.",
        "Remove pan form heat. Scrape seeds form vanilla bean into custard and discard pod. Stir sour cream into custard until combined well and strain through a fine sieve into a bowl. Chill custard until cold and feeze in an ice-cream maker. Makes about 1 quart."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "2 tablespoons granulated sugar",
        "3/4 teaspoon salt",
        "1 stick (1/2 cup) plus 2 tablespoons cold unsalted butter",
        "4 to 6 tablespoons ice water",
        "2 tablespoons unsalted butter, softened",
        "2 tablespoons firmly packed brown sugar",
        "2 tablespoons all-purpose flour",
        "1/4 cup chopped walnuts",
        "3 pounds Golden Delicious or Jonagold apples (about 6 medium)",
        "1/2 cup firmly packed brown sugar",
        "1/4 cup granulated sugar",
        "2 tablespoons all-purpose flour",
        "1 tablespoon fresh lemon juice",
        "3/4 teaspoon cinnamon",
        "2 tablespoons milk",
        "1 tablespoon granulated sugar",
        "2 cups half-and-half",
        "1 cup sugar",
        "1 vanilla bean, split lengthwise",
        "8 large egg yolks",
        "2 cups (1 pint) sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Apple",
        "Walnut",
        "Winter",
        "Gourmet"
    ],
    "title": "Apple Pie with Walnut Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/apple-pie-with-walnut-streusel-11404"
}
