{
    "directions": [
        "Divide butter between 2 (5- to 6-quart) wide heavy pots. Heat over moderately high heat until foam subsides, then sauté apples with sugar and zest, divided evenly between pots, stirring, until apples are slightly softened, about 5 minutes.",
        "Transfer apples with a slotted spoon to 2 (2 1/2- to 3-quart) buttered shallow baking dishes (2 inches deep).",
        "Transfer all apple juices to 1 pot. Stir in preserves and brandy and bring to a boil, stirring occasionally. Pour mixture over apples.",
        "Preheat oven to 375deg;F.",
        "Pulse flour, sugar, and salt in a food processor just until blended. Add butter and pulse just until mixture resembles coarse meal. Transfer to a large bowl and add chilled cream, stirring gently with a rubber spatula to form a dough. (Dough will be sticky at first, but it will stiffen slightly as flour absorbs cream.)",
        "Knead dough on a floured surface 4 to 6 times with floured hands (do not overwork dough, or biscuits will be tough). Roll out dough 3/4 inch thick, flouring surface as needed, and cut out 12 to 14 rounds with cookie cutter, re-rolling scraps as necessary. Arrange rounds on top of apples about 1/2 inch apart.",
        "Stir together yolk and unchilled cream and brush on biscuits. Sprinkle sugar generously over biscuits.",
        "Bake cobblers in middle of oven until biscuits are golden and cooked through (lift one to check if underside is cooked), 35 to 45 minutes."
    ],
    "ingredients": [
        "1 stick (1/2cup) unsalted butter, cut into pieces",
        "8 lb Granny Smith apples, peeled, cored, and each cut into 8 wedges",
        "1 1/2 cups sugar",
        "2 teaspoons finely grated fresh orange zest",
        "1/2 cup apricot preserves",
        "1/3 cup brandy",
        "3 3/4 cups self-rising flour (preferably White Lily)",
        "6 tablespoons sugar",
        "1/4 teaspoon salt",
        "2 sticks (1 cup) cold unsalted butter, cut into bits",
        "1 3/4 cups plus 2 tablespoons chilled heavy cream",
        "1 large egg yolk",
        "2 tablespoons heavy cream (not chilled)",
        "1/4 cup granulated sugar",
        "Special equipment: a 3-inch round cookie cutter and 2 (5- to 6-quart) wide heavy pots"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Bake",
        "Apple",
        "Fall",
        "Gourmet"
    ],
    "title": "Apple Cobblers",
    "url": "http://www.epicurious.com/recipes/food/views/apple-cobblers-104230"
}
