{
    "directions": [
        "Heat sugar in a 12-inch heavy skillet over medium heat, stirring with a fork to heat sugar evenly, until it starts to melt, then stop stirring and cook, swirling skillet occasionally so sugar melts evenly, until it is dark amber. Stir in butter, water, rum, vinegar, and a pinch of salt (caramel will harden and steam vigorously) and cook over low heat, stirring occasionally, until caramel has dissolved. Add cream and bring to a boil, stirring, then remove from heat. Cool to warm.",
        "Preheat oven to 250°F with rack in middle. Set a cooling rack in a large shallow baking pan.",
        "Heat 2 inches oil in a 5- to 6-quart heavy pot over medium-high heat to 375°F.",
        "Meanwhile, peel apples and cut crosswise into 1/4-inch-thick slices. Cut out core with cutter, then pat apple rings dry.",
        "Put 1 1/4 cups flour in a large shallow bowl and make a well in center. Beat egg in a small bowl with a fork, then stir in cider and 1 tablespoon oil and pour into well. Stir with fork until a lumpy batter forms.",
        "Working in batches of 3 or 4, dredge apple rings in remaining 1/2 cup flour, shaking off excess, then dip in batter to coat, letting excess drip off, and fry, gently turning over once with a slotted spoon, until golden brown on both sides, about 2 minutes total per batch. Transfer to rack and keep warm in oven. Return oil to 375°F between batches.",
        "Just before serving, dust warm beignets with confectioners sugar. Stir sauce, then serve on the side."
    ],
    "ingredients": [
        "1 cup sugar",
        "3 tablespoons unsalted butter, cut into pieces",
        "1/3 cup water",
        "1/4 cup dark rum",
        "1/2 teaspoon cider vinegar",
        "1/4 cup heavy cream",
        "About 8 cups vegetable oil, divided",
        "2 Golden Delicious apples",
        "1 3/4 cups self-rising cake flour, divided",
        "1 large egg",
        "3/4 cup sparkling apple cider",
        "Confectioners sugar for dusting",
        "a deep-fat thermometer; a 1-inch round cookie cutter or a melon-ball cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Dairy",
        "Fruit",
        "Dessert",
        "Fry",
        "Vegetarian",
        "Apple",
        "Fall",
        "Winter",
        "Pastry",
        "Gourmet",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Cider Beignets with Butter-Rum Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/apple-cider-beignets-with-butter-rum-caramel-sauce-240226"
}
