{
    "directions": [
        "Preheat oven to 375°F. Melt 3 tablespoons butter in heavy large skillet over medium heat. Add half of pears and half of apples. Sauté until fruit is soft, stirring occasionally, about 9 minutes. Transfer fruit to large bowl. Repeat with remaining 3 tablespoons butter and remaining pears and apples. Mix sugar, flour and ground cinnamon into fruit. Stir in whipping cream and apple juice. Transfer filling to 15x10x2-inch glass baking dish. (Filling can be prepared 6 hours ahead. Cover and refrigerate. Bake filling at 375°F for 10 minutes before adding topping.)",
        "Whisk flour, sugar, baking powder and salt in medium bowl. Add chilled butter and rub in with fingertips until mixture resembles coarse meal. Stir in cheese. (Can be made 6 hours ahead. Cover and chill.) Beat milk and egg in small bowl to blend. Mix into flour mixture with wooden spoon (dough will be stiff).",
        "Drop dough by heaping tablespoonfuls onto filling, spacing evenly. Bake cobbler until filling is bubbling and tester inserted into topping comes out clean, about 45 minutes. Serve warm."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) unsalted butter",
        "4 pounds firm but ripe Anjou pears, peeled, cored, quartered, cut into 1/2-inch-thick wedges",
        "4 pounds Golden Delicious apples, peeled, cored, quartered, cut into 1/2-inch-thick wedges",
        "3/4 cup sugar",
        "2 tablespoons all purpose flour",
        "1 teaspoon ground cinnamon",
        "1/2 cup whipping cream",
        "1/2 cup apple juice",
        "2 cups all purpose flour",
        "2 tablespoons sugar",
        "1 tablespoon baking powder",
        "1/4 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 cup (packed) shredded extra-sharp cheddar cheese (about 4 ounces)",
        "2/3 cup whole milk",
        "1 large egg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Apple",
        "Pear",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple-Pear Cobbler with Cheddar Crust",
    "url": "http://www.epicurious.com/recipes/food/views/apple-pear-cobbler-with-cheddar-crust-104288"
}
