{
    "directions": [
        "Position rack in bottom third of oven and preheat oven to 400° F. Combine sliced apples, 1/4 cup sugar, flour, 2 teaspoons ground cinnamon, vinegar and salt in large bowl; toss to blend.",
        "Roll out 1 dough disk on lightly floured surface to 13-inch round. Transfer to 9-inch-diameter deep-dish glass pie dish. Trim overhang to 1/2 inch. Brush edge of crust lightly with water. Transfer apple mixture to crust, mounding in center and pressing lightly to compact. Drizzle with honey. Sprinkle with 1 teaspoon cinnamon. Roll out second dough disk to 13-inch round. Place atop apples. Trim dough overhang to 1 inch. Fold top crust edge under bottom crust edge, pressing to seal. Crimp edge decoratively. Cut several slits in crust to allow steam to escape.",
        "Place apple pie on baking sheet. Bake 45 minutes.",
        "Combine remaining 1 tablespoon sugar and 1/2 teaspoon ground cinnamon in small bowl. Brush top crust of pie with milk. Sprinkle with sugar mixture. Bake until crust is golden brown, apples are tender and juices bubble thickly, covering crust edges with foil if browning too quickly, about 20 minutes. Transfer pie to rack and cool.",
        "Cut pie into wedges and serve with vanilla ice cream."
    ],
    "ingredients": [
        "1 1/2 pounds Red Delicious apples, 1/4-inch-thick slices",
        "1 1/2 pounds Golden Delicious apples, peeled, cored, cut into 1/4-inch-thick slices",
        "1/4 cup plus 1 tablespoon sugar",
        "1/4 cup all purpose flour",
        "3 1/2 teaspoons ground cinnamon",
        "1 tablespoon cider vinegar",
        "1/2 teaspoon salt",
        "Basic Pie Crust",
        "1/4 cup honey",
        "1 tablespoon milk",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Apple",
        "Fall",
        "Cinnamon",
        "Fat Free",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple Cinnamon Pie with Vanilla Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/apple-cinnamon-pie-with-vanilla-ice-cream-2594"
}
