{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "Make the batter: Sift the flour, sugar, cinnamon and salt into a bowl. In a separate bowl, whisk the eggs, egg yolk, and milk until well blended. Add about 1/3 of the egg mixture to the flour mixture and whisk until smooth, then gradually incorporate the remaining egg mixture. Whisk until well blended. Cover with plastic wrap and refrigerate while you prepare the apples.",
        "Cook the apples: With the tip of a knife, scrape the vanilla bean seeds from the pod into an ovenproof 10-inch cast iron or stainless steel skillet. Add the pod and the butter and cook over moderately high heat until the butter turns nut brown. Add a pinch of salt. Add the apples and cook, stirring often, until slightly softened, about 2 minutes. Remove the vanilla bean pod and discard. Sprinkle the apples with the sugar, reduce the heat to moderately low, and cook until the apples are almost cooked through and the sugar has melted and is coating the apples in a light syrup. Add the grappa or other brandy off the fire while pouring, place back on the fire, wait for flame to die down, the swirl the pan briefly. Spread the fruit evenly in the skillet.",
        "Working quickly, pour batter evenly over the fruit. Bake until the edges of the clafouti are puffed and browned and the center is set, about 15 minutes.",
        "Put some confectioners' sugar in a sieve and generously dust the surface of the clafouti. Serve warm directly from the pan with a dollop of creme fraiche.",
        "Michael's Notes: If you plan to serve individual clafoutis from mini pans, heat the pans in the oven until quite hot, about 5 minutes, then divide the cooked fruit among the pans, top with the batter, and bake. Cooking time will vary depending on the size of the pans.",
        "To make a cherry clafouti, use 1 1/4 cups pitted cherries. Substitute 1 teaspoon grated lemon zest for the cinnamon and Grand Marnier for the grappa."
    ],
    "ingredients": [
        "1/2 cup unbleached all-purpose flour",
        "1/3 cup plus 2 tablespoons sugar",
        "1/4 teaspoon ground cinnamon",
        "Pinch salt",
        "3 eggs plus 1 egg yolk",
        "1 cup whole milk",
        "1/4 vanilla bean, split lengthwise",
        "2 tablespoons unsalted butter",
        "Pinch salt",
        "1 1/2 cups peeled and diced Granny Smith apple (about 1 large apple)",
        "2 tablespoons sugar",
        "1 teaspoon grappa, Calvados, or other fruit brandy",
        "Confectioners' sugar for dusting",
        "1/3 cup creme fraiche"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Apple Dessert",
        "Fruit Dessert Recipes",
        "Apple",
        "Dessert",
        "Fruit",
        "Baking",
        "Egg Recipes",
        "Sugar",
        "Dairy Recipes",
        "Fall"
    ],
    "title": "Apple Clafouti",
    "url": "http://www.foodnetwork.com/recipes/michael-chiarello/apple-clafouti-recipe"
}
