{
    "directions": [
        "Preheat oven to 375°F. Blend first 6 ingredients in large bowl. Add bread; toss. Let soak 1 hour, tossing occasionally.",
        "Meanwhile, butter 12-inch-diameter ovenproof skillet with 2 1/2-inch-high sides. Arrange apple wedges in concentric circles in skillet, covering completely. Cover with foil; bake 20 minutes.",
        "Meanwhile, combine cherries and Armagnac in small saucepan. Simmer over medium heat 3 minutes. Remove from heat. Combine 1/2 cup butter, sugar, and salt in medium saucepan and stir over medium-high heat until caramel is smooth, about 2 minutes. Whisk Armagnac from cherries into caramel. Whisk applesauce into caramel. Pour over apples; cover skillet with foil again. Bake 20 minutes. Sprinkle cherries over; top with bread mixture. Cover skillet with foil; place on rimmed baking sheet. Bake 20 minutes. Sprinkle with toffee bits and almonds. Dot with remaining 2 tablespoons butter. Bake uncovered until top is deep brown and puffed, about 20 minutes. Serve warm."
    ],
    "ingredients": [
        "2 1/2 cups whipping cream",
        "6 large eggs",
        "2 large egg yolks",
        "1/2 cup sugar",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "1 (16- to 17-ounce) loaf old-fashioned white bread, unsliced, crust trimmed, bread cut into 1 1/2-inch cubes",
        "2 3/4 pounds Granny Smith apples, peeled, cored, each cut into 8 wedges",
        "1 cup dried tart cherries",
        "1 cup Armagnac or brandy",
        "1/2 cup plus 2 tablespoons unsalted butter, divided",
        "1/2 cup (packed) dark brown sugar",
        "1/8 teaspoon salt",
        "1 cup applesauce",
        "1/2 cup toffee bits (such as Skor or Heath)",
        "1/2 cup slivered or sliced almonds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Apple",
        "Cherry",
        "Fall",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple and Dried Cherry Custard Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/apple-and-dried-cherry-custard-bread-pudding-236214"
}
