{
    "directions": [
        "Preheat oven to 400°F. Place apples in a large baking dish and add vinegar, brown sugar, and 3/4 cup water; scrape in seeds from vanilla bean and add pod. Toss to coat apples and roast, turning apples occasionally and adding a splash of water if pan looks dry at any point, until apples are tender and starting to brown and juices are syrupy, 35–40 minutes. Let apples cool in pan; discard vanilla pod. Reduce oven temperature to 375°F.",
        "Roll out puff pastry on a lightly floured surface to a 14x11\" rectangle. Transfer to a parchment-lined baking sheet, placing a short end nearest to you.",
        "Roll out almond paste on a lightly floured surface to about a 11x4\" rectangle and place lengthwise on the left-hand side of pastry, leaving a 1 1/2\" border on the left side.",
        "Arrange apple halves in a single row, slightly overlapping, on top of almond paste and drizzle any pan juices over. Dot apples with butter and fold a long side of pastry up and over apples to create a long rectangle. Using a fork, crimp all open edges firmly to seal; trim crimped sides just enough to tidy edges.",
        "Whisk egg with 1 tsp. water in a small bowl and brush pastry with egg wash; sprinkle with granulated sugar. Cut several slits in top of the puff pastry to vent. Bake turnover, rotating baking sheet halfway through, until pastry is puffed and deeply browned, 40–45 minutes. Let cool slightly. Serve slices of turnover with scoops of ice cream, if desired.",
        "Turnover can be baked 1 day ahead. Let cool; store tightly wrapped at room temperature. Reheat in 350°F oven, if desired."
    ],
    "ingredients": [
        "3 large Pink Lady apples, peeled, halved, cored",
        "1/2 cup apple cider vinegar",
        "1/4 cup (packed) light brown sugar",
        "1/2 vanilla bean, halved lengthwise",
        "1 (14-ounce) package frozen puff pastry (such as Dufour), thawed",
        "All-purpose flour (for dusting)",
        "3 1/2 ounces almond paste",
        "4 tablespoons unsalted butter, cut into small pieces",
        "1 large egg, beaten to blend",
        "2 tablespoons granulated sugar",
        "Vanilla ice cream (for serving; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Apple",
        "Pastry",
        "Dessert",
        "Kid-Friendly",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apple-Almond Turnover",
    "url": "http://www.epicurious.com/recipes/food/views/apple-almond-turnover"
}
