{
    "directions": [
        "Position rack in center of oven. Preheat oven to 350°F. Bake large loaf 60 to 65 minutes, baby loaves 40 to 45 minutes. Prepare pan(s) as directed.",
        "In a large bowl, whisk together the flour, baking powder, baking soda, salt, sugar, and wheat germ. If using a food processor, add the apricots and a generous tablespoon of the flour mixture to the bowl and pulse until the fruit is cut into small (1/4-inch) bits. Or, cut up the apricots with oiled kitchen shears or an oiled knife. Scrape the apricot bits into the bowl with the flour. Chop the nuts and add them to the dry ingredients.",
        "In a medium bowl, whisk together the oil, egg, nectar or buttermilk, and extracts. Make a well in the middle of the dry ingredients and pour in the oil-egg mixture. Whisk or stir just to blend well; don't over mix.",
        "Scrape the batter into the prepared pan(s), filling them about two-thirds full. Bake 60 to 65 minutes for a large loaf, 40 to 45 minutes for small loaves (or for the time indicated for your altitude in the chart), or until the bread is golden brown and a cake tester inserted in the center comes out clean. Cool in the pan(s) on a wire rack.",
        "To make the optional icing, whisk together the sugar and liquid in a small bowl until thick and smooth. When the bread is completely cooled, drizzle the icing over the top; it will harden as it dries."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup granulated sugar",
        "3 tablespoons wheat germ",
        "1 cup dried apricots (moist-style)",
        "1/2 cup (2 1/2 ounces) blanched almonds",
        "1/3 cup canola or light olive oil",
        "1 large egg, at room temperature",
        "3/4 cup apricot nectar or buttermilk",
        "1 teaspoon almond extract",
        "1 teaspoon vanilla extract",
        "2/3 cup sifted confectioners' sugar",
        "2 to 3 tablespoons milk, water, or fruit juice (or as needed)",
        "Special Equipment: 9- by 5- by 3-inch loaf pan or three 5 3/4- by 3 1/4- by 2-inch baby loaf pans; food processor and kitchen shears or cutting board and knife; wooden skewer or cake tester.",
        "Pan Preparation: Butter the pan(s) or spray with butter-flavor nonstick vegetable spray and dust with flour. Tap out the excess flour."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Food Processor",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "Dried Fruit",
        "Almond",
        "Fall",
        "Winter",
        "Edible Gift",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot-Almond Gift Bread",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-almond-gift-bread-240346"
}
