{
    "directions": [
        "Pulse toasted almonds and sugar in a food processor until nuts are finely ground. Sift together flour, salt, cinnamon, ginger, and cloves into a bowl, then add to ground nuts in processor and pulse to combine.",
        "Lightly beat yolks, extracts, and zest in a small bowl with a fork. Add to food processor along with butter, then pulse until dough forms a ball. Form one third of dough into a disk, then roll out between 2 sheets of plastic wrap into a 10-inch round. Transfer to a baking sheet and chill until firm, about 10 minutes. Roll out remaining dough between 2 sheets of plastic wrap into a 12-inch round, then transfer to another baking sheet and chill until firm, about 10 minutes.",
        "Simmer water, sugar, brandy, and apricots in a small saucepan, uncovered, stirring occasionally, until apricots are tender and liquid is syrupy, 15 to 20 minutes. Transfer mixture to cleaned food processor and pulse until almost smooth. Spread mixture onto a plate and chill 15 minutes.",
        "Preheat oven to 350°F with rack in middle.",
        "Remove bottom of springform pan and invert, then lock on side. Remove larger dough round from refrigerator and peel off top layer of plastic wrap, then invert round into pan (pastry will break in spots). Press dough evenly onto bottom, then discard plastic. Fold in edge of dough and press 1/2 inch up side of pan (side will be thicker than bottom). Press gently to close any cracks.",
        "Bake pastry until lightly browned, about 20 minutes, then cool completely on a rack, about 30 minutes. (Dough will puff up as it bakes but will settle as it cools.)",
        "Spread filling into crust with an offset spatula or back of a spoon.",
        "Peel top layer of plastic wrap from smaller dough round, then cut round into 1/2-inch-wide strips. (Chill strips again if necessary.) Arrange half of strips over filling about 1 inch apart, pressing ends onto edge of torte. Arrange remaining strips across first strips to form a simple lattice. Press edges together with your fingertips.",
        "Bake until top is browned, 40 to 50 minutes. Cool completely, about 2 hours.",
        "Before serving, remove side of pan and dust edge of torte with confectioners sugar."
    ],
    "ingredients": [
        "2 cups whole almonds with skins (10 ounces), toasted and cooled completely",
        "3/4 cup sugar",
        "3/4 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon cinnamon",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground cloves",
        "2 large egg yolks",
        "1 teaspoons pure vanilla extract",
        "1/8 teaspoon pure almond extract",
        "2 teaspoons grated lemon zest",
        "1 1/2 sticks cold unsalted butter, cut into 1/2-inch pieces",
        "1 cup water",
        "2/3 cup sugar",
        "1/3 cup brandy",
        "8 ounces dried Pacific apricots",
        "Confectioners sugar for dusting",
        "Equipment: a 10-inch springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Dessert",
        "Bake",
        "Dried Fruit",
        "Almond",
        "Brandy",
        "Clove",
        "Potluck",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot Almond Linzertorte",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-almond-linzertorte-351443"
}
