{
    "directions": [
        "1. Place the apricots in a medium saucepan, cover with cold water, and bring just to a boil. Lower the heat, cover, and cook at a bare simmer until tender, 30 to 40 minutes. Drain the apricots, reserving the cooking liquid, and puree them in a food processor fitted with the metal blade. You should have about 1 cup of puree.",
        "2. Preheat the oven to 375°F. Butter a 10-inch savarin mold and sprinkle it generously with sugar. Combine the pureed apricots, 1/4 cup of the sugar, and the lime juice, lime zest, salt, pistachios, pecans, and cherries in a large bowl.",
        "3. Place the egg whites in the bowl of an electric mixer fitted with the whisk attachment and whip on high speed until they form soft peaks. With the mixer on, add the remaining 1/4 cup sugar in a slow stream. Continue to beat until the egg whites hold very stiff peaks. Carefully fold the whites into the apricot mixture. Scrape the mixture into the prepared savarin mold, and place it in the oven. Bake until firm, 10 to 15 minutes. Remove the dish from the oven and let it cool completely on a wire rack.",
        "4. While the soufflé is cooling, make the sauce: Combine the cornstarch and water in a small bowl and whisk until smooth. Place 3/4 cup of the reserved apricot cooking liquid in a small saucepan and bring to a boil. Whisk the cornstarch mixture into the liquid, lower the heat, and simmer, whisking constantly, until thickened, 2 to 3 minutes. Remove from the heat and stir in the mint.",
        "5. Place a serving dish upside down on top of the mold, invert the two together, and gently shake to release the soufflé. Fill the center with fresh fruit, and spoon the sauce around the base."
    ],
    "ingredients": [
        "1 pound dried apricots",
        "1/2 cup sugar, plus more for sprinkling",
        "2 teaspoons fresh lime juice",
        "1/2 teaspoon grated lime zest",
        "Pinch salt",
        "1/2 cup shelled unsalted pistachio nuts, chopped",
        "1/2 cup caramelized pecans",
        "1/2 cup chopped red glazed cherries (available in supermarkets)",
        "5 large egg whites, at room temperature",
        "1 tablespoon cornstarch",
        "2 tablespoons water",
        "1 teaspoon finely chopped fresh mint leaves",
        "About 3 cups cut-up fresh fruit (bite-size pieces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Apricot",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot Sunburst",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-sunburst-232199"
}
