{
    "directions": [
        "Preheat oven to 350°F. Line large rimmed baking sheet with parchment paper. Using electric mixer, beat egg whites in large bowl until soft peaks form. Gradually add 1 cup sugar; beat until thick and mixture resembles marshmallow creme, about 5 minutes. Beat in cornstarch and almond extract. Drop meringue onto prepared sheet in 6 mounds, spacing apart. Using spoon, make indentationin center of each. Sprinkle almonds over meringues. Place in oven; immediately reduce temperature to 250°F. Bake until meringues are dry outside but centers are still soft, about 45 minutes. Cool on sheet on rack 30 minutes.",
        "Meanwhile, stir apricots and 3/4 cup sugar in large nonstick skillet over medium-high heat until sugar dissolves and apricots are soft, about 5 minutes. Stir in vanilla. Transfer to bowl; chill until cool. Stir in raspberries.",
        "Using electric mixer, beat cream with remaining 1 tablespoon sugar in medium bowl until peaks form.",
        "Place meringues on plates. Spoon whipped cream into center of each. Top with apricot mixture and serve."
    ],
    "ingredients": [
        "4 large egg whites",
        "1 3/4 cups plus 1 tablespoon sugar, divided",
        "2 teaspoons cornstarch",
        "1/4 teaspoon almond extract",
        "1/3 cup sliced almonds",
        "1 1/2 pounds apricots, halved, pitted, each half cut into 3 wedges",
        "1 teaspoon vanilla extract",
        "1 1/2-pint container raspberries",
        "1 cup chilled whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Raspberry",
        "Apricot",
        "Almond",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot-Raspberry Pavlovas with Sliced Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-raspberry-pavlovas-with-sliced-almonds-232270"
}
