{
    "directions": [
        "Preheat oven to 400°F.",
        "Trim any extra fat from the chicken pieces and transfer them to a large roasting pan or broiler pan. If you don't have a roasting pan that's large enough, use 2 identical 9 x 13-inch baking pans.",
        "Mix together the preserves and the vinegar in a mixing bowl. Dump over the chicken, add the remaining ingredients, and toss with the chicken until the chicken is evenly coated. Arrange the chicken pieces in the pan(s), skin side up, and spaced evenly apart.",
        "If you want to prepare this in advance, you can do everything up to this point, cover the pans, and put them in the fridge until you're ready to roast the chicken, but bring it back to room temperature before roasting.",
        "Roast until the tops of the chicken pieces are browned, about 35-40 minutes.",
        "Recipes that use a lot of whole peeled garlic cloves are a perfect reason to look for containers of peeled garlic in the produce section of the supermarket. In my experience, Christopher Ranch is the best brand out there right now. The garlic is always fresh and potent."
    ],
    "ingredients": [
        "2 chickens, cut into pieces",
        "One 12-ounce jar apricot preserves",
        "12 to 15 medium dried plums, pitted",
        "1 tablespoon white vinegar",
        "A few pinches of salt",
        "20 grinds of freshly ground pepper",
        "10 cloves garlic, peeled",
        "20 to 30 sage leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Herb",
        "Poultry",
        "Bake",
        "Dinner",
        "Dried Fruit",
        "Apricot",
        "Plum",
        "Fall",
        "Kidney Friendly",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot-Glazed Chicken with Dried Plums and Sage",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-glazed-chicken-with-dried-plums-and-sage-231957"
}
