{
    "directions": [
        "Let the yogurt drain in a fine sieve set over a bowl, covered and chilled, overnight and measure out 1 cup of the drained yogurt, reserving the remaining yogurt for another use.",
        "Preheat the oven to 350°F. and butter and flour a 10-inch springform pan. Into another bowl sift together the flour, the baking powder, the baking soda, and a pinch of salt. In the bowl of an electric mixer cream the butter with the sugar until the mixture is light and fluffy, beat in the eggs, 1 at a time, beating well after each addition, and beat in the 1 cup drained yogurt, beating until the mixture is just combined. Add the flour mixture, beat the batter until it is just combined, and stir in the apricots and the walnuts.",
        "Spoon the batter into the prepared pan and bake the cake in the middle of the oven for 50 minutes, or until a tester comes out with a few crumbs adhering to it. Put the cake in the pan on a rack set over foil, pour the orange honey syrup over it, and let the cake absorb the syrup. The cake may be made 2 days in advance and kept in the pan covered with plastic wrap and foil and chilled. Remove the side of the pan and garnish the cake with the mint sprigs."
    ],
    "ingredients": [
        "two 8-ounce containers plain yogurt",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons double-acting baking powder",
        "1/2 teaspoon baking soda",
        "1 stick (1/2 cup) unsalted butter, softened",
        "3/4 cup sugar",
        "2 large eggs",
        "3/4 cup dried apricots, chopped fine",
        "1 cup walnuts, chopped fine",
        "Orange Honey Syrup",
        "mint sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Citrus",
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Yogurt",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot Yogurt Cake with Orange Honey Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-yogurt-cake-with-orange-honey-syrup-12086"
}
