{
    "directions": [
        "Bring sugar and 1 cup water to a boil in a 2 1/2- to 3-quart heavy saucepan over moderately high heat, stirring until sugar is dissolved. Add apricots, then reduce heat and simmer, covered, until plump and very soft, 25 to 30 minutes. Drain apricots in a sieve set over a bowl, then return syrup to pan. Cook syrup over moderate heat, swirling pan occasionally, until a deep caramel, 4 to 5 minutes. (Syrup will bubble, so remove from heat periodically to check color.)",
        "Carefully add 1/2 cup water to caramel (mixture will bubble up and steam vigorously), then cook over moderate heat, stirring, until caramel is dissolved. Purée apricots and caramel in a food processor until almost smooth, then cool to room temperature.",
        "Whisk together apricot purée and yogurt in a large bowl until combined well and chill, covered, until cold, about 4 hours.",
        "Sprinkle gelatin over remaining 1/4 cup water in a very small saucepan and let stand 1 minute to soften. Heat gelatin over moderate heat, stirring, until dissolved, then immediately whisk into apricot mixture.",
        "Freeze apricot mixture in ice cream maker. Transfer to an airtight container and put in freezer to harden."
    ],
    "ingredients": [
        "1 1/2 cups sugar",
        "1 3/4 cups cold water",
        "2 cups packed soft dried California apricots (10 ounces)",
        "1 (32-ounce) container whole-milk plain yogurt (3 1/2 cups)",
        "2 1/2 teaspoons unflavored gelatin (from a 1/4-ounce envelope)",
        "Special equipment: an ice cream maker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ice Cream Machine",
        "Fruit",
        "Dessert",
        "Kid-Friendly",
        "Quick & Easy",
        "Yogurt",
        "Frozen Dessert",
        "Apricot",
        "Summer",
        "Healthy",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Apricot Frozen Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-frozen-yogurt-108782"
}
