{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch tube pan.",
        "In a large bowl, cream together the butter and sugar until light. Beat in the eggs, one at a time. Stir in the lemon zest and sour cream. Sift together the flour, baking soda and salt, stir into the creamed mixture alternately with the brandy. Put the batter into the prepared tube pan.",
        "Bake for 1 hour and 15 minutes in the preheated oven. Cake will spring back to the touch when done. To make the syrup, use the second set of ingredients. Combine the sugar, water, peach schnapps, and lemon zest in a small saucepan over medium high heat. Bring to a boil for 1 minute. Turn the cake out onto a wire rack. Place cake in the upside down position, and place a cookie sheet under the wire rack. Poke holes in the bottom of the cake with a fork. Pour the syrup over the entire cake, until all of the syrup is absorbed. Let cake stand for a few minutes.",
        "To make the topping for the cake, use the third set of ingredients. In a small saucepan, combine the apricot or peach preserves, apricot brandy and lemon zest. Bring to a boil over medium heat. Let the mixture boil for 1 minute. Turn the cake over onto a serving plate, drizzle the warm glaze over the top. Serve warm or cooled."
    ],
    "ingredients": [
        "3 cups white sugar",
        "1 cup butter",
        "6 eggs",
        "3 cups all-purpose flour",
        "1/4 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup sour cream",
        "1/4 cup apricot brandy",
        "1 teaspoon lemon zest",
        "1 cup white sugar",
        "1 cup water",
        "1/2 cup peach schnapps",
        "1 teaspoon lemon zest",
        "1 cup apricot preserves",
        "1 teaspoon lemon zest",
        "1/2 cup apricot brandy"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Apricot Brandy, Peach Schnapps Pound Cake",
    "url": "http://allrecipes.com/recipe/16387/apricot-brandy-peach-schnapps-pound/"
}
