{
    "directions": [
        "Preheat oven to 350°F. Melt butter in heavy small saucepan over medium-low heat. Add brown sugar and stir until mixture begins to bubble, about 2 minutes. Pour into 9-inch-diameter cake pan with 2-inch-high sides. Spread mixture over bottom of pan. Sprinkle nuts over. Place each cherry half, cut side down, into pitted center of each apricot half. Arrange apricot halves, cherry side down, in concentric circles in pan.",
        "Whisk flour, baking powder, nutmeg and salt in medium bowl to blend. Using electric mixer, beat butter in large bowl until light and creamy. Gradually beat in sugar. Beat in eggs 1 at a time. Mix in vanilla. Beat in dry ingredients alternately with milk in 3 additions.",
        "Spoon batter over apricots. Bake cake until top is golden and tester inserted into center comes out clean, about 1 hour 10 minutes. Transfer pan to rack. Run knife around pan sides. Cool cake on rack 10 minutes. Place plate over pan; invert cake onto plate. Gently lift off pan.",
        "Set cake pan over low heat and whisk any sugar mixture remaining in pan until syrupy, about 30 seconds. Pour syrup over cake. Serve warm with whipped cream"
    ],
    "ingredients": [
        "5 tablespoons unsalted butter",
        "3/4 cup (packed) golden brown sugar",
        "7 fresh cherries, halved, pitted",
        "1/3 cup chopped pecans",
        "7 large apricots, halved, pitted",
        "1 3/4 cups unbleached all purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2/3 cup sugar",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "2/3 cup whole milk, room temperature",
        "Whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Dessert",
        "Bake",
        "Apricot",
        "Cherry",
        "Pecan",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot-Pecan Upside-Down Cake",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-pecan-upside-down-cake-5382"
}
