{
    "directions": [
        "In a heavy saucepan scald the milk with the vanilla bean. In a metal bowl whisk together the egg yolks, the sugar, the cornstarch, sifted, and a pinch of salt. Add the milk mixture to the yolk mixture in a stream, whisking, and transfer the mixture to the pan. Boil the custard, whisking, for 1 minute, or until it is thick and smooth, strain it through a fine sieve into a bowl, and stir in the brandy. Chill the custard, its surfaced covered with plastic wrap, for at least 6 hours or overnight. Whisk in the crème fraîche, fold in the heavy cream, beaten to stiff peaks, and the apricots, and chill the apricot custard, covered.",
        "In a blender or food processor purée 2 cups of the strawberries, sliced, and 1 cup of the raspberries with the sugar, the lemon juice, and the framboise until the mixture is smooth, force the purée through a fine sieve into a bowl, pressing hard on the solids, and stir in the remaining 2 cups strawberries and 1 cup raspberries, both crushed lightly.",
        "In a blender or food processor purée 1 1/2 cups of the blackberries with the sugar, the lemon juice, and the framboise until the mixture is smooth, transfer the purée to a bowl, and stir in the remaining 1 cup blackberries, crushed lightly.",
        "Arrange one third of the cake on the bottom of a 3 1/2- to 4-quart trifle bowl, sprinkle it with one third of the brandy, and pour half the red berry mixture evenly over the cake. Spoon one third or the apricot custard evenly over the red berry layer, top it with half the remaining cake, and sprinkle the cake with half the remaining brandy. Pour the blackberry mixture evenly over the cake, spoon half the remaining custard over it, and top the custard with the remaining cake. Sprinkle the cake with the remaining brandy, pour the remaining red berry mixture evenly over it, and spoon the remaining custard evenly over the red berry layer, covering the red berry layer completely.",
        "Chill the trifle, covered, for at least 12 hours or overnight, garnish it with the berries, and serves it with the additional raspberries."
    ],
    "ingredients": [
        "2 1/2 cups milk",
        "1 vanilla bean, split lengthwise",
        "6 large egg yolks",
        "2/3 cup sugar",
        "3 tablespoons cornstarch",
        "3 tablespoons apricot brandy, or to taste",
        "1/2 cup crème fraîche",
        "1/2 cup well-chilled heavy cream",
        "6 large fresh apricots, cut into 1/2-inch pieces (about 2 cups)",
        "4 cups strawberries, hulled",
        "2 cups, raspberries, picked over",
        "2 tablespoons sugar, or to taste",
        "1 to 2 tablespoons fresh lemon juice, or to taste",
        "1 to 2 tablespoons framboise or Chambord, or to taste",
        "2 1/2 cups blackberries, picked over",
        "1 tablespoon sugar",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon framboise or Chambord",
        "Lemon Almond Spongecake",
        "1/4 cup apricot brandy",
        "raspberries and blackberries for garnish plus additional raspberries as an accompaniment if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Dessert",
        "Apricot",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot Berry Trifle",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-berry-trifle-12043"
}
