{
    "directions": [
        "Simmer apricots, water, and 1/4 cup granulated sugar in a small saucepan, stirring until sugar is dissolved and liquid is reduced by about half, 12 to 15 minutes. Remove from heat and add rum, then cool slightly. Purée in a food processor or blender until smooth (use caution when blending hot liquids).",
        "Whisk together flour, baking powder, and a pinch of salt in a small bowl. Beat together butter, brown sugar, and remaining 1/2 cup granulated sugar in a large bowl with an electric mixer at moderate speed until pale and fluffy, about 5 minutes. Beat in vanilla and egg. Add flour mixture and mix at low speed until just combined. Form dough into a log and chill, wrapped in plastic wrap, until firm, about 1 hour.",
        "Preheat oven to 350°F.",
        "Divide dough into 8 pieces. Put 1 piece of dough on a sheet of plastic wrap, then fold plastic wrap over dough. Form piece into an 8-inch rope (dough will be very soft). Transfer in plastic wrap to 1 of 2 ungreased baking sheets, then remove plastic wrap. Pat rope into an 8- by 1 1/2-inch rectangle. Make more ropes and pat into rectangles in same manner, arranging them about 2 inches apart. Make a shallow trough lengthwise down center of each rectangle with your finger and spread apricot pureé in trough. Bake in batches in middle of oven until edges are golden, 18 to 20 minutes, then transfer to a rack to cool completely.",
        "Whisk together confectioners sugar, lemon juice, and enough water (about 2 1/2 teaspoons) to make a thick but pourable icing. Drizzle icing over rectangles and cut diagonally into 1-inch-thick strips. Let stand until icing is set, about 15 minutes.",
        "• Cookies keep, layered between sheets of wax or parchment paper, in an airtight container at room temperature 1 week."
    ],
    "ingredients": [
        "3/4 cup dried apricots ( 1/4 lb; preferably California)",
        "2/3 cup water",
        "3/4 cup granulated sugar",
        "1 tablespoon dark rum",
        "2 1/2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "2 sticks (1 cup) unsalted butter, softened",
        "1/4 cup packed brown sugar",
        "1 teaspoon vanilla",
        "1 large egg",
        "1 cup confectioners sugar",
        "2 teaspoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Rum",
        "Fruit",
        "Bake",
        "Dried Fruit",
        "Apricot",
        "Edible Gift",
        "Gourmet"
    ],
    "title": "Apricot Butter Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-butter-cookies-105931"
}
