{
    "directions": [
        "Position rack in lowest third of oven and preheat to 400°F. Combine first 5 ingredients in processor. Blend using on/off turns until nuts are coarsely chopped. Add butter and cut in using on/off turns until mixture begins to clump together. Transfer streusel to bowl and refrigerate.",
        "Combine apricots, sugar, flour and allspice in large bowl; toss to blend. Let stand until dry ingredients are moistened, about 15 minutes. Carefully fold in raspberries.",
        "Roll out pie-crust disk on lightly floured surface to 12 1/2-inch round. Transfer crust to 9-inch-diameter glass pie dish. Trim dough overhang to 3/4 inch. Fold overhang under; crimp edges decoratively. Spoon filling into crust.",
        "Place pie on baking sheet. Bake until filling begins to bubble at edges, about 45 minutes. Sprinkle streusel topping evenly over pie. Cover crust edges with foil to prevent overbrowning. Bake until crust and topping are golden brown and filling is bubbling thickly in center, about 50 minutes longer. Cool pie on rack at least 2 hours and up to 8 hours."
    ],
    "ingredients": [
        "1/2 cup all purpose flour",
        "1/2 cup hazelnuts (about 2 1/2 ounces)",
        "1/4 cup (packed) golden brown sugar",
        "1/4 cup sugar",
        "1/4 teaspoon salt",
        "5 tablespoons chilled unsalted butter, cut into 1/2-inch pieces",
        "1 1/2 pounds ripe apricots, halved, pitted, each half cut into 4 wedges",
        "1 cup sugar",
        "3 tablespoons all purpose flour",
        "1/4 teaspoon ground allspice",
        "1 1/2-pint basket raspberries",
        "Flaky Pie Crust disk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Raspberry",
        "Apricot",
        "Summer",
        "Family Reunion",
        "Hazelnut",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot-Raspberry Pie with Hazelnut Streusel Topping",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-raspberry-pie-with-hazelnut-streusel-topping-103535"
}
