{
    "directions": [
        "Preheat oven to 425°F. Lightly spray heavy baking sheet with vegetable oil spray.",
        "Mix buttermilk, orange peel and nutmeg in small bowl. Mix flour, sugar, baking powder, baking soda and salt in large bowl. Add shortening and butter to flour mixture and rub in with fingertips until mixture resembles coarse meal. Add buttermilk mixture and stir until soft dough forms. Turn dough out onto lightly floured surface and gently knead until smooth, about 4 to 5 turns. Pat dough into 6x4-inch rectangle. Cut dough into 6 equal squares.",
        "Transfer biscuits to prepared baking sheet. Bake until puffed and golden, about 12 minutes. Transfer to rack and cool slightly. (Can be made 4 hours ahead. Cool completely. Before serving, cover with foil and rewarm in 350°F oven 5 minutes.)",
        "Mix water and cornstarch in small bowl to blend. Bring nectar, sugar and lemon juice to boil in heavy medium saucepan. Whisk in cornstarch mixture. Bring to boil, stirring constantly. Mix in apricots, cherries and vanilla. Reduce heat to medium and stir until sauce thickens slightly and fruit is warmed through, about 1 minute.",
        "Cut warm biscuits horizontally in half. Place 1 bottom onto each of 6 plates. Spoon half of fruit mixture over, dividing equally. Place tops over fruit. Spoon remaining fruit mixture over each."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1/2 cup low-fat buttermilk",
        "1 1/2 teaspoons grated orange peel",
        "1/2 teaspoon ground nutmeg",
        "1 1/4 cups all purpose flour",
        "3 tablespoons sugar",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/8 teaspoon salt",
        "1 tablespoon chilled vegetable shortening, cut into small pieces",
        "1 tablespoon chilled unsalted butter, cut into small pieces",
        "1 tablespoon water",
        "2 teaspoons cornstarch",
        "1 11 1/2-ounce can apricot nectar",
        "3 tablespoons sugar",
        "1 teaspoon fresh lemon juice",
        "1 pound apricots, quartered, pitted",
        "1 pound Bing cherries, halved, pitted",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Apricot",
        "Cherry",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot-Cherry Shortcakes",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-cherry-shortcakes-4096"
}
