{
    "directions": [
        "Drain yogurt in a cheesecloth-lined sieve or colander set over a bowl, covered and chilled, 8 hours.",
        "Preheat oven to 350°F.",
        "Put stack of phyllo on a work surface and cover stack with 2 overlapping sheets of plastic wrap and then a damp kitchen towel. Stir together butter and oil.",
        "Arrange 1 phyllo sheet on a large parchment-lined baking sheet, then spread with one fourth of butter mixture using a dampened pastry brush. Sprinkle with 1 teaspoon granulated sugar. Top with 3 more layers in same manner as first with remaining phyllo and butter mixture and 3 teaspoons granulated sugar. Cut stack into 12 rectangles (2 lengthwise cuts, 3 crosswise) and bake in middle of oven until crisp and golden brown, about 10 minutes. Cool in pan on a rack.",
        "Scrape seeds from vanilla bean into a bowl using a small sharp knife. Stir in drained yogurt, sour cream, and 1 tablespoon brown sugar.",
        "Heat a large nonstick skillet over moderately high heat. Add apricots and sprinkle with remaining 2 teaspoons granulated sugar. Gently toss until apricots are warm and tender, 2 to 3 minutes. Transfer apricots to a bowl with a slotted spoon.",
        "Add water and remaining teaspoon brown sugar to skillet and deglaze by boiling over moderately high heat, scraping up brown bits, until reduced by about half. Toss apricots in warm syrup.",
        "Place 1 phyllo rectangle on a plate and top with 3 apricot pieces and 1 generous tablespoon yogurt mixture. Make 2 more layers with phyllo squares, apricots, and yogurt mixture. Make 3 more napoleons in same manner."
    ],
    "ingredients": [
        "1 cup nonfat yogurt",
        "4 (17- by 12-inch) phyllo sheets",
        "1 teaspoon unsalted butter, melted",
        "1 teaspoon vegetable oil",
        "6 teaspoons granulated sugar",
        "1 vanilla bean, halved lengthwise",
        "1/4 cup low-fat sour cream",
        "1 tablespoon plus 1 teaspoon packed light brown sugar",
        "6 fresh apricots (1 pound), pitted and each cut into 6 wedges",
        "1/4 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Yogurt",
        "Apricot",
        "Spring",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot Phyllo Napoleons",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-phyllo-napoleons-103404"
}
