{
    "directions": [
        "Combine flour, sugar, and salt in processor; blend 5 seconds. Add butter and cut in, using on/off turns, until mixture resembles coarse meal. Add cream and egg yolk. Using on/off turns, blend until moist clumps form. Gather dough into ball. Press over bottom and up sides of 10-inch-diameter tart pan with removable bottom. Pierce crust all over with fork. Cover and refrigerate at least 1 hour and up to 1 day.",
        "Combine pistachios, almonds, and sugar in processor. Blend until nuts are finely ground. Add butter and blend to paste consistency. Using on/off turns, mix in egg and both extracts. (Can be made 1 day ahead. Cover and chill. Let stand at room temperature 1 hour before using.)",
        "Preheat oven to 375°F. Bake chilled crust until light golden, pressing any bubbles with back of fork, about 18 minutes. Cool crust on rack 15 minutes.",
        "Spread filling evenly in crust. Arrange apricot halves, cut side down, close together in concentric circles atop filling, fitting in as many as possible. Bake tart until filling is lightly browned and set and apricots are tender, about 55 minutes. Cool tart completely on rack.",
        "Combine jam and 2 teaspoons water in heavy small saucepan. Simmer over medium-low heat 1 minute, stirring constantly. Strain glaze into small bowl. Push up pan bottom to release tart. Place tart on platter. Brush glaze over tart. Sprinkle chopped pistachios around edge of tart. (Can be prepared 8 hours ahead; let stand at room temperature.)"
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "3 tablespoons sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "2 tablespoons chilled whipping cream",
        "1 large egg yolk",
        "1/2 cup shelled natural unsalted pistachios (about 2 ounces)",
        "1/2 cup slivered almonds (about 2 ounces)",
        "1/2 cup sugar",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 large egg",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon almond extract",
        "9 large apricots, halved, pitted",
        "1/3 cup apricot jam",
        "2 teaspoons water",
        "Chopped pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Apricot",
        "Almond",
        "Pistachio",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot Tart with Pistachio-Almond Frangipane",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-tart-with-pistachio-almond-frangipane-106662"
}
