{
    "directions": [
        "In a heavy saucepan simmer apricots, water, and 1/2 cup sugar, covered, 20 minutes. Transfer hot mixture to a food processor and purée until very smooth. Force purée through a fine sieve into a bowl and stir in lemon juice, rum, vanilla, a pinch salt. Cool purée completely. Purée may be made 2 days ahead and chilled, covered,. Bring to room temperature before proceeding. Transfer purée to a large bowl.",
        "Preheat oven to 350°F. Generously butter 7-ounce (3 1/2- by 1 3/4 - inch) ramekins and coat with additional sugar, knocking out excess.",
        "In another large bowl with an electric mixer beat whites with pinch of salt until foamy. Beat in cream of tartar and beat whites until they hold soft peaks. Beat in remaining 1/4 cup sugar, a little at a time, and beat meringue until it just holds stiff peaks. Whisk about one forth meringue into purée to lighten and fold in remaining meringue gently but thoroughly. Ladle batter into ramekins and bake soufflés on a baking sheet in middle of oven 20 to 25 minutes, or until puffed, golden brown, and just set in center.",
        "Remove ramekins from oven. With 2 forks pull open center of each soufflé and pour some crème anglaise into each opening. Serve soufflés immediately.",
        "In a small heavy saucepan bring half-and-half just to a boil with vanilla bean and remove pan from heat. Scrape seeds from bean with a knife into half-and-half, reserving pod for another use if desired.",
        "In a bowl whisk together yolks, sugar, and a pinch of salt and whisk in hot half-and-half in a stream. Return custard to pan and cook over moderately low heat, stirring constantly with a wooden spoon, until thickened (170°F. on a candy thermometer), but do not let boil. Pour sauce through a fine sieve into a bowl and cool, stirring occasionally. Stir in rum. Chill sauce, covered, until very cold, at least 2 hours and up to 2 days. Makes about 2 1/4 cups."
    ],
    "ingredients": [
        "6 ounces dried apricots (about 1 1/2 cups)",
        "1 1/2 cups water",
        "3/4 cup sugar plus additional for coating ramekins",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon dark rum if desired",
        "1/2 teaspoon vanilla extract",
        "5 large egg whites",
        "1/4 teaspoon cream of tartar",
        "Accompaniment:",
        "2 cups half-and-half",
        "1/2 vanilla bean, split lengthwise",
        "5 large egg yolks",
        "1/4 cup sugar",
        "1 tablespoon dark rum, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Food Processor",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Apricot",
        "Vanilla",
        "Chill",
        "Simmer",
        "Boil",
        "Candy Thermometer",
        "Ramekin",
        "Gourmet"
    ],
    "title": "Apricot Souffles with Vanilla Rum Crème Anglaise",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-souffles-with-vanilla-rum-creme-anglaise-11814"
}
