{
    "directions": [
        "Cook fresh and dried apricots with sugar in a 3-quart heavy saucepan over moderate heat, stirring frequently, until apricots are softened and mixture is syrupy, about 15 minutes. Cool 10 minutes and purée in a blender until very smooth (use caution when blending hot liquids). Force purée through a very fine sieve into a bowl, pressing on solids and then discarding them. Cool to room temperature.",
        "Sprinkle gelatin over 1/4 cup milk in a cup and let soften while preparing custard. Bring remaining 1 3/4 cups milk just to a boil in a heavy saucepan and remove from heat. Whisk together yolks and sugar in a bowl, then add hot milk in a slow stream, whisking. Pour custard into heavy saucepan and cook over moderately low heat, stirring constantly, until slightly thickened and an instant-read thermometer registers 170°F (do not let boil).",
        "Add softened gelatin to hot custard and whisk until dissolved.",
        "Whisk custard into apricot purée and cool at room temperature, stirring occasionally, about 1 hour. Chill, covered, stirring occasionally, until custard is the consistency of raw egg whites, about 2 hours.",
        "Preheat oven to 375°F. Remove side of a 24-centimeter (9- to 9 1/2-inch) springform pan, then butter bottom and dust with flour, knocking off excess. Lock springform side around bottom.",
        "Melt chocolate in a double boiler or a small metal bowl set over a saucepan of barely simmering water, stirring occasionally, and remove top of double boiler or bowl from heat.",
        "Beat yolks and sugar with an electric mixer at high speed until mixture is thick, pale, and forms a ribbon when beaters are lifted, about 6 minutes with a standing mixer or 12 minutes with a handheld. Beat in chocolate until just combined.",
        "Beat whites with salt in another bowl using cleaned beaters until whites just hold soft peaks. Stir one fourth of whites into chocolate mixture to lighten, then fold in remaining whites gently but thoroughly.",
        "Spoon batter into springform pan, spreading it evenly, and bake in middle of oven until chocolate base is springy to the touch, 10 to 12 minutes. Cool in pan on a rack.",
        "Beat cream with salt in a bowl using cleaned beaters until it just holds soft peaks. Gently fold cream and lemon juice into custard and pour over chocolate base in springform pan. Chill bavarois, covered with a large inverted plate, until set, at least 10 hours.",
        "Run a thin knife around edge of pan and remove side."
    ],
    "ingredients": [
        "1 3/4 lb firm-ripe apricots (9 large), chopped",
        "1/2 cup dried apricots, chopped",
        "1 cup sugar",
        "3 teaspoons unflavored gelatin (from two 1/4-oz envelopes)",
        "2 cups whole milk",
        "5 large egg yolks",
        "1/2 cup sugar",
        "1 cup chilled heavy cream",
        "1/8 teaspoon salt",
        "2 teaspoons fresh lemon juice",
        "4 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
        "3 large eggs, separated",
        "5 tablespoons sugar",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Lemon",
        "Apricot",
        "Summer",
        "Chill",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Apricot and Chocolate Bavarois",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-and-chocolate-bavarois-106597"
}
