{
    "directions": [
        "Preheat oven to 375°F. Butter 8x8x2-inch glass baking dish. Combine apricots, berries, sugar and tapioca in large bowl; toss gently to blend. Let stand 15 minutes, tossing fruit occasionally. Transfer fruit mixture to prepared dish. Dot with butter. Bake until fruit is tender and juices bubble thickly, about 50 minutes. Cool completely in dish. (Can be made 4 hours ahead. Let stand at room temperature.)",
        "Preheat oven to 400°F. Combine flour, sugar, baking powder and salt in medium bowl; whisk to blend. Add butter, rub in with fingertips until mixture resembles coarse meal. Gradually add 1/2 cup cream, mixing with fork until moist clumps form. Knead gently in bowl until dough holds together.",
        "Roll out dough on lightly floured surface to 9x6-inch rectangle. Cut dough lengthwise into 8 strips, each about 3/4 inch wide. Arrange 4 strips in opposite direction, forming lattice. Press ends of pastry strips firmly into fruit. Brush dough with 1 tablespoon cream.",
        "Bake cobbler until filling is heated through and lattice is golden brown, about 30 minutes. Spoon warm cobbler into deep bowls; top with ice cream."
    ],
    "ingredients": [
        "2 1/4 to 2 1/2 pounds apricots (about 18), quartered, pitted",
        "2 5- to 6-ounce baskets blackberries",
        "1 cup sugar",
        "1/4 cup quick-cooking tapioca",
        "2 tablespoons (1/4 stick) chilled unsalted butter, diced",
        "1 1/2 cups all purpose flour",
        "2 tablespoons sugar",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, diced",
        "1/2 cup plus 1 tablespoon chilled whipping cream",
        "Vanilla ice cream or frozen yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Blackberry",
        "Apricot",
        "Summer",
        "Tapioca",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot-Blackberry Cobbler",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-blackberry-cobbler-2249"
}
