{
    "directions": [
        "Set up a grill for indirect grilling, with only half or two-thirds of the burners lit on a gas grill or with the coals on one side. Bring the grill temperature to about 450°. Line a 12-cup muffin tin with paper or foil liners.",
        "In a large bowl, whisk the flour with the cornmeal, salt, baking powder and baking soda.",
        "In a medium bowl, whisk the sugar with the eggs, sour cream and butter; mix into the dry ingredients, then fold in the apricots and pistachios. The batter will be quite thick.",
        "Spoon the batter into the muffin cups, filling each cup almost to the top. Set the muffin tin on the unlit side of the grill, close the lid and bake the muffins for 20 to 25 minutes, keeping the grill temperature between 400° and 450° and turning the pan once halfway through. The muffins are done when they are lightly browned on top and when a toothpick inserted in them comes out with a few moist crumbs attached.",
        "Carefully transfer the muffins to a rack and let cool slightly. Serve warm or at room temperature with yogurt."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "1 cup cornmeal",
        "1/4 teaspoon salt",
        "2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "3/4 cup sugar",
        "2 large eggs",
        "1 cup sour cream or full-fat yogurt",
        "6 tablespoons butter, melted and cooled",
        "7 ounces apricots (about 2 to 4 apricots), pitted and cut into 1/4 inch pieces",
        "1/2 cup shelled pistachios, roughly chopped",
        "Yogurt, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Apricot",
        "Pistachio",
        "Cornmeal",
        "Grill",
        "Grill/Barbecue",
        "Pastry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot-Pistachio Muffins Baked on the Grill",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-pistachio-muffins-baked-on-the-grill-51241420"
}
