{
    "directions": [
        "Pulse almonds, flour, sugar, and salt in a food processor until almonds are very finely chopped. Add butter and pulse until mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Add yolk and extracts and pulse just until mixture begins to clump.",
        "Turn out dough onto a lightly floured surface and divide into 4 portions. With heel of your hand, smear each portion once or twice with a forward motion to distribute fat. Gather dough together into a ball with scraper and transfer to tart pan. Pat dough with floured fingers into tart pan in an even 1/4-inch-thick layer, including side (side should be flush with top of rim). Chill until firm, about 30 minutes.",
        "Toss apricots with Amaretto and 1/4 cup sugar, then let macerate until juicy, at least 1 hour.",
        "Whisk together preserves, whole egg, yolk, cream, almond extract, a pinch of salt, and remaining 2 tablespoons sugar in another bowl until combined. Chill, covered, until ready to use.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Line tart shell with foil and fill with pie weights. Bake until side is set and edge is pale golden, 18 to 20 minutes. Carefully remove foil and weights and bake shell until bottom is pale golden, 5 to 7 minutes more. Cool completely in pan on a rack, about 15 minutes.",
        "Reduce oven temperature to 350°F.",
        "Lift apricots from liquid with a slotted spoon and arrange, skin sides down, in tart shell. Whisk remaining apricot liquid into egg mixture, then pour over apricots(fruit will poke through filling). Cover edge of tart shell with a pie shield or foil and bake tart until filling is set and slightly puffed, 45 to 50 minutes. Cool tart completely in pan on rack."
    ],
    "ingredients": [
        "1/2 cup slivered almonds (2 oz)toasted and cooled",
        "1 cup all-purpose flour",
        "1/4 cup sugar",
        "1/4 teaspoon salt",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into 1/2-inch cubes",
        "1 large egg yolk",
        "1/4 teaspoon vanilla extract",
        "1/8 teaspoon almond extract",
        "1 lb firm-ripe apricots, halved, pitted, and each half cut into three wedges",
        "1 tablespoon Disaronno Amaretto",
        "1/4 cup plus 2 tablespoons sugar",
        "1/2 cup fine-quality apricot preserves",
        "1 large egg",
        "1 large egg yolk",
        "2 tablespoons heavy cream",
        "1/8 teaspoon almond extract",
        "Special equipment: a pastry or bench scraper; a 9- by 1-inch round tart pan with removable bottom; pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Apricot",
        "Almond",
        "Summer",
        "Jam or Jelly",
        "Gourmet"
    ],
    "title": "Apricot Cream Tart",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-cream-tart-109552"
}
