{
    "directions": [
        "Blend flour, sugar, and 1/2 teaspoon salt in processor. Add butter. Using on/off turns, blend until mixture resembles very coarse meal. Add 4 tablespoons ice water. Blend to moist clumps, adding more ice water by teaspoonfuls if dry. Gather dough into ball; flatten into disk. Wrap dough in plastic; chill at least 1 hour and up to 1 day.",
        "Roll out dough on lightly floured sheet of parchment paper to 13-to 14-inch round. Slide dough, still on parchment paper, onto rimless baking sheet; chill 10 minutes.",
        "Preheat oven to 425°F. Toss apricots, brown sugar, butter, 2 teaspoons honey, and cinnamon in large bowl to coat. Spread amaretti crumbs in center of dough, leaving 2-inch plain border. Top crumbs with apricots and juices. Fold border over edge of fruit; brush with glaze.",
        "Bake crostata on parchment on sheet 15 minutes. Reduce oven temperature to 375°F. Bake until crust is golden and juices bubble thickly, about 40 minutes. Cool 15 minutes.",
        "Meanwhile, whisk whipping cream and 4 teaspoons honey in medium bowl until peaks form. Chill until ready to serve.",
        "Run spatula under crust to loosen from parchment. Slide crostata onto platter. Brush fruit lightly with additional honey. Serve crostata warm or at room temperature with honey-sweetened whipped cream.",
        "Available at some supermarkets and at Italian markets."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "2 tablespoons sugar",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "4 tablespoons (or more) ice water",
        "1 1/2 to 1 3/4 pounds large slightly underripe apricots (8 to 9), halved, pitted, each half cut into 3 wedges",
        "2 tablespoons golden brown sugar",
        "1 tablespoon melted butter",
        "6 teaspoons honey, divided, plus",
        "1/4 teaspoon ground cinnamon",
        "1 cup coarsely crushed amaretti cookies (Italian macaroons)*",
        "1 large egg, beaten to blend (for glaze)",
        "1 cup chilled heavy whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Egg",
        "Dessert",
        "Bake",
        "Lunch",
        "Apricot",
        "Summer",
        "Butter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Apricot and Amaretti Crostata",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-and-amaretti-crostata-353785"
}
