{
    "directions": [
        "Stir flour, 1/8 teaspoon sugar and salt in bowl to blend. Add butter; rub in with fingertips until coarse meal forms. Mix in enough water by tablespoons until clumps form. Gather into ball; flatten into disk. Wrap in plastic; chill at least 1 hour and up to 2 days.",
        "Preheat oven to 400°F. Line baking sheet with parchment. Roll out dough on floured surface to 11-inch round. Transfer to prepared baking sheet.",
        "Mix flour and 2 teaspoons sugar in bowl. Sprinkle over crust, leaving 1 1/2-inch border. Place apricots cut side down on crust, placing close together and leaving 1-1/2 inch border at outer edge. Scatter cherries over apricots. Top with 4 tablespoons sugar. Fold pastry edges up around apricots, pressing against apricots to form scalloped border. Brush crust with butter; sprinkle with 1/2 tablespoon sugar.",
        "Bake until crust is golden and fruit is tender (some juices from fruit will leak onto parchment), about 1 hour. Remove from oven. Using pastry brush, brush tart with juices on parchment. Gently slide parchment with tart onto rack. Carefully run long knife under tart to loosen (crust is fragile). Cool on parchment until lukewarm. Slide 9-inch-diameter tart pan bottom under tart, then place tart on platter. Serve with ice cream or yogurt."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1/8 teaspoon sugar",
        "Pinch of salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into pieces",
        "2 1/2 tablespoons (about) ice water",
        "2 tablespoons all purpose flour",
        "2 teaspoons plus 4 1/2 tablespoons sugar",
        "8 large apricots, halved, pitted",
        "1 cup pitted cherries (about 6 ounces) or frozen, thawed",
        "2 tablespoons (1/4 stick) unsalted butter, melted, cooled",
        "Vanilla ice cream or frozen yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Picnic",
        "Apricot",
        "Cherry",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot and Cherry Country Tart",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-and-cherry-country-tart-299"
}
