{
    "directions": [
        "Combine 2 cups sugar and 2 cups water in heavy medium saucepan. Stir over low heat until sugar dissolves. Increase heat and bring to boil. Cool syrup completely. Add 1 cup bourbon, peaches, raisins, pears and pineapple to syrup and toss. Let stand 2 hours at room temperature.",
        "Preheat oven to 300°F. Butter two 9x5x3-inch loaf pans. Line with parchment; butter parchment. Drain fruit thoroughly. Mix pistachios, coconut, almonds and 3/4 cup flour in large bowl. Add fruit mixture and toss. Mix remaining 3/4 cup flour, nutmeg, cinnamon, salt and baking soda in medium bowl. Whisk 6 tablespoons bourbon, buttermilk and orange juice in small bowl.",
        "Using electric mixer, cream butter, remaining 1 cup sugar and lemon peel in large bowl until fluffy. Add eggs 1 at a time, beating well after each addition. Stir in dry ingredients alternately with buttermilk mixture, beginning and ending with dry ingredients. Fold in fruit mixture.",
        "Divide batter between prepared pans. Bake until toothpick inserted into centers comes out clean, about 1 1/2 hours. Cool cakes in pans on racks 15 minutes. Turn out cakes onto racks; peel off paper. Turn cakes right side up.",
        "Mix remaining 4 tablespoons bourbon with peach preserves in small bowl. Brush mixture over top and sides of warm cakes. Cool completely. Wrap tightly and store in cool dark place at least 2 days and up to 1 month."
    ],
    "ingredients": [
        "3 cups sugar",
        "2 cups water",
        "1 cup plus 10 tablespoons bourbon",
        "2 cups chopped dried peaches",
        "1 cup golden raisins",
        "1 cup chopped dried pears",
        "1 cup chopped dried pineapple",
        "1 1/2 cups unsalted shelled pistachios, coarsely chopped",
        "1 cup sweetened shredded coconut",
        "1 cup finely ground almonds",
        "1 1/2 cups unbleached all purpose flour",
        "1 1/4 teaspoons ground nutmeg",
        "1/8 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "1/4 teaspoon baking soda",
        "6 tablespoons buttermilk",
        "1/4 cup fresh orange juice",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 tablespoon grated lemon peel",
        "4 large eggs, room temperature",
        "1/4 cup peach preserves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Bourbon",
        "Mixer",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Dried Fruit",
        "Raisin",
        "Apricot",
        "Peach",
        "Tropical Fruit",
        "Coconut",
        "Pineapple",
        "Pistachio",
        "Spice",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot Pistachio Fruitcakes",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-pistachio-fruitcakes-2803"
}
