{
    "directions": [
        "Pour milk into small saucepan. Scrape in seeds from vanilla bean; add bean. Bring to simmer. Remove from heat. Whisk yolks, 3 tablespoons sugar and cornstarch in bowl to blend. Gradually whisk milk mixture into yolk mixture. Return to pan. Whisk over medium heat until custard thickens and boils, about 2 minutes. Transfer to bowl; cool. Discard vanilla bean. (Can be made 2 days ahead. Cover; chill.)",
        "Preheat oven to 400°F. Roll out pastry on floured surface to 14-inch round. Transfer to 11-inch-diameter tart pan with removable bottom. Press crust into pan. Trim edges to 1/2-inch overhang; fold in and press, forming double-thick sides. Freeze crust until firm, about 20 minutes. Bake until light golden, about 20 minutes. Cool. Maintain oven temperature.",
        "Finely grind almonds and powdered sugar in processor. Add cooled custard; blend using on/off turns. Blend in butter, then whole egg, extract and salt. Pour into crust; smooth top. Arrange apricot halves, round side up, atop filling.",
        "Bake tart until filling is set and golden, about 45 minutes. Remove from oven. Drizzle honey over. Return to oven for 3 minutes. Cool completely in pan."
    ],
    "ingredients": [
        "2/3 cup whole milk",
        "1 2-inch piece vanilla bean, split lengthwise",
        "2 large egg yolks",
        "3 tablespoons sugar",
        "1 tablespoon cornstarch",
        "Pastry Crust Dough",
        "1/2 cup blanched whole almonds",
        "1/3 cup powdered sugar",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "1 large egg",
        "1 teaspoon almond extract",
        "Pinch of salt",
        "3 15.25-ounce cans unpeeled apricot halves in heavy syrup, well drained",
        "3 tablespoons honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Apricot",
        "Almond",
        "Spring",
        "Honey",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot Tart with Honey and Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-tart-with-honey-and-almonds-101604"
}
