{
    "directions": [
        "Whisk flour, cornmeal and salt in small bowl to blend. Using electric mixer, beat butter and sugar in large bowl to blend. Beat in egg yolks. Add dry ingredients and beat just until blended. Divide dough in half; flatten into disks. Wrap each dough disk in plastic and refrigerate 20 minutes. (Can be prepared 1 day ahead. Keep refrigerated. Let dough soften slightly at room temperature before using.)",
        "Bring 5 cups water to simmer in heavy medium pot over medium heat. Add apricots and poach until tender, about 25 minutes. Drain well.",
        "Preheat oven to 375°F. Lightly oil 9-inch-diameter tart pan with removable bottom. Unwrap 1 dough disk; press onto bottom and up sides of tart pan. Spread apricot preserves over bottom of crust. Place poached apricots over preserves, covering crust completely and overlapping slightly. Using pastry brush, brush beaten egg over edges of crust. Roll out second dough disk between 2 sheets of parchment paper to 12-inch round. Remove top piece of parchment; using 1-inch-diameter cookie cutter, cut hole in center of top crust. Turn crust over onto filling. Remove second piece of parchment paper. Press around crust edges to seal. Cut off excess dough to make top crust flush with tart pan sides. Brush crust with beaten egg and sprinkle with 3 tablespoons sugar.",
        "Bake tart until cornmeal crust is golden brown, about 45 minutes. Transfer apricot tart to rack. Cool 30 minutes. Remove tart from pan and cool completely. (Apricot tart can be prepared up to 1 day ahead. Store airtight at room temperature.) Serve tart with Apricot Sauce and whipped cream, if desired."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "3/4 cup cornmeal",
        "3/4 teaspoon salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "3/4 cup sugar",
        "3 large egg yolks",
        "5 cups water",
        "12 ounces dried apricot halves (about 2 2/3 cups)",
        "1/3 cup apricot preserves",
        "1 large egg, beaten to blend",
        "3 tablespoons sugar",
        "Apricot Sauce (optional)",
        "Whipped cream (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Buffet",
        "Apricot",
        "Cornmeal",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot Tart with Cornmeal Crust",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-tart-with-cornmeal-crust-104527"
}
