{
    "directions": [
        "Preheat the oven to 375 degrees F. Butter a 9- to 10-inch shallow pie plate.",
        "Combine the egg yolks and 1/3 cup of the sugar in a large bowl. Using an electric mixer, beat on medium-high speed until ribbons form when you lift the beater just slightly out of the batter, about 3 minutes. Add the flour, heavy cream and vanilla extract. Reduce the speed to low and beat until thoroughly blended, stopping the mixer occasionally to scrape down the sides of the bowl with a rubber spatula.",
        "Slide the prepared pie plate into the oven to preheat for 4 to 5 minutes. Meanwhile, whisk together the egg whites and salt in a small bowl for 30 seconds; add to the batter and beat with the mixer on low speed until just incorporated, 1 to 2 minutes. Combine the apricots, lemon zest and the remaining 2 tablespoons sugar in a medium bowl, and gently stir until the apricots are thoroughly coated. Remove the pie plate from the oven, pour in the apricots in a decorative pattern, and top with the batter.",
        "Bake until set in the middle, 30 to 35 minutes. Serve warm with a small dollop of the whipped cream, if using.",
        "Add the heavy cream, sugar, vanilla and lemon zest to a stand mixer fitted with the whisk attachment. Whip just until soft peaks form."
    ],
    "ingredients": [
        "Unsalted butter, for greasing the pie plate",
        "2 large eggs, separated",
        "1/3 cup plus 2 tablespoons sugar",
        "3 tablespoons all-purpose flour",
        "1/2 cup heavy cream",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon kosher salt",
        "Two 15.25-ounce cans apricots, drained and gently rinsed",
        "1 teaspoon grated lemon zest",
        "Lemon-Vanilla Whipped Cream, for topping, optional",
        "1 1/2 cups heavy cream, chilled",
        "2 tablespoons sugar",
        "1 1/2 teaspoons vanilla extract",
        "1/2 teaspoon grated lemon zest"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cake",
        "Egg Recipes",
        "Apricot",
        "Fruit",
        "Dairy Recipes",
        "Dessert"
    ],
    "title": "Apricot Clafouti",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/apricot-clafouti"
}
