{
    "directions": [
        "Combine all ingredients in heavy small saucepan and bring to boil. Reduce heat to medium-low and simmer until thickened and reduced to 1 1/4 cups, about 15 minutes.",
        "Blend all ingredients in small bowl. Set aside.",
        "Melt butter in heavy large skillet over medium heat. Add onions and shallots and sauté until very soft and light brown, about 20 minutes. (Glaze, herb butter and onion mixture can be prepared 1 day ahead. Cover separately and chill. Bring herb butter to room temperature before continuing.)",
        "Position rack in lowest third of oven and preheat to 400° F. Pat turkey dry with paper towels. Season turkey cavity with salt and pepper. Place turkey on rack set in large roasting pan. Slide hand under skin of turkey breast to loosen skin. Spread half of herb butter over breast under skin. If stuffing turkey, spoon stuffing into main cavity. Place remaining herb butter in small saucepan. Stir over low heat until melted. Brush butter over outside of turkey. Tie legs together loosely to hold shape of turkey. Roast turkey 30 minutes. Reduce oven temperature to 325° F. Roast turkey 1 hour 30 minutes, basting occasionally with pan drippings. Tent turkey with heavy-duty foil; roast 45 minutes longer. Add onion mixture, 1 can broth, thyme and sage to pan. Roast 15 minutes. Bring glaze to simmer. Brush 1/2 cup glaze over turkey. Continue to roast turkey uncovered until meat thermometer inserted into thickest part of thigh registers 180° F. or until juices run clear when thickest part of thigh is pierced with skewer, brushing occasionally with glaze and adding more broth to pan if liquid evaporates, about 40 minutes longer for unstuffed turkey (about 1 hour 10 minutes longer for stuffed turkey). Place turkey on platter, tent with foil. Let stand 30 minutes. Reserve mixture in pan for gravy.",
        "Pour contents of roasting pan into strainer set over large bowl. Spoon fat from pan juices in bowl. Transfer onion mixture in strainer to blender. Add 1 cup pan juices to blender and puree until smooth, adding more pan juices and chicken broth if necessary to thin sauce to desired consistency. Transfer sauce to heavy large saucepan and bring to boil. Cook until color deepens, skimming off any foam, about 5 minutes. Season with salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "1 cup apricot nectar",
        "1 cup apricot preserves",
        "2 tablespoons minced peeled fresh ginger",
        "1 tablespoon honey",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "3 tablespoons chopped fresh thyme or 1 tablespoon dried",
        "3 tablespoons chopped fresh sage or 1 tablespoon dried rubbed sage",
        "1 1/2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "2 tablespoons (1/4 stick) unsalted butter",
        "3 large onions (about 2 pounds), thinly sliced",
        "6 ounces shallots (about 6 large), thinly sliced",
        "1 21- to 22-pound turkey",
        "1 14 1/2-ounce can (or more) low-salt chicken broth",
        "1 teaspoon chopped fresh thyme or 1/2 teaspoon dried",
        "1/2 teaspoon chopped fresh sage or 1/4 teaspoon dried",
        "1 14 1/2-ounce can (about) low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Herb",
        "Onion",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Apricot"
    ],
    "title": "Apricot-Glazed Turkey with Roasted Onion and Shallot Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-glazed-turkey-with-roasted-onion-and-shallot-gravy-2602"
}
