{
    "directions": [
        "In a small saucepan combine the apricots, 1/4 cup of the granulated sugar, and 2/3 cup of water, simmer the mixture for 15 to 18 minutes, or until the mixture is reduced by half, and add the rum. Let the mixture cool slightly and in a blender purée it.",
        "In a bowl whisk together the flour, the baking powder, and a pinch of salt. In a large bowl with an electric mixer beat together the butter, the remaining 1/2 cup granulated sugar, and the brown sugar until the mixture is light and fluffy, beat in the vanilla and the egg, and beat the mixture until it is combined well. Add the flour mixture and beat the dough until it is just combined. Form the dough into a log, chill it for 1 hour, and divide it into 8 pieces.",
        "Working with 1 piece of dough at a time, on a sheet of plastic wrap form the pieces into 8-inch ropes, wrapping the plastic wrap around the ropes to keep the dough from sticking, and on 2 baking sheets pat the rope into a 8- by 1 1/2-inch rectangles. Make a canal down the center of each rectangle with your finger and spread the apricot purée in the canals. Bake the rectangles in 2 batches in the middle of a preheated 350°F. oven for 18 to 20 minutes, or until the edges are golden, transfer them to racks, and let them cool. In a small bowl whisk together the confectioners' sugar, the lemon juice, and enough water to make a thick but pourable icing, drizzle the icing over the rectangles diagonally into 1-inch strips. The cookies keep in an airtight container for 1 week."
    ],
    "ingredients": [
        "3/4 cup (about 1/4 pound) dried apricots",
        "3/4 cup granulated sugar",
        "1 tablespoon dark rum",
        "2 1/2 cups all-purpose flour",
        "1 teaspoon double-acting baking powder",
        "2 sticks (1 cup) unsalted butter, softened",
        "1/4 cup firmly packed brown sugar",
        "1 teaspoon vanilla",
        "1 large egg",
        "1 cup confectioners' sugar",
        "2 teaspoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Rum",
        "Mixer",
        "Fruit",
        "Dessert",
        "Bake",
        "Apricot",
        "Shower",
        "Chill",
        "Gourmet"
    ],
    "title": "Apricot Butter Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-butter-cookies-10239"
}
