{
    "directions": [
        "Preheat oven to 350°F. Blend nuts, 6 tablespoons sugar and flour in processor until nuts are finely chopped. Add butter. Process until mixture begins to clump together, divide equally among four 4-inch-diameter tartlet pans with removable bottoms. Press mixture onto bottom and up sides of pans. Bake until crusts are golden and set, about 13 minutes. Transfer pans to racks; cool completely.",
        "Combine wine, water and 1/3 cup sugar in large nonstick skillet. Scrape in seeds from vanilla bean; add bean. Stir over medium heat until sugar dissolves. Increase heat and boil until liquid is slightly thickened and reduced to generous 1/2 cup, about 5 minutes. Discard vanilla bean. Cool syrup to room temperature.",
        "Combine cream cheese, preserves and 2 tablespoons vanilla syrup in processor; purée until smooth. Spoon filling into crusts; smooth tops. Refrigerate until set, about 1 hour. (Can be made 1 day ahead. Keep tartlets chilled. Cover syrup and let stand at room temperature.)",
        "Transfer 2 tablespoons vanilla syrup into small bowl. Add apricots to syrup in skillet; toss gently to coat. Arrange apricot slices decoratively atop filling in crusts. Brush apricot slices with reserved 2 tablespoons vanilla syrup. Refrigerate tartlets 30 minutes. Serve chilled."
    ],
    "ingredients": [
        "1 cup coarsely chopped roasted macadamia nuts (about 5 ounces)",
        "6 tablespoons plus 1/3 sugar",
        "1/4 cup all purpose flour",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "1 cup semidry white wine (such as Chenin Blanc)",
        "1/3 cup water",
        "1 vanilla bean, split lengthwise",
        "4 ounces cream cheese, room temperature",
        "2 tablespoons apricot preserves",
        "6 apricots, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Apricot",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot-Cream Cheese Tartlets in Macadamia Crust",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-cream-cheese-tartlets-in-macadamia-crust-2296"
}
