{
    "directions": [
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 14-inch round and fit into bottom and side of tart pan, then trim flush with top of rim. Chill until firm, about 30 minutes.",
        "Lightly prick bottom of shell all over with a fork, then line with foil and fill with weights. Bake until pastry is pale golden along rim, and set underneath weights, 18 to 20 minutes. Carefully remove foil and weights and bake shell until bottom and side are golden, about 10 minutes more. Cool completely in pan on a rack, about 30 minutes. Leave oven on.",
        "While shell cools, roast apricots in 1 layer, cut sides up, in a 13- by 9-inch baking dish 30 minutes, then set aside.",
        "Reduce oven temperature to 350°F.",
        "Pulse almonds with 2 tablespoons sugar and a pinch of salt in a food processor until finely ground.",
        "Beat together butter and 1/4 cup sugar with an electric mixer at medium-high speed until pale and fluffy. Add eggs, 1 at a time, beating well after each addition, then beat in almond mixture, vanilla, and almond extract until just combined.",
        "Spread frangipane evenly in tart shell. Arrange apricots, cut sides up, on top of frangipane. (Frangipane will puff up around apricots when baked.) Bake until frangipane is golden brown and just firm to the touch, about 45 minutes.",
        "Preheat broiler.",
        "Sprinkle top of tart with remaining 2 teaspoons sugar and broil about 6 inches from heat until sugar is melted and top of tart is browned, 1 to 2 minutes (watch carefully). Cool to warm or room temperature in pan on a rack, at least 30 minutes."
    ],
    "ingredients": [
        "Pastry dough (from butterscotch chiffon pie recipe)",
        "18 to 20 drained canned apricot halves (from 2 [1-lb] cans)",
        "1 cup whole blanched almonds (5 oz)",
        "6 tablespoons plus 2 teaspoons sugar",
        "1 stick (1/2 cup) unsalted butter, softened",
        "2 large eggs",
        "1 teaspoon vanilla",
        "1/4 teaspoon almond extract",
        "Special equipment: an 11- by 1-inch fluted tart pan with a removable bottom; pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Broil",
        "Apricot",
        "Almond",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Apricot Almond Tart",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-almond-tart-233569"
}
