{
    "directions": [
        "Whisk flour, sugar, and salt in large bowl to blend. Add butter; rub in with fingertips until mixture resembles coarse meal. Add 3 tablespoons ice water and stir until moist clumps form, adding more ice water by teaspoonfuls if mixture is too dry. Gather dough into ball; flatten into disk. Wrap in plastic and refrigerate 30 minutes.",
        "Roll out dough on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter pie dish. Fold overhang under and crimp decoratively. Refrigerate 30 minutes.",
        "Preheat oven to 375°F. Line crust with foil; fill with dried beans or pie weights. Bake until dough begins to set, about 20 minutes. Remove foil and beans. Bake until crust is just beginning to brown, about 5 minutes longer. Maintain oven temperature.",
        "Mix first 7 ingredients in medium bowl to blend. Add butter; rub in with fingertips until moist clumps form.",
        "Mix all ingredients in large bowl to blend. Transfer to warm pie crust.",
        "Sprinkle topping evenly over apricot mixture. Bake pie until topping is brown and filling is bubbling thickly, about 45 minutes, covering crust with foil after 30 minutes if browning too quickly. Cool completely. Cut into wedges and serve."
    ],
    "ingredients": [
        "1 1/4 cups all purpose flour",
        "1 teaspoon sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "3 tablespoons (or more) ice water",
        "1/2 cup Grape Nuts",
        "1/2 cup (packed) golden brown sugar",
        "1/3 cup all purpose flour",
        "1/3 cup toasted slivered almonds, finely chopped",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 1/2 pounds apricots, halved, pitted, cut into 1/2-inch slices (about 5 cups)",
        "5 tablespoons sugar",
        "3 tablespoons coarsely chopped crystallized ginger",
        "4 teaspoons cornstarch",
        "1/8 teaspoon almond extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Apricot",
        "Almond",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Kosher"
    ],
    "title": "Apricot Pie with Candied Ginger and Crunchy Topping",
    "url": "http://www.epicurious.com/recipes/food/views/apricot-pie-with-candied-ginger-and-crunchy-topping-109813"
}
