{
    "directions": [
        "Place the wine and saffron in a cup or small bowl. Stir briefly, then let it sit. Melt the butter in a large skillet over medium heat. Add the onion; cook and stir until transparent, about 3 minutes. Mix in the rice, and continue cooking and stirring until the rice has absorbed most of the butter.",
        "Slowly stir the white wine and saffron into the rice, stirring  continuously until the wine is absorbed and rice is creamy. Season with thyme, then pour in 1 cup of chicken broth at a time, cooking and stirring constantly until each cup of broth is absorbed before adding the next. Stop adding broth when the rice is tender. If you run out of broth, you may use water. Remove from the heat, stir in the Parmesan cheese and allow to cool until you can touch it without burning your hands.",
        "Lightly grease a large cookie sheet with olive oil. Pour the risotto out onto the sheet and spread evenly. Place in the refrigerator for about 1 hour or until chilled.",
        "When the rice is cool, roll small portions into balls about the size of golf balls. Tuck a cube of fontina cheese into the center of each one. Roll each ball in bread crumbs to coat.",
        "Heat the olive oil in a heavy saucepan or deep fryer to 375 degrees F 190 degrees C). The oil should be about 3 inches deep. When the oil is hot, fry the arancini until they reach a golden orangish brown, about 3 minutes. Arancini literally means 'little oranges'. Cool for 5 minutes, then serve with any marinara sauce."
    ],
    "ingredients": [
        "1 pinch saffron threads, crushed",
        "1 cup white wine",
        "2 tablespoons butter",
        "6 cups chicken broth, or as needed",
        "3 cups Arborio rice",
        "1 small white onion, chopped",
        "1 tablespoon chopped fresh thyme",
        "1 cup grated Parmesan cheese",
        "1 pound fontina cheese, cubed",
        "2 cups plain dried bread crumbs",
        "1 quart olive oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Arancini III",
    "url": "http://allrecipes.com/recipe/89692/arancini-iii/"
}
