{
    "directions": [
        "Grate horseradish in processor fitted with coarse-shredder disk. Transfer horseradish to medium saucepan. Add cream. Cover and simmer 10 minutes. Remove from heat. Let stand, covered, 30 minutes to infuse. Strain cream into small saucepan, pressing firmly on solids. (Can be made 2 days ahead. Cover and chill.)",
        "Cook red and golden beets in separate medium pots of boiling salted water until tender, about 18 minutes. Drain and cool. (Can be made 2 days ahead. Cover and chill.)",
        "Peel red beets; cut each in half and place in medium skillet. Peel golden beets; cut each in half and place in another medium skillet. Mix 1/2 cup vinegar and 2 tablespoons sugar into each skillet. Cook beets in each skillet over medium-high heat until liquid thickens to syrup and begins to coat beets, stirring often, about 4 minutes. Season beets with salt and pepper. Remove from heat.",
        "Preheat oven to 350°F. Sprinkle fish with salt and pepper. Heat 1 tablespoon oil in heavy large ovenproof skillet over high heat. Add fish, skin side down. Sear until skin is brown and crisp, about 3 minutes. Place skillet with fish in oven. Roast fish until barely opaque in center, about 3 minutes.",
        "Meanwhile, warm horseradish cream over medium heat. Heat remaining 2 tablespoons oil in another large skillet over medium-high heat. Add greens and sauté until just wilted, about 1 minute. Season with salt and pepper.",
        "Divide greens among 4 plates. Top greens with fish, skin side up. Surround fish with beets. Spoon warm horseradish cream over and drizzle with beet juices."
    ],
    "ingredients": [
        "3 cups 1/2-inch cubes peeled fresh horseradish root (from 1 pound unpeeled)",
        "1 1/2 cups heavy whipping cream",
        "8 baby red beets",
        "8 baby golden beets",
        "1 cup apple cider vinegar",
        "4 tablespoons sugar",
        "4 6-ounce arctic char or salmon fillets (with skin)",
        "3 tablespoons vegetable oil",
        "1 large bunch dandelion greens, stems trimmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fish",
        "Leafy Green",
        "Roast",
        "Horseradish",
        "Vinegar",
        "Beet",
        "Fall"
    ],
    "title": "Arctic Char with Horseradish Cream, Sweet-and-Sour Beets, and Dandelion Greens",
    "url": "http://www.epicurious.com/recipes/food/views/arctic-char-with-horseradish-cream-sweet-and-sour-beets-and-dandelion-greens-108555"
}
