{
    "directions": [
        "Preheat oven to 400°F. Wrap sweet potatoes individually in foil. Roast until tender, 1 to 1 1/2 hours. Cool and peel. Puree in processor until smooth. Measure 3 cups puree and transfer to microwave-safe bowl. Stir in mustard. Season with salt. DO AHEAD: Can be made 1 day ahead. Cover and chill. Boil vinegar in small saucepan until reduced to ` cup, about 8 minutes. Stir in soy sauce. Remove from heat.",
        "Cook broccoli in pot of boiling salted water until crisp-tender, about 1 minute. Drain; set aside. Cook bacon in medium skillet over medium heat until edges are crisp. Transfer to paper towels to drain. DO AHEAD: Reduction and broccoli can be made 2 hours ahead. Let stand at room temperature.",
        "Process mustard seeds in spice grinder until coarsely ground. Sprinkle fish with salt and pepper. Sprinkle ground seeds over top of fish. Heat 1 tablespoon oil in large skillet over medium-high heat. Add fish, mustard side down, and cook until brown and just opaque in center, about 3 minutes per side.",
        "Meanwhile, rewarm puree in microwave until heated through. Heat 1 tablespoon oil in another large skillet. Add broccoli and bacon; sauté until heated through. Season with salt and pepper.",
        "Divide broccoli, fish, and puree among plates. Drizzle with balsamic reduction and serve.",
        "*Chinese broccoli is also called gai lan or Chinese kale; it's available at Asian markets. Broccoli rabe is an Italian leafy green vegetable with scattered clusters of broccoli-like florets; you'll find it at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "3 red-skinned sweet potatoes (yams; about 2 1/2 pounds)",
        "1 teaspoon (or more) hot prepared Chinese mustard",
        "1 cup balsamic vinegar",
        "1 1/2 teaspoons soy sauce",
        "1 pound Chinese broccoli or broccoli rabe (rapini),* large outer leaves removed, cut crosswise on diagonal into 1/4-inch-thick slices",
        "2 slices bacon, cut into 1-inch pieces",
        "2 teaspoons yellow mustard seeds",
        "4 5- to 6-ounce arctic char fillets",
        "2 tablespoons vegetable oil, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Sauté",
        "Low Fat",
        "High Fiber",
        "Vinegar",
        "Broccoli",
        "Sweet Potato/Yam",
        "Fall",
        "Healthy"
    ],
    "title": "Arctic Char with Chinese Broccoli and Sweet Potato Purée",
    "url": "http://www.epicurious.com/recipes/food/views/arctic-char-with-chinese-broccoli-and-sweet-potato-puree-239797"
}
