{
    "directions": [
        "Place arctic char skin side down on a large piece of plastic wrap. Mix 3 tablespoons grapefruit zest, 3 tablespoons salt, both sugars, 1 tablespoon crushed green peppercorns, and crushed juniper berries in a small bowl; sprinkle mixture over fish, spreading evenly and pressing gently so spices adhere. Wrap plastic tightly around fish, then wrap with another large sheet of plastic. Gently poke 24 small holes through plastic (not fish) on both sides of fish with a thin skewer or the tip of a sharp knife to allow juices to escape. Put fish on a rimmed baking sheet. Top with another rimmed baking sheet; weigh it down with two 15-ounce canned goods. Refrigerate for 2 days, turning fish after 1 day.",
        "Remove canned goods and top baking sheet. Unwrap and discard plastic, keeping cure intact. Rewrap in clean plastic and poke holes in plastic as before. Place in a clean resealable plastic bag; refrigerate, skin side up. Chill for 1 more day. Gently scrape off cure.",
        "Whisk crème fraîche, 2 teaspoons dill, and remaining 1 teaspoon crushed green peppercorns in a small bowl. Season with salt. Thinly slice gravlax on a diagonal and serve on crackers. Top with crème fraîche and garnish with remaining 2 teaspoons grapefruit zest and 1 teaspoon dill."
    ],
    "ingredients": [
        "1 2-pound side of arctic char, skin on, pinbones removed",
        "3 tablespoons plus 2 teaspoons finely grated white or pink grapefruit zest",
        "3 tablespoons kosher salt plus more",
        "2 tablespoons muscovado sugar or light brown sugar",
        "1 tablespoon granulated sugar",
        "1 tablespoon plus 1 teaspoon dried whole green peppercorns, crushed",
        "1 tablespoon juniper berries, well crushed",
        "1/2 cup crème fraîche",
        "3 teaspoons minced fresh dill, divided",
        "Crackers or toasts (preferably rye)",
        "Ingredient info: Juniper berries are sold in the spice section of better supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Appetizer",
        "Cocktail Party",
        "New Year's Eve",
        "Grapefruit",
        "Shower",
        "Chill",
        "Party",
        "Dill",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Arctic Char Gravlax with White Grapefruit",
    "url": "http://www.epicurious.com/recipes/food/views/arctic-char-gravlax-with-white-grapefruit-367709"
}
