{
    "directions": [
        "Pat fish dry, then transfer, skin side up, to a large sheet of plastic wrap. Stir together sugar, salt, and pepper, then rub 3 tablespoons of mixture onto skin of fish. Turn fish over and thickly coat with remaining sugar mixture, then pack dill on top.",
        "Wrap fish tightly in 2 or 3 layers of plastic wrap (to prevent leakage; salt mixture will liquefy as fish cures) and transfer to a large shallow baking pan. Put another baking pan or a cutting board on top of fish and weight down with 3 or 4 full cans (about 3 lb total). Let fish cure, chilled, turning wrapped fillet over roughly every 12 hours and then replacing weight, for 36 hours total.",
        "Peel cucumbers, making sure to remove all green (for a clearer jelly), then halve lengthwise and core. Coarsely chop cucumbers and purée in a food processor until smooth, then drain in a large fine-mesh sieve set over a bowl, pressing hard on solids to extract 2 cups liquid. Discard solids.",
        "Stir together salt and 1/2 cup cucumber liquid in a small saucepan and sprinkle with gelatin. Let stand 1 minute to soften, then heat over moderate heat, stirring, just until gelatin is dissolved, about 2 minutes. Cool mixture to room temperature, then stir into remaining 1 1/2 cups cucumber liquid along with vinegar. Pour mixture into an 8-inch square glass baking dish and sprinkle with dill fronds, pressing gently to submerge. Chill, covered, until set, at least 8 hours.",
        "Unwrap gravlaks, discarding liquid, and gently scrape off dill. Transfer gravlaks, skin side down, to a cutting board. Holding a very sharp long thin-bladed knife at a 30-degree angle, cut gravlaks across the grain into very thin slices, being careful not to cut through skin. Discard skin.",
        "Cut jelly into 6 pieces and divide among 6 plates with a metal spatula. Serve with several slices of gravlaks."
    ],
    "ingredients": [
        "1 (1 1/4-lb) center-cut piece arctic char fillet with skin, pin bones removed",
        "1/2 cup sugar",
        "1/4 cup kosher salt",
        "1 tablespoon coarsely ground black pepper",
        "3 cups coarsely chopped fresh dill (from 2 large bunches)",
        "3 seedless cucumbers (usually plastic-wrapped; 3 lb total)",
        "3/4 teaspoon table salt",
        "2 teaspoons unflavored gelatin (from 1 envelope)",
        "1 tablespoon distilled white vinegar",
        "1 tablespoon tiny fresh dill fronds",
        "Accompaniment: thin Scandinavian crispbread such as Kavli"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Appetizer",
        "No-Cook",
        "Quick & Easy",
        "Cucumber",
        "Chill",
        "Dill",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Arctic Char Gravlaks with Cucumber Jelly",
    "url": "http://www.epicurious.com/recipes/food/views/arctic-char-gravlaks-with-cucumber-jelly-232479"
}
