{
    "directions": [
        "Stir together all pickled onion ingredients in a bowl and chill, covered, at least 12 hours.",
        "Toast cumin, allspice, and peppercorns together in a dry heavy skillet over moderate heat, stirring, until fragrant, 1 to 2 minutes. Finely grind toasted spices with achiote in an electric coffee/spice grinder or with a mortar and pestle. Mince garlic and mash to a paste with salt using a heavy knife, then transfer to a 2 1/2- to 3-quart shallow glass or ceramic baking dish. Stir in spice mixture, oregano, orange juice, and vinegar. Add pork and rub meat all over with marinade. Marinate pork, covered and chilled, at least 2 hours.",
        "Preheat oven to 325°F.",
        "Bring pork to room temperature, then add water to baking dish and cover tightly with foil. Bake in middle of oven until very tender, 1 3/4 to 2 hours. (Leave oven on.)",
        "Uncover pork and, when cool enough to handle, shred meat on a cutting board, discarding bones and excess fat. Transfer meat and any juices accumulated on cutting board to baking dish.",
        "Bring milk to a simmer in a small saucepan, then remove from heat and reserve 1/2 cup in a small bowl. Add butter to remaining 2 1/2 cups hot milk and stir until melted.",
        "Toss together arepa flour, sugar, salt, and mozzarella in a large bowl. Add hot milk with butter and stir until combined. Let mixture stand until milk is absorbed, 1 to 2 minutes (dough will be soft; it will continue to stiffen as it stands).",
        "Form 1 level tablespoon dough into a ball. Flatten ball to a 1 1/2- to 1 3/4-inch-diameter disk and transfer to a wax-paper-lined tray. Form more disks with remaining dough in same manner, stirring in some of reserved milk if dough becomes too stiff and edges of disks crack when flattened.",
        "Heat 1/2 tablespoon oil in a 12-inch nonstick skillet over moderately low heat until hot, then cook arepas in batches of 10 to 12, turning over once, until golden in patches, 8 to 12 minutes total. (Add more oil to skillet between batches as needed.) Transfer to baking sheets as cooked.",
        "Reheat arepas in batches as needed, covered with foil, until heated through, 10 to 15 minutes, then top with pork and pickled onion. Serve warm."
    ],
    "ingredients": [
        "1 medium red onion, cut into 3/4-inch-wide wedges, then very thinly sliced crosswise",
        "1 to 2 fresh habanero or Scotch bonnet chiles, seeded, deveined, and very finely chopped",
        "1/2 cup distilled white vinegar",
        "1/2 teaspoon dried oregano (preferably Mexican), crumbled",
        "1/2 teaspoon salt, or to taste",
        "1/2 teaspoon cumin seeds",
        "1/4 teaspoon whole allspice",
        "1/2 teaspoon black peppercorns",
        "2 tablespoons achiote (annatto) seeds",
        "6 large garlic cloves, coarsely chopped",
        "1 1/2 teaspoons salt",
        "1 teaspoon dried oregano (preferably Mexican), crumbled",
        "1/3 cup fresh orange juice",
        "1/3 cup distilled white vinegar",
        "3 pound pork shoulder chops (3/4 inch thick)",
        "1/2 cup water",
        "3 cups whole milk",
        "1/2 stick (1/4 cup) unsalted butter, cut into pieces",
        "1 1/2 cups white arepa flour",
        "1 tablespoon sugar",
        "1 teaspoon salt",
        "1 cup coarsely grated mozzarella (5 ounces)",
        "2 1/2 tablespoons vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Onion",
        "Pork",
        "Bake",
        "Marinate",
        "Cocktail Party",
        "Cinco de Mayo",
        "Vinegar",
        "Mozzarella",
        "Orange",
        "Spice",
        "Pan-Fry",
        "Gourmet"
    ],
    "title": "Arepas with Pulled Pork and Pickled Onion",
    "url": "http://www.epicurious.com/recipes/food/views/arepas-with-pulled-pork-and-pickled-onion-108149"
}
