{
    "directions": [
        "Set racks in upper and lower thirds of oven, and preheat to 450 degrees F. Line 2 large baking sheets with parchment paper.",
        "Cook beef in a large, heavy skillet over medium-high heat, stirring and breaking up lumps, until no longer pink, 4 to 5 minutes. Transfer beef to a small bowl with a slotted spoon, and pour off grease from skillet. Melt butter in skillet and saute onions and green onion, stirring occasionally, until tender, about 5 minutes. Return beef to skillet and stir in hard-boiled eggs, olives, raisins, cumin, salt, and pepper. Transfer mixture to a shallow bowl and chill until cooled, 10 to 20 minutes.",
        "Unfold 1 pastry sheet, keeping remaining chilled, onto a lightly floured surface, dust lightly with flour, and roll out into a 12-inch square. Cut 4 (5 1/2-inch) rounds from pastry. Brush a 1/2-inch border around edges of 1 round with water, using a small brush or fingertip. Spoon about 3 tablespoons of filling onto half of round. Fold other half over filling and press edges together firmly. Crimp edges with a fork and transfer to one of prepared baking sheets. Repeat with 3 remaining rounds. Form 12 more empanadas in same manner with remaining pastry and filling, arranging them about 1 1/2 inches apart on baking sheets.",
        "Brush tops of empanadas with beaten egg. Bake, switching position of sheets halfway through, until golden brown, about 15 minutes."
    ],
    "ingredients": [
        "1/2 pound ground beef",
        "3 tablespoons butter",
        "2 medium onions, chopped",
        "1 green onion, chopped",
        "2 hard-boiled eggs, chopped",
        "14 pitted green olives, such as Manzanilla, finely chopped",
        "3 tablespoons raisins",
        "1 teaspoon cumin",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 (17.5 ounce) packages frozen puff pastry (each with 2 sheets), thawed",
        "1 raw egg, lightly beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Argentinian Beef Empanadas",
    "url": "http://allrecipes.com/recipe/244265/argentinian-beef-empanadas/"
}
