{
    "directions": [
        "In a saute; pan melt the shortening and add the chopped onions. Cook the onions until just before they begin to turn golden. Remove from the heat and stir in the sweet paprika, hot paprika, crushed red pepper flakes and salt to taste.",
        "Spread the meat on a sieve and pour boiling water on it for partial cooking. Allow meat to cool. Place meat in a dish add salt to taste, cumin and vinegar. Mix and add the meat to the onion mixture. Mix well  and place on a flat to dish to cool and harden.",
        "Cut puff pastry dough into 10 round shells. Place a spoonful of the meat mixture on each round; add some of the raisins, olives and hard boiled egg. Avoid reaching the edges of the pastry with the filling because its oiliness will prevent good sealing. Slightly wet the edge of the pastry, fold in two and stick edges together. The shape should resemble that of a half-moon. You should have a 2/3 to 1/2 inch flat edge of pastry to work with. Seal by twisting edge, step by step, between thumb and index finger, making sure to add pressure before releasing the pinch and moving on to the next curl. Other sealing procedures like pinching without curling or using a fork to seal will not prevent juice leaks during baking, and empanadas must be juicy.",
        "Preheat oven to 350 degrees F (180 degrees C). Place empanadas on a parchment paper lined baking sheet. Be sure to prick each empanada with a fork near the curl to allow steam to escape during baking. Glaze with egg for shine and bake until golden, about 20 to 30 minutes."
    ],
    "ingredients": [
        "1/2 cup shortening",
        "2 onions, chopped",
        "1 pound lean ground beef",
        "2 teaspoons Hungarian sweet paprika",
        "3/4 teaspoon hot paprika",
        "1/2 teaspoon crushed red pepper flakes",
        "1 teaspoon ground cumin",
        "1 tablespoon distilled white vinegar",
        "1/4 cup raisins",
        "1/2 cup pitted green olives, chopped",
        "2 hard-cooked eggs, chopped",
        "salt to taste",
        "1 (17.5 ounce) package frozen puff pastry sheets, thawed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Argentine Meat Empanadas",
    "url": "http://allrecipes.com/recipe/12512/argentine-meat-empanadas/"
}
