{
    "directions": [
        "Stir together olive oil, lemon juice, wine, and garlic; season with salt, pepper, oregano, rosemary, and bay leaf. Toss lamb with marinade until evenly combined, then pour into a resealable plastic bag, and marinate in refrigerator at least 24 hours.",
        "Position oven rack to its top setting and set oven to broil.",
        "Remove lamb from marinade and thread onto metal skewers; reserve marinade. Thread onion wedges, green peppers, and mushrooms onto separate metal skewers. Brush vegetables with reserved marinade.",
        "Broil the skewers on a broiler pan, turning frequently. Cook onions for 12 minutes, lamb for 10 minutes, green pepper for 7 minutes, and the mushrooms for 3 minutes. Remove from oven, and allow to cool until cool enough to handle.",
        "Remove skewers from ingredients and set aside. Reassemble skewers, alternating lamb, onions, green peppers, mushrooms, and tomatoes. Place onto broiler pan and brush again with marinade. Discard remaining marinade.",
        "Broil skewers again to finish cooking, turning frequently until the lamb is medium-rare and the vegetables begin to blacken in spots, 5 to 7 minutes."
    ],
    "ingredients": [
        "1/2 cup olive oil",
        "2 tablespoons fresh lemon juice",
        "1 teaspoon dry white wine",
        "1 tablespoon minced garlic",
        "1/8 teaspoon salt",
        "1/8 teaspoon black pepper",
        "1/8 teaspoon dried oregano",
        "1/8 teaspoon dried rosemary leaves",
        "1 bay leaf",
        "2 pounds boneless leg of lamb, cut into 1 1/2-inch cubes",
        "2 large onions, peeled, cut into 8 wedges each",
        "2 large green bell peppers, cut into 8 wedges each",
        "12 mushrooms, stems removed",
        "2 large tomatoes, cut into 8 wedges"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Armenian Shish Kabob",
    "url": "http://allrecipes.com/recipe/137975/armenian-shish-kabob/"
}
