{
    "directions": [
        "Set a rack over a saucepan of boiling water, put the saffron in a saucer on the rack, and let it steam for 3 to 4 minutes, or until it is brittle. Remove the saucer and the rack and crumble the saffron in the saucer.",
        "In a large heavy skillet heat the oil over moderately high heat until it is hot but not smoking and reduce the heat to moderately low. Cook the chicken, patted dry, in batches in the oil, turning it, for 15 to 18 minutes, or until it is cooked through, transferring it as it is cooked to a bowl.",
        "Pour off all but 3 tablespoons of the fat from the skillet and in the skillet cook the onions and the green bell peppers over moderately low heat, stirring occasionally, until the vegetables are softened. Add the tomatoes, the garlic, the paprika, and the saffron and cook the mixture, stirring, for 1 minute. Add the rice and cook the mixture, stirring, for 3 minutes. Add the broth, heated, and simmer the mixture, stirring occasionally, for 7 minutes. Transfer the rice mixture to a shallow 5-quart baking dish and arrange the chicken over it.",
        "Bake the arroz con pollo in middle of a preheated 325° F. oven for 15 minutes, sprinkle the red bell pepper and the peas over it, and bake the arroz con pollo for 5 to 10 minutes more, or until the liquid is absorbed and the rice is al dente. Sprinkle the arroz con pollo with the parsley."
    ],
    "ingredients": [
        "1 rounded 1/4 teaspoon saffron threads",
        "1/4 cup olive oil",
        "a 3 1/2-pound chicken, cut into serving pieces",
        "2 onions, chopped",
        "2 small green bell peppers, chopped",
        "3/4 pound plum tomatoes (about 6), peeled, seeded, and chopped",
        "2 garlic cloves, minced",
        "4 teaspoons paprika",
        "3 cups Arborio rice (Italian short-grain rice, available at Italian markets and some specialty foods shops)",
        "6 cups chicken broth",
        "1 large red bell pepper, roasted and cut into strips",
        "1 cup thawed frozen peas",
        "1/4 cup minced fresh parsley leaves if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Rice",
        "Tomato",
        "Bake",
        "Fall",
        "Gourmet"
    ],
    "title": "Arroz con Pollo",
    "url": "http://www.epicurious.com/recipes/food/views/arroz-con-pollo-10666"
}
