{
    "directions": [
        "Bring 2 cups shrimp stock to a boil in a saucepan; reduce heat to low and let the stock simmer.",
        "Whisk cornmeal with remaining 1 cup shrimp stock in a bowl until smooth. Whisk the moistened cornmeal into the simmering shrimp stock. Stir grits occasionally until slightly thickened, 3 to 5 minutes. Stir in butter until incorporated. Mix in sharp Cheddar cheese, about 1 tablespoon at a time, until cheese has smoothly melted into grits.",
        "Bring grits back to a simmer and cook, stirring often, until tender, 15 to 20 more minutes. Season with salt and black pepper.",
        "While grits are simmering, heat canola oil in a large skillet over medium heat. Cook and stir celery until tender, 3 to 4 minutes; stir in onion, green bell pepper, thyme, and oregano. Cook and stir vegetables until onion is translucent, 7 to 8 minutes.",
        "Mix tomato sauce into cooked vegetables and simmer for about 5 minutes to blend the flavors; stir in the sour cream to make a sauce.",
        "Stir shrimp into the sauce with vegetables and cover skillet. Bring sauce to a simmer, cover, and reduce heat to low. Simmer until shrimp are pink and no longer translucent in the middle, 5 to 7 minutes.",
        "To serve, turn grits into a large shallow serving bowl and arrange shrimp over the grits using tongs. Pour sauce and vegetables over shrimp and grits; season to taste with hot pepper sauce and sprinkle with green onion."
    ],
    "ingredients": [
        "3 cups shrimp stock, divided",
        "1 cup finely ground cornmeal",
        "1 tablespoon butter",
        "1/2 cup shredded sharp Cheddar cheese",
        "salt and ground black pepper to taste",
        "2 tablespoons canola oil",
        "1/2 cup diced celery",
        "1 cup diced onion",
        "1 cup diced green bell pepper",
        "1 tablespoon dried thyme",
        "1 tablespoon dried oregano",
        "1 (8 ounce) can tomato sauce",
        "1/3 cup reduced-fat sour cream",
        "1 1/2 pounds uncooked shrimp, peeled and deveined",
        "1 dash hot pepper sauce, or to taste (optional)",
        "1 teaspoon chopped green onion, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Arron's Shrimp and Grits",
    "url": "http://allrecipes.com/recipe/220896/arrons-shrimp-and-grits/"
}
