{
    "directions": [
        "Bring large pot of water to boil. Add 2 tablespoons lemon juice to water. Add artichokes and cook until tender, about 25 minutes. Drain well. Cool completely. Using small spoon and keeping artichokes intact, carefully remove tiny center leaves and chokes.",
        "Mix goat cheese, cream, 2 teaspoons thyme and garlic in small bowl. Season to taste with salt and pepper. Spoon mixture into center of artichokes, dividing equally. Place each artichoke in center of square piece of foil large enough to cover artichoke completely. Gather foil up around artichoke, twisting top of foil to secure. (Can be prepared 1 day ahead. Refrigerate.)",
        "Preheat oven to 400°F. Place artichokes on baking sheet and bake until heated through, about 15 minutes. Melt butter in heavy small skillet. Add olive oil and remaining 6 tablespoons lemon juice and bring to simmer. Remove from heat and stir in remaining 1 teaspoon thyme. Season to taste with salt and pepper. Unwrap artichokes. Place each in center of plate. Drizzle butter mixture around each and serve."
    ],
    "ingredients": [
        "8 tablespoons fresh lemon juice",
        "6 medium artichokes, tops and stems trimmed",
        "8 ounces soft fresh goat cheese (such as Montrachet)",
        "3 tablespoons whipping cream",
        "3 teaspoons minced fresh thyme or 1 teaspoon dried",
        "2 large garlic cloves, pressed",
        "3 tablespoons butter",
        "3 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Goat Cheese",
        "Artichoke",
        "Spring",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Artichokes with Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/artichokes-with-goat-cheese-399"
}
