{
    "directions": [
        "Prepare a gas grill for direct-heat cooking over medium-high heat; see grilling procedure .",
        "Pulse artichokes, mayonnaise, capers, and garlic in a food processor until coarsely chopped.",
        "Trim off a thin slice from 2 opposite long sides of eggplant, then cut eggplant lengthwise into 4 (1/3-inch-thick) slices. Brush both sides of slices with 2 tablespoons oil (total) and season with 1/4 teaspoon each of salt and pepper.",
        "Grill eggplant slices, covered, turning once and brushing grilled sides with 1 tablespoon oil (total), until golden-brown and tender, about 4 minutes, then transfer to a tray.",
        "Brush both sides of bread with remaining 2 tablespoons oil and grill, covered, without turning, until grill marks appear, about 2 minutes.",
        "Top each of 4 bread slices, grilled sides up, with cheese and an eggplant slice. Spread artichoke mixture on remaining 4 bread slices, grilled sides up, then assemble sandwiches.",
        "Put sandwiches on grill and press down with a metal spatula, then grill, turning once, until heated through and grill marks appear, about 4 minutes total."
    ],
    "ingredients": [
        "1 (6 1/2-ounces) jar marinated artichokes, drained and chopped",
        "2 tablespoons mayonnaise",
        "1 tablespoon drained capers",
        "1 small garlic clove",
        "1 (3/4-pound) eggplant",
        "5 tablespoons olive oil, divided",
        "1 (1-pound) round loaf Italian bread, 8 (1/3-inch-thick) slices cut from middle",
        "1/4 pound Fontina (preferably Italian), thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Vegetarian",
        "Quick & Easy",
        "Father's Day",
        "Backyard BBQ",
        "Lunch",
        "Artichoke",
        "Eggplant",
        "Spring",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Fontina",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Artichoke and Eggplant Panini",
    "url": "http://www.epicurious.com/recipes/food/views/artichoke-and-eggplant-panini-352791"
}
