{
    "directions": [
        "Keep stem attached and, at opposite end, cut off top inch of 1 artichoke with a serrated knife. Bend back outer leaves until they snap off close to base, then discard several more layers of leaves in same manner until you reach pale yellow leaves with pale green tips.",
        "Cut remaining leaves flush with top of artichoke bottom using a sharp knife, then pull out purple leaves and scoop out fuzzy choke with melon-ball cutter. Trim dark green fibrous parts from base and sides of artichoke with a sharp paring knife, then rub cut surfaces with a lemon half.",
        "Cut 1/4 inch from end of stem to expose inner core. Trim sides of stem (still attached) down to pale inner core. Rub cut surfaces with same lemon half.",
        "Trim remaining artichokes in same manner.",
        "Put water and oil in a 4-quart heavy pot.",
        "Mince and mash garlic with 1 teaspoon kosher salt, then mix in mint. Rub one sixth of garlic paste into cavity of each artichoke, then stand artichokes upside down in liquid in pot. Sprinkle remaining teaspoon salt over artichokes, then simmer, covered, over low heat, until tender, 20 to 30 minutes.",
        "Transfer artichokes to a serving dish and boil cooking liquid, whisking, until emulsified and reduced to about 1/3 cup. Pour sauce over artichokes and serve warm or at room temperature."
    ],
    "ingredients": [
        "6 large artichokes (10 to 12 oz each)",
        "1 lemon, halved",
        "1 cup water",
        "1/3 cup extra-virgin olive oil",
        "1 tablespoon finely chopped garlic",
        "2 teaspoons kosher salt",
        "1 tablespoon finely chopped fresh mint",
        "Garnish: chopped fresh mint",
        "Special equipment: a melon-ball cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Appetizer",
        "Braise",
        "Vegetarian",
        "Mint",
        "Artichoke",
        "Gourmet",
        "Sugar Conscious",
        "Vegan",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Artichoke Bottoms Braised in Olive Oil with Garlic and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/artichoke-bottoms-braised-in-olive-oil-with-garlic-and-mint-106242"
}
