{
    "directions": [
        "Preheat oven to 350°F. Divide bread between 2 baking sheets. Bake until cubes are dry but not hard, stirring occasionally, about 15 minutes.",
        "Heat oil in heavy large skillet over medium-high heat. Add sausage and sauté until cooked through, breaking up with back of fork, about 5 minutes. Add onions, celery, and garlic. Sauté until celery is soft, about 10 minutes. Mix in artichokes, thyme, and mint; sauté 2 minutes longer. Transfer sausage mixture to large bowl. (Bread and sausage mixture can be made 1 day ahead. Cover separately. Store bread at room temperature. Refrigerate sausage mixture and reheat to lukewarm before continuing.)",
        "Add bread to sausage mixture; toss to blend well. Mix in cheese, then 1 cup broth. Season with salt and pepper.",
        "Loosely fill main cavity and neck cavity of turkey with stuffing. Add enough broth to remaining stuffing to moisten slightly (1/4 cup to 3/4 cup, depending on amount of remaining stuffing). Generously butter baking dish. Spoon remaining stuffing into prepared dish. Cover dish with buttered foil, buttered side down. Bake stuffing in dish — alongside turkey or while turkey is resting — until heated through, about 25 minutes. Uncover stuffing in dish. Bake until top of stuffing is slightly crisp and golden, about 15 minutes longer.",
        "Preheat oven to 350°F. Generously butter 13x9x2-inch glass baking dish. Add enough extra broth to stuffing to moisten (3/4 cup to 1 1/4 cups). Transfer stuffing to prepared dish. Cover with buttered foil, buttered side down. Bake until heated through, about 40 minutes. Uncover and bake until top is slightly crisp and golden, about 20 minutes longer."
    ],
    "ingredients": [
        "15 cups 1-inch cubes crustless sourdough bread (from two 1-pound loaves)",
        "3 tablespoons olive oil",
        "1 1/2 pounds Italian sweet sausages, casings removed",
        "2 cups chopped onions",
        "3/4 cup chopped celery",
        "2 large garlic cloves, minced",
        "1 8-ounce package frozen artichoke hearts, thawed, coarsely chopped",
        "2 teaspoons chopped fresh thyme",
        "1 teaspoon chopped fresh mint",
        "1 cup freshly grated Parmesan cheese (about 3 ounces)",
        "1 cup (or more) low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pork",
        "Vegetable",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Parmesan",
        "Sausage",
        "Artichoke",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Artichoke, Sausage, and Parmesan Cheese Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/artichoke-sausage-and-parmesan-cheese-stuffing-107289"
}
