{
    "directions": [
        "In a bowl stir together well the cheeses, the artichoke hearts, and pepper to taste and chill the filling for 1 hour, or until it is cold.",
        "In a large heavy skillet cook the bell peppers in the oil over moderately low heat, stirring, until they are softened, stir in the garlic and the broth, and simmer the mixture for 15 minutes. Transfer about 2 tablespoons of the bell peppers with a slotted spoon to a bowl and reserve them for garnish. In a blender purée the remaining bell pepper mixture with salt and pepper to taste until it is smooth, transfer the sauce to a small saucepan, and keep it warm, covered, while preparing the ravioli.",
        "Cut out a heart from each won ton wrapper with a heart-shaped cutter (about 3 inches at the widest point). Put 1 heart on a lightly floured surface, mound 1 teaspoon of the filling on each lobe of the heart, and brush the edges with water. Put a second heart over the first, pressing down around the filling to force out the air, and seal the edges well. Make ravioli with the remaining wrappers and filling in the same manner, transferring them as they are formed to a kitchen towel, and let them dry slightly, turning them occasionally.",
        "Bring a large saucepan of boiling salted water to a gentle boil and in it cook the ravioli for 2 minutes, or until they rise to the surface and are tender. (Do not let the water boil vigorously once the ravioli have been added.) Transfer the ravioli as they are cooked with a slotted spoon to a kitchen towel to drain. Divide the sauce between 2 plates, arrange 3 ravioli on each plate, and garnish each serving with some of he reserved bell peppers."
    ],
    "ingredients": [
        "1/4 pound brin d'amour (Corsican sheep's milk cheese, available at specialty foods shops), herbed coating discarded and the cheese grated (about 1/3 cup)",
        "2 tablespoons soft mild goat cheese, such as Montrachet",
        "1/4 cup finely chopped drained marinated artichoke hearts",
        "3 small red, yellow, or orange bell peppers, cut into julienne strips",
        "1 tablespoon olive oil",
        "1 garlic clove, chopped",
        "1/2 cup chicken broth",
        "12 won ton wrappers (available at Oriental markets and many supermarkets), thawed if frozen"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Vegetable",
        "Appetizer",
        "Valentine's Day",
        "Winter",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Artichoke Heart and Brin D'amour Ravioli with Three-Pepper Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/artichoke-heart-and-brin-damour-ravioli-with-three-pepper-sauce-11327"
}
