{
    "directions": [
        "Preheat oven to 250°F. Cut each plum tomato in half lengthwise and place, cut side up, on rimmed baking sheet. Drizzle tomatoes with oil, then sprinkle with chopped thyme, 1 teaspoon coarse salt, and 1/2 teaspoon black pepper. Roast tomatoes until tender and dry-looking on top but still moist, about 1 hour 45 minutes. Cool on sheet. Do ahead: Can be made 2 days ahead. Wrap; chill. Rewarm oven-dried tomatoes in microwave in 15-second intervals at low setting before using.",
        "Place beans in medium bowl. Add enough cold water to cover by 2 inches. Let beans soak overnight. Place dried porcini mushrooms in another medium bowl. Add 2 cups boiling water. Soak until mushrooms are soft, at least 1 hour and up to 4 hours. Drain mushrooms, reserving soaking liquid. Chop mushrooms.",
        "Heat 1 tablespoon oil in heavy large saucepan over medium heat. Add leek, onion, and carrot; sprinkle lightly with salt and pepper. Cover and cook until vegetables are tender, stirring occasionally, about 10 minutes. Add 3 cups broth, wine, bay leaves, chopped sage, chopped porcini mushrooms, and reserved mushroom soaking liquid, leaving any sediment behind. Drain beans; add beans to pot. Bring to boil. Reduce heat and simmer uncovered until beans are tender, stirring occasionally and adding more broth by 1/2 cupfuls to keep beans just covered, about 2 hours. Season beans to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cool, cover, and chill. Rewarm beans before continuing.",
        "Heat remaining 2 tablespoons olive oil in medium skillet over medium-high heat. Add sliced wild mushrooms, garlic, and shallot; sauté until mushrooms are tender, about 8 minutes. Season with salt and pepper. Stir mushrooms into beans. Keep mixture warm.",
        "Preheat broiler. Grind dried porcini mushrooms to powder in spice grinder or food mill. Brush broiler pan with oil. Brush fish on both sides with oil; place on broiler pan, skin side down. Sprinkle each with salt, pepper, 1/2 teaspoon ground mushrooms, and 1/4 teaspoon fennel pollen (reserve any remaining ground mushrooms for another use).",
        "Broil fish, flesh side up, 4 inches from heat source until just opaque in center (do not turn), 4 to 5 minutes.",
        "Spoon 1 cup bean mixture into center of each plate. Top beans with tomato halves, then fish, flesh side up.",
        "*Available in the produce section of many supermarkets and at specialty foods stores and Italian markets.",
        "**A spice extracted from wild fennel plants; available at specialty foods stores and from zingermans.com"
    ],
    "ingredients": [
        "1 pound plum tomatoes",
        "1 tablespoon olive oil",
        "2 teaspoons chopped fresh thyme",
        "1 teaspoon coarse kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 cup dried large white beans (such as gigante, cannellini, Italian butter, or Great Northern)",
        "1/2 ounce dried porcini mushrooms*",
        "2 cups boiling water",
        "3 tablespoons olive oil, divided",
        "1 cup chopped leek (white and pale green parts only)",
        "1/2 cup chopped onion",
        "1/2 cup chopped peeled carrot",
        "4 cups (about) low-salt chicken broth, divided",
        "1/2 cup dry white wine",
        "2 small bay leaves",
        "1 teaspoon chopped fresh sage",
        "1/2 pound fresh wild mushrooms (such as chanterelle, porcini, or stemmed shiitake), thickly sliced",
        "2 garlic cloves, chopped",
        "1 small shallot, chopped",
        "1/4 ounce dried porcini mushrooms*",
        "Olive oil",
        "4 6-ounce arctic char fillets with skin (each 3/4 to 1 inch thick)",
        "1 teaspoon fennel pollen** or ground fennel seed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Fish",
        "Mushroom",
        "Tomato",
        "Broil",
        "Roast",
        "High Fiber",
        "Mother's Day",
        "Dinner",
        "Healthy",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Artic Char with White Beans, Wild Mushrooms, and Oven-Dried Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/artic-char-with-white-beans-wild-mushrooms-and-oven-dried-tomatoes-350114"
}
