{
    "directions": [
        "For the crust: Preheat oven to 450 degrees F.",
        "Mix veggies and hash browns together. Gently press between paper towels to remove as much moisture as possible. In a large nine inch pie plate, toss the veggie mixture with the melted butter. Sprinkle 4 tablespoons of the cheese packet from the box of Steakhouse Hash Browns over hash brown mixture and blend. Using the bottom of a measuring cup, press mixture into the bottom and up the sides to firmly form a crust. Place rack on the lower third of the oven. Bake for 20-25 minutes until golden brown and the edges begin to crisp. While crust bakes, make the filling.",
        "For the filling: Blend the eggs and cream until smooth. Stir in the artichokes, leeks, ham, cheese and seasonings.",
        "When the hash brown crust is ready, lower the oven temperature to 350 degrees F and pour the filling into the crust. Bake for 30 minutes then sprinkle the crunchy onion topping on the quiche. Continue to bake for another 15 minutes or until the quiche is light golden brown and firm in the middle. Quiche will settle as it cools."
    ],
    "ingredients": [
        "For the crust:",
        "2 cups Idahoan® Steakhouse Cheesy Hashbrowns, rehydrated",
        "1/4 cup zucchini, shredded",
        "1/4 cup sweet potato, shredded",
        "1/4 cup carrot, shredded",
        "4 tablespoons butter, melted",
        "1 teaspoon salt",
        "For the filling:",
        "4 large eggs",
        "1 1/2 cups whip cream, un-whipped (or half and half for a lighter quiche)",
        "8 ounces artichokes hearts, coarse chop",
        "1/2 cup leeks, chopped and sauteed to soften",
        "3/4 cup cooked ham, small dice",
        "1 cup Swiss cheese, shredded",
        "1/8 teaspoon cayenne red pepper",
        "1 teaspoon dried sage",
        "3/4 teaspoon salt",
        "Crunchy onion packet for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Artichoke and Ham Quiche with Cheesy Hashbrown Crust",
    "url": "http://allrecipes.com/recipe/234778/artichoke-and-ham-quiche-with-cheesy/"
}
