{
    "directions": [
        "Place unpeeled garlic cloves in small saucepan. Add enough water to cover garlic cloves by 1 inch. Bring to boil; reduce heat to medium-low, cover, and simmer until garlic is tender, about 25 minutes. Drain; transfer to plate. Chill garlic cloves until cool enough to handle, about 10 minutes. Squeeze garlic cloves from peel and place cloves in small bowl. Using fork, mash garlic cloves until smooth.",
        "Melt butter in heavy small saucepan over medium heat. Add anchovies and sauté 1 minute. Add mashed garlic and oil. Simmer over low heat 10 minutes to allow flavors to blend, stirring occasionally. Season to taste with salt and pepper. DO AHEAD: Can be made 1 hour ahead. Let stand at room temperature. Rewarm before serving, stirring occasionally (bagna cauda will separate when served).",
        "Add artichokes to large pot of boiling salted water. Cover and cook until just tender when pierced through stem with fork, turning occasionally, 30 to 40 minutes, depending on size of artichokes. Drain.",
        "Place 1 hot artichoke on each of 6 plates. Divide bagna cauda among small bowls or ramekins. Serve artichokes with warm bagna cauda."
    ],
    "ingredients": [
        "3 heads of garlic, cloves separated, papery skin removed (but cloves left unpeeled)",
        "3 tablespoons butter",
        "1 2-ounce tin anchovy fillets, drained, anchovies chopped",
        "1/2 cup extra-virgin olive oil",
        "6 large artichokes, stems trimmed, top 3/4 inch removed, tips of remaining leaves trimmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Appetizer",
        "High Fiber",
        "Dinner",
        "Artichoke",
        "Spring",
        "Party",
        "Simmer",
        "Boil",
        "Anchovy",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Artichokes with Bagna Cauda",
    "url": "http://www.epicurious.com/recipes/food/views/artichokes-with-bagna-cauda-358232"
}
