{
    "directions": [
        "Cut off and discard the stems of the artichokes with a serrated knife and rub the artichoke bottoms with some of the lemon juice. To a kettle of boiling salted water add the remaining lemon juice and the artichokes, boil the artichokes for 15 to 20 minutes, or until the bottoms are tender when pierced with a knife, and plunge them into a bowl of ice and cold water to stop the cooking. Drain the artichokes well, pull off the leaves, reserving 36 tender ones, and scrape out the chokes from the bottoms. Trim the artichoke bottoms and cut them into julienne strips.",
        "In a small bowl whisk together the oil, the vinegar, the garlic paste, the pimiento, and pepper to taste, add the artichoke strips, and toss the mixture well. The artichoke mixture and leaves may be prepared 1 day in advance and kept covered and chilled. Divide the artichoke mixture among 6 salad plates with a slotted spoon, arrange the reserved leaves around it, and spoon the dressing remaining in the bowl onto the leaves. Sprinkle the artichokes with the parsley."
    ],
    "ingredients": [
        "6 artichokes (about 1/2 pound each)",
        "1/4 cup fresh lemon juice",
        "6 tablespoons extra-virgin olive oil",
        "3 tablespoons white-wine vinegar",
        "1 large garlic clove, minced and mashed to a paste with 1/2 teaspoon salt",
        "3 tablespoons finely chopped drained bottled pimiento",
        "2 tablespoons minced fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Vegetable",
        "Appetizer",
        "Side",
        "Vegetarian",
        "Artichoke",
        "Bell Pepper",
        "Spring",
        "Vegan",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Artichokes with Garlic Pimiento Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/artichokes-with-garlic-pimiento-vinaigrette-11776"
}
