{
    "directions": [
        "Squeeze juice from lemon halves into large bowl of cold water; add squeezed lemons. Cut off stem and top 3/4 inch of 1 artichoke and discard. Using scissors, trim sharp tips from leaves. Place artichoke in lemon water until ready to cook. Repeat with remaining artichokes. Drain artichokes and cook in large pot of boiling salted water until base of each is tender when pierced with knife and leaves pull away easily, about 25 minutes. Drain artichokes well. (Can be prepared 8 hours ahead. Cover and refrigerate. Steam artichokes 10 minutes to rewarm before continuing.)",
        "Mix extra-virgin olive oil, grated pecorino Romano cheese, 1 1/2 teaspoons black pepper and 3/4 teaspoon salt in small bowl to blend. Gently press artichoke leaves outward from center to open artichokes slightly. Pull out small purple-tipped leaves, then scoop out fibrous choke. Place 1 artichoke on each of 4 plates. Sprinkle artichoke cavities with salt and pepper. Drizzle 1 tablespoon cheese dressing over each artichoke. Divide remaining cheese dressing equally among 4 small ramekins; serve dressing with artichokes."
    ],
    "ingredients": [
        "2 lemons, halved",
        "4 artichokes (about 10 ounces each)",
        "3/4 cup extra-virgin olive oil",
        "3/4 cup grated pecorino Romano cheese",
        "1 1/2 teaspoons cracked black pepper",
        "3/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Vegetable",
        "Appetizer",
        "Steam",
        "Artichoke",
        "Spring",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Artichokes with Romano, Cracked Pepper and Olive",
    "url": "http://www.epicurious.com/recipes/food/views/artichokes-with-romano-cracked-pepper-and-olive-103218"
}
