{
    "directions": [
        "Melt butter in large skillet over medium-high heat. Add mushrooms and garlic; sauté until mushrooms release juices and begin to brown, about 7 minutes. Add artichokes and vermouth. Cook until liquid is absorbed, stirring occasionally, about 10 minutes. Season with salt and pepper.",
        "Melt butter in heavy medium saucepan over medium-high heat. Add flour; stir 1 minute. Gradually whisk in milk. Reduce heat to medium and simmer until sauce thickens and lightly coats spoon, stirring occasionally, about 20 minutes. Stir in 1 1/2 cups Parmesan. Season to taste with salt, pepper, and ground nutmeg.",
        "Spread 2/3 cup béchamel sauce over bottom of 13x9x2-inch glass baking dish. Top with enough noodles to cover bottom of dish. Spread 1/4 of artichoke mixture over. Spoon 2/3 cup béchamel sauce over. Top béchamel with 1/4 of mozzarella.",
        "Sprinkle with 3 tablespoons Parmesan. Top with enough noodles to cover. Repeat layering 3 more times, finishing with a layer of noodles, then remaining béchamel. Sprinkle with remaining Parmesan. (Can be prepared 1 day ahead. Cover with foil and refrigerate.)",
        "Preheat oven to 350°F. Bake lasagna covered with foil 1 hour (or 1 hour 15 minutes if chilled). Remove foil. Increase temperature to 450°F. Bake lasagna until golden on top, about 10 minutes longer."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter",
        "1 pound mushrooms, sliced",
        "3 garlic cloves, minced",
        "2 8-ounce packages frozen artichoke hearts, thawed, coarsely chopped",
        "1 cup dry vermouth",
        "4 1/2 tablespoons butter",
        "4 1/2 tablespoons all purpose flour",
        "4 1/2 cups whole milk",
        "2 1/2 cups freshly grated Parmesan cheese (about 7 1/2 ounces)",
        "Ground nutmeg",
        "1 9-ounce package oven-ready (no-boil) lasagna noodles",
        "1 pound whole-milk mozzarella cheese, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Mushroom",
        "Pasta",
        "Bake",
        "Christmas",
        "Vegetarian",
        "Back to School",
        "Dinner",
        "Mozzarella",
        "Parmesan",
        "Artichoke",
        "Fall",
        "Spring",
        "Winter",
        "Noodle",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Artichoke and Mushroom Lasagna",
    "url": "http://www.epicurious.com/recipes/food/views/artichoke-and-mushroom-lasagna-106207"
}
