{
    "directions": [
        "Working with 1 artichoke at a time, cut off top inch of artichoke and gently pull open center. Scoop out sharp leaves and fuzzy choke from center with a melon-ball cutter or a spoon. Trim bottom 1/4 inch of stem (if present), keeping stem attached, and peel stem. Put artichoke in a large bowl of cold water. Repeat with remaining artichokes.",
        "Remove artichokes from water and push 3 parsley sprigs into center of each. Heat 1/4 cup olive oil in pot over moderate heat until hot but not smoking, then add artichokes, thyme sprigs, garlic, 1/4 cup water, pepper, and 1/2 teaspoon salt. Cover pot and braise artichokes, turning occasionally, until artichokes are browned in spots and bases are tender when pierced with a knife, about 35 minutes.",
        "Transfer artichokes, thyme, and garlic to a platter. Add remaining 3/4 cup water to pot and deglaze by boiling over high heat, stirring and scraping up brown bits, 1 minute. Pour pan juices (they will be dark) into a small bowl and stir in extra-virgin olive oil and remaining 1/2 teaspoon salt. Squeeze pulp from 2 of garlic cloves into juices and mash into sauce with a fork.",
        "Divide artichokes and remaining garlic cloves among 6 plates and drizzle with sauce. Garlic cloves can be peeled and spread on crusty bread."
    ],
    "ingredients": [
        "6 medium artichokes (1/2 lb each)",
        "18 fresh flat-leaf parsley sprigs",
        "1/4 cup olive oil",
        "8 fresh thyme sprigs",
        "1 head of garlic, cloves separated and left unpeeled",
        "1 cup water",
        "1/4 teaspoon black pepper",
        "1 teaspoon salt",
        "1 tablespoon extra-virgin olive oil",
        "Special equipment: a 6- to 8-qt heavy pot wide enough to hold artichokes in a single layer (about 11 inches in diameter)",
        "Accompaniment: crusty bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Vegetable",
        "Side",
        "Braise",
        "Vegetarian",
        "Quick & Easy",
        "Low/No Sugar",
        "Artichoke",
        "Spring",
        "Vegan",
        "Thyme",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Artichokes Braised with Garlic and Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/artichokes-braised-with-garlic-and-thyme-231804"
}
