{
    "directions": [
        "Heat 2 tablespoons of the olive oil in a medium saucepan over high heat. Add the artichoke hearts and reduce the heat to medium high. Cook, stirring occasionally, for about 10 minutes, or until the hearts are beginning to brown. Remove to a plate and set aside.",
        "To the same pan, add the remaining 2 tablespoons olive oil, the butter and the shallots and cook for 1 minute, stirring regularly. Add the rice and salt and stir with a wooden spoon to coat all the kernels with oil. Continue to cook for 3 minutes, or until the rice is sizzling. Add the wine and cook, stirring, until it is almost completely absorbed. Now begin adding the chicken broth, one cup at a time, stirring frequently between additions. After the first cup is almost entirely absorbed, add the next cup. Continue in this way until the rice is cooked through and you have a creamy risotto, about 20 minutes in all. (The risotto should be slightly loose, not dry; it should run off your spoon. If it gets too dry, add a bit more broth.) Stir in the peas, feta, chives, mint and black pepper. Gently stir in the artichoke hearts and the lemon juice. Serve."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil",
        "One 9-ounce package frozen artichoke hearts, cut into bite-size wedges",
        "1 tablespoon unsalted butter",
        "1 large or 2 small shallots, minced",
        "1 cup Arborio rice",
        "1 teaspoon salt",
        "1 cup dry white wine, room temperature",
        "3 1/2 cups low-sodium chicken broth, warmed",
        "1/2 cup frozen peas, thawed",
        "1/2 cup crumbled feta cheese (3 ounces)",
        "1/4 cup finely chopped chives",
        "1/4 cup chopped fresh mint",
        "1/4 teaspoon freshly ground black pepper",
        "1 tablespoon fresh lemon juice (from 1/2 small lemon)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Risotto Recipes",
        "Artichoke",
        "Vegetable",
        "Rice Recipes"
    ],
    "title": "Artichoke Risotto",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/artichoke-risotto"
}
