{
    "directions": [
        "Heat olive oil in heavy medium skillet over medium heat. Add chopped garlic and fennel seeds and sauté 3 minutes. Add artichoke hearts and chopped fennel and stir 1 minute. Add vegetable broth and bring mixture to boil. Cover skillet and cook until vegetables are very tender, about 12 minutes. Uncover and simmer until pan juices have evaporated completely, stirring occasionally, about 10 minutes. Scrape filling into processor and cool. Add fennel fronds and process to coarse puree. Season to taste with salt and pepper. Add yolk and blend.",
        "Line baking sheet with plastic wrap. If using wonton wrappers, trim edges to form rounds. Brush entire surface of 1 wrapper lightly with egg white. Place 1 rounded teaspoon filling in center. Fold dough over, forming semi-circle. Seal edges, pressing out any air around filling. Place on prepared sheet. Repeat with remaining filling and wrappers. (Ravioli can be prepared ahead. Cover loosely with towel and plastic wrap and refrigerate up to 8 hours, or cover with plastic and freeze 3 days. Do not thaw frozen ravioli before cooking.)",
        "Heat oil in heavy large saucepan over medium-low heat. Add garlic, fennel and fennel seeds and sauté until tender, about 12 minutes. Add tomatoes with their juices and next 4 ingredients. Simmer until sauce thickens, breaking up tomatoes with back of spoon, about 25 minutes. Season with salt and pepper. (Can be made 2 days ahead. Cover; chill. Rewarm before using.)",
        "Boil ravioli in large pot of boiling salted water until tender, about 5 minutes. Drain well. Spoon some sauce on each plate. Arrange ravioli atop sauce. Garnish with fresh fennel fronds."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "5 large garlic cloves, chopped",
        "1/4 teaspoon fennel seeds",
        "1 9-ounce package frozen artichoke hearts, unthawed",
        "1/2 cup chopped fresh fennel",
        "1/2 cup canned vegetable broth or water",
        "2 tablespoons minced fresh fennel fronds",
        "1 egg yolk",
        "32 to 36 gyoza (round) wrappers or wonton wrappers",
        "1 egg white",
        "1/4 cup olive oil",
        "4 garlic cloves, chopped",
        "1 cup chopped fresh fennel",
        "1 1/4 teaspoons fennel seeds",
        "1 28-ounce can Italian tomatoes",
        "2 tablespoons tomato paste",
        "1 teaspoon dried oregano",
        "1/4 teaspoon dried crushed red pepper",
        "1/8 teaspoon ground cloves",
        "Fresh fennel fronds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "Pasta",
        "Tomato",
        "Vegetable",
        "Hanukkah",
        "Vegetarian",
        "Artichoke",
        "Fennel",
        "Spring",
        "Healthy"
    ],
    "title": "Artichoke and Fennel Ravioli with Tomato-Fennel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/artichoke-and-fennel-ravioli-with-tomato-fennel-sauce-2892"
}
