{
    "directions": [
        "Add lemon halves to a large bowl of cold water, squeezing to release juice.",
        "Cut off top inch of 1 artichoke and bend back outer leaves until they snap off close to base (keep stem attached). Discard several more layers in same manner until you reach pale yellow leaves.",
        "Cut remaining leaves flush with top of artichoke bottom using a sharp knife. Trim dark green fibrous parts from base and sides of artichoke.",
        "Peel sides of stem down to pale inner core. Put in lemon water while preparing remaining artichokes.",
        "Cook shallots, carrot, garlic, and seeds in 1/4 cup oil in a 4-to 5-quart heavy pot (pot should be wide enough to hold artichokes in 1 layer with stems pointing upward) over medium heat, stirring occasionally, 3 minutes. Add water, zest, and 3 tablespoons lemon juice and bring to a simmer. Stand artichokes in pot and season with 1 teaspoon salt and 1/4 teaspoon pepper. Cover artichokes with wax paper, then a lid, and simmer over medium-low heat until bases are just tender when pierced with a knife, 20 to 30 minutes.",
        "Transfer artichokes to a dish and reserve cooking liquid. When artichokes are cool enough to handle, halve lengthwise. Scoop out and discard inner choke (fuzzy center and any sharp leaves).",
        "Heat 2 tablespoons oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then brown cut sides of artichokes in 2 batches, about 2 minutes per batch, transferring to a serving dish. Add reserved cooking liquid to skillet along with remaining tablespoon lemon juice and remaining 2 tablespoons oil. Boil vigorously 3 minutes, then stir in parsley and pour over artichokes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 lemon, halved",
        "8 medium artichokes",
        "3 small shallots, sliced into thin rings",
        "1 carrot, finely chopped",
        "3 garlic cloves, thinly sliced",
        "1/4 teaspoon fennel seeds",
        "1/4 teaspoon coriander seeds",
        "1/2 cup extra-virgin olive oil, divided",
        "1 1/2 cups water",
        "3 strips lemon zest",
        "1/4 cup fresh lemon juice, divided",
        "2 tablespoons coarsely chopped flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Braise",
        "Dinner",
        "Lemon",
        "Artichoke",
        "Fall",
        "Potluck",
        "Gourmet",
        "Sugar Conscious",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Artichokes Braised in Lemon and Olive Oil",
    "url": "http://www.epicurious.com/recipes/food/views/artichokes-braised-in-lemon-and-olive-oil-350606"
}
