{
    "directions": [
        "Preheat oven to 425°F. Brush 13x9x2-inch glass baking dish with 1 tablespoon oil. To trim artichoke, add the juice from half a lemon to a large bowl of cold water. Cut off the artichoke's stem; rub cut surface with the other lemon half. Peel off all the leaves. Cut off top one inch of artichoke. Using a spoon with a serrated edge, scrape out the fibrous choke from the center. Rub the artichoke all over with lemon and drop it into lemon water. Drain before using.",
        "Slice artichoke hearts. Arrange half of potatoes in dish, covering bottom completely. Top with half of artichoke hearts and half of mushrooms. Coarsely crumble half of goat cheese over. Sprinkle with half of garlic, salt, and pepper, then 1 tablespoon Parmesan. Drizzle with 1 tablespoon oil. Cover with remaining mushrooms, then artichokes, goat cheese, garlic, 1 tablespoon Parmesan, and 1 tablespoon oil. Top with remaining potatoes. Pour wine over; drizzle with remaining 1 tablespoon oil. Cover dish with foil. Bake 40 minutes. Reduce oven temperature to 400°F. Sprinkle top with remaining 1 tablespoon Parmesan. Bake uncovered until potatoes are tender and top is brown, about 25 minutes. Cool slightly and serve."
    ],
    "ingredients": [
        "4 tablespoons extra-virgin olive oil",
        "4 large artichokes",
        "2 pounds Yukon Gold potatoes, thinly sliced",
        "4 large portobello mushroom caps, thinly sliced",
        "6 ounces soft fresh goat cheese",
        "3 garlic cloves, minced",
        "3 tablespoons freshly grated Parmesan cheese",
        "1/2 cup dry white wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Potato",
        "Side",
        "Bake",
        "Vegetarian",
        "High Fiber",
        "Casserole/Gratin",
        "Goat Cheese",
        "Artichoke",
        "White Wine",
        "Spring",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Artichoke, Potato, and Portobello Mushroom Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/artichoke-potato-and-portobello-mushroom-casserole-234430"
}
