{
    "directions": [
        "1. Preheat all grates of a well-oiled charcoal or gas grill to high.",
        "2. Combine all of the butter ingredients together and set aside.",
        "3. Cut off the thorny ends of the artichokes with scissors and then cut the artichokes lengthwise in half. Rub the cut sides of the artichokes with a lemon half and place, cut side down, on a sheet pan. Add enough lightly salted water, 2 to 3 cups, to come 1/4 inch up the sides of the artichokes.",
        "Place the pan with the artichokes directly on the grate, reduce the heat to medium-high if you can (those cooking on coals won't be able to, and must monitor the water level especially closely), close the lid, and cook, adding water as needed to maintain the level at 1/4 inch. Cook until tender when pierced with a paring knife, about 30 minutes.",
        "4. Carefully remove the pan from the grill. Using a spoon, scoop the fuzzy choke from each of the halves. Transfer the cleaned halves to a new sheet pan.",
        "Using your hands or a brush, evenly, but lightly, coat both sides of the artichokes with canola oil.",
        "5. Place the artichokes, cut side down, on the grate andn grill until well marked and lightly charred, 2 to 3 minutes. Flip and repeat on the second side, grilling for 2 to 3 minutes.",
        "While still cut side up, place about 1/2 tablespoon of butter in each of the cavities and allow it to melt.",
        "Squeeze lemon juice over the top and sprinkle with parsley and fleur de sel.",
        "6. Remove theth artichokes from the grill and arrange on a serving platter."
    ],
    "ingredients": [
        "8 tablespoons (4 ounces) unsalted butter, softened",
        "4 salted anchovy fillets, rinsed, and finely chopped",
        "2 garlic cloves, peeled, halved, germ removed, and grated on a Microplane grater",
        "1 teaspoon kosher salt",
        "1 teaspoon finely ground fresh black pepper",
        "1 tablespoon freshly squeezed lemon juice",
        "8 medium globe artichokes, 10 to 12 ounces each",
        "3 to 4 lemons, halved and seeds removed",
        "Kosher salt, for salting the water",
        "About 1/4 cup canola or vegetable oil",
        "About 1/4 cup coarsely chopped flat-leaf parsley",
        "Fleur de sel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Vegetable",
        "Side",
        "Fourth of July",
        "Picnic",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Seafood",
        "Artichoke",
        "Fall",
        "Spring",
        "Summer",
        "Tailgating",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Simmer",
        "Butter",
        "Anchovy",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Artichokes Basted with Anchovy Butter",
    "url": "http://www.epicurious.com/recipes/food/views/artichokes-basted-with-anchovy-butter-352969"
}
