{
    "directions": [
        "Squeeze juice from 2 lemon halves into large bowl; add lemon halves. Fill bowl with water. Cut stem off 1 artichoke. Starting at base, bend leaves back and snap off where they break naturally; continue until all tough outer leaves have been removed, leaving cone of tender pale green leaves. Using small sharp knife, trim outside edge of base until smooth and no dark green areas remain. Rub trimmed edge with 1 of remaining lemon halves. Cut artichoke lengthwise into quarters. Rub cut sides of quarters with lemon. Using small knife, cut out choke and small purple-tipped leaves from 1 quarter. Rub cut areas with lemon. Trim top leaves, leaving artichoke quarter about 2 inches long. Cut quarter into 2 wedges. Place wedges into lemon water. Repeat with remaining artichokes.",
        "Bring remaining ingredients to boil in heavy large pot (do not use aluminum or cast iron). Drain artichokes; add to pot. Return to boil. Reduce heat to medium-low; simmer until artichokes are tender, about 20 minutes. Using slotted spoon, transfer artichokes to medium bowl. Reserve 1 cup cooking liquid in small bowl.",
        "Place potatoes, salt, bay leaf, 1/2 teaspoon mustard seeds and celery seeds in large saucepan. Pour in enough cold water to cover potatoes generously. Boil until potatoes are tender, about 20 minutes. Drain. Cool 15 minutes; peel.",
        "Stir saffron in heavy large in heavy large pot over medium-low heat until fragrant, about 2 minutes. Add reserved 1 cup cooking liquid; bring to simmer. Add artichokes, potatoes, mussels, shallots, butter and 3/4 teaspoon mustard seeds. Bring to boil. Cover pot; cook until mussels open and potatoes are golden, about 8 minutes. (Discard any unopened mussels.) Mix in green onions. Season with salt and pepper.",
        "Divide stew among 6 shallow soup bowls. Sprinkle with chives and serve."
    ],
    "ingredients": [
        "2 large lemons, halved",
        "5 medium artichokes",
        "10 cups canned low-salt chicken broth",
        "2 tablespoons extra-virgin olive oil",
        "1 bay leaf",
        "12 small red-skinned potatoes",
        "1 tablespoon salt",
        "1 bay leaf",
        "1 1/4 teaspoons mustard seeds",
        "1/2 teaspoon celery seeds",
        "1/4 teaspoon (packed) stem saffron",
        "18 mussels, scrubbed, debearded",
        "3/4 cup chopped shallots",
        "5 tablespoons unsalted butter",
        "2 green onions, finely chopped",
        "1 bunch chives, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Potato",
        "Shellfish",
        "Vegetable",
        "Stew",
        "Seafood",
        "Mussel",
        "Spice",
        "Saffron",
        "Spring",
        "Summer"
    ],
    "title": "Artichoke Stew with Mussels, Potatoes and Saffron",
    "url": "http://www.epicurious.com/recipes/food/views/artichoke-stew-with-mussels-potatoes-and-saffron-103003"
}
