{
    "directions": [
        "Blend together all dough ingredients in processor until mixture just begins to form a ball. Knead dough on a lightly floured surface, incorporating only as much additional flour as necessary to keep dough from sticking, until smooth and elastic, 6 to 8 minutes. Wrap dough in plastic wrap and let stand at room temperature 1 hour (to make rolling easier).",
        "Whisk together flours in a bowl, then mound flour mixture on a work surface, preferably wooden, and make a well in center. Add yolks, oil, salt, and water to well. With a fork, gently beat yolks, oil, and water until combined. Gradually stir in enough flour to form a paste, pulling in flour closest to egg mixture and being careful not to make an opening in outer wall of well. Knead remaining flour into mixture with your hands to form a dough (it will be soft and sticky). Knead dough until smooth and elastic, 8 to 10 minutes. Cover with an inverted bowl and let stand 1 hour (to make rolling easier).",
        "Heat butter in a 12-inch heavy skillet over moderate heat until foam subsides, then add garlic, salt, and pepper and cook, stirring occasionally, until garlic begins to turn golden, 1 to 2 minutes. Add arugula and zest and cook, turning with tongs, until arugula is wilted, 2 to 4 minutes. Transfer arugula mixture to a fine-mesh sieve and press with back of a wooden spoon to extract excess liquid, then finely chop.",
        "Stir together arugula mixture and cheeses in a bowl.",
        "Cut dough into 8 equal pieces. Cover 7 pieces with plastic wrap and pat out remaining piece into a flat rectangle. Generously dust with flour.",
        "Set rollers of pasta maker on widest setting. Feed rectangle, a short side first, through rollers. Fold rectangle in thirds, like a letter, and feed it, a short side first, through rollers. Repeat 6 or 7 more times, folding dough in thirds and feeding it through rollers, a short side first each time, dusting with flour to prevent sticking. Turn dial to next (narrower) setting and feed dough through rollers without folding, a short side first. Continue to feed dough through without folding, making space between rollers narrower each time, until the second to narrowest setting is used. (Do not roll too thin or pasta will tear when filled.)",
        "Put sheet of dough on a lightly floured kitchen towel (not terry cloth) with a long side nearest you. Drop 5 or 6 rounded teaspoon-size mounds of filling 1 1/2 inches apart in a row down center of right half of sheet, then lift left half of sheet and drape over mounds. Press down firmly but gently around each mound, forcing out air. (Air pockets increase the chance that ravioli will break during cooking.) Cut pasta (between mounds) with a sharp knife into roughly 2 1/2-inch squares. Line a large shallow baking pan with a clean dry kitchen towel (not terry cloth), then arrange ravioli in 1 layer in it. Make more ravioli with remaining pieces of dough and remaining filling in same manner, transferring to lined pan.",
        "Heat butter in cleaned 12-inch heavy skillet over moderate heat until foam subsides, then cook pine nuts, stirring frequently, until pale golden, about 4 minutes. Add garlic, pepper, and salt and cook, stirring frequently, until garlic begins to turn golden, about 2 minutes. Add lemon juice and oil, swirling skillet to combine, and remove from heat. (Leave sauce in skillet.)",
        "Bring a 6- to 8-quart pot of salted water to a boil over high heat, then reduce heat to a gentle boil. While water is heating, reheat sauce over low heat if necessary.",
        "Add half of ravioli to gently boiling water, carefully stirring to separate, and cook, adjusting heat to keep at a gentle boil, until pasta is just tender, 2 to 3 minutes. Lift cooked ravioli with a slotted spoon, draining well over pot, then transfer to skillet with sauce and gently swirl skillet to coat pasta. Transfer ravioli to a platter with half of sauce and sprinkle evenly with half of chopped fresh arugula. Repeat with remaining pasta, sauce, and arugula."
    ],
    "ingredients": [
        "2 cups cake flour (not self-rising)",
        "1/2 cup all-purpose flour plus additional for kneading",
        "4 large egg yolks",
        "3 tablespoons extra-virgin olive oil",
        "1 teaspoon salt",
        "1/2 cup water",
        "2 tablespoons unsalted butter",
        "1 1/2 teaspoons finely chopped garlic",
        "3/4 teaspoon salt",
        "3/4 teaspoon black pepper",
        "1 lb arugula, trimmed",
        "1 teaspoon finely grated fresh lemon zest",
        "1/2 cup soft mild goat cheese (4 1/2 oz)",
        "1/2 cup ricotta (preferably fresh; 4 1/2 oz)",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/3 cup pine nuts (1 1/2 oz)",
        "1 tablespoon finely chopped garlic",
        "1/2 teaspoon black pepper",
        "1/4 teaspoon salt",
        "2 teaspoons fresh lemon juice",
        "1/4 cup extra-virgin olive oil",
        "1/2 cup chopped arugula",
        "Special equipment: a pasta maker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta Maker",
        "Cheese",
        "Citrus",
        "Dairy",
        "Egg",
        "Garlic",
        "Leafy Green",
        "Pasta",
        "Appetizer",
        "Gourmet",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Arugula and Goat Cheese Ravioli",
    "url": "http://www.epicurious.com/recipes/food/views/arugula-and-goat-cheese-ravioli-237194"
}
