{
    "directions": [
        "Preheat oven to 250°F. Line rimmed baking sheet with parchment. Arrange grapes in single layer on baking sheet. Drizzle with 3 teaspoons olive oil; toss to coat. Place shallots on sheet of heavy-duty foil; drizzle with 1 teaspoon oil. Enclose in foil; place in small baking dish. Bake until shallots are very soft, about 1 1/2 hours, and grapes are shriveled and lightly caramelized, about 2 1/2 hours. Cool. Do ahead: Can be made 2 days ahead. Cover separately; chill. Bring to room temperature before using.",
        "Combine shallots and accumulated juices, vinegar, and honey in blender and puree. Season with salt and pepper.",
        "With blender running, gradually blend in remaining 3/4 cup oil. Do ahead: Can be made 1 day ahead. Cover; chill. Bring to room temperature before serving.",
        "Toss arugula in large bowl with enough dressing to coat. Divide among plates. Top with pears and grapes. Sprinkle with cracked pepper and serve."
    ],
    "ingredients": [
        "1 1/2 pounds seedless red grapes, stemmed",
        "4 teaspoons plus 3/4 cup extra-virgin olive oil",
        "4 shallots (about 4 ounces), peeled",
        "1/4 cup Sherry wine vinegar",
        "2 tablespoons honey",
        "12 ounces arugula (about 16 cups), tough stems removed",
        "3 ripe pears, quartered, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Blender",
        "Fruit",
        "Leafy Green",
        "Onion",
        "Side",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Pear",
        "Arugula",
        "Fall",
        "Healthy",
        "Grape",
        "Shallot",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Arugula Salad with Pears, Oven-Dried Grapes, and Roasted-Shallot Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/arugula-salad-with-pears-oven-dried-grapes-and-roasted-shallot-vinaigrette-236246"
}
