{
    "directions": [
        "Line an 11- by 7-inch baking pan with foil, leaving a slight overhang on all sides.",
        "In a heavy saucepan bring water with salt to a boil and add polenta in a thin stream, whisking. Cook polenta over low heat (it should be barely boiling), stirring constantly, until very thick, about 10 minutes. Spread polenta evenly in pan.",
        "Separately mince shallots and garlic and chop arugula. In a non-stick skillet cook shallots in oil over moderate heat, stirring occasionally, until softened, about 5 minutes. Add garlic, arugula, and salt to taste and cook, stirring, a few seconds, or until arugula is just wilted. Spread arugula mixture evenly over polenta and cool to room temperature. Chill polenta, covered, until firm, at least 2 hours, and up to 1 day.",
        "Preheat oven to 400°F.",
        "Sprinkle arugula topping evenly with Parmesan, pressing gently to make it adhere, and, using foil, transfer polenta to a cutting board. Cut polenta lengthwise into thirds and cut strips crosswise into 3/4-inch-wide canapés. Arrange canapés on a large baking sheet and bake in upper third of oven 10 minutes, or until just heated through. Change oven setting to broil and broil canapés 2 minutes, or until tops just begin to brown.",
        "Serve canapés warm or at room temperature."
    ],
    "ingredients": [
        "4 cups water",
        "1 1/4 teaspoons salt",
        "1 cup instant polenta",
        "2 large shallots",
        "1 large garlic clove",
        "3 cups arugula leaves",
        "1 teaspoon olive oil",
        "1/2 cup freshly grated Parmesan (about 1 1/2 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Leafy Green",
        "Vegetable",
        "Bake",
        "Cocktail Party",
        "Low Fat",
        "Vegetarian",
        "Winter",
        "Gourmet"
    ],
    "title": "Arugula- and Parmesan-Topped Polenta Canapes",
    "url": "http://www.epicurious.com/recipes/food/views/arugula-and-parmesan-topped-polenta-canapes-14560"
}
