{
    "directions": [
        "Heat oil in heavy large skillet over medium-high heat. Add onions. Sauté until golden, about 18 minutes. Remove from heat. Sprinkle with vinegar; stir to blend. Season with salt and pepper.",
        "Combine first 4 ingredients in another heavy large skillet. Bring to boil, whisking. Boil 1 minute. Add walnuts; stir. Toss until syrup forms glaze on nuts, about 3 minutes. Transfer nuts to sheet of foil and quickly separate nuts with forks. Cool. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Preheat oven to 350°F. Place bread cubes in large bowl. Drizzle with oil, tossing constantly to coat evenly. Scatter cubes in single layer on rimmed baking sheet. Sprinkle with salt and pepper. Bake croutons until crisp, stirring occasionally, about 15 minutes. DO AHEAD: Can be made 2 hours ahead. Let stand on sheet at room temperature.",
        "Whisk oil and vinegar in small bowl. Season dressing with salt and pepper.",
        "Place arugula in very large bowl. Drop in onions, tossing to distribute evenly. Add nuts, croutons, and goat cheese. Toss with enough dressing to coat lightly."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 1/4 pounds red onions, thinly sliced",
        "2 tablespoons balsamic vinegar",
        "1/3 cup (packed) golden brown sugar",
        "1/4 cup water",
        "2 tablespoons (1/4 stick) butter",
        "Large pinch of salt",
        "1 1/2 cups walnut halves",
        "4 cups 1/2-inch cubes crustless country bread",
        "3 tablespoons extra-virgin olive oil",
        "5 tablespoons extra-virgin olive oil",
        "3 tablespoons balsamic vinegar",
        "2 5-ounce packages baby arugula",
        "2 5-ounce packages soft goat cheese, broken into 1/2-inch pieces, chilled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Onion",
        "Appetizer",
        "Side",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Goat Cheese",
        "Walnut",
        "Arugula",
        "Healthy",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Arugula Salad with Caramelized Onions, Goat Cheese, and Candied Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/arugula-salad-with-caramelized-onions-goat-cheese-and-candied-walnuts-357496"
}
