{
    "directions": [
        "Arrange a rack in the center of the oven and preheat to 350°F. Line a baking sheet with parchment paper.",
        "In a medium bowl, combine the almonds, grapeseed oil, confectioners' sugar, and salt and stir to combine. Spread the mixture on the prepared baking sheet and bake until golden brown and aromatic, 12 to 15 minutes. Transfer to a cutting board to cool then coarsely chop. DO AHEAD: The smoked marzipan can be made in advance and stored, in an airtight container at room temperature, up to 5 days.",
        "Line a large plate with paper towels.",
        "In a large heavy skillet over moderately high heat, heat the oil until shimmering. Working in batches, fry the prosciutto, flipping occasionally, until golden brown and crispy, about 30 seconds per side. Transfer as done to the paper-towel-lined plate. DO AHEAD: The prosciutto can be made in advance and stored, in an airtight container at room temperature, up to 4 hours.",
        "In a medium bowl, beat the heavy cream until soft peaks form.",
        "In a second medium bowl, combine the ricotta and salt. Whisk about 1/3 of the whipped cream into the ricotta to lighten it. Gently fold the remaining 2/3 of the whipped cream into the mixture until fully incorporated but still light. DO AHEAD: The ricotta cream can be made in advance and refrigerated, covered, up to 1 hour.",
        "Preheat the broiler and line a baking sheet or broiler pan with aluminum foil.",
        "Trim the tops off each fig then cut them in half lengthwise. Gently open each fig half to expose its flesh and place, skin-side-down, on the prepared baking sheet or broiler pan. Sprinkle with sugar and broil, about 6 inches from the flame, until the sugar bubbles, about 90 seconds. Just before serving, sprinkle with fleur de sel.",
        "In a small bowl, whisk together the olive oil and lemon juice. Place the arugula in a large serving bowl or platter, drizzle with vinaigrette, and toss to coat. Season with salt and pepper then top with the smoked marzipan, crispy prosciutto, dollops of ricotta cream, and brûléed figs. Serve immediately."
    ],
    "ingredients": [
        "1 cup (about 4 ounces) smoked Marcona or smoked regular almonds",
        "3 tablespoons grapeseed oil",
        "2 tablespoons confectioners' sugar",
        "1 teaspoon kosher salt",
        "1/2 cup canola oil",
        "6 ounces thinly sliced prosciutto, trimmed of excess fat",
        "3/4 cup heavy cream, well chilled",
        "1 cup (about 9 ounces) fresh ricotta*",
        "1/4 teaspoon kosher salt",
        "16 fresh figs",
        "1/2 cup turbinado sugar**",
        "1 tablespoon fleur de sel",
        "1/2 cup extra-virgin olive oil",
        "Juice of 1 lemon",
        "10 cups baby arugula",
        "*If your fresh ricotta is very wet, you'll need to drain it before using. Line a colander with a double layer of cheesecloth and set it over a small bowl. Place the ricotta inside, cover with plastic wrap, and refrigerate overnight. Discard the drained liquid.",
        "**Turbinado sugar is raw sugar that has been steam-cleaned. The coarse crystals are blond in color with a delicate molasses flavor. Demerara sugar, light brown sugar, or raw sugar can be substituted.",
        "Special equipment: 2 large baking sheets; parchment paper; aluminum foil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Appetizer",
        "Christmas",
        "Lunch",
        "Ricotta",
        "Fig",
        "Almond",
        "Arugula",
        "Prosciutto",
        "Christmas Eve",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Arugula with Brûléed Figs, Ricotta, Prosciutto, and Smoked Marzipan",
    "url": "http://www.epicurious.com/recipes/food/views/arugula-with-bruleed-figs-ricotta-prosciutto-and-smoked-marzipan-368717"
}
