{
    "directions": [
        "Blend flour and salt in processor. Add butter and shortening. Using on/off turns, process until mixture resembles coarse meal. Mix in enough ice water to form moist clumps. Gather dough into ball; flatten into disk. Wrap in plastic and chill until dough is firm enough to roll out, about 30 minutes. Roll out dough on floured surface to 12-inch round. Transfer to 9-inch-diameter tart pan with removable bottom. Trim dough overhang to 1 inch. Fold overhang in and press, forming double-thick high-standing sides. Pierce crust all over with fork. Freeze crust 30 minutes. (Can be made 1 day ahead. Cover and keep frozen.)",
        "Position rack in center of oven and preheat to 400°F. Bake crust until golden brown, piercing with fork if crust bubbles, about 20 minutes. Transfer crust to rack. Reduce temperature to 375°F.",
        "Cook bacon in heavy medium skillet over medium-high heat until crisp, about 5 minutes. Using slotted spoon, transfer to paper towels and drain. Add shallots to same skillet and sauté until tender, about 2 minutes. Add arugula and sauté until just wilted, about 1 minute. Remove from heat. Add balsamic vinegar; toss to combine.",
        "Sprinkle arugula mixture, then bacon over crust. Whisk cream, eggs, salt and pepper in large bowl to blend. Stir in cheese. Pour mixture into crust.",
        "Bake quiche until filling is slightly puffed and golden, about 35 minutes. Let stand 10 minutes. Cut into wedges."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1/2 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "3 tablespoons chilled solid vegetable shortening, cut into small pieces",
        "4 tablespoons (about) ice water",
        "6 bacon slices, cut into 1/2-inch pieces",
        "1/2 cup chopped shallots",
        "8 ounces arugula, stems trimmed, leaves coarsely chopped (about 5 1/2 cups)",
        "2 teaspoons balsamic vinegar",
        "1 cup whipping cream",
        "3 large eggs",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "3/4 cup shredded Gruyère cheese (about 2 1/2 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Pork",
        "Breakfast",
        "Brunch",
        "Bacon",
        "Arugula",
        "Fall",
        "Shower",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Arugula and Bacon Quiche",
    "url": "http://www.epicurious.com/recipes/food/views/arugula-and-bacon-quiche-102151"
}
