{
    "directions": [
        "In blender, purée mango, yogurt, and vinegar until silky smooth, about 1 to 2 minutes. Stir in salt and pepper and set aside.",
        "Have ready a large bowl of ice and cold water. In medium saucepan over high heat, bring salted water to a boil. Add asparagus and boil, uncovered, until crisp-tender, about 3 minutes. Drain, then immediately plunge spears into ice water to stop cooking. Drain again and pat dry.",
        "In medium bowl, toss together spinach and arugula.",
        "In small bowl, toss mango and chives with olive oil.",
        "To plate, pour 1/4 cup mango dressing into center of each of 4 plates. Lay three asparagus spears side-by-side over each pool of dressing, then top each with 1/4 of salad greens. Sprinkle with mango-chive mixture, then top with prosciutto."
    ],
    "ingredients": [
        "1 large ripe mango, peeled, pitted, and roughly chopped (or 1 1/4 cups frozen mango cubes, thawed)",
        "4 teaspoons nonfat plain yogurt",
        "3 tablespoons rice wine vinegar",
        "1/4 teaspoon kosher salt",
        "1/8 teaspoon freshly ground black pepper",
        "12 medium asparagus spears, trimmed and lower half peeled",
        "3 cups (3 ounces) baby spinach leaves",
        "8 arugula leaves",
        "1/4 fresh mango, finely diced",
        "2 teaspoons fresh chives, sliced into 1/2-inch lengths",
        "1/2 teaspoon olive oil",
        "3 ounces prosciutto, sliced into thin ribbons*",
        "*To thinly slice the prosciutto, pile up the slices, roll them into a cigar, then thinly slice crosswise and peel apart the resulting ribbons."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Fruit",
        "Leafy Green",
        "Herb",
        "Pork",
        "Vegetable",
        "Side",
        "Yogurt",
        "Healthy",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Arugula and Spinach Salad with Prosciutto and Creamy Mango Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/arugula-and-spinach-salad-with-prosciutto-and-creamy-mango-dressing-238302"
}
