{
    "directions": [
        "In a 12-inch heavy skillet over medium-high heat, cook garlic in olive oil, stirring, until it begins to turn pale golden, then add arugula in batches, stirring and turning over with tongs until slightly wilted before adding each new batch, and continue sautéing until completely wilted, about 1 minute more. Season with salt, and transfer arugula filling to a large sieve set over a bowl to drain. Let cool.",
        "With a food processor running, add garlic cloves, one at a time, through feed tube, and finely chop. Add oregano, lemon zest, olive oil, 1 teaspoon salt, and 1/2 teaspoon pepper to processor, and pulse until paste is well blended.",
        "Pat the lamb dry. Arrange it, boned side up, on a work surface. Patch any holes with slices of meat from the edge, and season it with 3/4 teaspoon salt and 1/4 teaspoon pepper. Rub boned side with half of oregano paste, then top it evenly with all of the arugula mixture, leaving a 1-inch border around the edges.",
        "Beginning with a short side, roll up lamb, enclosing arugula (the rolled roast will appear messy and ungainly, but once it's roasted, it will look delicious). Snugly tie roast closed, crosswise at 1-inch intervals and around the length, with kitchen string.",
        "Transfer lamb to a roasting pan and rub it all over with the remaining oregano paste. Let it stand for 1 hour at room temperature.",
        "Put oven rack in middle of oven and heat oven to 450°F.",
        "Roast lamb for 30 minutes.",
        "Cut each onion lengthwise into eighths, and halve potatoes or quarter if large. Toss onions, potatoes, and carrots with 2 tablespoons oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Scatter vegetables (not including asparagus) around lamb in the pan, then reduce oven temperature to 350°F, and roast lamb until an instant-read thermometer inserted into center of thickest part of roast registers 130°F for medium-rare meat (test temperature in several places), 40 to 50 minutes more. Transfer lamb to a platter and tent loosely with foil, then let it stand for 30 minutes.",
        "While lamb is standing, increase oven to 450°F, then stir vegetables in pan, and continue to roast until tender, 10 to 15 minutes.",
        "Toss asparagus with remaining 1/2 tablespoon oil and 1/8 teaspoon salt, and scatter among roasted vegetables, then continue to roast until asparagus is just tender, about 10 minutes.",
        "Transfer vegetables with a slotted spoon to a serving dish, and keep warm, loosely covered. Reserve roasting pan.",
        "Skim any fat from the pan drippings in roasting pan, and set roasting pan over 2 burners over medium-high heat. Add wine and deglaze the pan by boiling the liquid, scraping up the brown bits, for 1 minute. Strain the liquid through a fine-mesh sieve into a saucepan, then boil until reduced by half (to about 1/3 cup). Add chicken stock and any juices that have accumulated on the platter, and boil the sauce until reduced to about 2 cups. Reduce heat to a simmer.",
        "Stir the cornstarch mixture, then add it to simmering sauce; continue to simmer sauce, stirring, for 1 minute. Season sauce with salt and pepper and keep it warm.",
        "Discard the strings from the lamb, then carve lamb into thin slices on a cutting board and serve it with sauce and vegetables."
    ],
    "ingredients": [
        "3 large garlic cloves, thinly sliced lengthwise",
        "1 tablespoon olive oil",
        "10 ounces baby arugula or baby spinach",
        "Salt",
        "7 large garlic cloves",
        "3 tablespoons chopped fresh oregano",
        "1 tablespoon grated fresh lemon zest",
        "2 tablespoons olive oil",
        "Salt",
        "Freshly ground black pepper",
        "4 1/2- to 5-pound boneless leg of lamb, trimmed of fat on both sides and butterflied (from an 8-pound lamb leg on the bone; see Cooks' Notes:)",
        "2 medium red onions, peeled and root ends trimmed, but left intact",
        "1 1/2 pounds small (1 1/2- to 2-inch) red potatoes",
        "1 pound medium carrots, peeled and cut diagonally into 1-inch pieces",
        "2 1/2 tablespoons olive oil, divided",
        "Salt",
        "Freshly ground black pepper",
        "1 pound medium asparagus, ends trimmed and stalks cut diagonally into 1-inch pieces",
        "Pan drippings from lamb",
        "3/4 cup dry white wine",
        "2 cups chicken stock or reduced-sodium broth",
        "1 1/2 tablespoons cornstarch dissolved in 3 tablespoons cold water",
        "Salt",
        "Freshly ground black pepper",
        "Special equipment: Kitchen string; a heavy roasting pan; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Onion",
        "Potato",
        "Roast",
        "Easter",
        "Dinner",
        "Asparagus",
        "Arugula",
        "Carrot",
        "Spring",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Arugula-Stuffed Leg of Lamb with Roasted Spring Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/arugula-stuffed-leg-of-lamb-with-roasted-spring-vegetables-395393"
}
