{
    "directions": [
        "Tear off 4 (2-foot-long) sheets of heavy-duty foil and stack. Arrange batatas in 1 layer on top in center. Working with top sheet of foil, fold each side of foil over batatas to enclose, then turn package a quarter turn and fold over each side of second sheet of foil to enclose. Repeat folding with remaining 2 sheets of foil, turning package a quarter turn before each layer.",
        "Open vents on bottom of grill and remove top grill rack, leaving bottom rack in place. Light charcoal in chimney starter, then pour out onto bottom rack, using tongs to clear a space in center of rack just large enough for foil package. Put package in cleared space and arrange lit coals around package. (Do not put coals underneath or on top of package.)",
        "Roast batatas, turning package over every 10 minutes, checking and adding charcoal to keep a steady heat around package, until a sharp paring knife inserted halfway into a batata passes through easily but with slight resistance, 45 to 50 minutes.",
        "While batatas are roasting, stir together butter, lime juice, parsley, cumin, salt, and pepper in a small bowl with a fork until combined well. 3Unwrap batatas carefully. When cool enough to handle, peel and cut crosswise into 1/2-inch-thick slices. Season batatas with salt and pepper and serve with lime-cumin butter.",
        "Batatas can be roasted (instead of grilled), wrapped in 1 layer of foil, in middle of a preheated 400°F oven 1 1/4 to 1 1/2 hours."
    ],
    "ingredients": [
        "4 medium batatas (about 2 lb total), rinsed and dried",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 tablespoon fresh lime juice",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "2 teaspoons cumin seeds, toasted and cooled",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "Special equipment: 12-inch-wide heavy-duty foil; a chimney starter and a charcoal grill (or see cooks' note, below); long metal tongs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Roast",
        "Vegetarian",
        "Lime",
        "Sweet Potato/Yam",
        "Parsley",
        "Seed",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Ash-Roasted Batatas with Lime-Cumin Butter",
    "url": "http://www.epicurious.com/recipes/food/views/ash-roasted-batatas-with-lime-cumin-butter-234666"
}
