{
    "directions": [
        "1. Preheat the oven to 350°F (325°F if using a glass pan). Grease one 9-inch square pan,9-inch Bundt or tube pan, or 9-inch springform pan. Line with parchment or waxed paper, grease again, and dust with flour.",
        "2. To make the streusel: Combine the sugar, flour, cinnamon, salt, and nutmeg if using. Cut in the butter to resemble coarse crumbs. If desired, stir in the nuts.",
        "3. To make the batter: Sift together the flour, baking powder, baking soda, and salt. In a large bowl, beat the butter until smooth, about 1 minute. Gradually add the sugar and beat until light and fluffy, about 4 minutes. Beat in the egg yolks, one at a time. Blend in the sour cream, vanilla, and zest if using. Stir in the flour mixture.",
        "4. Spread half of the batter in the prepared pan. Sprinkle with half of the streusel. Carefully cover with the remaining batter and sprinkle with the remaining streusel.",
        "5. Bake unitl the cake is golden and pulls away from the sides of the pan, about 50 minutes. Set on a rack and let cool in the pan for at least 15 minutes. Serve warm or at room temperature. Wrap the kuchen in plastic and store at room temperature for up to 2 days or in the freezer for up to 3 months.",
        "6. To make the glaze if using: Combine all the glaze ingredients, stirring until smooth and of pouring consistency. Drizzle over the cake and let stand until set.",
        "When baking and storing a cake containing acidic ingredients such as sour cream in an aluminum pan, line the bottom with parchment paper to prevent the juices from reacting with the aluminum and creating a metallic flavor.",
        "Spread all the batter in a 13-by-9-inch pan, sprinkle with all of the topping, and bake for 30 to 35 minutes.",
        "After adding the middle layer of streusel, top with 1 cup peeled, cored, and thinkly sliced cooking apples, 1 cup peeled, pitted, and sliced peaches, or 1 cup pitted cherries, blueberries, blackberries, or raspberries.",
        "Combine 8 ounces softened cream chees, 1/4 cup sugar, 1 large egg, and 1 teaspoon vanilla extract. Spread over the top of the batter, leaving a 1-inch border on all sides. If desired, spread 1/2 cup melted blueberry, cherry, raspberry, or strawberry preserves or pie filling over the cheese mixture. Sprinkle with the streusel."
    ],
    "ingredients": [
        "1/2 cup granulated or brown sugar, or 1/4 cup each",
        "1/2 cup all-purpose flour",
        "3/4 teaspoon ground cinnamon",
        "1/8 teaspoon salt",
        "1/4 to 1/2 teaspoon ground nutmeg or cloves (optional)",
        "1/4 cup (1/2 stick) unsalted butter or margarine, softened",
        "1/2 cup coarsely chopped walnuts or pecans, grated coconut, golden raisins, or chocolate chips, or 1 cup any combination (optional)",
        "2 cups all-purpose flour",
        "1 teaspoon double-acting baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) unsalted butter or margarine, softened",
        "1 cup granulated or brown sugar or 1/2 cup each",
        "4 large egg yolks, or 3 large eggs",
        "1 cup (8 ounces) sour cream or plain yogurt",
        "1 1/2 teaspoons vanilla extract",
        "1 teaspoon finely grated lemon zest (optional)",
        "1 cup confectioners' sugar",
        "1/2 teaspoon vanilla or almond extract",
        "1 to 2 tablespoons milk or water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dairy",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "Hanukkah",
        "Sukkot",
        "Rosh Hashanah/Yom Kippur",
        "Fall",
        "Kosher",
        "Shavuot",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Ashkenazic Sour Cream Coffee Cake (Smeteneh Küchen)",
    "url": "http://www.epicurious.com/recipes/food/views/ashkenazic-sour-cream-coffee-cake-smeteneh-kuchen-103994"
}
