{
    "directions": [
        "Boil 1 cup apple cider in a small pot until reduced to 1/4 cup, about 10 minutes. Remove pot from heat and cool to room temperature.",
        "Beat white sugar and butter together with an electric mixer until creamy and smooth; add eggs, 1 at a time, beating well before each addition. Mix buttermilk and reduced apple cider into creamed butter mixture.",
        "Whisk flour, baking powder, baking soda, cinnamon, salt, and nutmeg together in a bowl. Slowly stir flour mixture into creamed butter mixture just until dough is combined.",
        "Turn dough onto a lightly floured piece of parchment paper. Sprinkle dough with flour and roll to 1/2-inch thickness, adding more flour if dough is sticky. Cut dough into doughnuts using a 3-inch-wide doughnut cutter and arrange on a baking sheet; refrigerate until chilled, 20 to 30 minutes.",
        "Heat at least 3 inches of oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Whisk confectioners' sugar and 2 tablespoons apple cider together in a bowl until glaze is smooth.",
        "Fry doughnuts in the hot oil, 2 to 3 at a time, until golden brown, 1 to 2 minutes per side; remove with a slotted spoon and drain on paper towels. Pour glaze over warm doughnuts."
    ],
    "ingredients": [
        "Doughnuts:",
        "1 cup apple cider",
        "1 cup white sugar",
        "1/4 cup butter, at room temperature",
        "2 eggs",
        "1/2 cup buttermilk",
        "3 1/2 cups all-purpose flour, or more as needed",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "1/8 teaspoon ground nutmeg",
        "2 cups vegetable oil for frying, or as needed",
        "Glaze:",
        "1 cup confectioners' sugar",
        "2 tablespoons apple cider"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ashley's Apple Cider Doughnuts",
    "url": "http://allrecipes.com/recipe/239019/ashleys-apple-cider-doughnuts/"
}
