{
    "directions": [
        "Combine 3/4 water, sugar, corn syrup, and pinch of salt in large saucepan. Bring to boil over medium heat, stirring until sugar dissolves. Add pear pieces and simmer until pears are very tender, stirring occasionally, 8 to 10 minutes. Cool slightly. Transfer mixture to processor and puree until smooth. Chill pear mixture until cold, about 2 hours.",
        "Process pear mixture in ice cream maker according to manufacturer's instructions. Transfer pear sorbet to freezer container; cover and freeze until firm. DO AHEAD: Can be made 3 days ahead. Keep frozen.",
        "Pour sake into 8x8x2-inch glass dish. Spoon 2 tablespoons water into heatproof custard cup or small bowl. Sprinkle gelatin over. Let stand until gelatin softens, about 10 minutes. Pour enough water into small skillet to come 1 inch up sides; bring to boil. Reduce heat to very low. Place cup with gelatin mixture in hot water in skillet. Stir until gelatin dissolves and mixture is fluid, about 1 minute. Remove cup with gelatin mixture from skillet. Pour gelatin mixture into sake and stir to blend well. Freeze sake mixture until firm, at least 8 hours or overnight.",
        "Combine 1 1/2 cups water and 1 1/2 cups sugar in medium saucepan. Bring to boil, stirring until sugar dissolves. Remove from heat. Cool simple syrup until just warm to touch, 20 to 30 minutes.",
        "Meanwhile, cut off peel and white pith from all grapefruit. Working over bowl to catch juices and using small sharp knife, cut between membranes to release segments into bowl. Quarter and core Asian pears, then cut lengthwise into very thin slices. Add to bowl with grapefruit.",
        "Pour warm simple syrup over fruit. Cover and refrigerate until well chilled, about 2 hours. DO AHEAD: Compote can be made 6 hours ahead. Keep chilled.",
        "Arrange 1 layer of pear slices in each of 6 cocktail glasses. Top each with 1 layer of grapefruit segments. Spoon 2 tablespoons syrup from fruit mixture over. Scrape fork all over sake granita to form crystals. Place large spoonful of granita atop fruit in each glass. Top each with 1 more layer of pear slices, then layer of grapefruit segments and scoop of pear sorbet. Garnish with fennel fronds, if desired, and serve."
    ],
    "ingredients": [
        "3/4 cup water",
        "3/4 cup sugar",
        "2 tablespoons light corn syrup",
        "Pinch of salt",
        "3 1/2 cups diced peeled ripe Anjou or Bartlett pears (about 3 large)",
        "1 1/3 cups coarsely filtered sake",
        "2 tablespoons water",
        "3/4 teaspoon unflavored gelatin",
        "1 1/2 cups water",
        "1 1/2 cups sugar",
        "4 ruby red grapefruits or white grapefruits",
        "2 large unpeeled Asian pears",
        "Fresh fennel fronds (optional; for garnish)",
        "Special equipment: Ice cream maker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Dessert",
        "Low Fat",
        "High Fiber",
        "Grapefruit",
        "Fennel",
        "Sake",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Asian Pear",
        "Fat Free",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Asian Pear and Grapefruit Salad with _Sake_ Granita and Pear Sorbet",
    "url": "http://www.epicurious.com/recipes/food/views/asian-pear-and-grapefruit-salad-with-em-sake-em-granita-and-pear-sorbet-354894"
}
