{
    "directions": [
        "Put the bulgur in a medium bowl and add the boiling water. Cover with plastic wrap and let stand until the bulgur is tender, 45 minutes to 1 hour.",
        "Meanwhile, in a medium bowl whisk the vinegar and sugar with a generous seasoning of salt and pepper until dissolved. Add the cucumber and onion, toss well and set aside to marinate for about 30 minutes.",
        "In a separate small bowl combine the yogurt and chili garlic sauce. Season with salt and pepper and set aside.",
        "Drain the bulgur and put into a large bowl. Add the turkey, hoisin, scallions, ginger, garlic and chopped cilantro and mix until just combined. Form into 4 equal sized patties.",
        "Heat a large nonstick skillet over medium heat until very hot. Lightly brush both sides of each patty with oil and place in the skillet. Cook, turning once, until just cooked through, 3 to 4 minutes per side.",
        "Drain the pickled vegetables and toss with the whole cilantro. Spread some spicy yogurt sauce on the top and bottom of each bun and top with a burger patty and some pickles."
    ],
    "ingredients": [
        "1/4 cup bulgur wheat",
        "1/2 cup boiling water",
        "1/4 cup rice wine vinegar",
        "1 teaspoon sugar",
        "Kosher salt and freshly ground black pepper",
        "1/4 seedless cucumber, sliced 1/8-inch thick, 1 cup",
        "1/4 small red onion, thinly sliced",
        "1/4 cup plain low-fat yogurt",
        "1 teaspoon chili garlic sauce",
        "12 ounces lean ground turkey",
        "2 tablespoons hoisin sauce",
        "2 scallions, chopped",
        "1 teaspoon grated ginger",
        "1 clove garlic, grated",
        "2 tablespoons chopped cilantro, plus 1/4 cup whole leaves",
        "2 teaspoons vegetable oil",
        "4 whole wheat hamburger rolls"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Turkey Burger",
        "Burger",
        "Poultry Recipes",
        "Turkey Recipes",
        "Healthy",
        "Asian"
    ],
    "title": "Asian Turkey Burgers",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/asian-turkey-burgers-recipe"
}
