{
    "directions": [
        "Combine 1 1/2 cups hot water and shiitake mushrooms in small bowl. Let stand until mushrooms soften, about 30 minutes. Remove mushrooms from water and squeeze excess liquid back into bowl. Cut out hard stems and discard. Thinly slice mushrooms.",
        "Pour mushroom soaking liquid into large saucepan, leaving any sediment in bottom of bowl. Add clam juice and 2 cups water. Bring to simmer. Reduce heat to very low and keep liquid hot.",
        "Heat oil in heavy large Dutch oven over medium-high heat. Add pancetta, ginger and half of green onions; stir until aromatic, about 2 minutes. Add mussels, cover and cook until mussels open, about 6 minutes. Using tongs, transfer mussels to large bowl (discard any that do not open). Cover bowl with foil.",
        "Add mushrooms and bok choy stems to Dutch oven; stir over medium-high heat 2 minutes. Add rice; stir 1 minute. Add vermouth; stir until absorbed, about 2 minutes. Add 1 cup hot liquid ; adjust heat so that rice simmers slowly. Cook until liquid is absorbed, stirring often, about 5 minutes. Continue cooking until rice is almost tender, adding 1 cup liquid every 5 minutes and stirring often, about 15 minutes longer.",
        "Mix bok choy leaves and snow peas into risotto and continue cooking until rice is just tender and mixture is creamy, adding liquid 1/2 cup at a time and stirring, often about 10 minutes longer . Mix in chopped cilantro and remaining green onions. Season with salt and pepper.",
        "Transfer risotto to large bowl. Arrange mussels around edge of bowl. Garnish with cilantro sprigs and serve."
    ],
    "ingredients": [
        "1 1/2 cups hot water",
        "1 ounce dried shiitake mushrooms",
        "3 cups bottled clam juice",
        "2 cups water",
        "1 tablespoon vegetable oil",
        "1/4 pound pancetta, chopped",
        "2 tablespoons minced peeled fresh ginger",
        "1 bunch green onions, chopped",
        "1 1/2 pounds mussels, scrubbed, debearded",
        "2 cups 1/4-inch-thick slices bok choy stems",
        "2 cups arborio or medium-grain rice",
        "1/2 cup dry vermouth",
        "2 cups chopped bok choy leaves",
        "1/2 pound snow peas, stringed, thinly sliced lengthwise",
        "1/4 cup chopped fresh cilantro",
        "Fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pork",
        "Rice",
        "Shellfish",
        "Bacon",
        "Mussel",
        "Healthy",
        "Bok Choy"
    ],
    "title": "Asian Risotto with Pancetta and Mussels",
    "url": "http://www.epicurious.com/recipes/food/views/asian-risotto-with-pancetta-and-mussels-1188"
}
