{
    "directions": [
        "Mix garlic, soy sauce, vinegar, sugar, sesame oil, ginger, and pepper flakes in a 2-cup Pyrex measuring cup. Whisk in mayonnaise until smooth, then in a slow steady stream, whisk in  oil to make an emulsified dressing; keep chilled until ready to toss with salad. Store in a clean jar with lid.",
        "Bring 1 gallon of water and 2 tablespoons of salt to boil in a large soup kettle. Add pasta and, using package times as a guide, boil, stirring frequently and adding broccoli the last 1 minute, until just tender. Drain thoroughly (do not rinse) and dump onto a large, lipped cookie sheet. Set aside while preparing remaining salad ingredients.",
        "Place all salad ingredients (except soy-ginger dressing) in a large bowl or transfer to a gallon-size zipper bag. (Can be covered and refrigerated several hours at this point). When ready to serve, add dressing; toss to coat and serve."
    ],
    "ingredients": [
        "Soy-Ginger Dressing:",
        "3 medium garlic cloves, minced",
        "6 tablespoons soy sauce",
        "1 tablespoon rice wine vinegar",
        "1 tablespoon sugar",
        "1 tablespoon sesame oil",
        "1 teaspoon ground ginger",
        "3/4 teaspoon hot red pepper flakes",
        "2 tablespoons mayonnaise",
        "1/4 cup vegetable oil",
        "Pasta Salad:",
        "2 tablespoons salt",
        "1 pound penne pasta",
        "8 ounces broccoli florets",
        "1 pound rare deli roast beef, sliced 1/8 inch thick and cut into bite-size strips",
        "3 medium carrots, peeled and coarsely grated",
        "1 medium red bell pepper, cut into bite-size strips",
        "2 cups bean sprouts",
        "3 green onions, thinly sliced",
        "1/2 cup chopped roasted (or honey-roasted) peanuts",
        "1/4 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Asian Pasta Salad with Beef, Broccoli and Bean Sprouts",
    "url": "http://allrecipes.com/recipe/106381/asian-pasta-salad-with-beef-broccoli/"
}
