{
    "directions": [
        "Bring all syrup ingredients to a boil in a 1-quart heavy saucepan, stirring until sugar is dissolved. Reduce heat and simmer until syrup is reduced to about 1/2 cup, about 15 minutes. Remove from heat and let steep, covered, 1 hour. Pour syrup through a sieve into a bowl, discarding solids.",
        "Heat a dry heavy 10-inch skillet over moderate heat until hot, then toast pumpkin seeds, stirring constantly, until puffed and beginning to pop, 3 to 5 minutes. Transfer seeds to a plate and season with salt.",
        "Halve, pit, and peel avocados, then thinly slice lengthwise. Gently toss slices with 2 tablespoons lemon juice and salt and pepper to taste, then gently toss with 1/4 cup syrup.",
        "Halve pears and core, then thinly slice lengthwise. Toss pear slices with remaining 2 tablespoons lemon juice and salt and pepper to taste. Stir in remaining 1/4 cup syrup.",
        "Drain pears, reserving syrup, and arrange slices on 4 plates. Transfer avocado slices to plates with a slotted spoon, discarding syrup. Toss greens with reserved syrup from pears and salt and pepper to taste. Mound greens next to avocado and pear slices and sprinkle with pumpkin seeds."
    ],
    "ingredients": [
        "2 cups water",
        "1/2 cup sugar",
        "1 (2-inch-long) piece cinnamon stick",
        "2 (1- by 1/4-inch) pieces fresh ginger, smashed",
        "2 teaspoons green or white cardamom pods, lightly crushed",
        "2 teaspoons coriander seeds, lightly crushed",
        "10 whole black peppercorns, lightly crushed",
        "1/4 teaspoon dried hot red pepper flakes",
        "1/4 cup raw green (hulled) pumpkin seeds (not roasted)",
        "2 firm-ripe California avocados (1 to 1 1/4 lb)",
        "1/4 cup fresh lemon juice",
        "2 Asian pears (1 lb total)",
        "4 oz mixed microgreens or baby greens (4 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fruit",
        "Leafy Green",
        "Appetizer",
        "Quick & Easy",
        "Pear",
        "Spice",
        "Avocado",
        "Summer",
        "Gourmet",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Asian Pear and Avocado Salad with Garam Masala Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/asian-pear-and-avocado-salad-with-garam-masala-syrup-231987"
}
