{
    "directions": [
        "In a large bowl stir together marinade ingredients and let stand 15 minutes.",
        "Add pork to marinade, tossing to coat completely. Marinate pork, covered and chilled, at least 2 hours, or overnight, turning pork at least once.",
        "Preheat oven to 200°F.",
        "Remove pork from marinade and cut into 1-inch-thick slices. In a bowl dredge pork in flour, shaking off excess. In a large heavy skillet heat 1 tablespoon butter and vegetable oil over moderately high heat until hot but not smoking and sauté pork 5 minutes on each side. Transfer pork to a heatproof dish and keep warm in middle of oven.",
        "To skillet add remaining tablespoon butter and sauté shallots, stirring, 1 minute. Add mushrooms and sauté, stirring, 5 minutes, or until liquid they give off is evaporated. Add brandy and cook mixture, stirring, until almost evaporated. Add water and preserves and cook, stirring, until combined well. Stir in cream. Add pork and simmer 5 minutes."
    ],
    "ingredients": [
        "1/4 cup fresh orange juice",
        "2 tablespoons oyster sauce",
        "2 tablespoons soy sauce",
        "1 1/2 tablespoons Asian sesame oil",
        "1 1/2 teaspoons five-spice powder*",
        "1/2 teaspoon dried thyme, crumbled",
        "3 garlic cloves, minced",
        "1 pound pork tenderloin, trimmed of any excess fat",
        "all-purpose flour for dredging pork",
        "2 tablespoons unsalted butter",
        "1 tablespoon vegetable oil",
        "2 large shallots, chopped fine",
        "1/4 pound shiitake mushrooms, stems discarded and caps sliced thin",
        "1/4 cup brandy",
        "1/4 cup water",
        "1/3 cup apricot preserves",
        "1/3 cup heavy cream",
        "*available at Asian markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pork",
        "Marinate",
        "Orange",
        "Brandy",
        "Spring",
        "Gourmet",
        "Sweden"
    ],
    "title": "Asian Pork Tenderloin Fallom",
    "url": "http://www.epicurious.com/recipes/food/views/asian-pork-tenderloin-fallom-11990"
}
