{
    "directions": [
        "Heat oil in large skillet over medium-high heat. Add lemongrass and garlic; sauté 2 minutes. Add mushrooms. Sprinkle with 1/2 teaspoon coarse salt; sauté until mushrooms are tender, about 4 minutes. Remove from heat; cool in skillet.",
        "Place pork in large bowl. Mix in 1 tablespoon soy sauce, 1 teaspoon sesame oil, cracked pepper, and 1/2 teaspoon coarse salt, then fold in mushroom mixture. Using 2 generous tablespoonfuls for each, shape into 18 patties, each about 2 1/4 inches in diameter; arrange on plastic-lined baking sheet.",
        "Whisk hoisin sauce, ginger, vinegar, chili sauce, and remaining 1 tablespoon soy sauce and 2 teaspoons sesame oil in small bowl for sauce. DO AHEAD: Burgers and sauce can be made 6 hours ahead. Cover separately; chill.",
        "Spray grill rack with nonstick spray. Prepare barbecue (medium-high heat ). Grill burgers until cooked through, about 3 minutes per side. Arrange burgers on platter; set out sauce. Place lettuce, bell pepper, carrot, and cilantro in separate bowls. Serve, allowing guests to wrap burgers in lettuce and add sauce and vegetables as desired.",
        "* Available in the Asian foods section of many supermarkets and at Asian markets."
    ],
    "ingredients": [
        "2 tablespoons canola oil or peanut oil",
        "2 tablespoons minced lemongrass (from bottom 3 inches of about 4 stalks)",
        "2 garlic cloves, minced",
        "4 ounces fresh shiitake mushrooms, stemmed, caps chopped",
        "1 teaspoon coarse kosher salt, divided",
        "1 3/4 pounds ground pork shoulder (Boston butt)",
        "2 tablespoons soy sauce, divided",
        "3 teaspoons Asian sesame oil, divided",
        "3/4 teaspoon cracked black pepper",
        "1/2 cup hoisin sauce*",
        "1 tablespoon minced peeled fresh ginger",
        "1 tablespoon unseasoned rice vinegar",
        "1 teaspoon hot chili sauce (such as sriracha)*",
        "Nonstick vegetable oil spray",
        "2 heads of Bibb lettuce, cored, leaves separated",
        "1 cup matchstick-size strips red bell pepper",
        "1 cup matchstick-size strips peeled carrot",
        "1/3 cup fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pork",
        "High Fiber",
        "Backyard BBQ",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Lemongrass",
        "Sesame",
        "Soy Sauce",
        "Lettuce"
    ],
    "title": "Asian Pork and Mushroom Burger Wraps",
    "url": "http://www.epicurious.com/recipes/food/views/asian-pork-and-mushroom-burger-wraps-242710"
}
