{
    "directions": [
        "Soak noodles in cold water to cover 30 minutes.",
        "While noodles soak, stir together all glaze ingredients in a small bowl. Stir together all sauce ingredients in another small bowl.",
        "Preheat oven to 450°F with rack in middle.",
        "Blanch carrots in a small saucepan of boiling water 30 seconds, then transfer to a large bowl with a slotted spoon. Return water to a boil and cook beans until crisp-tender, about 2 minutes. Transfer to bowl with carrots.",
        "Bring a pasta pot of water to a boil.",
        "Meanwhile, put duck legs, skin sides up, on rack of a broiler pan, then pour 1 cup water into bottom of pan. Brush or spoon about half of glaze over skin side of duck. Roast duck until well browned, about 20 minutes.",
        "Turn on broiler. Brush duck with remaining glaze, then broil 3 to 4 inches from heat until skin is bubbling and lightly charred around edges, about 2 minutes more. Keep warm, covered.",
        "Drain noodles, then cook in boiling water 30 seconds. Reserve 1 cup cooking water and drain noodles again.",
        "Add hot noodles, sauce, and scallions to carrots and beans and toss with tongs until well coated with sauce, adding some of reserved cooking liquid to moisten if necessary",
        "Add hot noodles, sauce, and scallions to carrots and beans and toss with tongs until well coated with sauce, adding some of reserved cooking liquid to moisten if necessary"
    ],
    "ingredients": [
        "7 ounces (1/4-inch-wide) dried rice-stick noodles (rice vermicelli)",
        "2 medium carrots, cut into matchsticks",
        "1/4 pound Chinese long beans or regular green beans, cut into 1-inch lengths",
        "4 Confit Duck Legs at room temperature",
        "1/2 cup chopped scallions (about 3)",
        "2 cups coarsely torn mixed fresh herbs such as mint, cilantro, and basil",
        "2 tablespoons hoisin sauce",
        "1 tablespoon fresh lime juice",
        "2 teaspoons Sriracha (Southeast Asian chile sauce)",
        "1/4 cup soy sauce",
        "3 tablespoons Chinese black vinegar (preferably Chinkiang)",
        "1 1/2 tablespoons packed dark brown sugar",
        "1 teaspoon Asian sesame oil",
        "1 garlic clove, finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Broil",
        "Vinegar",
        "Green Bean",
        "Carrot",
        "Noodle",
        "Soy Sauce",
        "Simmer",
        "Gourmet",
        "Lunar New Year"
    ],
    "title": "Asian Noodles with Barbecued Duck Confit",
    "url": "http://www.epicurious.com/recipes/food/views/asian-noodles-with-barbecued-duck-confit-243565"
}
