{
    "directions": [
        "Whisk together fish sauce, ginger, garlic, soy sauce, and sugar in a small bowl until sugar is dissolved. Pour marinade into a large sealable plastic bag. Pat steak dry and place in bag, then press out excess air and seal bag. Turn bag over 2 or 3 times to coat meat, then place in a shallow dish (in case of leaks) and chill at least 4 hours and up to 8. Bring steak to room temperature 30 minutes before grilling.",
        "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas).",
        "Remove steak from marinade (discard marinade) and pat dry with paper towels. Grill, uncovered unless using a gas grill, over direct heat, turning over once, until medium-rare, 12 to 14 minutes total.",
        "Transfer steak to a cutting board and let stand, uncovered, about 15 minutes.",
        "Whisk together lime juice, water, sugar, fish sauce, and red-pepper flakes in a bowl until sugar is dissolved, then stir in shallots.",
        "Cook noodles in a 5-quart pot of boiling salted water until just tender, 4 to 5 minutes. Drain in a colander, then rinse under cold water and drain well. Transfer to a bowl and toss with 1/2 cup dressing. 3Working around core of each apple, cut thin slices (about 1/8 inch thick) with slicer, then stack slices. Cut slices lengthwise into 1/4-inch-wide matchsticks.",
        "Combine apples, greens, and mint in a large bowl. Add 1/2 cup dressing and toss well to coat.",
        "Thinly slice steak across the grain.",
        "Arrange noodles on a large platter and mound greens on top of noodles. Arrange steak slices on greens and sprinkle with peanuts. Serve at room temperature with remaining dressing on the side.",
        "*Found in Asian markets and uwajimaya.com."
    ],
    "ingredients": [
        "1/4 cup Asian fish sauce",
        "2 tablespoons finely chopped peeled fresh ginger",
        "2 garlic cloves, finely chopped",
        "2 tablespoons soy sauce",
        "2 tablespoons sugar",
        "2 lb flank steak",
        "1/2 cup fresh lime juice",
        "6 tablespoons water",
        "6 tablespoons sugar",
        "6 tablespoons Asian fish sauce",
        "1 1/2 teaspoons dried hot red-pepper flakes",
        "1/2 cup thinly sliced shallots (2 medium)",
        "8 oz dried vermicelli rice-stick noodles*",
        "2 medium Granny Smith apples",
        "7 oz Asian salad mix (16 cups loosely packed; see cooks' note, below)",
        "1 cup fresh mint leaves, torn into pieces if large",
        "1/2 cup salted roasted peanuts (sometimes labeled \"cocktail peanuts\"), chopped",
        "Special equipment: an adjustable-blade slicer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Fruit",
        "Garlic",
        "Ginger",
        "Leafy Green",
        "Herb",
        "Nut",
        "Pasta",
        "Vegetable",
        "Apple",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Asian Steak and Noodle Salad",
    "url": "http://www.epicurious.com/recipes/food/views/asian-steak-and-noodle-salad-235018"
}
