{
    "directions": [
        "Bring a large pot of lightly salted water to a boil. Cook shell pasta in the boiling water, stirring occasionally until still firm to the bite, about 9 minutes. Drain.",
        "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish.",
        "Heat olive oil in a large pot over medium heat. Add mushrooms, onion, and salt and pepper to taste. Cook and stir until mushrooms have browned and onion is translucent, about 7 minutes. Add radicchio, garlic, and sage; cook until radicchio has wilted and garlic is fragrant, about 3 minutes. Remove from heat and stir in pasta.",
        "Melt butter in a saucepan over medium-high heat. Whisk in flour; cook until foaming. Pour in milk, whisking constantly, until mixture comes to a boil and thickens, about 5 minutes. Remove from heat; whisk in Asiago cheese, heavy cream, 1 cup Parmigiano-Reggiano cheese, 1/2 teaspoon salt, and 1/4 teaspoon black pepper until sauce is melted and smooth.",
        "Pour sauce over pasta mixture; stir until thoroughly combined. Transfer to prepared baking dish. Top with remaining 1/2 cup Parmigiano-Reggiano cheese and panko.",
        "Bake in the preheated oven until bubbly, about 30 minutes. Broil until topping is golden brown, about 1 minute."
    ],
    "ingredients": [
        "1 (16 ounce) package shell pasta",
        "2 tablespoons olive oil",
        "1 pound sliced cremini mushrooms",
        "1 small red onion, diced",
        "salt and ground black pepper to taste",
        "1 large head radicchio - halved, cored, and thinly sliced",
        "4 cloves garlic, minced",
        "2 tablespoons minced fresh sage",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "2 cups milk",
        "3 cups grated Asiago cheese",
        "1 1/2 cups heavy whipping cream",
        "1 1/2 cups freshly grated Parmigiano-Reggiano cheese, divided",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/2 cup panko bread crumbs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Asiago Cremini Pasta Bake with Radicchio",
    "url": "http://allrecipes.com/recipe/246656/asiago-cremini-pasta-bake-with-radicc/"
}
