{
    "directions": [
        "Halve the pineapple lengthwise, cut out the flesh, leaving 1/2-inch-thick shells, and reserve the shells. Discard the core and cut enough of the pineapple into 1/2-inch pieces to measure 1 1/2 cups, reserving the remaining pineapple for another use. In a bowl combine the pineapple pieces, the bell pepper, the scallions, and the jalapeño pepper. In a small bowl whisk together the soy sauce, the sugar, the anchovy paste, the turmeric, and 1 tablespoon water.",
        "In a wok or heavy skillet heat 1 tablespoon of the oil over moderately high heat until it is hot but not smoking, in it stir-fry the shrimp for 1 1/2 minutes, or until they are just firm, and transfer them to a bowl. Heat the remaining 1 tablespoon oil over moderately high heat until it is hot but not smoking and in the oil stir-fry the garlic for 5 seconds, or until it is golden. Add the rice and stir-fry the mixture for 30 seconds, or until the rice is hot. Add the soy mixture and stir-fry the mixture for 1 minute. Add the pineapple mixture and the shrimp, stir-fry the mixture for 1 minute, or until it is hot, and stir in the coriander. Serve the fried rice in the reserved pineapple shells if desired. (There will be extra fried rice.)"
    ],
    "ingredients": [
        "a 4-pound pineapple",
        "1/2 cup julienne red bell pepper",
        "3 scallions, sliced thin",
        "2 teaspoons minced fresh jalapeño pepper, including the seeds (wear rubber gloves), or to taste",
        "1 1/2 tablespoons soy sauce",
        "1 1/2 teaspoons sugar",
        "1 teaspoon anchovy paste",
        "1/2 teaspoon turmeric",
        "2 tablespoons vegetable oil",
        "1 pound small shrimp (about 50), shelled and deveined",
        "2 garlic cloves, minced",
        "5 cups cooked rice",
        "1/4 cup finely chopped fresh coriander"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Rice",
        "Stir-Fry",
        "Pineapple",
        "Shrimp",
        "Gourmet"
    ],
    "title": "Asian-Style Shrimp and Pineapple Fried Rice",
    "url": "http://www.epicurious.com/recipes/food/views/asian-style-shrimp-and-pineapple-fried-rice-11983"
}
