{
    "directions": [
        "Mix 1 tablespoon soy sauce, honey and crushed red pepper in glass pie dish. Add flank steak; turn to coat. Let stand at room temperature 1 hour or refrigerate up to 4 hours, turning ccasionally.",
        "Whisk 4 teaspoons soy sauce, rice vinegar and next 4 ingredients in large bowl for dressing.",
        "Spray large nonstick skillet with nonstick spray; heat over medium heat. Add steak and cook to desired doneness, about 5 minutes per side for medium-rare. Let cool 10 minutes. Meanwhile, cook pasta in pot of boiling salted water until almost tender. Add carrots and peas; cook until vegetables and pasta are just tender, about 2 minutes. Drain. Transfer to bowl with dressing. Add onions and 4 tablespoons cilantro; toss. Season with salt and pepper. Thinly slice steak crosswise. Arrange steak atop pasta, spooning any juices over. Sprinkle with 1 tablespoon cilantro."
    ],
    "ingredients": [
        "1 tablespoon plus 4 teaspoons soy sauce",
        "1 teaspoon honey",
        "1/8 teaspoon dried crushed red pepper",
        "1 8-ounce piece flank steak",
        "2 tablespoons rice vinegar",
        "1 tablespoon vegetable oil",
        "2 teaspoons oriental sesame oil",
        "1 1/2 teaspoons minced peeled ginger",
        "2 garlic cloves, minced",
        "Nonstick vegetable oil spray",
        "1 9-ounce package fresh angel hair pasta or 9 ounces thin spaghetti",
        "2 medium carrots, peeled, cut into matchstick-size strips",
        "4 ounces fresh snow peas, trimmed, halved diagonally",
        "1/3 cup thinly sliced green onions",
        "5 tablespoons chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pasta",
        "Vegetable",
        "Marinate",
        "Dinner",
        "Meat",
        "Steak",
        "Fall",
        "Summer",
        "Noodle",
        "Soy Sauce",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Asian Noodles with Pan-Seared Flank Steak",
    "url": "http://www.epicurious.com/recipes/food/views/asian-noodles-with-pan-seared-flank-steak-104062"
}
