{
    "directions": [
        "Make the meatballs: Preheat the oven to 400 degrees F and line a baking sheet with parchment paper. Heat 1 tablespoon vegetable oil in a large nonstick skillet over medium-high heat. Add the cabbage and season with 1/4 teaspoon salt; cook, stirring occasionally, until softened, about 4 minutes. Transfer the cabbage to a plate to cool. Wipe out the pan, then add the remaining 1 tablespoon vegetable oil and the mushrooms. Season with 1/4 teaspoon salt and a few grinds of pepper and cook, stirring occasionally, until lightly browned, about 5 minutes. Transfer the mushrooms to the plate with the cabbage to cool.",
        "Lightly beat the eggs and egg white in a large bowl. Add the pork, scallions, garlic, ginger, soy sauce, sesame oil, sugar and cornstarch. Add the cabbage, mushrooms and a few grinds of pepper and mix with your hands until just combined (do not overmix). Dampen your hands and shape the meat mixture into 18 balls (about 2 inches each); arrange on the prepared baking sheet.",
        "Make the sauce: Mix the hoisin sauce, Sriracha, vinegar, sugar and 1 tablespoon water in a bowl; set aside 1/2 cup for serving. Brush the meatballs with the remaining sauce and sprinkle with the sesame seeds. Bake until cooked through, 18 to 22 minutes. Serve in lettuce leaves with the reserved sauce.",
        "Photograph by Christina Holmes"
    ],
    "ingredients": [
        "For the meatballs:",
        "2 tablespoons vegetable oil",
        "3 cups thinly sliced green cabbage (about 1/4 head)",
        "Kosher salt",
        "8 ounces shiitake mushrooms, stems removed, caps thinly sliced",
        "Freshly ground white pepper",
        "2 large eggs plus 1 egg white",
        "1 1/2 pounds ground pork",
        "4 scallions, minced",
        "3 cloves garlic, minced",
        "1 2-inch piece ginger, peeled and finely grated (about 1 tablespoon)",
        "3 tablespoons low-sodium soy sauce",
        "1 tablespoon toasted sesame oil",
        "2 teaspoons sugar",
        "2 teaspoons cornstarch",
        "For the sauce:",
        "1/2 cup hoisin sauce",
        "2 teaspoons Sriracha chile sauce",
        "1 teaspoon rice vinegar",
        "1 tablespoon sugar",
        "3 tablespoons sesame seeds",
        "1 head Boston lettuce, leaves separated"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Asian",
        "Meatballs",
        "Meat",
        "Pork"
    ],
    "title": "Asian Pork Meatballs",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/asian-pork-meatballs"
}
