{
    "directions": [
        "Place onions and carrots in a 5- to 6-quart slow cooker. Combine flour, the 1/2 teaspoon salt, and the 1/4 teaspoon pepper in a large resealable plastic bag. Trim fat from bison short ribs. If needed, cut into single rib portions. Pat dry with paper towels. Add bison short ribs, a few at a time, to the plastic bag, shaking to coat.",
        "Heat oil over medium-high heat in a very large skillet. Cook bison short ribs, half at a time, in hot oil until brown on all sides, adding more oil if necessary. Place in slow cooker on top of vegetables.",
        "Combine broth, orange juice, soy sauce, brown sugar, garlic, ginger, and cayenne pepper in a medium bowl. Pour over bison short ribs and vegetables in slow cooker.",
        "Cover and cook on low for 11 to 12 hours or on high or 5-1/2 to 6 hours. Use a slotted spoon to transfer bison short ribs and vegetables to a serving platter; reserve cooking liquid. Cover bison short ribs and vegetables with foil to keep warm.",
        "For sauce, skim fat from cooking liquid; measure 3 cups of the liquid. Discard the remaining liquid. Combine the 3 cups cooking liquid and cornstarch in a medium saucepan. Cook and stir over medium-high heat until slightly thickened and bubbly. Cook and stir for 2 more minutes. Season to taste with additional salt and black pepper. Serve with rice and sprinkle with cilantro."
    ],
    "ingredients": [
        "2 cups chopped onions",
        "1 cup sliced carrots",
        "1/3 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "4 pounds bison short ribs",
        "1 tablespoon toasted sesame oil, or more to taste",
        "1 cup beef broth",
        "1/2 cup orange juice",
        "1/4 cup soy sauce",
        "3 tablespoons packed brown sugar",
        "4 cloves garlic, minced",
        "1/4 teaspoon cayenne pepper",
        "2 tablespoons cornstarch",
        "Salt and black pepper",
        "Hot cooked rice",
        "Chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Asian Bison Short Ribs",
    "url": "http://allrecipes.com/recipe/233880/asian-bison-short-ribs/"
}
