{
    "directions": [
        "In a medium saucepan, soak the kombu in the water for 1 to 2 hours.",
        "Set the saucepan of kombu on the stove and turn the heat up to high. When the water begins to throw bubbles but before it reaches a rolling boil, remove the kombu with tongs and discard. Stir the katsuobushi into the broth, and return to a boil. Reduce the heat and simmer for 1 minute. Remove from the heat and let sit for 10 minutes.",
        "Strain through a cheesecloth-lined strainer set over a large bowl, then press as much liquid out of the katsuobushi as you can. Reserve the liquid. Discard the katsuobushi. You can add a dried shiitake mushroom to the liquid as it cools. Dashi keeps in the refrigerator for 1 week, or until it starts to cloud.",
        "Combine the dashi, scallions, cilantro, vinegar, soy sauce, ginger, mirin, sesame oil, and hot pepper flakes in a medium bowl. Season to taste with more vinegar, soy, and red pepper flakes. Give the sauce a few hours to meld before serving.",
        "Serve the pork shoulder shredded or chopped, along with rice and leaves of bibb (or other) lettuce. Let guests use the lettuce leaves to make rolls filled with pork and rice and dipped in the sauce."
    ],
    "ingredients": [
        "1/2 ounce (three 7-inch pieces) kombu seaweed, available at Japanese markets",
        "6 cups cool water",
        "1 ounce shaved katsuobushi (bonito flakes), available at Japanese markets",
        "1 dried shiitake mushroom, optional",
        "2 cups cooled dashi, from recipe below",
        "1/4 cup thinly sliced scallions",
        "1/4 cup roughly chopped cilantro",
        "1/4 cup rice vinegar (cider vinegar or ume plum vinegar can be used instead)",
        "3 tablespoons soy sauce",
        "2 tablespoons minced ginger (from a 2-inch piece)",
        "2 tablespoons mirin",
        "1/2 teaspoon toasted sesame oil",
        "Pinch hot pepper flakes or togarashi, optional"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Ginger",
        "Mushroom",
        "Side",
        "Vinegar",
        "Cilantro",
        "Soy Sauce",
        "Green Onion/Scallion"
    ],
    "title": "Asian Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/asian-dipping-sauce-51165600"
}
