{
    "directions": [
        "Preheat oven to 375°F. Whisk chili sauce, soy sauce, balsamic vinegar, and ginger in medium bowl; add steaks and turn to coat. Let marinate at room temperature 15 minutes, turning occasionally.",
        "Heat 1/2 tablespoon vegetable oil in large ovenproof skillet over medium-high heat. Scrape most of marinade off steaks and back into bowl. Sprinkle steaks with salt and pepper; add to skillet and cook until browned, about 3 minutes. Turn steaks over and transfer skillet to oven. Roast until cooked to desired doneness, about 5 minutes longer for medium-rare. Transfer steaks to cutting board; let rest 10 minutes.",
        "Meanwhile, heat remaining 1 tablespoon vegetable oil in heavy medium skillet over medium-high heat. Add onion and bell peppers; sauté until crisp-tender, about 3 minutes. Add green onions and all remaining marinade from steaks. Bring to boil. Stir in cilantro. Cut steaks crosswise in half. Divide steaks among 4 plates. Spoon vegetables over steaks and serve.",
        "*A sweet-hot Thai-style condiment used in marinades and sauces; available in the Asian foods section of some supermarkets and at Asian markets."
    ],
    "ingredients": [
        "2 tablespoons Thai-style chili sauce*",
        "1 1/2 tablespoons soy sauce",
        "2 teaspoons balsamic vinegar",
        "2 teaspoons grated peeled fresh ginger",
        "2 10- to 12-ounce New York steaks",
        "1 1/2 tablespoons vegetable oil, divided",
        "1 medium onion, halved, sliced",
        "2 medium red bell peppers, cut into",
        "4 green onions, chopped",
        "1/2 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Stir-Fry",
        "Kid-Friendly",
        "Low Cal",
        "Back to School",
        "Dinner",
        "Steak",
        "Bell Pepper",
        "Poker/Game Night",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Asian Steak Topped with Bell Pepper Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/asian-steak-topped-with-bell-pepper-stir-fry-350398"
}
