{
    "directions": [
        "Combine chicken wings, 2 green onions, ginger, garlic and peppercorns in large saucepan. Add enough cold water to cover mixture by 2 inches. Bring to simmer. Reduce heat to medium-low. Simmer gently until liquid is reduced to 4 cups, about 2 1/2 hours. Strain broth into large glass measuring cup; discard solids. Season broth to taste with salt. Refrigerate at least 30 minutes. Spoon fat off top of broth. (Can be made 2 days ahead. Cover and chill.)",
        "Using scissors, cut noodles into 3-inch lengths. Place in large bowl. Add enough hot water to cover; let stand until softened, about 10 minutes. Drain well.",
        "Arrange sliced chicken on platter. Place Sweet-and-Spicy Dipping Sauce, lettuce leaves, carrots, mint, cilantro, remaining 4 chopped green onions and noodles in separate bowls.",
        "Return broth to saucepan; bring to simmer. Transfer broth to fondue pot. Set pot over fondue burner and adjust heat so that broth simmers. Allow guests to simmer chicken slices in broth until cooked through, about 3 minutes. Serve with sauce, vegetables and noodles."
    ],
    "ingredients": [
        "2 pounds chicken wings",
        "6 green onions, chopped",
        "3 1/4-inch-thick slices fresh ginger",
        "1 garlic clove",
        "1/8 teaspoon whole black peppercorns",
        "10 cups (or more) cold water",
        "2 ounces bean thread noodles*",
        "1 pound partially frozen skinless boneless chicken breasts, cut crosswise into 1/8-inch-thick slices",
        "Sweet-and-Spicy Dipping Sauce",
        "2 heads butter lettuce, leaves separated",
        "1/2 cup finely shredded peeled carrots",
        "1/3 cup fresh mint leaves",
        "1/3 cup fresh cilantro leaves",
        "*Clear dried noodles that are also known as cellophane or transparent noodles; available at Asian markets and in the Asian foods section of some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Herb",
        "Onion",
        "Poultry",
        "Vegetable",
        "Dinner",
        "Mint",
        "Party",
        "Noodle",
        "Cilantro",
        "Lettuce",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Asian Hot Pot with Chicken and Sweet-and-Spicy Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/asian-hot-pot-with-chicken-and-sweet-and-spicy-dipping-sauce-100683"
}
