{
    "directions": [
        "Sprinkle short ribs with 3 teaspoons salt and 2 teaspoons pepper.",
        "In large heavy stockpot over high heat, heat oil until hot but not smoking. Working in batches, sear ribs, turning occasionally, until brown on all sides, about 10 to 12 minutes. Transfer as browned to plate, reserving rendered fat in pan. Add onions, carrots, celery, fennel, lemongrass, garlic, and ginger and sauté, stirring frequently, until soft, about 10 minutes. Add rice wine, soy sauce, thyme, and bay leaves, and remaining 1 teaspoon salt and 1/2 teaspoon pepper. Return short ribs to pot and add water to cover. Bring to boil, then reduce heat to low, cover, and simmer 3 1/2 hours, then brush with glaze. Continue cooking, brushing with glaze every 5 minutes, until meat is very tender and falling off bones, about 4 hours total. Transfer ribs to serving dish, brush with glaze, and serve."
    ],
    "ingredients": [
        "15 pounds beef short ribs, cut into 3- to 4-inch pieces (have your butcher do this)",
        "4 teaspoons kosher salt",
        "2 1/2 teaspoons freshly ground black pepper",
        "2 tablespoons canola oil",
        "5 large onions, roughly chopped (about 5 cups)",
        "6 carrots, roughly chopped (about 3 1/2 cups)",
        "1/2 bunch celery, roughly chopped (about 3 cups)",
        "2 medium fennel bulbs (sometimes called anise; 1 1/2 to 2 pounds total), stalks discarded and bulbs roughly chopped",
        "4 lemongrass stalks, root ends trimmed, tough outer leaves discarded, and finely chopped",
        "3 tablespoons garlic, minced (about 6 to 7 cloves)",
        "1 tablespoon ginger, minced (from 1/2-inch knob)",
        "4 cups Chinese Shaoxing rice wine or sake",
        "2 cups dark soy sauce",
        "6 whole sprigs fresh thyme",
        "3 dried bay leaves",
        "1 cup cranberry-teriyaki glaze"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Herb",
        "Onion",
        "Vegetable",
        "Braise",
        "Christmas",
        "New Year's Eve",
        "Fall",
        "Winter"
    ],
    "title": "Asian Braised Short Ribs with Cranberry-Teriyaki Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/asian-braised-short-ribs-with-cranberry-teriyaki-glaze-236609"
}
