{
    "directions": [
        "Preheat oven 400 degrees F.",
        "Preheat a large oven safe skillet over high heat with the oil. Liberally season the chicken wings with salt and pepper. Once the skillet is screaming hot add the wings in 1 even layer. Brown the wings for 3 minutes per side. While the wings are browning, assemble the plum glaze: in a small pot over high heat combine the plum sauce, orange juice, ginger root, tamari and hot pepper flakes. Bring up to a simmer and lower the heat, reserving it until the wings are done browning. Remove ginger from glaze. Pour the simmering plum glaze mixture over the browned wings. Place the skillet in the oven and roast for 20 minutes, flipping the wings once half way through the cooking time.",
        "Remove the wings from the oven, if the glaze is not syrupy and thick, place the skillet of wings on the cook top and turn the heat on high, allow the glaze to reduce for about 1 minute. Toss the wings around in the glaze and finish with the fresh cilantro and basil.",
        "Serve hot or room temperature.",
        "TIDBITS",
        "Close that door! Whenever you are tending to something in the oven, pull it out of the oven completely and close that door while you are doing your business. Otherwise your oven will have to work double time to get back up to temperature."
    ],
    "ingredients": [
        "2 tablespoons vegetable or olive oil",
        "12 whole chicken wings, drummers and tips",
        "Salt and pepper",
        "3/4 cup plum sauce",
        "1/2 cup orange juice, eyeball it",
        "2 inches ginger root, peeled",
        "3 tablespoons tamari, dark soy sauce, eyeball it",
        "1/2 to 1 teaspoon red chili flakes, medium heat to extra spicy",
        "1/4 cup chopped fresh cilantro leaves",
        "1/4 cup chopped fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Asian Appetizer",
        "Appetizer",
        "Asian",
        "Chicken",
        "Poultry Recipes",
        "Snack",
        "Recipes for Parties",
        "Super Bowl",
        "Tailgate Party"
    ],
    "title": "Asian Glazed Wings",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/asian-glazed-wings-recipe"
}
