{
    "directions": [
        "In a large bowl combine well the noodles, the mushrooms, the pork, the garlic, the shallots, the gingerroot, the carrot, the coriander, the mint, the sprouts, the soy sauce, the salt, and the sugar. Put 1 spring-roll wrapper on a work surface, keeping the remaining wrappers covered with plastic wrap, cut it in half diagonally, and arrange one half with the longest side facing you. Spread a rounded tablespoon of the filling down the long side, leaving a 2-inch border at each end, and brush the edges with some of the egg wash. Fold the corners of the long side over the filling and, rolling away from you, roll up the filling in the wrapper, sealing the roll, using some of the remaining egg wash if necessary. Make more spring rolls with the remaining filling, wrappers, and egg wash in the same manner, transferring them as they are made to a wax-paper-lined baking sheet and keeping them covered with plastic wrap. In a deep fryer heat 1 1/4 inches of the oil to 375°F. on a deep-fat thermometer and in it fry the spring rolls in batches, turning them, for 2 to 3 minutes, or until they are golden, transferring them as they are fried with a slotted spoon to paper towels to drain. The spring rolls may be made 5 days in advance, cooled completely, and kept frozen in plastic freezer bags. Reheat the rolls, unthawed, on a rack set in a shallow baking pan in a preheated 450°F. oven for 10 minutes.",
        "In a small bowl stir together the soy sauce, the lime juice, the water, the garlic paste, the sugar, and the chili.",
        "Cut the spring rolls diagonally into 1-inch-thick slices if desired. Arrange the spring rolls or slices on a platter with the dipping sauce and garnish the platter with the scallion brushes.",
        "Trim the roots and the green parts from scallions, leaving about 2 1/2 inches of stalk. Make crisscross cuts about 1/2 inch deep at both ends of each stalk and spread the fringed ends gently. Put the scallions in a bowl of ice and cold water and chill them for 2 hours, or until the fringed ends have curled. Drain the scallions well."
    ],
    "ingredients": [
        "2 ounces cellophane (bean-thread) noodles*, soaked in boiling-hot water to cover for 20 minutes, drained well, and chopped",
        "6 dried shiitake mushrooms*, soaked in hot water to cover for 20 minutes, rinsed, squeezed dry, the stems discarded, and the caps sliced thin",
        "3/4 pound lean ground pork",
        "3 garlic cloves, minced",
        "3 large shallots, minced",
        "1 tablespoon minced peeled fresh gingerroot",
        "1 large carrot, shredded",
        "1/3 cup chopped fresh coriander",
        "1/3 cup chopped fresh mint leaves",
        "1 cup chopped mung bean sprouts*",
        "2 tablespoons soy sauce",
        "1 1/2 teaspoons salt",
        "1 teaspoon sugar",
        "20 spring-roll wrappers*",
        "an egg wash made by beating 1 large egg with 1 teaspoon water",
        "vegetable oil for deep-frying",
        "1/4 cup soy sauce",
        "1/4 cup fresh lime juice",
        "2 tablespoons water",
        "2 garlic cloves, minced and mashed to a paste with 1/2 teaspoon salt",
        "2 tablespoons sugar",
        "a 2-inch fresh red or green chili, seeded and minced (wear rubber gloves), or 1/4 teaspoon dried hot red pepper flakes, or to taste",
        "scallion brushes for garnish if desired",
        "*available at Asian markets, some specialty foods shops, and many supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Mushroom",
        "Pork",
        "Appetizer",
        "Side",
        "Fry",
        "Lime",
        "Mint",
        "Carrot",
        "Shallot",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Asian Spring Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/asian-spring-rolls-11646"
}
