{
    "directions": [
        "Put beef cubes in a container with a lid. Whisk 2 tablespoons olive oil, 2 tablespoons oyster sauce, 4 minced garlic cloves, wine, 1 teaspoon fish sauce, 1 teaspoon black pepper, soy sauce, dark soy sauce, and sesame oil together in a bowl until marinade is well mixed; pour over beef. Allow beef to marinate, 10 to 30 minutes.",
        "Whisk 1 tablespoon fish sauce, lemon juice, and 1 tablespoon black pepper together in a bowl until dipping sauce is well mixed.",
        "Heat 2 tablespoons olive oil in a wok or large skillet over high heat; add beef and marinade. Cook and stir beef mixture, 2 tablespoons oyster sauce, and 4 cloves minced garlic together in hot oil until beef is cooked through and sauce begins to thicken, 5 to 10 minutes. Adding garlic over several times during cooking will produce a better mix of flavors.",
        "Serve beef alongside dipping sauce."
    ],
    "ingredients": [
        "1 1/2 pounds beef tenderloin, cut into cubes",
        "Marinade:",
        "2 tablespoons olive oil",
        "2 tablespoons oyster sauce (such as Maekrua®)",
        "4 large cloves garlic, minced, or more to taste",
        "1 tablespoon Cabernet Sauvignon wine",
        "1 teaspoon fish sauce",
        "1 teaspoon ground black pepper, or more to taste",
        "1 teaspoon soy sauce (optional)",
        "1 teaspoon dark soy sauce (optional)",
        "2 drops sesame oil, or more to taste",
        "Dipping Sauce:",
        "1 tablespoon fish sauce (optional)",
        "1 tablespoon lemon juice (optional)",
        "1 tablespoon ground black pepper (optional)",
        "2 tablespoons olive oil",
        "2 tablespoons oyster sauce (such as Maekrua®)",
        "4 cloves garlic, minced, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Asian Garlic Beef Cubes (Vietnamese Bo Luc Lac or Shaking Beef)",
    "url": "http://allrecipes.com/recipe/244962/asian-garlic-beef-cubes-vietnamese-b/"
}
