{
    "directions": [
        "1. Bring a large saucepan of lightly salted water to a boil. Cook the onions, with their skins, over high heat for 2 to 3 minutes, just until they begin to soften. Drain and set aside to cool. When cool enough to handle, slice off the root ends and remove the papery onion skin; leave whole.",
        "2. In a sauté pan, mix the sherry, raisins, honey, 3 tablespoons water, the butter, orange juice, and thyme. Add the onions and bring to a simmer over medium-high heat. Reduce the heat to maintain a simmer, cover, and cook for 15 to 20 minutes, until the onions are tender when pierced with a small sharp knife. Adjust the heat as needed to maintain the simmer.",
        "3. Remove the cover, season to taste with salt and pepper, and simmer for 2 to 4 minutes longer, or until the sauce reduces almost to a glaze. Stir the onions occasionally so they color evenly. Remove from the heat and let the onions cool slightly in the pan. Stir in the vinegar and set aside to cool to room temperature.",
        "4. Cut the cheese into four equal pieces and put each on a plate. Mound the onions next to the cheese. Serve with a baguette slice."
    ],
    "ingredients": [
        "1 1/2 pounds cippoline onions, skins on",
        "3/4 cup dry sherry",
        "1/3 cup raisins",
        "3 tablespoons honey",
        "1 1/2 tablespoons unsalted butter",
        "Juice of 1 orange",
        "1 teaspoon chopped fresh thyme",
        "Kosher salt and cracked black pepper",
        "1 tablespoon sherry vinegar",
        "1/2 pound Asiago cheese",
        "Four 1/4-inch slices baguette, toasted and brushed with extra virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Fruit",
        "Onion",
        "Vegetable",
        "Side",
        "Quick & Easy",
        "Vinegar",
        "Parmesan",
        "Orange",
        "Raisin",
        "Sherry",
        "Fall",
        "Spring",
        "Summer",
        "Winter",
        "Honey",
        "Thyme",
        "Fontina",
        "Butter"
    ],
    "title": "Asiago Cheese with Glazed Cipolline Onions",
    "url": "http://www.epicurious.com/recipes/food/views/asiago-cheese-with-glazed-cipolline-onions-355871"
}
