{
    "directions": [
        "With a Japanese rotary slicer (see note this page) cut cucumber into 1 long spiral. (Alternatively, with a sharp knife cut cucumber into very thin slices.) In a bowl toss cucumber with vinegar, sugar, red pepper flakes, and salt to taste.",
        "In another bowl whisk together egg white, soy sauce, and gingerroot until combined well and stir in salmon, bread crumbs, scallions, mustard seeds, and salt to taste. In a food processor purée 1/3 cup salmon mixture and return to salmon mixture remaining in bowl. (Alternatively, chop 1/3 cup salmon mixture fine and mash to a paste with flat side of a knife.) Stir mixture to combine and form into four 3/4-inch-thick patties. Drain cucumber well.",
        "In a large non-stick skillet heat oil over moderately high heat until hot but not smoking and cook patties until golden, about 2 minutes on each side. Cook patties, covered, over moderate heat until just cooked through, about 5 minutes more. Arrange lettuce leaves on 4 pumpernickel slices and top with salmon burgers, pickled cucumber, and remaining 4 pumpernickel slices."
    ],
    "ingredients": [
        "1 large cucumber (about 1 pound)",
        "1 tablespoon cider vinegar",
        "1 1/2 teaspoons sugar",
        "1/4 teaspoon dried hot red pepper flakes",
        "1 large egg white",
        "1 tablespoon soy sauce",
        "1/2 teaspoon grated peeled fresh gingerroot",
        "a 3/4-pound piece salmon fillet, skin discarded and fish cut into  1/4-inch pieces",
        "1/2 cup fine fresh bread crumbs",
        "2 scallions, chopped fine",
        "1 teaspoon mustard seed",
        "1 teaspoon vegetable oil",
        "4 small green-leaf lettuce leaves",
        "8 slices firm pumpernickel (about 10 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Food Processor",
        "Ginger",
        "Low Fat",
        "Quick & Easy",
        "Lunch",
        "Vinegar",
        "Salmon",
        "Cucumber",
        "Summer",
        "Pan-Fry",
        "Gourmet"
    ],
    "title": "Asian Salmon Burgers with Pickled Cucumber on Pumpernickel",
    "url": "http://www.epicurious.com/recipes/food/views/asian-salmon-burgers-with-pickled-cucumber-on-pumpernickel-12394"
}
