{
    "directions": [
        "Bring 1-inch of water to a boil, add salt then green beans, cover and cook 2 minutes, then add asparagus and cook 3 minutes more. If using pencil asparagus, blanch for 1 to 2 minutes. Drain well and cold shock vegetables in ice water to stop cooking process. Drain the vegetables on clean kitchen towels to dry completely. Thinly slice the green beans lengthwise on an angle; pile them together and run your knife through them cutting them into 2-inch pieces. Halve the asparagus lengthwise if thicker, leave in spindles if thin, then cut the spears into 2-inch pieces on an angle. Combine the beans, asparagus, 1/2 cup of parsley and onion in a shallow bowl.",
        "Combine the lemon zest and juice, remaining 1/2 cup of parsley and herbs in a food processor with cheese. Turn processor on and stream in extra-virgin olive oil. Season the dressing with salt and pepper and pour over the salad. Season the sliced tomatoes with salt and garnish salad with them."
    ],
    "ingredients": [
        "Salt",
        "1/2 pound green beans, trimmed of stems",
        "3/4 pound regular or pencil asparagus, trimmed of rough ends, a small bundle",
        "1/2 red onion, thinly sliced",
        "1 cup flat-leaf parsley, a couple of handfuls",
        "1 lemon, zested and juiced",
        "1/2 cup basil, 12 leaves, a couple of handfuls",
        "1 small clove garlic, cracked from skin",
        "1/4 cup grated Parmigiano-Reggiano or Romano, a generous handful",
        "1/3 cup extra-virgin olive oil, eyeball it",
        "Salt and pepper",
        "2 plum tomatoes, seeded then thinly sliced lengthwise"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Side Dish Recipes",
        "Easy Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Green Bean Salad",
        "Beans and Legumes",
        "Green Bean",
        "Salad Recipes",
        "Tomato Salad",
        "Tomato",
        "Vegetable",
        "Tomato Side Dish",
        "Asparagus",
        "Onion Recipes",
        "Fruit",
        "Lemon Recipes",
        "Cheese",
        "Spring"
    ],
    "title": "Asparagus and Green Bean Salad",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/asparagus-and-green-bean-salad-recipe"
}
