{
    "directions": [
        "Roll out pastry dough on a floured surface into a 15 1/2-inch round. Transfer to pizza pan by rolling dough around rolling pin and unrolling it across pan. Trim edge just enough to make even, then fold over and pinch to form a 1/2-inch-high, double-thick side. Prick bottom of shell all over with a fork and chill until firm, at least 30 minutes.",
        "Preheat oven to 375°F.",
        "Line shell with foil and fill with pie weights or raw rice. Bake in middle of oven until sides are firm, about 20 minutes. Remove foil and weights carefully and bake shell until golden, about 10 minutes more, then cool.",
        "Layer asparagus on a steamer rack, sprinkling each layer with kosher salt to taste. Steam, covered, over boiling water until completely tender but not mushy, about 8 minutes for green asparagus or 12 for white, then transfer to a bowl of ice water to stop cooking. Drain well and pat dry with paper towels.",
        "Whisk together cream, eggs, 1/2 teaspoon kosher salt, and nutmeg, then season lightly with pepper. Pour custard evenly in tart shell.",
        "Sprinkle custard with two thirds of cheese, then arrange spears in custard, tips out (like the spokes of a wheel). Sprinkle remaining cheese over top.",
        "Bake tart in middle of oven until custard is set, about 20 minutes.",
        "Then broil tart 2 to 3 inches from heat until golden, 1 to 2 minutes."
    ],
    "ingredients": [
        "Black Pepper and Sour Cream Pastry Dough",
        "3 pounds thick white or green asparagus, trimmed to 6 inches and peeled",
        "1/2 teaspoon kosher salt plus additional for sprinkling",
        "1 cup heavy cream",
        "2 large eggs",
        "1/4 teaspoon freshly grated nutmeg",
        "1 cup finely grated Gruyère",
        "Special equipment: a round pizza pan (13 inches in diameter, not including rim) and pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Bake",
        "Asparagus",
        "Spring",
        "Swiss Cheese",
        "Gourmet"
    ],
    "title": "Asparagus and Gruyère Tart",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-and-gruyere-tart-104744"
}
