{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Place a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover pan and bring the water to a boil. Place 1 pound of asparagus into the steamer insert, cover, and steam until just tender, 4 to 6 minutes. Drain asparagus and set aside.",
        "Beat eggs, half-and-half, parsley, salt, white pepper, and green hot sauce in a bowl until smooth.",
        "Stir together cooked chicken, Swiss cheese, Monterey Jack cheese, mushrooms, and green onions in a bowl; mix in flour.",
        "Line a 9-inch pie dish with pie crust.",
        "Spread about half of the cooked asparagus over the bottom of the crust.",
        "Spread about half of the chicken mixture over the asparagus.",
        "Repeat layers of asparagus and chicken mixture.",
        "Gently pour the egg mixture over the layers.",
        "Arrange 3 asparagus spears decoratively on top of the quiche.",
        "Bake in the preheated oven until the filling is slightly puffed and lightly browned and a toothpick inserted into the center of the quiche comes out clean, 40 to 50 minutes.",
        "Sprinkle quiche with cherry tomatoes, if desired."
    ],
    "ingredients": [
        "1 pound fresh asparagus, trimmed and cut into 1/2-inch pieces",
        "5 eggs",
        "1/2 cup half-and-half",
        "1 tablespoon dried parsley",
        "1/2 teaspoon salt",
        "ground white pepper to taste",
        "1/4 teaspoon green (mild) hot pepper sauce (such as Tabasco®)",
        "2 cups diced cooked rotisserie chicken",
        "1 cup shredded Swiss cheese",
        "1/2 cup shredded Monterey Jack cheese",
        "1/2 cup sliced fresh mushrooms",
        "4 green onions, chopped",
        "2 teaspoons all-purpose flour",
        "1 unbaked 9-inch pie crust",
        "3 spears fresh asparagus, trimmed",
        "1/4 cup cherry tomatoes, quartered (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Asparagus Chicken Quiche",
    "url": "http://allrecipes.com/recipe/220222/asparagus-chicken-quiche/"
}
