{
    "directions": [
        "Preheat oven to 350°F. and butter six 3/4-cup soufflé dishes or custard cups. Line bottoms of dishes or cups with rounds of wax paper and butter paper. Line a baking pan large enough to hold dishes or cups with a double layer of kitchen towels.",
        "Trim asparagus and cut off tips. Halve asparagus tips lengthwise and cut stalks crosswise into 1-inch pieces. In a steamer rack set over boiling water steam asparagus tips, covered, until crisp-tender, about 1 minute. Transfer asparagus tips with a slotted spoon to a colander and rinse under cold water to stop cooking. Drain tips well and pat dry.",
        "Steam asparagus stalks, covered, until tender but still bright green, about 8 minutes. Transfer stalks with slotted spoon to paper towels and pat dry well. In a blender purée stalks, cream, tarragon, 3 tablespoons butter, Parmesan, and salt until smooth. In a bowl whisk eggs until combined and add asparagus purée in a stream, whisking until smooth.",
        "Divide mixture among dishes or cups and put on towels in pan. Add enough hot water to pan to reach halfway up sides of dishes or cups and bake flans in lower third of oven 35 to 40 minutes, or until a thin knife inserted in center comes out clean. Remove dishes or cups from pan and cool on a rack 5 minutes.",
        "In a small saucepan heat asparagus tips in remaining tablespoon butter until heated through. Run knife around edges of dishes or cups and invert flans onto 6 plates. Top flans with asparagus tips."
    ],
    "ingredients": [
        "2 pounds asparagus",
        "2 tablespoons heavy cream",
        "1/2 teaspoon dried tarragon, crumbled",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1/4 cup freshly grated Parmesan (about 3/4 ounce)",
        "1/2 teaspoon salt",
        "3 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Vegetable",
        "Bake",
        "Asparagus",
        "Gourmet"
    ],
    "title": "Asparagus Flans",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-flans-11999"
}
