{
    "directions": [
        "In a skillet cook onions in oil and butter with salt and pepper to taste over moderately low heat 15 minutes, or until golden. Transfer onions to a bowl to cool.",
        "Have ready a large bowl of ice and cold water. Cut asparagus crosswise into 1/2-inch pieces and cook in a large saucepan of boiling salted water 3 to 5 minutes, or until just tender. Drain asparagus in a colander and transfer to bowl of ice and cold water to stop cooking. Lift asparagus out of water and pat dry.",
        "Preheat oven to 400°F. Spread onions evenly onto galette rounds and top with prosciutto, asparagus, and goat cheese. Bake galettes on a baking sheet in middle of oven about 15 minutes, or until tops are lightly browned. Transfer galettes to a rack and cool. Serve galettes, cut into wedges, at room temperature.",
        "In a bowl whisk together milk, butter, yolks, and whole egg. In another bowl whisk together flour, salt, and chives and stir into milk mixture until just combined.",
        "On a lightly floured surface with floured hands knead dough about 8 times, or until just smooth. Wrap dough in plastic wrap and chill hour.",
        "Preheat oven to 450°F. Divide dough into 4 pieces. On a lightly floured surface with a floured rolling pin roll out each piece into an 8-inch round. Transfer rounds to 2 baking sheets and crimp edges decoratively. Chill dough 10 minutes and bake in middle and lower thirds of oven about 5 minutes, or until golden brown. Transfer galettes to racks and cool completely. Galettes may be made 1 day ahead and kept in a sealable plastic bag at room temperature. Makes 4 galettes rounds."
    ],
    "ingredients": [
        "2 medium onions, chopped",
        "1 tablespoon olive oil",
        "1 tablespoon unsalted butter",
        "1/2 pound thin asparagus (about 15 spears, 1/4- to 1/2-inch thick), trimmed",
        "3 tablespoons chopped fresh chives",
        "1/4 pound thinly sliced prosciutto, cut crosswise into thin slices",
        "1/3 cup soft mild goat cheese (about 4 ounces) room temperature",
        "2 galette rounds, baked",
        "1/4 cup milk",
        "3/4 stick (6 tablespoons) unsalted butter, melted and cooled",
        "3 large egg yolks",
        "1 large whole egg",
        "2 cups all-purpose flour",
        "1 3/4 teaspoons salt",
        "3 tablespoons chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Pork",
        "Vegetable",
        "Bake",
        "Spring",
        "Gourmet"
    ],
    "title": "Asparagus, Prosciutto, and Goat Cheese Galettes",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-prosciutto-and-goat-cheese-galettes-11993"
}
