{
    "directions": [
        "On a lightly floured surface, roll out pastry into a 16-inch square and fit into an 11-inch tart pan with a removable fluted rim. Roll a rolling pin over top of tart to trim pastry flush with top of rim. Chill pastry shell while making filling.",
        "Preheat oven to 425°F. with a baking sheet on lowest rack.",
        "In a small skillet, cook scallions in butter with salt to taste over moderate heat, stirring, until softened, about 1 minute, and cool.",
        "In a steamer set over boiling water, arrange asparagus slices and top with reserved tips. Steam asparagus, covered, until crisp-tender, about 2 to 3 minutes, and drain well, reserving tips separately.",
        "In a blender, blend eggs, goat cheese, milk, and salt with pepper to taste. Add tarragon and pulse custard to combine.",
        "Spread scallions and asparagus slices in pastry shell and arrange reserved tips decoratively on top. Pour custard slowly over vegetables.",
        "Bake tart in pan on heated baking sheet in oven 15 minutes. Reduce temperature to 375°F. and bake tart until set, about 8 minutes. Transfer tart in pan to a rack.",
        "Remove rim of pan and serve tart warm or at room temperature."
    ],
    "ingredients": [
        "a 1/2-pound frozen puff pastry sheet, thawed",
        "1 bunch scallions (white and pale green parts only), sliced thin (about 3/4 cup)",
        "1 tablespoon unsalted butter",
        "1 pound asparagus, trimmed and cut diagonally into 1/4-inch-thick slices, reserving tips",
        "3 large eggs",
        "a 3 1/2-ounce log soft mild goat cheese such as Montrachet",
        "1 cup milk",
        "3/4 teaspoon salt",
        "1 tablespoon finely chopped fresh tarragon leaves or 3/4 teaspoon dried, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Egg",
        "Bake",
        "Vegetarian",
        "Goat Cheese",
        "Asparagus",
        "Spring",
        "Shower",
        "Tarragon",
        "Gourmet"
    ],
    "title": "Asparagus Goat Cheese Tart with Tarragon",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-goat-cheese-tart-with-tarragon-10236"
}
