{
    "directions": [
        "Put dried mushrooms in a heatproof bowl and pour boiling water over them. Let stand 20 minutes. Pour mushrooms with liquid through a paper towel-lined sieve into a small saucepan. Transfer mushrooms to a cutting board and finely chop. Add vinegar, shallots, sugar, 1/2 teaspoon salt, and half of mushrooms to saucepan and boil mixture until it is reduced to 2/3 cup, about 10 minutes. Whisk in 1/4 cup olive oil and add salt and pepper to taste. Sauce can be served warm or at room temperature.",
        "Preheat oven to 400°F with rack in upper third.",
        "Stir together remaining chopped mushrooms with softened goat cheese in a small bowl.",
        "Place a steamer basket in a 5-quart pot filled with 2 inches of water. Steam asparagus, covered, just until tender, 4 to 5 minutes. Transfer asparagus to a bowl of ice water to stop cooking, then drain and pat dry.",
        "Halve asparagus crosswise.",
        "Arrange bread slices on a large baking sheet. Brush with some olive oil and bake until golden, 10 to 12 minutes.",
        "Spread goat cheese mixture generously on toasts.",
        "To serve, place a toast in the center of a salad plate and arrange 4 or 5 stem ends of asparagus on each. Top stems with asparagus tips, arranging them perpendicular to stems. Drizzle asparagus and surrounding plate with vinaigrette."
    ],
    "ingredients": [
        "1/2 ounce dried porcini mushrooms",
        "1 cup boiling water",
        "1/4 cup sherry vinegar",
        "1/4 cup minced shallots",
        "2 teaspoons sugar",
        "1/4 cup extra-virgin olive oil, plus additional for brushing",
        "2 bunches (2 pounds) green asparagus (not pencil), ends trimmed to 6 inches",
        "8 ounces fresh goat cheese, softened",
        "8 (1/2-inch thick) slices good quality bread, such as pain de mie, pullman or sourdough, crusts trimmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mushroom",
        "Appetizer",
        "Quick & Easy",
        "Graduation",
        "Wedding",
        "Goat Cheese",
        "Asparagus",
        "Spring",
        "Shower",
        "Engagement Party",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Asparagus Goat Cheese Bruschetta with Porcini Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-goat-cheese-bruschetta-with-porcini-vinaigrette-365217"
}
