{
    "directions": [
        "1. Wash the asparagus. Cut 2 inches (5 cm.) off the tips and save them for another use. Do not peel the stalks but cut them into 15-inch (3-cm.) pieces.",
        "2. Bring the stock or broth to a boil in a soup pot. When it bubbles, add the asparagus pieces and sugar. Turn down the heat, cover, and simmer for 20 minutes.",
        "3. Blend and pass through a fine strainer (a chinois if possible), pressing on the solids with a spoon to extract as much liquid as possible. Put the soup back in the pot, bring back to a boil, and boil about 30 minutes more.",
        "4. Thoroughly mix the cornstarch in a bowl with 1 tablespoon cold water. Beat the yolk and cream together in a bowl large enough to hold all the soup.",
        "5. When the soup in the pot has been reduced by about half, whisk in the cornstarch mixture. Boil for 1 minute, whisking constantly, and then gently pour everything into the bowl with the egg-cream mixture, whisking as you pour.",
        "6. Pour the contents of the bowl back into the soup pot and heat very gently in order to thicken. Stir with a spatula and turn off the heat at the first sign of boiling. Blend. Season with salt as necessary."
    ],
    "ingredients": [
        "2 pounds (1 kg.) white asparagus",
        "1 quart (1 L.) chicken stock (or store-bought), or chicken broth (or store-bought or made from a bouillon cube)",
        "A bit of sugar (1 cube if you have cubes)",
        "5 cup (30 g.) cornstarch",
        "1 egg yolk",
        "1 cup (25 cl.) heavy cream",
        "Salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Blender",
        "Chicken",
        "Egg",
        "Appetizer",
        "Asparagus",
        "Simmer",
        "Boil",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Asparagus Velouté",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-veloute-355936"
}
