{
    "directions": [
        "Prepare a large bowl of ice water.",
        "Fill the pasta pot with 3 quarts of water and bring it to a rolling boil over high heat. Add the coarse salt and the asparagus. Blanch, uncovered, until crisp-tender, about 3 minutes. (Cooking time will vary according to the size and tenderness of the asparagus.) Immediately remove the colander from the water, letting the water drain from the asparagus. Plunge the asparagus into the ice water so they cool down as quickly as possible and retain their crispness and bright green color. (The asparagus will cool in 1 to 2 minutes. After that, they will soften and begin to lose crispness and flavor.) Drain the asparagus and wrap it in a thick kitchen towel to dry. (Do not cook the asparagus in advance or it will lose its crispness.)",
        "Break each egg into a ramekin or small cup. Set aside. In a large, shallow saucepan, bring 2 inches of water to a boil. Add the vinegar. One by one, bring the edge of a ramekin or cup level with the surface of the water and slide the egg in gently. Turn off the heat and cover the pan. Poach the eggs until the whites are firm but the yolks are still runny and are covered with a thin, translucent layer of white, about 3 minutes.",
        "With the sieve or slotted spoon, carefully lift the eggs from the water and transfer them to several thicknesses of paper towels.",
        "Place the salad greens and chives in a large salad bowl. Toss with just enough dressing to coat the greens lightly and evenly.",
        "Place the asparagus on a large plate and add just enough dressing to lightly coat the spears. Roll the asparagus in the dressing.",
        "Arrange the dressed greens at one side of each of 4 large dinner plates. (Rectangular plates are particularly beautiful here.) Carefully place a poached egg alongside. Arrange 4 asparagus spears next to the eggs. Carefully drape a slice of ham over each of the poached eggs. Season the greens lightly with fine sea salt and generously with pepper. Sprinkle with chives. Serve with the toast."
    ],
    "ingredients": [
        "3 tablespoons coarse sea salt",
        "16 green asparagus spears (1 pound), trimmed",
        "4 ultra-fresh large eggs",
        "1 tablespoon distilled vinegar",
        "4 cups torn soft greens, such as buttercrunch lettuce",
        "1/4 cup minced fresh chives",
        "Lemon and Olive Oil Dressing",
        "4 thin slices top-quality ham",
        "Fine sea salt",
        "Coarse, freshly ground black pepper",
        "Toast, for serving",
        "5-quart pasta pot fitted with a colander; 4 ramekins or small cups ; a flat, fine-mesh sieve or a large slotted spoon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Salad",
        "Asparagus",
        "Ham",
        "Egg",
        "Chive",
        "Lettuce",
        "Poach",
        "Lunch",
        "Brunch",
        "Spring"
    ],
    "title": "Asparagus, Ham, and Poached Egg Salad",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-ham-and-poached-egg-salad"
}
