{
    "directions": [
        "Cook asparagus in pot of boiling salted water until crisp-tender, about 2 minutes. Drain. Transfer asparagus to bowl of ice water to cool. Drain.Bring broth to boil in medium saucepan. Reduce heat to very low; cover and keep warm.",
        "Meanwhile, melt butter with oil in heavy large saucepan over medium heat. Add leek and sauté until tender, about 5 minutes. Add rice and stir 2 minutes. Add wine and simmer until absorbed, stirring constantly, about 5 minutes. Add 1/2 cup hot chicken broth. Reduce heat and simmer until absorbed, stirring frequently. Add remaining broth 1/2 cup at a time, allowing broth to be absorbed before adding more and stirring frequently until rice is just tender and mixture is creamy, about 30 minutes. Add asparagus and stir until heated through, about 2 minutes. Remove from heat. Stir in prosciutto, Parmesan and parsley. Season with salt and pepper and serve."
    ],
    "ingredients": [
        "1 pound asparagus spears, tough ends trimmed, cut diagonally into 1/2-inch pieces",
        "5 cups canned low-salt chicken broth",
        "3 tablespoons butter",
        "1 tablespoon olive oil",
        "1 cup thinly sliced leek (white and pale green parts only)",
        "1 1/2 cups arborio rice or medium-grain white rice",
        "1/2 cup dry white wine",
        "2 ounces prosciutto, minced (about 1/4 cup)",
        "3 tablespoons freshly grated Parmesan cheese",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Rice",
        "Vegetable",
        "Appetizer",
        "Asparagus",
        "Leek",
        "Summer",
        "Prosciutto",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Asparagus and Leek Risotto with Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-and-leek-risotto-with-prosciutto-5390"
}
