{
    "directions": [
        "Place potatoes in small saucepan. Add enough water to cover by 1 inch. Sprinkle with salt. Bring to boil and cook until potatoes are tender, about 10 minutes. Drain. Cool. Cut potatoes into thin slices.",
        "Preheat oven to 450°F. Sprinkle rimless baking sheet with cornmeal. Roll and stretch pizza dough to 16x11-inch oval. Transfer to baking sheet. Mix 1 tablespoon olive oil and garlic in small bowl. Brush garlic oil over dough. Sprinkle 3/4 of green onions over, then mozzarella, leaving 1/2-inch plain border. Top with potato slices and goat cheese. Toss asparagus and 1 tablespoon oil in medium bowl. Scatter asparagus over pizza. Sprinkle with Parmesan, then lightly with salt and generously with pepper.",
        "Bake pizza until crust is browned and asparagus is tender, about 18 minutes. Transfer to cutting board. Sprinkle with remaining green onions. Cut into pieces."
    ],
    "ingredients": [
        "5 ounces fingerling potatoes",
        "Cornmeal (for sprinkling)",
        "Pizza Dough",
        "2 tablespoons extra-virgin olive oil, divided",
        "1 garlic clove, pressed",
        "4 green onions, thinly sliced, divided",
        "1 1/3 cups grated whole-milk mozzarella cheese (about 6 ounces)",
        "4 ounces soft fresh goat cheese, crumbled",
        "8 ounces asparagus, trimmed, each spear cut in half lengthwise, then crosswise into 2- to 3-inch pieces",
        "1/2 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "High Fiber",
        "Mother's Day",
        "Father's Day",
        "Dinner",
        "Lunch",
        "Goat Cheese",
        "Asparagus",
        "Spring",
        "Party",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Asparagus, Fingerling Potato, and Goat Cheese Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-fingerling-potato-and-goat-cheese-pizza-352629"
}
