{
    "directions": [
        "Preheat the oven to 375°F. In a 10-inch non-stick skillet simmer the asparagus in water to cover for 3 to 5 minutes, or until it is just tender. Drain the asparagus, rinse it under cold water, and pat it dry with paper towels. Cut the asparagus crosswise into 1/4-inch pieces and transfer the pieces to a bowl. In the skillet cook the onion with salt and pepper to taste in 1 tablespoon of the butter over moderate heat, stirring frequently, for 5 minutes. Add the sugar, cook the mixture, stirring, for 3 to 5 minutes, or until the onion is golden, and transfer the mixture to the bowl. Stir in the Gruyère, the tarragon, and salt and pepper to taste.",
        "In the skillet, cleaned, heat the remaining 1/2 tablespoon butter over moderate heat until it is melted, tilt the skillet to coat it, and remove it from the heat. In a bowl whisk the egg yolks with the flour and salt and pepper to taste until the mixture is thick and lemon-colored. In another bowl with an electric mixer beat the egg whites with a pinch of salt until they just hold stiff peaks, fold them into the yolk mixture gently but thoroughly, and pour the egg mixture into the skillet, spreading it evenly. (If the skillet handle is plastic, wrap it in a double thickness of foil.) Bake the omelet in the middle of the oven for 7 minutes, or until it is puffed and almost cooked through, spoon the filling down the middle of it, and with a spatula fold the omelet in half to enclose the filling. Bake the omelet in the middle of the oven for 1 minute more, or until the cheese is melted and the omelet is cooked through."
    ],
    "ingredients": [
        "1/2 pound asparagus, trimmed",
        "1 medium red onion, sliced thin",
        "1 1/2 tablespoons unsalted butter",
        "a pinch of sugar",
        "2/3 cup coarsely grated Gruyère",
        "1 tablespoon minced fresh tarragon leaves, or to taste",
        "4 large eggs, separated",
        "2 tablespoons all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Cheese",
        "Egg",
        "Onion",
        "Brunch",
        "Bake",
        "Vegetarian",
        "Asparagus",
        "Tarragon",
        "Simmer",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Asparagus, Gruyère, and Tarragon Souffleed Omelet",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-gruyere-and-tarragon-souffleed-omelet-12102"
}
