{
    "directions": [
        "Unfold pastry sheets and halve each parallel to fold lines. Roll out 1 half (keep remaining 3 halves chilled, covered with plastic wrap) into a 20- by 7-inch rectangle with a floured rolling pin on a well-floured surface. (Pastry will shrink slightly after rolling.) Brush off excess flour from work surface and both sides of pastry, then trim all edges with a sharp knife to make even. Cut crosswise into 6 (6 1/2- by 3-inch) rectangles.",
        "Brush rectangles with some egg wash and sprinkle each evenly with 1 packed tablespoon cheese, leaving a 1/2-inch border on long sides. Lay an asparagus stalk along 1 long side, then roll up asparagus in pastry, pressing seam to seal. Make more rolls with remaining pastry, cheese, and asparagus.",
        "Arrange rolls, seam sides down, about 1 inch apart on lightly oiled baking sheets and brush top and sides lightly with egg wash. Chill rolls until pastry is firm, at least 15 minutes.",
        "Preheat oven to 400°F.",
        "Bake rolls in batches in middle of oven until puffed and golden, about 16 minutes.",
        "Transfer with a metal spatula to a cutting board and trim about 1/2 inch from ends. Halve each roll crosswise, then, starting about 1/2 inch from either end, cut each section diagonally in half (see photo, opposite). Stand asparagus rolls on end, 2 by 2 on platters, and drizzle each with 1 drop of truffle oil (if using). Serve warm."
    ],
    "ingredients": [
        "1 (17 1/4-ounce) package frozen puff pastry sheets, thawed",
        "2 large egg yolks, lightly beaten with 2 tablespoons cold water",
        "5 ounce finely grated Parmigiano-Reggiano (1 3/4 cups packed)",
        "28 (3/4-inch-thick) asparagus (2 pounds), stalks trimmed to 6-inch lengths and tips reserved if desired",
        "3 tablespoons white or black truffle oil (1 1/2 ounces; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Vegetable",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Parmesan",
        "Asparagus",
        "Spring",
        "Phyllo/Puff Pastry Dough",
        "Gourmet"
    ],
    "title": "Asparagus Parmesan Pastry Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-parmesan-pastry-rolls-108150"
}
