{
    "directions": [
        "Whisk first 5 ingredients in small bowl. Gradually whisk in oil.",
        "DO AHEAD: Can be made 1 day ahead. Cover and refrigerate. Bring to room temperature and rewhisk beforeusing.",
        "Fill large bowl with lightly salted ice water; stir until salt dissolves. Cook asparagus in large pot of boiling salted water until crisp-tender, about 3 minutes. Drain, reserving 3 cups cooking liquid. Transfer asparagus to bowl of salted ice water to cool. Place green onions in another large bowl; pour hot reserved asparagus cooking liquid over onions and let stand until cool, about 30 minutes. Drain asparagus and green onions well. Transfer onions to clean kitchen towel and squeeze dry. DO AHEAD: Asparagus and onions can be made 1 day ahead. Wrap separately in several layers of paper towels, then enclose in resealable plastic bags and refrigerate.",
        "Combine green onions, cucumbers, and herbs in mixing bowl. Add dressing; toss to coat. Season with salt and pepper.",
        "Arrange asparagus on platter. Spoon cucumber mixture over and serve."
    ],
    "ingredients": [
        "3 tablespoons fresh lemon juice",
        "1 tablespoon red wine vinegar",
        "1 teaspoon Dijon mustard",
        "1 teaspoon coarse kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "3/4 cup extra-virgin olive oil",
        "3 pounds medium asparagus, trimmed",
        "4 cups thinly sliced green onions",
        "3 cups 1/4-inch cubes peeled seeded Kirby or English hothouse cucumbers",
        "1 tablespoon chopped fresh Italian parsley",
        "1 tablespoon chopped fresh chervil",
        "1 tablespoon chopped fresh chives",
        "1 tablespoon chopped fresh mint",
        "2 teaspoons chopped fresh tarragon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Onion",
        "Vegetarian",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Low Sodium",
        "Mint",
        "Asparagus",
        "Cucumber",
        "Healthy",
        "Low Cholesterol",
        "Tarragon"
    ],
    "title": "Asparagus, Green Onion, Cucumber, and Herb Salad",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-green-onion-cucumber-and-herb-salad-241637"
}
