{
    "directions": [
        "Put oven rack in middle position and preheat oven to 325°F. Butter an 8- by 2-inch round cake pan and line bottom with a round of wax paper, then butter paper. 3Steam asparagus in a steamer set over boiling water, covered, until very tender, 6 to 8 minutes. Purée asparagus in a food processor until smooth, 1 to 2 minutes. (You will have about 2 cups purée.)",
        "Whisk together eggs, milk, cheese, salt, pepper, and nutmeg in a bowl, then whisk in asparagus purée.",
        "Pour asparagus mixture into pan and bake in a hot water bath until flan is set and a wooden pick or skewer inserted in center comes out clean, 50 minutes to 1 hour.",
        "Transfer pan to a rack to cool slightly, 10 to 15 minutes.",
        "Put all sauce ingredients in a metal bowl, then set bowl over a pan of barely simmering water. Heat sauce, whisking until cheese and butter are melted, and then stirring with a wooden spoon, until sauce is slightly thickened and registers 165°F on an instant-read thermometer, 5 to 8 minutes. Remove bowl from pan.",
        "Run a thin knife around edge of flan to loosen, then invert a serving plate over pan and invert flan onto plate. Remove pan and discard paper. Cut flan into wedges and serve immediately with sauce."
    ],
    "ingredients": [
        "2 lb asparagus, trimmed",
        "4 large eggs",
        "1 1/3 cups whole milk",
        "2 tablespoons freshly grated Parmigiano-Reggiano",
        "1 1/4 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1/8 teaspoon freshly grated nutmeg, or to taste",
        "1/4 lb Italian Fontina, rind discarded and cheese coarsely grated (or cut into 1/4-inch dice if too soft to grate)",
        "1/2 cup whole milk",
        "2 large eggs yolks",
        "1 tablespoon butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Appetizer",
        "Bake",
        "Quick & Easy",
        "Asparagus",
        "Fontina",
        "Gourmet"
    ],
    "title": "Asparagus Flan with Cheese Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-flan-with-cheese-sauce-109425"
}
