{
    "directions": [
        "In a small saucepan simmer reserved asparagus ends in water, covered, 15 minutes. Remove and discard asparagus ends with slotted spoon and bring water to a boil. Add reserved asparagus tips and cook, uncovered, over high heat until crisp-tender, about 3 minutes. Transfer asparagus tips with slotted spoon to a colander, reserving cooking liquid, and rinse under cold water to stop cooking. Drain tips well.",
        "In a 4-quart heavy saucepan cook onions in butter with salt and pepper to taste over moderate heat, stirring until pale golden. Add asparagus stalk pieces, broth, and reserved cooking liquid and simmer, covered, 15 minutes, or until asparagus pieces are tender.",
        "Make basil cream while soup simmers: In a small saucepan bring cream to a boil and stir in basil and salt. Cook mixture over high heat, stirring, until basil is wilted, about 5 to 10 seconds, and in a blender purée mixture. Return basil cream to small saucepan and keep warm.",
        "Purée soup in cleaned blender in small batches and return to 4-quart saucepan, thinning with water if desired. Season soup with salt and pepper and heat over moderately low heat, stirring occasionally, until heated through.",
        "Divide soup among 6 bowls and add asparagus tips, arranging them decoratively. Drizzle basil cream over each serving."
    ],
    "ingredients": [
        "3 pounds asparagus, ends and tips cut off and reserved separately and stalks cut crosswise into 1-inch pieces",
        "2 1/2 cups water",
        "2 medium onions, chopped fine",
        "1 1/2 tablespoons unsalted butter",
        "2 cups chicken broth",
        "1/2 cup heavy cream",
        "1 1/2 cups packed fresh basil leaves",
        "1/2 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Vegetable",
        "Basil",
        "Asparagus",
        "Spring",
        "Gourmet"
    ],
    "title": "Asparagus Soup with Basil Cream",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-soup-with-basil-cream-10223"
}
