{
    "directions": [
        "Melt butter in heavy medium saucepan over medium-low heat. Add onion and garlic and sauté onion until translucent, about 8 minutes. Add flour and cook 2 minutes, stirring occasionally. Gradually whisk in milk. Simmer until mixture thickens, stirring constantly, about 2 minutes. Mix in lemon peel and nutmeg. Remove from heat. Season with salt and pepper. (Can be prepared 1 day ahead. Cover white sauce and refrigerate.)",
        "Grease 8-inch square baking pan. Steam asparagus over boiling salted water until just crisp-tender, about 6 minutes. Refresh under cold water; drain. Cut asparagus into 1-inch-pieces. Combine asparagus and ricotta in small bowl. Cook lasagne noodles in large pot of rapidly boiling salted water until just tender but still firm to bite, stirring occasionally. Drain. Rinse noodles with cold water and drain well.",
        "Spread 1/2 of white sauce in bottom of pan. Top with single layer of lasagne noodles, trimming to fit. Cover with 1/2 cup white sauce. Top with 1/2 of asparagus mixture. Top with half each of Swiss cheese and bacon. Top with another layer of noodles. Cover with remaining white sauce. Top with remaining asparagus mixture, Swiss cheese and bacon. Cover with remaining noodles. Drizzle top with tomato sauce. Sprinkle with Parmesan cheese. (Can be prepared 1 day ahead. Cover and refrigerate. Bring to room temperature before continuing.)",
        "Preheat oven to 350°F. Bake lasagne until heated through, about 20 minutes. Cool slightly before serving."
    ],
    "ingredients": [
        "2 tablespoons (1/4 sticks) butter",
        "1 medium onion, finely choppe",
        "2 garlic cloves, minced",
        "3 tablespoons all purpose flour",
        "2 cups lowfat milk",
        "1/2 teaspoon grated lemon peel",
        "1/4 teaspoon ground nutmeg",
        "3/4 pound asparagus",
        "1 1/2 cups ricotta cheese",
        "6 to 9 lasagne noodles",
        "1 1/3 cups shredded Swiss cheese (about 5 ounces)",
        "1 cup diced Canadian bacon (about 5 1/2 ounces)",
        "1/2 cup canned tomato sauce",
        "Freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Pork",
        "Tomato",
        "Vegetable",
        "Bake",
        "Asparagus",
        "Spring",
        "Indiana"
    ],
    "title": "Asparagus Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-lasagne-2565"
}
