{
    "directions": [
        "In a double boiler or a metal bowl set over a pan of simmering water melt butter. Add Fontina and milk and heat, stirring with a whisk, until cheese begins to melt. Whisk in yolks and cook, stirring constantly with whisk, until smooth and thickened slightly, about 7 minutes.",
        "Remove pan from heat and remove bowl from pan. Stir sauce 1 minute while water in pan cools slightly. Return bowl to pan and keep sauce warm over hot water (off heat), whisking occasionally to eliminate skin that forms on surface.",
        "Preheat broiler.",
        "On a baking sheet toast bread about 3 inches from heat, turning, until golden, about 1 to 2 minutes on each side. Rub tops of crostini with cut side of garlic and brush with oil. Season crostini lightly with salt. Divide crostini among 4 plates and top with prosciutto.",
        "In a deep 10- to 12-inch skillet bring 1 1/4 inches salted water to a boil and cook asparagus until crisp-tender, about 2 to 4 minutes. Transfer asparagus with tongs to a colander and drain. Divide asparagus among crostini. Pour fonduta over them."
    ],
    "ingredients": [
        "1 tablespoon unsalted butter",
        "1/4 pound Italian Fontina cheese,* rind discarded, cut into 1/4-inch dice (3/4 cup)",
        "1/2 cup milk",
        "2 large egg yolks",
        "four 1/2-inch-thick slices from a large round crusty loaf of bread (about 8 to 9 inches across)",
        "1 large garlic clove, halved crosswise",
        "2 tablespoons extra-virgin olive oil",
        "1/4 pound thinly sliced prosciutto",
        "1 pound thin asparagus, trimmed and lower 2 inches of stalks peeled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Appetizer",
        "Broil",
        "Asparagus",
        "Prosciutto",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Asparagus and Prosciutto Crostini with Fonduta",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-and-prosciutto-crostini-with-fonduta-10215"
}
