{
    "directions": [
        "In a large heavy saucepan cook the leek, the onion, and the celery with salt and pepper to taste in the butter over moderate heat, stirring, until the vegetables are softened, add the asparagus pieces, the broth, and the water, and simmer the mixture, covered for 10 to 15 minutes, or until the asparagus is tender. Purée the soup in batches in a blender or food processor until it is smooth, transferring it as it is puréed to another large heavy saucepan, and let it cool to lukewarm.",
        "In a saucepan of boiling water cook the reserved asparagus tips for 3 to 4 minutes, or until they are tender, and transfer them with a slotted spoon to a bowl of ice and cold water to stop the cooking. Drain the asparagus tips and reserve them.",
        "In a heatproof bowl whisk together the eggs and 1/4 cup of the lemon juice, add 1 cup of the lukewarm soup in a stream, whisking, and whisk the egg mixture into the remaining soup. Cook the soup over moderately low heat, whisking and being careful not to let it boil, until it is thickened slightly and registers 160°F. on a candy thermometer and whisk in the minced dill, the additional lemon juice, and salt and pepper to taste. (The soup may be prepared up to this point 1 day in advance and kept covered and chilled. To reheat the soup, cook it over low heat, stirring, until it is hot, being careful not to let it boil.) Serve the soup either hot or chilled, garnished with the reserved asparagus tips and the dill sprigs."
    ],
    "ingredients": [
        "1 1/3 cups finely chopped white part of leek, washed well and drained",
        "1 1/3 cups finely chopped onion",
        "1 cup thinly sliced celery",
        "2 tablespoons unsalted butter",
        "3 pounds asparagus, trimmed and cut into 1-inch pieces, reserving about 30 tips for garnish",
        "4 cups chicken broth",
        "2 cups water",
        "3 large eggs",
        "1/4 cup fresh lemon juice plus additional to taste if desired",
        "3 tablespoons minced fresh dill",
        "dill sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Food Processor",
        "Egg",
        "Easter",
        "Lemon",
        "Asparagus",
        "Spring",
        "Healthy",
        "Dill",
        "Gourmet"
    ],
    "title": "Asparagus and Dill Avgolemono Soup",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-and-dill-avgolemono-soup-11905"
}
