{
    "directions": [
        "Cut leeks crosswise into 1/2-inch slices and in a bowl soak in water, agitating occasionally to dislodge any sand, 5 minutes. Lift leeks out of water and drain in a colander.",
        "Quarter potatoes. In a 12- to 14-inch non-stick skillet, heat 1 tablespoon oil over moderately high heat until hot but not smoking and sauté potatoes with salt to taste, stirring occasionally, until golden, about 5 minutes. Transfer potatoes to a bowl.",
        "In skillet, heat 1 tablespoon oil until hot but not smoking and sauté leeks, stirring occasionally and shaking skillet, until lightly browned, about 3 to 4 minutes. Transfer leeks to bowl with potatoes.",
        "In skillet, heat remaining tablespoon oil until hot but not smoking and sauté asparagus, stirring occasionally, 2 minutes. Add mushrooms and sauté mixture, stirring occasionally, until mushrooms are softened, about 3 minutes.",
        "Add broth and bring to a boil. Add potatoes and leeks and simmer, covered, until vegetables are tender, about 5 minutes.",
        "Squeeze a little lemon juice over vegetables and stir in mint, parsley, and salt and pepper to taste."
    ],
    "ingredients": [
        "2 large leeks (white and pale green parts only)",
        "1 pound small red potatoes",
        "3 tablespoons olive oil",
        "1 pound asparagus, trimmed and cut diagonally into 1-inch pieces",
        "1/2 pound fresh shiitake mushrooms, stems discarded and caps quartered",
        "1 1/2 cups chicken broth",
        "1/2 lemon",
        "1/4 cup chopped fresh mint leaves",
        "3 tablespoons finely chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Potato",
        "Vegetable",
        "Side",
        "Sauté",
        "Low Cal",
        "Asparagus",
        "Leek",
        "Spring",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Asparagus, Leek, Shiitake and Potato Ragoût",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-leek-shiitake-and-potato-ragout-10227"
}
