{
    "directions": [
        "Half-fill a large bowl with ice water. Place a steamer rack insert in a large pot. Fill the pot with water so it reaches just below the steamer rack. Place the pot over high heat, cover it with a lid, and bring the water to a boil. Add the asparagus, cover the pot (leaving the lid slightly ajar), and steam the asparagus until crisp-tender, 3 to 5 minutes, depending on thickness. Transfer the asparagus to the bowl of ice water to stop the cooking. Drain well. Meanwhile, in a small bowl, mix the horseradish and sour cream until well combined. Season with salt and pepper. Lay 1 1/2 ounces of the beef on a flat work surface or cutting board. Spread one-quarter (about 1/2 tablespoon) of the horseradish mixture over the beef, leaving a small border. Place 3 asparagus spears at one of the narrower ends of each beef slice so the tips hang over. Roll the beef around the bundle of asparagus until you reach the other end of the beef. Repeat with the remaining roast beef, horseradish mixture, and asparagus to create 3 more roll-ups. Serve immediately.",
        "Follow the directions above, except instead of steaming the asparagus, add 1 tablespoon of water and the asparagus to a medium microwave-safe bowl or dish. Cover the dish with a microwave-safe plate. Microwave on high for 1 to 2 minutes, or until the asparagus is crisp tender. Transfer the asparagus to a bowl of ice water to stop the cooking. Drain well."
    ],
    "ingredients": [
        "12 medium asparagus spears, trimmed by snapping off the ends where they break naturally",
        "1 teaspoon prepared horseradish, or more to taste",
        "2 tablespoons light sour cream",
        "Salt and pepper, to taste",
        "6 ounces thinly sliced or shaved Simple Grilled London Broil, Pot Roast, or extra-lean deli roast beef"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Microwave",
        "Beef",
        "Vegetable",
        "Steam",
        "Meat",
        "Asparagus",
        "Spring",
        "Party"
    ],
    "title": "Asparagus Roast Beef Roll-Ups",
    "url": "http://www.epicurious.com/recipes/food/views/asparagus-roast-beef-roll-ups-363388"
}
