{
    "directions": [
        "Cover potatoes with salted cold water by 1 inch in a 4-quart pot and boil, uncovered, until tender, 10 to 15 minutes. Drain in a colander and halve if large.",
        "While potatoes boil, steam asparagus in a steamer set over boiling water, covered, until crisp-tender, 3 to 5 minutes. Transfer with a slotted spoon to a bowl of ice and cold water to stop cooking, then pat dry.",
        "Steam sugar snaps in steamer set over boiling water, covered, until crisp-tender, about 1 minute. Transfer with slotted spoon to ice water to stop cooking, then pat dry.",
        "Preheat broiler.",
        "Cut cauliflower into large florets (about 3 inches long and 2 inches wide), then cut florets lengthwise through stem into flat 1/2-inch-wide slices. Gently toss with oil and salt to taste in a bowl and arrange in 1 layer on a broiler pan. Broil 3 inches from heat, turning over once, until cauliflower is crisp-tender and edges are brown, about 5 minutes total.",
        "Arrange cooked vegetables (warm or at room temperature), bell peppers, and tomatoes separately or mixed on 1 or 2 platters and serve with dips: anchovy mayonnaise, cilantro chutney, and romesco sauce."
    ],
    "ingredients": [
        "1 lb small red potatoes",
        "1 lb asparagus, trimmed",
        "1/2 lb sugar snap peas, trimmed",
        "1 small head cauliflower (1 1/4 lb)",
        "1 tablespoon olive oil",
        "3 mixed red and yellow bell peppers, cut into 1/2-inch-wide strips",
        "1 pt assorted cherry tomatoes",
        "Accompaniment: anchovy mayonnaise , cilantro chutney , romesco sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Tomato",
        "Side",
        "Broil",
        "Steam",
        "Vegetarian",
        "Quick & Easy",
        "Asparagus",
        "Cauliflower",
        "Bell Pepper",
        "Summer",
        "Sugar Snap Pea",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Assorted Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/assorted-vegetables-232483"
}
