{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Toss raisins and 1 teaspoon flour together in a saucepan until raisins are coated in flour. Stir 1/4 cup sugar, 1 teaspoon vanilla extract, and lemon juice into raisins. Pour 1 cup boiling water over raisin mixture; bring mixture to a boil. Cook, stirring constantly, until raisins start to break down and mixture thickens, 5 to 10 minutes. Remove from heat and cool to room temperature.",
        "Stir 2 3/4 cups flour, 3/4 cup sugar, and salt together in a bowl.",
        "Whisk melted shortening and molasses together in another bowl; stir in remaining vanilla extract. Dissolve baking soda in 1/3 cup boiling water. Stir soda water into molasses mixture until mixture foams and is well-combined. Stir flour mixture and molasses mixture together in a large bowl until a stiff dough forms.",
        "Divide dough into 2 balls; 1 dough ball for the bottom cookie rounds and 1 ball for the top cookie rounds. Cover 1 dough ball with a damp paper towel; roll remaining dough ball out to 1/8-inch thickness. Cut dough into rounds using the top of a glass or a round cookie cutter. Place these bottom rounds 2-inches apart on a baking sheet. Top each dough round with 1 tablespoon of raisin filling mixture.",
        "Roll out remaining dough ball to 1/8-inch thickness and cut into rounds using the same cutter. Moisten fingers slightly with water and carefully work each top round from the center outwards until each is about 1/4-inch larger around than the bottom round. Working from one edge, place top round over bottom round and filling, pressing firmly to seal the cookie. Lightly press down tops of cookies to settle filling in the pocket.",
        "Bake in the preheated oven until cookie is set, 10 to 12 minutes. Cool briefly on the baking sheet before transferring to a wire rack to cool completely."
    ],
    "ingredients": [
        "Filling:",
        "1 cup raisins",
        "1 teaspoon all-purpose flour",
        "1/4 cup sugar",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon lemon juice",
        "1 cup boiling water",
        "Dough:",
        "2 3/4 cups all-purpose flour",
        "3/4 cup sugar",
        "3/4 teaspoon salt",
        "1/2 cup shortening, melted",
        "1/2 cup molasses",
        "1 teaspoon vanilla extract",
        "1 teaspoon baking soda",
        "1/3 cup boiling water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Aunt Clara's Filled Molasses Cookies",
    "url": "http://allrecipes.com/recipe/240774/aunt-claras-filled-molasses-cookies/"
}
