{
    "directions": [
        "In a large bowl, mix together the suet and 1 cup brown sugar until smooth. Stir in the carrot, potato, egg, salt and vanilla. Mix in enough buttermilk to make a loose batter. Sift 1/2 cup of flour, baking soda, cinnamon, cloves and nutmeg into a separate bowl. Stir into the carrot mixture just until blended. Fold in the raisins, currants, cherries and mixed fruit.",
        "Grease the inside of two wide mouth pint jars. Divide the mixture evenly between the two jars filling about 3/4 full. Cover with lids, but only screw the rings on enough so they don't fall off. The cake will need to expand while cooking. Place a rack or trivet in the bottom of a large pot to keep the jars off of the bottom. Fill the pot with enough water to come halfway up the sides of the jars. Cover the pot with a lid and bring the water to a boil.",
        "Steam the pudding for 3 hours. Carefully remove the jars and adjust the lids and screw on the rings. Allow to cool to room temperature. The lids should snap down to seal as they cool. Allow the pudding to age for a few weeks before serving.",
        "Before serving, make the sauce: In a small saucepan, stir together 1/2 cup brown sugar, salt and 1 tablespoon of flour until there are no lumps. Stir in the water and bring to a boil. Simmer over medium heat until thickened, about 5 minutes.",
        "Serve the pudding warm, or slice and fry in butter before spooning the sauce over the top."
    ],
    "ingredients": [
        "1 cup ground beef suet",
        "1 cup brown sugar",
        "1 cup grated carrots",
        "1 cup grated raw potatoes",
        "1 egg",
        "1 teaspoon salt",
        "1 tablespoon vanilla extract",
        "2 tablespoons buttermilk",
        "1/2 cup all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground nutmeg",
        "1/2 cup black raisins",
        "1/2 cup dried currants",
        "1/2 cup candied cherries",
        "1/2 cup candied mixed fruit peel",
        "1/2 cup brown sugar",
        "1 tablespoon all-purpose flour",
        "1 pinch salt",
        "1 cup water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Aunt Caroline's Christmas Pudding",
    "url": "http://allrecipes.com/recipe/133693/aunt-carolines-christmas-pudding/"
}
