{
    "directions": [
        "Place a rack into the lower third of oven.",
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Grease and flour a cake mold pan (such as a bunny cake or train cake mold) using vegetable shortening.",
        "Sift flour, baking powder, and salt in a bowl.",
        "Mix 1 1/3 cup milk, lemon extract, 1 1/4 teaspoons vanilla extract, and orange extract in a separate bowl.",
        "Beat unsalted butter in a large mixing bowl with an electric mixer on medium speed until butter is creamy and smooth, 1 to 2 minutes. Beat in white sugar and continue beating until the mixture is light and fluffy, about 5 more minutes. Scrape the sides of the bowl occasionally.",
        "Beat in eggs, one at a time, beating each egg in thoroughly before adding the next.",
        "Reduce mixer speed to low and beat in flour mixture in several additions, alternating with milk mixture; begin and end with flour mixture. Do not overbeat. Scrape bowl occasionally.",
        "Pour batter evenly into prepared cake pan.",
        "Bake in the preheated oven until lightly browned and a toothpick inserted into the middle of the cake comes out clean, 30 to 45 minutes.",
        "Place cake in pan on a wire rack and allow to cool for 15 minutes before inverting pan to remove cake. Allow cake to completely cool on wire rack, 3 to 4 hours.",
        "Beat vegetable shortening, 1/2 cup butter, confectioners' sugar, 2 tablespoons milk, and 1 teaspoon clear vanilla extract in a bowl until frosting is smooth and creamy.",
        "Pack the frosting into a heavy resealable plastic bag; force the frosting into one corner of the bag. Clip a small corner off the plastic bag, seal the bag, and pipe the frosting onto the cooled cake in desired pattern."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1 3/4 teaspoons baking powder",
        "1 1/4 teaspoons salt",
        "1 1/3 cups milk at room temperature",
        "1 1/2 teaspoons lemon extract",
        "1 1/4 teaspoons vanilla extract",
        "3/4 teaspoon orange extract",
        "1 1/8 cups unsalted butter at room temperature",
        "2 cups white sugar",
        "4 eggs at room temperature",
        "1/2 cup vegetable shortening",
        "1/2 cup butter at room temperature",
        "4 cups confectioners' sugar",
        "2 tablespoons milk at room temperature",
        "1 teaspoon clear vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Aunt Mary's Delicious Bunny Cake",
    "url": "http://allrecipes.com/recipe/220930/aunt-marys-delicious-bunny-cake/"
}
