{
    "directions": [
        "Preheat oven to 375°F. and lightly butter and flour three 9- by 2-inch round cake pans, knocking out any excess flour.",
        "In a bowl with an electric mixer beat together sugar, shortening, and margarine until light and fluffy. Add egg yolks, 1 at a time, beating well after each addition. Into another bowl sift together flour, baking soda, and salt. Beat flour mixture into egg mixture in 2 batches alternately with buttermilk, beginning and ending with flour mixture, until combined. Beat in vanilla, coconut, and chopped pecans. Beat egg whites in another bowl until they just hold stiff peaks and fold into batter gently but thoroughly.",
        "Divide batter among pans, smoothing tops, and bake in upper two thirds of oven, switching position of pans in oven halfway through baking, until a tester comes out clean, about 30 minutes. Cool cake layers in pans on racks 10 minutes and invert onto racks to cool completely.",
        "In a bowl with an electric mixer beat together cream cheese, margarine, and vanilla until smooth. Gradually beat in confectioners' sugar, beating until creamy.",
        "Stack cake layers on a cake plate, spreading about 1/2 cup frosting between each layer. Spread remaining frosting on top and side of cake."
    ],
    "ingredients": [
        "2 cups granulated sugar",
        "1 1/2 cups vegetable shortening, softened",
        "1 stick (1/2 cup) margarine, softened",
        "5 large eggs, separated",
        "2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup well-shaken buttermilk",
        "1 teaspoon vanilla",
        "2 cups sweetened flaked coconut",
        "1 cup chopped pecans",
        "an 8-ounce package cream cheese, softened",
        "1 stick (1/2 cup) margarine, softened",
        "1 teaspoon vanilla",
        "a 1-pound box confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Coconut",
        "Pecan",
        "Gourmet",
        "Louisville",
        "Kentucky"
    ],
    "title": "Aunt Tom's Italian Cream Cake",
    "url": "http://www.epicurious.com/recipes/food/views/aunt-toms-italian-cream-cake-11985"
}
