{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C). Grease and flour a 10 inch Bundt pan. Mix together the flour, baking soda, salt, allspice, cinnamon and nutmeg. Set aside.",
        "In a medium bowl, whisk together 1 1/2 cups sugar, oil, eggs, milk and 1/4 cup rum until blended.  Make a well in the center of the dry ingredients.  Pour in the rum mixture, stirring until combined.  Stir in the walnuts.",
        "Pour batter into prepared pan. Bake in the preheated oven for 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool in the pan.  Pierce cake from 15 to 20 times with a wooden skewer to prepare the cake for the rum glaze.",
        "Rum Glaze: In a saucepan, melt 1 cup of butter in water, then bring to a slow boil.  Stir in 1 cup sugar and continue to boil for 5 minutes, stirring constantly.  Let mixture cool for 5 minutes, then mix in 10 ounces rum.  Let cool 15 minutes, then apply the rum glaze to the cake.",
        "To apply Rum Glaze: Gradually drizzle a small amount of the rum glaze over the top of the skewered cake while it is still in the pan.  When the top of the cake cannot absorb any more glaze, turn it out of the pan and onto a plate to repeat the procedure on the bottom of the cake.  Let the cake sit until the glaze has soaked in, then repeat the procedure from the beginning, putting the cake back into the pan to glaze the top.  It may take 24 hours for the cake to completely absorb all of the rum glaze."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 pinch salt",
        "1 teaspoon ground allspice",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground nutmeg",
        "1 1/2 cups white sugar",
        "1/2 cup vegetable oil",
        "3 eggs",
        "1/2 cup milk",
        "1/4 cup dark rum",
        "3/4 cup chopped black walnuts",
        "1 cup butter",
        "1/4 cup water",
        "1 cup white sugar",
        "10 fluid ounces dark rum"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Aunt T's D.W.I. Rum Cake",
    "url": "http://allrecipes.com/recipe/21581/aunt-ts-dwi-rum-cake/"
}
