{
    "directions": [
        "In a small heatproof bowl plump currants in boiling-hot water 15 minutes and drain. Pat currants dry between paper towels. In a food processor or in a bowl with an electric mixer blend together well cream cheese, jam, yolks, zest, and vanilla. In a bowl with an electric mixer (beaters cleaned if necessary) beat whites with a pinch of salt until they hold soft peaks. Add sugar to whites and beat meringue until it holds stiff peaks. Fold cheese mixture into meringue gently but thoroughly and fold in currants.",
        "Preheat oven to 400°F. and lightly butter a 14-inch-long oval gratin dish or other 2 1/2-quart shallow baking dish.",
        "Working with 1 crêpe at a time, spread 2 generous tablespoons filling on each crêpe, leaving a 1/2-inch border all around, and roll up crêpes jelly-roll fashion. With a sharp knife cut crêpes on a diagonal in half and arrange, overlapping slightly, in layers in baking dish. Crêpes may be prepared up to this point 4 hours ahead and chilled, covered. Bring crêpes to at room temperature before proceeding.",
        "In a small bowl whisk together eggs, granulated sugar, and milk and pour over crêpes, letting custard seep between layers. Bake crêpes in middle of oven 30 to 35 minutes, or until puffed and custard is set, and cool to warm.",
        "Dust crêpes with confectioners' sugar and serve with apricot caramel sauce."
    ],
    "ingredients": [
        "1/2 cup dried currants",
        "1 cup boiling-hot water",
        "two 8-ounce packages cream cheese, softened",
        "1/2 cup apricot jam",
        "2 large eggs, separated",
        "1 teaspoon freshly grated lemon zest",
        "1 teaspoon vanilla",
        "1/4 cup granulated sugar",
        "about 25 Austrian crêpes",
        "2 large eggs",
        "3 tablespoons granulated sugar",
        "1 cup milk",
        "confectioners' sugar for dusting",
        "Accompaniment: apricot caramel sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Currant",
        "Apricot",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Austrian Sweet Cheese Crepes Baked in Custard",
    "url": "http://www.epicurious.com/recipes/food/views/austrian-sweet-cheese-crepes-baked-in-custard-13508"
}
