{
    "directions": [
        "First, make the sourdough starter. Crumble the yeast into a large bowl. Whisk in 1 quart of warm water and 2 tablespoons of sugar until dissolved. The water should be just slightly warmer than body temperature. Gradually whisk in 4 cups of flour, continuing to mix until all lumps are gone. Cover with a dish towel, and let sit for 24 hours at room temperature.",
        "After 24 hours, stir well, cover, and let stand another 24 hours. It will be a thin, light-colored sourdough which is then ready to use.",
        "In a large bowl, stir together the rye flour, 4 cups of all-purpose flour, salt and sugar. Mix in the sourdough starter using a wooden spoon, then stir in 2 cups of warm water. I transfer the dough to a heavy duty stand mixer to mix the first couple of minutes, then it can't handle the heavy dough and I start using my hands by turning the dough out onto a floured surface. A clean countertop works best. Knead the dough, adding a few tablespoons of water at a time if it is too stiff. Fold the dough over, pull it apart, whatever you can do to get it kneaded up good. Total kneading time should be 15 to 20 minutes to get a smooth dough. Place the dough in a large bowl, cover, and let rise until doubled, 1 to 2 hours.",
        "When the dough has risen, scrape it out of the bowl and back onto a floured surface. Knead for about 5 minutes. This is important to activate the gluten. Shape into 1 or 2 long loaves. Place on baking sheets, and let rise for about 1 hour, or until your finger leaves an impression when you poke the bread gently.",
        "Preheat the oven to 425 degrees F (220 degrees C). Bake the bread for about 45 minutes for 2 loaves, 1 1/2 hours if you made one big loaf. Don't worry if the crust is dark. The bread will be delicious and so will the crust. Cool completely before cutting. I always freeze half."
    ],
    "ingredients": [
        "1 1/2 ounces compressed fresh yeast",
        "1 quart warm water",
        "2 tablespoons white sugar",
        "4 cups all-purpose flour",
        "8 cups white rye flour",
        "4 cups all-purpose flour",
        "2 tablespoons salt",
        "1 teaspoon white sugar",
        "2 cups warm water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Authentic German Bread (Bauernbrot)",
    "url": "http://allrecipes.com/recipe/88506/authentic-german-bread-bauernbrot/"
}
