{
    "directions": [
        "Toast guajillo chiles, ancho chiles, and chipotle chiles in a dry pan over medium heat, stirring constantly, until warm and aromatic, about 3 minutes. Transfer to the blender with chicken broth.",
        "Heat 2 cups chicken broth in a saucepan until it begins to simmer, about 5 minutes. Pour broth into a blender.",
        "Toast dinner roll pieces and tortilla strips in a dry pan over medium heat, stirring constantly, until lightly browned, about 3 minutes. Transfer to the blender with chicken broth and chiles",
        "Allow the chiles and toasted bread and tortillas to soak, fully submerged, in the chicken broth until softened, about 10 minutes. Blend the mixture until smooth.",
        "Cook tomatoes and tomatillos in a dry skillet on medium-high heat until soft and blackened, 3 to 4 minutes per side. Place tomatoes in the blender with the chile puree.",
        "Melt lard in a large skillet over medium heat. Stir in onion, garlic, peanuts, raisins, cumin seeds, thyme, cinnamon sticks, cloves, and allspice berries; cook and stir until onions are soft and golden, 5 to 8 minutes. Remove the cinnamon sticks and other whole spices; add onion mixture to the blender with the chile-tomato mixture and blend until smooth.",
        "Pour chile puree into a large saucepan over medium heat. Stir in chocolate chicken broth, sugar, and salt. Bring mixture to a simmer; stir until chocolate is melted and sauce is thickened and slightly reduced, 10 to 15 minutes."
    ],
    "ingredients": [
        "2 cups chicken broth",
        "2 dried guajillo chiles, stemmed and seeded",
        "2 dried ancho chiles, stemmed and seeded",
        "3 dried chipotle chiles, stemmed and seeded",
        "1 dinner roll, torn into pieces",
        "2 corn tortillas, cut into 1-inch strips",
        "2 tomatoes, cut in half crosswise",
        "5 tomatillos, cut in half crosswise",
        "1 tablespoon lard",
        "1 onion, halved and thinly sliced",
        "1/2 head garlic, peeled and sliced",
        "1/3 cup chopped peanuts",
        "1/4 cup raisins",
        "2 tablespoons cumin seeds",
        "1 tablespoon dried thyme",
        "3 cinnamon sticks",
        "5 whole cloves",
        "6 whole allspice berries",
        "5 ounces dark chocolate, coarsely chopped",
        "1 cup chicken broth",
        "3 tablespoons white sugar",
        "1 teaspoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Authentic Mole Sauce",
    "url": "http://allrecipes.com/recipe/223261/authentic-mole-sauce/"
}
