{
    "directions": [
        "Combine 2 1/2 cups flour, 1 tablespoon sugar, and 1/4 teaspoon salt in a large bowl. Cut in butter and shortening with a pastry blender or 2 knives until mixture resembles coarse crumbs. Stir in ice water, 1 tablespoon at a time, until mixture forms a ball. Divide dough in half and flatten each half into a 5-inch disk. Wrap in plastic wrap and chill at least 1 hour or up to 8 hours (overnight).",
        "Combine 1 cup sugar, 3 tablespoons flour, cinnamon, ginger, nutmeg, and 1/4 teaspoon salt in large bowl. Add apples and pears and toss to coat well.",
        "Preheat oven to 425 degrees F (220 degrees C). Position 2 racks in lower third of oven. Put a sheet of foil just a few inches larger than pie plate on bottom rack to catch drips.",
        "Roll out 1 piece of dough into a 12-inch round (about 1/8 inch thick) on a lightly floured work surface with a floured rolling pin. Line a 9-inch pie plate with pastry and trim overhang to 1/2 inch with kitchen shears or a paring knife. Roll  out remaining dough in same manner and cut into 10 strips (3/4 to 1 inch wide) for a lattice.",
        "Mound apple and pear filling into crust. Brush crust rim with some of egg wash. Dot filling with butter. Lay 5 strips of dough parallel across pie, about 1 inch apart, letting excess hang over rim. Lay remaining strips diagonally across pie in opposite direction. Press ends firmly to rim of pie, trimming excess dough. Crimp edges with your fingers or fork tines. Brush with remaining egg wash. Sprinkle with remaining tablespoon sugar.",
        "Bake pie in lower third of oven for 15 minutes, then reduce temperature to 375 degrees F (190 degrees C) and bake until juices in center of pie are bubbling, about 45 minutes more. (Loosely cover pie with a sheet of foil if browning too quickly.) Transfer pie to a wire rack and cool 2 hours."
    ],
    "ingredients": [
        "Pastry:",
        "2 1/2 cups flour",
        "1 tablespoon sugar",
        "1/4 teaspoon salt",
        "3/4 cup cold butter, cut into small pieces",
        "6 tablespoons cold shortening, cut into small pieces",
        "8 tablespoons ice water, or as needed",
        "Filling:",
        "1 cup sugar",
        "3 tablespoons flour",
        "3/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon nutmeg",
        "1/4 teaspoon salt",
        "1 2/3 pounds Granny Smith apples - peeled, cored and cut into 1/4-inch-thick slices",
        "1 2/3 pounds firm ripe Anjou pears - peeled, cored and cut into 1/4-inch-thick slices",
        "1 egg yolk",
        "2 teaspoons water",
        "1 tablespoon butter, cut into bits",
        "1 tablespoon white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Autumn Apple and Pear Lattice Pie",
    "url": "http://allrecipes.com/recipe/255357/autumn-apple-and-pear-lattice-pie/"
}
