{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.",
        "Pour about 1 inch of water into the bottom of a pan. Place the squash into a steamer basket fitted into the pan. Bring to a boil, then reduce heat to medium, cover, and steam the squash until tender and easily pierced with a fork, about 15  minutes. Cool.",
        "Place the squash, 2/3 cup brown sugar, 1/2 cup all-purpose flour, eggs, milk, vanilla, 2 teaspoons cinnamon, nutmeg, and cloves in the bowl of a food processor. Pulse until the mixture is smooth. Pour into a large mixing bowl. Stir in the apples, carrots, and raisins until evenly blended. Spread the mixture over the bottom of the prepared baking dish.",
        "Mix together the rolled oats, wheat bran, 1 cup brown sugar, 1/2 cup whole wheat flour, and 1 tablespoon cinnamon with the melted butter in a bowl until crumbly. Spoon the topping over the apple-squash mixture.",
        "Bake in preheated oven until top is golden brown and the apples are tender, 30 to 45 minutes."
    ],
    "ingredients": [
        "4 1/2 cups butternut squash - peeled, seeded, and cut into 3/4-inch chunks",
        "2/3 cup packed brown sugar",
        "1/2 cup all-purpose flour",
        "2 eggs",
        "2 teaspoons milk",
        "2 teaspoons vanilla extract",
        "2 teaspoons ground cinnamon",
        "2 teaspoons ground nutmeg",
        "1/2 teaspoon ground cloves",
        "4 large Granny Smith apple - peeled, cored and chopped",
        "2 large carrots, peeled and shredded",
        "1 cup raisins",
        "Topping",
        "2 cups rolled oats",
        "1 cup wheat bran",
        "1 cup packed brown sugar",
        "1/2 cup whole wheat flour",
        "1 tablespoon ground cinnamon",
        "1/2 cup melted butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Autumn Apple-Squash Crisp",
    "url": "http://allrecipes.com/recipe/93476/autumn-apple-squash-crisp/"
}
