{
    "directions": [
        "Boil juice in small saucepan until reduced to 1/2 cup, about 6 minutes. Remove from heat. Add chocolate and let stand 1 minute; whisk until melted and smooth. Stir in brandy and vanilla. (Sauce can be prepared 4 days ahead. Cover and chill. Rewarm before serving.)",
        "Combine 1 cup juice, wine, star anise, and cinnamon in large saucepan. Scrape in seeds from vanilla bean; add bean. Bring to simmer. Remove from heat. Cover; let stand 10 minutes. Add cherries and prunes. Cover and simmer until fruit is plump, about 5 minutes. Discard star anise, cinnamon, and vanilla bean. Mix in apples and sugar; simmer until apples are tender but hold shape and liquid is reduced to 3 tablespoons, stirring occasionally, about 45 minutes.",
        "Mix cornstarch and 2 tablespoons apple juice. Add to filling; stir over medium-high heat until filling thickens and boils, about 3 minutes. (Can be made 3 days ahead. Cool slightly, cover, and chill.)",
        "Preheat oven to 375°F. Lightly butter heavy large baking sheet. Blend first 3 ingredients in processor until nuts are finely ground.",
        "Place dry kitchen towel on work surface. Place 1 phyllo sheet on towel (cover remaining phyllo with plastic wrap and damp towel). Brush phyllo lightly with melted butter. Top with second phyllo sheet; brush with butter. Sprinkle with scant 3 tablespoons nut mixture. Continue with 6 more phyllo sheets, brushing each with butter and sprinkling with scant 3 tablespoons nut mixture. Top with remaining phyllo sheet. Brush with butter. Spoon filling atop phyllo stack in 12x3-inch log, starting 2 inches from 1 long side and 2 1/2 inches from each short side. Fold short edges over filling. Using towel as aid and beginning at edge close to filling, roll up strudel jelly-roll style. Place strudel, seam side down, on prepared baking sheet. Brush strudel with butter. (Can be made 4 hours ahead. Chill.)",
        "Bake strudel uncovered until golden, about 45 minutes. Let cool at least 30 minutes. Cut warm or room-temperature strudel into slices; place on plates. Serve with ice cream and warm chocolate sauce.",
        "*Brown star-shaped seedpods sold at Asian markets and specialty foods stores and in the spice section of some supermarkets."
    ],
    "ingredients": [
        "1 cup apple juice",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 tablespoon brandy",
        "1/2 teaspoon vanilla extract",
        "1 cup plus 2 tablespoons apple juice",
        "1/2 cup dry white wine",
        "3 whole star anise*",
        "1 cinnamon stick",
        "1 vanilla bean, split lengthwise",
        "1/3 cup (packed) dried Bing cherries",
        "1/3 cup (packed) pitted prunes, halved",
        "1 1/4 pounds Braeburn apples, peeled, cored, cut into 1/2-inch cubes",
        "1/3 cup (packed) golden brown sugar",
        "1 1/2 tablespoons cornstarch",
        "2/3 cup hazelnuts, toasted, husked",
        "1/2 cup graham cracker crumbs",
        "3 tablespoons sugar",
        "9 17x12-inch sheets fresh phyllo pastry or frozen, thawed",
        "1/2 cup unsalted butter, melted",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Prune",
        "Apple",
        "Cherry",
        "Brandy",
        "White Wine",
        "Fall",
        "Hazelnut",
        "Anise",
        "Phyllo/Puff Pastry Dough",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Autumn Apple Strudel",
    "url": "http://www.epicurious.com/recipes/food/views/autumn-apple-strudel-108643"
}
