{
    "directions": [
        "Lightly oil ramekins and line bottoms with wax paper or parchment, then oil paper.",
        "Quarter, pit, and peel 2 avocados. Purée avocado quarters with 1 tablespoon lemon juice, vitamin C, and salt in a food processor until smooth.",
        "Sprinkle gelatin over milk in a small heavy saucepan and let soften 1 minute. Heat over low heat, stirring, until gelatin is dissolved, 1 to 2 minutes, then remove from heat. Add to avocado purée and blend until smooth.",
        "Halve, pit, and peel remaining avocado. Cut into 1/4-inch dice and toss with remaining teaspoon lemon juice in a small bowl. Beat cream in a bowl with an electric mixer at medium speed until it just holds soft peaks. Fold in avocado purée gently but thoroughly, then fold in diced avocado. Spoon mousse into ramekins, smoothing tops. Cover surface of each mousse with a piece of plastic wrap, then cover ramekins with plastic wrap. Chill mousse until set, at least 2 hours.",
        "Whisk together vinegar, sugar (to taste), salt, and pepper in a bowl until sugar is dissolved, then stir in tomatoes, papaya, onion, and tarragon. Let stand at room temperature 1 hour (for flavors to develop).",
        "Unmold mousse by running a knife around edge of each ramekin, then invert each onto a plate, discarding paper. Serve with relish."
    ],
    "ingredients": [
        "3 firm-ripe California avocados (1 1/2 to 1 3/4 lb total)",
        "1 tablespoon plus 1 teaspoon fresh lemon juice",
        "1 (500-mg) vitamin C tablet, crushed to a powder",
        "1/2 teaspoon salt",
        "1 1/4 teaspoons unflavored gelatin (from a 1/4-oz envelope)",
        "3 tablespoons whole milk",
        "1/3 cup chilled heavy cream",
        "3 tablespoons tarragon white-wine vinegar",
        "1 to 2 tablespoons sugar",
        "1/4 teaspoon salt",
        "1/8 teaspoon black pepper",
        "1/4 lb grape tomatoes, cut into 1/4-inch dice (1/2 cup)",
        "1/2 lb papaya, peeled, seeded, and cut into 1/4-inch dice (1/2 cup)",
        "2 tablespoons chopped red onion",
        "1 teaspoon finely chopped fresh tarragon",
        "Special equipment: 8 (3-oz) ramekins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Fruit",
        "Tomato",
        "Vegetable",
        "Freeze/Chill",
        "Papaya",
        "Avocado",
        "Summer",
        "Chill",
        "Gourmet"
    ],
    "title": "Avocado Mousse with Papaya Tomato Relish",
    "url": "http://www.epicurious.com/recipes/food/views/avocado-mousse-with-papaya-tomato-relish-231984"
}
