{
    "directions": [
        "In a large fine sieve rinse the rice under running cold water until the water runs clear with no milky residue and drain it well. In a large heavy saucepan combine the rice with 1 1/4 cups water, bring the water to a boil, and simmer the rice, covered tightly, for 15 minutes, or until the water is absorbed and the rice is tender. Remove the pan from the heat, let the rice stand, covered tightly, for 10 minutes, and transfer it to a jelly-roll pan, spreading it in an even layer. Keep the rice warm, covered. In a saucepan whisk together the vinegar, the sugar, the Sherry, and the salt, simmer the mixture until the sugar is dissolved, and let it cool. Sprinkle the rice with as much of the vinegar mixture as necessary to moisten it lightly, tossing it carefully, and cover it with a dampened cloth. (Do not chill the rice.) The rice may be made 3 hours in advance and kept, covered with the dampened cloth, at room temperature.",
        "Peel and pit the avocado, rubbing it with the lemon juice, and cut it into 1/4-inch-thick strips. Heat the nori in a preheated 350°F. oven for 10 minutes, or until it is softened slightly, and keep it warm. Working with one sheet of nori at a time and with a long side facing you, spread about 3/4 cup of the rice in an even layer on each sheet, leaving a 1/2-inch border on the long sides. Arrange some of the avocado strips horizontally across the middle of the rice and arrange some of the cucumber strips and the crab meat on top of the avocado. Dab the crab meat with the wasabi and beginning with a long side roll up the nori tightly jelly-roll fashion. Cut each roll with a sharp knife into 3/4-inch-thick slices and serve the rolls with the soy sauce, the additional wasabi, and the ginger."
    ],
    "ingredients": [
        "1 cup white short-grain rice*",
        "2 tablespoons rice vinegar (available at Oriental markets, specialty foods shops, and some supermarkets)",
        "1 teaspoon sugar",
        "1 teaspoon dry Sherry",
        "1/2 teaspoon salt",
        "1/2 avocado (preferably California)",
        "fresh lemon juice for rubbing the avocado",
        "three 8- by 7-inch pieces of toasted nori (dried laver)*",
        "1/2 cucumber, peeled and cut lengthwise into 8- by 1/4-inch strips, discarding the seeds",
        "about 1/4 pound fresh King crab meat, thawed if frozen, picked over, and drained",
        "wasabi (Japanese horseradish) paste* to taste for the sushi plus additional as an accompaniment if desired",
        "soy sauce as an accompaniment",
        "pickled ginger* as an accompaniment if desired",
        "*available at Oriental markets and some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Shellfish",
        "Crab",
        "Avocado",
        "Boil",
        "Gourmet"
    ],
    "title": "Avocado and Crab-Meat Sushi",
    "url": "http://www.epicurious.com/recipes/food/views/avocado-and-crab-meat-sushi-12779"
}
