{
    "directions": [
        "Preheat oven to 500 degrees F. Arrange tomato halves, cut sides up on a foil-lined baking pan. Sprinkle tomatoes with salt, sugar and parsley, then drizzle with olive oil.",
        "Roast tomatoes until soft but still intact, 30 to 40 minutes.",
        "In food processor, combine avocados, lime juice, water, olive oil, salt and pepper; process until smooth. In medium bowl, combine avocado sauce; stir in chives or scallions. Separate English muffin halves and brush with olive oil; bake in preheated oven until edges are brown, about 8 minutes.",
        "While muffins are cooking, fill a 12-inch heavy skillet with water until half-full; bring water to a simmer, then add vinegar. Break an egg into a small cup, then carefully pour the egg into the water. Repeat with remaining eggs, poach eggs at a simmer for 3 to 4 minutes or until whites are firm but yolks are still runny. To drain, transfer eggs with a slotted spoon to paper towels and sprinkle with salt and pepper.",
        "To assemble, place roasted tomatoes on top of English muffins. Top each tomato with an egg, then transfer muffins to 4 plates. Spoon avocado sauce over eggs and sprinkle with crumbled bacon."
    ],
    "ingredients": [
        "4 medium tomatoes, halved lengthwise",
        "1/4 teaspoon fine salt",
        "1/2 teaspoon sugar",
        "4 teaspoons olive oil",
        "2 ripe Avocados from Mexico",
        "1/4 cup fresh lime juice",
        "1/4 cup water",
        "3/4 teaspoon fine salt",
        "1/2 teaspoon black pepper",
        "2 tablespoons finely chopped chives or scallions",
        "4 slices cooked bacon, crumbled",
        "4 English muffins, split",
        "2 tablespoons olive oil",
        "1 teaspoon distilled white vinegar",
        "8 large eggs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Avocado Sauce Eggs Benedict",
    "url": "http://allrecipes.com/recipe/235841/avocado-sauce-eggs-benedict/"
}
