{
    "directions": [
        "Melt 6 tablespoons butter with canola oil and tangerine juice in a saucepan over medium heat. Remove from heat, and allow to cool about 5 minutes. Soak a piece of cheesecloth large enough to drape over the turkey in the mixture.",
        "Preheat oven to 425 degrees F ( 220 degrees C).Clean turkey, and season body cavity with salt and pepper. Loosely pack the neck cavity and body cavity with stuffing. Tie drumsticks together, spread 6 tablespoons butter over the turkey, and season with salt and pepper. Place turkey in a shallow roasting pan.",
        "Roast turkey for 25 minutes in the preheated oven, and then arrange soaked cheesecloth over turkey.  Reduce oven temperature to 325 degrees F (110 degrees C). Continue roasting 1 hour. Leaving the cheesecloth draped over the turkey, baste with the tangerine juice mixture. Continue roasting about 2 hours, basting occasionally, until the internal temperature of the thickest part of the thigh reaches 180 degrees F (80 degrees C) and the stuffing inside the body cavity reaches 165 degrees F (70 degrees C). Discard cheesecloth, and place turkey on a serving platter. Allow turkey to cool about 25 minutes before carving.",
        "Skim fat from pan juices, and reserve 1/4 cup fat and skimmed pan juices. In the baking pan, mix pan juices with 1 cup turkey stock; cook over high heat, stirring to scrape the bottom of the pan.",
        "In a saucepan over low heat, whisk together reserved 1/4 cup fat and flour until thickened, about 3 minutes. Stir in pan juices and remaining turkey stock, and add neck and giblets. Simmer 10 minutes, stirring constantly, until giblets are cooked through. Strain through a sieve, and serve with the turkey and stuffing."
    ],
    "ingredients": [
        "3/4 cup unsalted butter, divided",
        "3/4 cup canola oil",
        "1 1/2 cups tangerine juice",
        "1 (10 pound) whole turkey, neck and giblets reserved",
        "2 1/4 cups sausage stuffing",
        "salt and pepper to taste",
        "2 1/4 cups turkey stock",
        "3 tablespoons all-purpose flour"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Awesome Tangerine-Glazed Turkey",
    "url": "http://allrecipes.com/recipe/13677/awesome-tangerine-glazed-turkey/"
}
