{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Melt butter in a saucepan over medium heat. Add apples; toss until coated with butter. Stir in brown sugar, white sugar, lemon juice, 1 1/2 teaspoons cinnamon, 1/2 teaspoon vanilla extract, salt, nutmeg, allspice, and cloves; cook and stir until apples have softened and sugars have melted, about 5 minutes. Bring to a boil.",
        "Combine water and cornstarch in a bowl. Stir cornstarch mixture into the apple mixture; cook and stir until apple mixture is thickened, about 5 minutes. Remove from heat; cool completely, about 20 minutes.",
        "Roll out 1 sheet of pie crust on a work surface with a rolling pin; cover with half of the cooled apple mixture. Roll out a second sheet of pie crust with a rolling pin; slice into 1/2-inch wide strips with a sharp knife. Weave pie crust strips together over apple mixture to create a lattice top.",
        "Flour a round cookie cutter or drinking glass. Press cookie cutter through dough to create 12 round pies. Transfer to a baking sheet.",
        "Bake in the preheated oven until crust is cooked through a golden brown, about 20 minutes. Transfer to a wire rack to cool, about 10 minutes.",
        "Repeat with remaining pie crusts and apple mixture; place on a second baking sheet. Bake in the oven until crust is cooked through a golden brown, about 20 minutes.",
        "Combine confectioners' sugar and 1 teaspoon cinnamon in a mixing bowl; add 1 teaspoon vanilla extract. Stir in milk slowly until desired consistency is reached; drizzle over cooled pies."
    ],
    "ingredients": [
        "1/4 cup butter",
        "4 apples, peeled and diced into 1/4-inch cubes",
        "1/2 cup brown sugar",
        "1/4 cup white sugar",
        "1 1/2 teaspoons lemon juice",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground allspice",
        "1/8 teaspoon ground cloves",
        "2 tablespoons water",
        "1 tablespoon cornstarch",
        "4 sheets pie crust pastries",
        "1 teaspoon all-purpose flour",
        "Icing:",
        "3/4 cup confectioners' sugar",
        "1 teaspoon ground cinnamon",
        "1 teaspoon vanilla extract",
        "1 1/2 tablespoons milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Awesome Apple Pie Cookies",
    "url": "http://allrecipes.com/recipe/255040/awesome-apple-pie-cookies/"
}
