{
    "directions": [
        "Melt 2 tablespoons butter with vegetable oil in heavy large skillet over medium-high heat. Add all onions; cook until deep brown, stirring often, about 8 minutes. Add sugar and sauté until sugar dissolves, about 1 minute. Add 1/2 cup vinegar; sauté until almost all liquid evaporates, about 1 minute. Transfer to small bowl.",
        "Preheat oven to 200°F. Mix salt, 1/2 teaspoon cumin, and pepper in small bowl. Rub chicken breasts all over with spice mixture. Heat 2 teaspoons olive oil in heavy large skillet over medium-high heat; add chicken breasts, skin side down. Sauté until cooked through, about 4 minutes per side. Transfer chicken to baking sheet. Keep warm in oven.",
        "Heat remaining 2 teaspoons olive oil in same skillet over medium heat. Add garlic and sauté 20 seconds. Add caramelized onions, 1/4 cup vinegar, tomato, olives, capers, and Sherry. Cook until liquid reduces slightly, stirring constantly, about 2 minutes. Stir in 1 1/2 teaspoons cumin, chicken broth, lime juice, sage, thyme, and rosemary. Add avocado; cook until sauce thickens, stirring constantly, about 3 minutes. Reduce heat to low. Add 4 tablespoons butter and stir until blended into sauce. Season with salt and pepper. Place 1 chicken breast on each of 6 plates; spoon sauce over."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) chilled butter",
        "3 tablespoons vegetable oil",
        "1 large red onion, halved lengthwise, thinly sliced crosswise",
        "1/2 yellow onion, thinly sliced",
        "1 1/2 tablespoons sugar",
        "3/4 cup Sherry wine vinegar",
        "1 tablespoon coarse kosher salt",
        "2 teaspoons ground cumin",
        "1/4 teaspoon ground black pepper",
        "6 boneless chicken breast halves with skin",
        "4 teaspoons olive oil",
        "4 garlic cloves, thinly sliced",
        "1 large tomato, peeled, seeded, diced",
        "1/4 cup coarsely chopped pitted oil-cured black olives",
        "1/4 cup drained capers, rinsed",
        "1/4 cup Sherry",
        "1/3 cup low-salt chicken broth",
        "1/4 cup fresh lime juice",
        "1 tablespoon chopped fresh sage",
        "1 tablespoon chopped fresh thyme",
        "1 teaspoon minced fresh rosemary",
        "1 ripe avocado, halved, pitted, peeled, cut into 1/2-inch cubes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Olive",
        "Onion",
        "Sauté",
        "Dinner",
        "Vinegar",
        "Spice",
        "Avocado",
        "Fortified Wine",
        "Fall",
        "Capers",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Aztec Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/aztec-chicken-108576"
}
