{
    "directions": [
        "To make the crust, melt 1 cup butter in a heavy saucepan over low heat, and whisk in the sugar, cocoa, and eggs. Stir in the coffee liqueur, and whisk constantly until the mixture thickens, about 2 minutes. Mix the graham cracker crumbs with coconut and walnuts in a bowl, and stir into the cocoa mixture. Grease a 9x13-inch square dish or line with greased waxed paper, and pack the crumb mixture into the bottom of the dish. Refrigerate the crust while making the filling.",
        "Place 1/2 cup of butter, confectioners' sugar, custard powder, and Irish cream liqueur into a mixing bowl, and beat with an electric mixer until the mixture is smooth and creamy. Spread the filling over the crust, and refrigerate the dish until the filling has set, at least 1 hour.",
        "Melt the chocolate chips and 2 tablespoons of butter in the top of a double boiler over hot water, stirring until the mixture is smooth and well blended. Stir in the orange liqueur, and drizzle the filling over the custard filling to cover completely. Return the dish to the refrigerator, and chill until the topping has hardened, at least 1 hour. To cut, run a sharp knife under hot water and cut the bars with the heated knife, reheating the knife as necessary."
    ],
    "ingredients": [
        "1 cup butter",
        "1/2 cup white sugar",
        "10 tablespoons unsweetened cocoa powder",
        "2 eggs",
        "1/4 cup coffee flavored liqueur (such as Kahlua®)",
        "4 cups graham cracker crumbs",
        "2 cups shredded coconut",
        "1 cup chopped walnuts",
        "1/2 cup butter",
        "4 cups confectioners' sugar",
        "1/4 cup vanilla custard powder",
        "1/4 cup Irish cream liqueur (such as Baileys®)",
        "2 cups semisweet chocolate chips",
        "2 tablespoons butter",
        "1/4 cup orange liqueur, such as Grand Marnier®"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "B-52 Bars",
    "url": "http://allrecipes.com/recipe/213584/b-52-bars/"
}
