{
    "directions": [
        "Mix salt, sugar, and baking powder in a small bowl. Season chicken all over with salt mixture (you won’t need all of it). Chill uncovered on a wire rack set inside a rimmed baking sheet, at least 2 hours and up to 1 day.",
        "Combine garlic and lemon juice in a medium bowl; let sit 10 minutes. Mix in mayonnaise, chives, celery seeds, and pepper; season with salt.",
        "Whisk flour, cornstarch, garlic powder, onion powder, paprika, cayenne, and 2 Tbsp. salt in a medium bowl. Whisk egg, buttermilk, bourbon (if using), and 3 Tbsp. hot sauce in another medium bowl. Working with 1 piece at a time, dredge chicken in flour mixture, turning to coat and packing into crevices. Shake to remove excess; return to rack. Pour 3 Tbsp. buttermilk mixture into flour mixture and work in with your fingers. Dip chicken into remaining buttermilk mixture, allow excess to drip off, then pack moistened flour mixture firmly onto chicken. Gently shake off excess; return to rack. Chill at least 30 minutes and up to 12 hours.",
        "Pour oil into a large heavy pot fitted with thermometer to come halfway up sides. Heat over medium-high until thermometer registers 350°F. Working in 2 batches, fry chicken, turning often and adjusting heat to maintain temperature, until deep golden brown, 5–8 minutes per batch. Transfer to a wire rack set over paper towels to drain.",
        "Heat a dry large skillet, preferably cast iron, over medium. Brush cut sides of buns with butter and, working in batches, cook, cut side down, until deep golden brown, about 2 minutes per batch.",
        "Mix 1 Tbsp. pickle brine into 2 Tbsp. seasoned mayonnaise in a medium bowl. Add lettuce, season with salt and pepper, and toss to coat. Spread some seasoned mayonnaise over cut sides of buns. Build sandwiches with pickles, fried chicken, slaw, and more hot sauce, if desired."
    ],
    "ingredients": [
        "1 tablespoon Diamond Crystal or 2 teaspoons Morton kosher salt",
        "1 teaspoon light brown sugar",
        "1 teaspoon baking powder",
        "4 skin-on or skinless, boneless chicken thighs",
        "1 garlic clove, finely grated",
        "2 tablespoons fresh lemon juice",
        "1/2 cup mayonnaise",
        "2 tablespoons finely chopped chives",
        "1/2 teaspoon celery seeds",
        "1/2 teaspoon freshly ground black pepper",
        "Kosher salt",
        "1 1/2 cups all-purpose flour",
        "1/3 cup cornstarch",
        "1 tablespoon garlic powder",
        "1 tablespoon onion powder",
        "1 tablespoon paprika",
        "2 teaspoons cayenne pepper",
        "2 tablespoons kosher salt, plus more",
        "1 large egg, beaten to blend",
        "1 cup buttermilk",
        "2 tablespoons bourbon (optional)",
        "3 tablespoons hot sauce, plus more for serving (optional)",
        "Peanut or vegetable oil (for frying; about 8 cups)",
        "4 soft seeded hamburger buns",
        "3 tablespoons unsalted butter, melted",
        "Bread-and-Butter Pickles (for serving), plus 1 tablespoon brine",
        "4 cups thinly sliced iceberg lettuce",
        "Freshly ground black pepper",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fry",
        "Deep-Fry",
        "Chicken",
        "Sandwich",
        "Lunch",
        "Buttermilk",
        "Summer",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "BA's Best Fried Chicken Sandwich",
    "url": "http://www.epicurious.com/recipes/food/views/ba-best-fried-chicken-sandwich"
}
