{
    "directions": [
        "Mix all the ingredients without the butter and then beat with a wooden spoon for about 15 minutes. When the dough starts to unstick from the spoon, add the melted butter. Mix.",
        "Cover the dough with a cloth and let it rise. When the volume doubles spread the dough halfway up the 4 buttered moulds. Make sure that the dough is evenly spread and than leave it to rise in a warm area (86 - 95°F). The Baba should slightly overflow the moulds.",
        "Cook it in the oven for 25 minutes at 392 - 400°F. The cooking time can depend on the size, color, and desired moistness of the Baba. Turn out the Babas as soon as they are cook.",
        "Mix all the syrup ingredients and bring to boiling point. Leave to infuse. Place the Babas in the syrup and leave to soak for about 40 minutes. Verify that they are well soaked, and then place them on a grid to let them drip for about 5 minutes.",
        "Slice the vanilla pod in two lengthwise and scrape out the grains that will be mixed in with the cream.",
        "Beat the vanilla grains with the sugar and cream to obtain a Chantilly.",
        "Put the Baba on a plate and glaze with the apricot coating.",
        "Serving at the table, cut the Baba in two (lengthwise) and pour on the rum according to you taste. Served it with the Chantilly cream."
    ],
    "ingredients": [
        "3 1/2 ounces flour",
        "A pinch of salt",
        "1/2 ounce sugar",
        "A pinch of baking powder",
        "2 eggs",
        "1 ounce butter",
        "1 quart water",
        "18 ounces caster sugar",
        "Lemon zests",
        "Orange zests",
        "2 ounces of apricot coating/glazing",
        "Add Rum according to your taste",
        "7 ounces double cream",
        "1 ounce sugar",
        "1/2 vanilla pod"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Rum",
        "Citrus",
        "Dessert",
        "Bake",
        "Apricot",
        "Vanilla",
        "Fall",
        "Jam or Jelly"
    ],
    "title": "Baba",
    "url": "http://www.epicurious.com/recipes/food/views/baba-105879"
}
