{
    "directions": [
        "Butter eight 1/3-cup ring molds. In the bowl of an electric mixer proof the yeast with the sugar in the milk for 5 minutes, or until the mixture is foamy. Stir in 1/4 cup of the flour, stir the mixture until it is smooth, and let the sponge rise, covered, in a warm place for 20 minutes, or until it is double in bulk. In a small bowl whisk together lightly the egg and the salt. To the yeast mixture add the remaining 1/2 cup flour in 2 batches alternately with the egg mixture, beating well after each addition. Beat in the butter, 1 piece at a time, beating well after each addition, and the cinnamon and beat the dough, scraping down the side of the bowl, for 3 minutes. (The dough will be very soft.) Divide the dough among the prepared ring molds set in a jelly-roll pan, let the babas rise, uncovered, for 15 minutes, or until they are just even with the tops of the molds, and bake even with the tops of the molds, and bake them in the middle of preheated 375°F. oven for 15 minutes, or until they are golden. Transfer the babas in the molds to a rack set over another jelly-roll pan and let them cool for 10 minutes, or until they are only warm.",
        "In a small saucepan combine the sugar and the water, bring the mixture to a boil, stirring until the sugar is dissolved, and simmer the syrup for 3 minutes. Remove the pan from the heat and stir in the Calvados.",
        "In a small saucepan combine the jelly, the Calvados, and the sugar, bring the mixture to a boil, and simmer it, stirring, for 2 minutes.",
        "Run a thin, sharp knife around the center and side of each mold and invert the babas onto the rack. Reserve 1/2 cup of the syrup in a measuring cup, spoon the remaining syrup, heated to warm, over the babas, reusing the syrup that drips into the pan, until it is all absorbed, and let the babas stand for 15 minutes. The babas may be prepared up to this point 1 day in advance, kept on the rack set over the jelly-roll pan, and covered with foil.",
        "Brush the glaze, heated to warm, carefully over the babas. The babas may be glazed 1 hour in advance.",
        "Reserve 6 to 8 small apple rings. Arrange the remaining apple rings decoratively in overlapping rings on each of 6 to 8 plates, top them with the babas, and garnish each baba with a spoonful of the creème fraîche. Fold the reserved apple rings in half and roll the halves into cones to resemble flower buds. Garnish each baba with an apple-ring \"bud\" and drizzle some of the reserved syrup around it."
    ],
    "ingredients": [
        "1 1/2 teaspoons active dry yeast",
        "1 tablespoon sugar",
        "1/4 cup lukewarm milk",
        "3/4 cup all-purpose flour",
        "1 large egg",
        "1/4 teaspoon salt",
        "3 tablespoons unsalted butter, cut into pieces and softened",
        "1/2 teaspoon cinnamon",
        "1/2 cup sugar",
        "1 cup water",
        "1/3 cup Calvados",
        "1/4 cup apple jelly",
        "2 tablespoons Calvados",
        "1 tablespoon sugar",
        "glazed apple rings and crème fraîche for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Mixer",
        "Dessert",
        "Bake",
        "Apple",
        "Gourmet"
    ],
    "title": "Babas au Calvado with Glazed Apple Rings",
    "url": "http://www.epicurious.com/recipes/food/views/babas-au-calvado-with-glazed-apple-rings-13170"
}
