{
    "directions": [
        "Bring a large pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes. Drain and cool.",
        "Meanwhile, prepare dough by combining 1 egg, 1 tablespoon cream cheese, 1 teaspoon milk and 1/2 cup flour.  Once all the flour has been worked in, add another 1/2 cup flour, 1 tablespoon cream cheese and 1 teaspoon milk.  When the dough is well blended, add 1 egg, 1 tablespoon cream cheese and another 1/2 cup flour; mix well.  Finally, add the remaining egg, 1 teaspoon milk and 1/2 cup flour.  If dough is too dry, add a little more milk; if too wet, add more flour.",
        "On a well floured surface, roll out 1/4 of the dough to 1/4 inch thickness.  Using a glass, muffin cutter, or any rounded surface, cut out circles of dough.  Flour both sides of the circle and set aside in a single layer on wax paper.  Repeat process with remaining dough.",
        "Mash the potatoes with the cottage cheese, salt and butter.  Place a spoonful of the filling slightly below the center of a circle of dough.  Fold the dough over and seal edges with fingertips.  Use enough filling so that you have to stretch the dough over it, but not so much that it squeezes out when sealed.",
        "Bring a large pot of salted water to a boil.  Drop in pierogis, a few at a time.  Cook for 1 to 2 minutes, or until they float to the top; drain.",
        "Heat oil in a large skillet over medium-high heat.  Fry boiled pierogis in hot oil until crispy."
    ],
    "ingredients": [
        "12 Yukon Gold potatoes, peeled and quartered",
        "3 eggs",
        "3 tablespoons cream cheese, divided",
        "3 teaspoons milk, divided",
        "2 cups all-purpose flour, divided",
        "2 1/2 (8 ounce) containers cottage cheese",
        "salt to taste",
        "2 tablespoons butter",
        "oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Babaci's Potato Pierogi",
    "url": "http://allrecipes.com/recipe/25341/babacis-potato-pierogi/"
}
