{
    "directions": [
        "In a small saucepan, heat milk until just below boiling. Add butter and stir until melted. Remove from heat, and let cool until lukewarm.",
        "Place cake yeast in a small bowl; pour 1/2 cup lukewarm water over the yeast. Stir with a spoon to break up the yeast slightly; set aside.",
        "In a mixing bowl, beat 4 eggs and egg yolks with an electric mixer with a paddle attachment. Add 1 cup sugar and salt, and continue to beat until mixture is thick and pale. Stir in vanilla, orange liqueur, zests, and yeast mixture.  Beat in 2 cups flour on low speed; when incorporated, add 2 more cups of flour and mix until combined. Add cooled milk mixture alternately with an additional 4 cups flour, beating on medium-low speed.",
        "If the dough is very sticky, add up to 1 cup of flour. Mix in currants, raisins, golden raisins, and almonds.",
        "Transfer dough to a well-floured work surface and knead about 8 to 10 minutes, adding reserved flour if needed. Shape dough into a ball. Transfer dough to a large greased bowl, and turn to coat. Cover with greased plastic wrap.",
        "Place in a warm place and allow it to rise until dough has doubled, about 1 1/2 to 2 hours. Punch the dough down, re-cover the bowl, and allow to rise again for an additional 1 1/2 hours.",
        "Preheat oven to 350 degrees F (175 degrees C). Butter 3 tube pans.",
        "In a small bowl, combine 1 cup flour, 1/2 cup brown sugar, and cinnamon. Cut in 4 tablespoons butter to form crumb topping. Sprinkle evenly among the 3 pans.",
        "Turn out dough onto a lightly floured surface. Knead for 1 minute. Cut dough into thirds. Flatten each piece of dough into a rectangle and roll it up into a log, pinching the seam to seal. Lay each log seam-side up in the prepared pans, pinching ends together to form rings. Cover loosely with plastic wrap. Allow to rise for 30 minutes.",
        "Beat an egg with 1 tablespoon water to make an egg wash. Before baking, gently brush egg wash over each loaf.",
        "Bake babkas in preheated oven until until golden brown and hollow sounding when tapped, about 30 to 45 minutes. Immediately turn out onto a cooling rack so bread does not stick to the pan. Cool completely before slicing."
    ],
    "ingredients": [
        "2 cups milk",
        "1/2 pound unsalted butter, at room temperature",
        "1 (0.6 ounce) cake cake yeast",
        "1/2 cup warm water (110 degrees F/45 degrees C)",
        "4 eggs, room temperature",
        "4 egg yolks, room temperature",
        "1 cup white sugar",
        "1 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1 tablespoon orange liqueur (optional)",
        "3 tablespoons grated orange zest",
        "1 tablespoon grated lemon zest",
        "10 cups all-purpose flour, or as needed",
        "1 1/2 cups dried currants",
        "1 1/2 cups raisins",
        "1 1/2 cups golden raisins",
        "1 cup chopped slivered almonds",
        "Topping:",
        "1 cup all-purpose flour",
        "1/2 cup packed brown sugar",
        "1 teaspoon ground cinnamon",
        "4 tablespoons butter",
        "1 eggs",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Babka I",
    "url": "http://allrecipes.com/recipe/6711/babka-i/"
}
