{
    "directions": [
        "Preheat an oven to 400°F.",
        "Using a paring knife, hull the strawberries and cut them in half lengthwise. Spread the berries on a rimmed baking sheet. Drizzle with 2 Tbs. of the olive oil and sprinkle with the 2 tsp. sugar, 1/4 tsp. of the salt and several grinds of pepper. Toss to coat the berries evenly, then spread them out again. Roast until softened, about 10 minutes. Let cool to room temperature.",
        "In a small nonreactive bowl, whisk together the vinegar, orange juice, tarragon, the 1 Tbs. sugar, 3/4 tsp. of the salt and several grinds of pepper until the sugar dissolves. Slowly whisk in the remaining 6 Tbs. olive oil until well blended to make a vinaigrette. Taste and adjust the seasonings.",
        "In a small bowl, stir together the almonds and 1/4 tsp. of the salt. In a large bowl, combine the spinach, the remaining 1/4 tsp. salt and several grinds of pepper. Whisk the vinaigrette to recombine, drizzle about one-third of it over the spinach and toss well (reserve the remaining vinaigrette for another use). Taste and adjust the seasonings.",
        "Divide the dressed spinach evenly among individual plates, top each serving with an equal amount of the roasted strawberries, and sprinkle with the almonds and cheese. Serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "New Flavors for Salads,",
        "by Dina Cheney (Oxmoor House, 2009)."
    ],
    "ingredients": [
        "2 pints large strawberries (1 lb. total)",
        "8 Tbs. extra-virgin olive oil",
        "1 Tbs. plus 2 tsp. sugar",
        "1 1/2 tsp. sea salt, plus more, to taste",
        "Freshly ground pepper, to taste",
        "6 Tbs. red wine vinegar",
        "1/4 cup fresh orange juice",
        "4 tsp. finely chopped fresh tarragon",
        "1 cup blanched whole almonds, toasted",
        "9 cups baby spinach",
        "5 oz. pecorino romano cheese, shredded"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Baby Spinach Salad with Roasted Strawberries",
    "url": "http://www.williams-sonoma.com/recipe/baby-spinach-salad-with-roasted-strawberries.html"
}
