{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch round pans.",
        "In the top of a double boiler, Combine 8 chopped candy bars, peanut butter, and 6 tablespoons milk. Heat and stir until melted, stirring constantly.  Let cool.",
        "Sift together flour, baking soda and  baking powder. Set aside.",
        "In a large bowl, cream 1/2 cup butter and 1 1/4 cup sugar until light and fluffy. Add eggs and beat well. Blend in cooled candy mixture and  1/2 teaspoon vanilla.",
        "On low speed, add flour mixture to creamed mixture, alternating with buttermilk. Do not overmix.",
        "Pour into 2 greased and floured 9 inch round cake pans and bake at 350 degrees F (175 degrees C) for 30 minutes.  Cool in pans on racks for 10 minutes.  Turn out and finish cooling on rack.",
        "For filling and topping:  Melt 6 candy bars in double boiler, then set aside.  In a saucepan, combine egg yolks, 1 cup evaporated milk, 1 cup sugar and 1/2 cup butter. Cook and stir until thick over medium heat for approximately 10 minutes. Remove from heat and blend in melted candy mixture, coconut and peanuts. Cool, then beat vigorously with spoon.",
        "For whipped topping, whip heavy cream until stiff. In a clean bowl, whip egg white until stiff. Fold egg white, confectioners sugar and 3/4 teaspoon vanilla into whipped cream.",
        "To assemble, spread cooled filling between layers and on top of cake.  Spread whipped topping on sides of cake."
    ],
    "ingredients": [
        "8 (1.2 ounce) bars Baby Ruth ™ candy bars, chopped",
        "4 tablespoons crunchy peanut butter",
        "6 tablespoons evaporated milk",
        "2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/2 cup butter, softened",
        "1 1/4 cups white sugar",
        "2 eggs",
        "1/2 teaspoon vanilla extract",
        "1 cup buttermilk",
        "6 (1.2 ounce) bars Baby Ruth ™ candy bars, chopped",
        "2 egg yolks",
        "1 cup evaporated milk",
        "1 cup white sugar",
        "1/2 cup butter",
        "1 cup flaked coconut",
        "1/2 cup chopped peanuts",
        "1 cup heavy whipping cream",
        "1 egg white",
        "2 1/2 tablespoons sifted confectioners' sugar",
        "3/4 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baby Ruth™  Layer Cake",
    "url": "http://allrecipes.com/recipe/8397/baby-ruth-layer-cake/"
}
