{
    "directions": [
        "Peel the ginger, cut it into thin slices and crush each slice with the flat side of a chef's knife.",
        "In a large Dutch oven or other heavy pot over medium-high heat, warm the oil. Add the onion and sauté until softened, about 3 minutes. Add the cinnamon sticks and star anise and cook, stirring constantly, until fragrant and the cinnamon sticks begin to uncurl, about 2 minutes. Add the crushed ginger, garlic and chili paste and cook, stirring constantly, until fragrant, about 45 seconds. Add the stock, soy sauce and 4 1/2 cups water. Increase the heat to high, cover and bring to a boil. Stir in the beef and return to a boil. Reduce the heat to low, cover partially and simmer until the beef is very tender, about 1 1/2 hours.",
        "Meanwhile, trim the bottom ends of the bok choy and cut each head lengthwise into quarters. In a large saucepan over high heat, bring 4 quarts water to a boil. Stir in the 1 Tbs. salt and the noodles, return to a boil and cook until the noodles are tender, about 3 minutes. Drain the noodles, rinse well under warm running water and drain well again. Divide the noodles evenly among 6 to 8 warmed bowls.",
        "Using a slotted spoon, remove and discard the cinnamon sticks, star anise and ginger from the broth. Add the bok choy and cook until just tender-crisp, about 5 minutes. Add half of the green onions and stir to combine.",
        "Taste the soup and adjust the seasonings with salt. Ladle the soup over the noodles, distributing the beef and bok choy equally. Garnish with the remaining green onions and serve immediately. Serves 6 to 8.",
        "Adapted from Williams-Sonoma",
        "New Flavors for Soup",
        ", by Adam Ried (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "4-inch piece fresh ginger",
        "2 Tbs. canola oil",
        "1 yellow onion, thinly sliced",
        "4 cinnamon sticks",
        "1 whole star anise",
        "5 garlic cloves, crushed and thinly sliced",
        "2 tsp. Asian chili garlic paste",
        "4 cups chicken stock or low-sodium chicken broth",
        "1/2 cup soy sauce",
        "2 lb. beef blade steak, trimmed and cut into slices 1/4 inch thick",
        "5 baby bok choy, about 1 1/2 lb. total",
        "1 Tbs. kosher salt, plus more, to taste",
        "1 1/2 lb. fresh Chinese wheat noodles",
        "4 green onions, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Baby Bok Choy and Beef Noodle Soup with Warm Spices",
    "url": "http://www.williams-sonoma.com/recipe/baby-bok-choy-and-beef-noodle-soup-with-warm-spices.html"
}
