{
    "directions": [
        "When the baccalà is sufficiently soaked, cut it into small pieces—6 inches or so—and put them in a saucepan or deep skillet with at least an inch of water to cover. Bring to a boil, set the cover ajar (rest it on a wooden spoon set on the rim of the pan), and cook at a steady bubbling boil for 20 minutes or more, until the cod is easy to flake but still has body and shape. Don't let it start to break apart. Lift it out of the cooking water, and let it drain and cool in a colander. Reserve a cup of the cooking water.",
        "Meanwhile, rinse the potato but leave it whole and unpeeled. Put it in a small pot covered with cold water. Bring to the boil, and cook steadily until you can easily pierce the potato with a knife blade.",
        "Let it cool, and peel it.",
        "Set up the electric mixer and flake all the fish into the bowl. Beat with the paddle at low speed to break the fish up more; drop in the minced garlic, and beat at medium speed while you pour in half the olive oil very gradually in a thin stream, then add the potato and incorporate it; continue beating at low speed as you gradually add the rest of the oil.",
        "Now raise the speed to high and whip the fish to lighten it.",
        "Reduce the speed to medium and incorporate the half-and- half gradually, then whip at high speed again. At this point the whipped cod should be smooth and fluffy, almost like mashed potatoes but with texture. If it is very dense, you can thin it with the cooking water (but be careful: too much water will make it too salty).",
        "Finally, season with pepper and beat it in to blend. If you use a food processor instead of a mixer, follow the same order of additions, and process as needed to form a light, smooth spread. Put the spread in containers and store sealed, in the refrigerator, for up to a week. You can also freeze baccalà mantecato; the texture will not be as creamy, but it will have good flavor and makes a delicious pasta sauce."
    ],
    "ingredients": [
        "1 pound boneless baccalà (salt cod), soaked to remove salt",
        "1 medium russet potato (about 1/2 pound)",
        "2 plump garlic cloves, finely minced",
        "1 cup extra-virgin olive oil",
        "1/2 cup half-and-half or light cream",
        "1/2 cup poaching water from cooking the baccalà",
        "freshly ground black pepper to taste",
        "A heavy-duty electric mixer with the paddle attachment or a food processor"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Fish",
        "Garlic",
        "Potato",
        "Appetizer",
        "Cod"
    ],
    "title": "Baccalà Mantecato: A Savory Spread of Whipped Salt Cod",
    "url": "http://www.epicurious.com/recipes/food/views/baccala-mantecato-a-savory-spread-of-whipped-salt-cod-355908"
}
