{
    "directions": [
        "Place each rib rack on a sheet of extra-wide, heavy-duty aluminum foil. (The foil should be 4 inches longer than the ribs on either end.) Season racks liberally with kosher salt and sprinkle each rack with 3 tablespoons of the rub. Turn the ribs, meat side down, and tightly seal each foil pouch. Place on a half sheet pan and refrigerate overnight.",
        "The next day, heat the oven to 250 degrees F.",
        "Combine the orange juice and margarita mix in a liquid measuring cup. Open 1 end of each pouch and evenly divide the liquid between the 2 pouches. Reseal the pouches and place the sheet pan in the oven for 2 hours. Remove the ribs from the oven, carefully open 1 end of each pouch and pour the braising liquid into a heatproof measuring cup. Reseal the pouches and place them and the measuring cup of liquid into the refrigerator for up to 8 hours.",
        "The fat in the braising liquid will have solidified on the top and can be removed at this time. Transfer the liquid to a small saucepan and add the honey, ketchup, Worcestershire sauce, espresso powder and cayenne pepper. Whisk to combine. Set over medium high heat and reduce to a glaze, approximately 10 minutes.",
        "Set a gas grill to medium-high and allow to heat for 10 minutes. Cut each slab in half and place them on the grill, flesh side down, close the lid and decrease the heat to medium. Leave alone for 3 minutes. Flip and cook for another 3 minutes. Flip and cook for 3 minutes on each side 1 more time or until each rib has a nice char. Remove the ribs from the grill to a cutting board. and cut into 2 rib portions, using kitchen shears. Add the ribs and half the glaze to a large serving bowl and toss to thoroughly coat. Serve the remaining glaze on the side.",
        "Place all of the ingredients in an airtight container and shake to combine. Store for up to 3 months.",
        "Yield: about 2 1/2 cups"
    ],
    "ingredients": [
        "2 full racks/slabs (about 4 1/2 pounds) baby back pork ribs",
        "Kosher salt",
        "6 tablespoons Rub Number Nine, recipe follows",
        "1/2 cup orange juice (not fresh squeezed)",
        "1/2 cup margarita mix",
        "1/3 cup honey",
        "1/3 cup ketchup",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon espresso powder or instant coffee powder",
        "1/8 teaspoon cayenne pepper",
        "1 1/4 cups dark brown sugar",
        "3/4 cup chili powder",
        "1/4 cup garlic powder",
        "2 tablespoons ground thyme",
        "1 tablespoon cayenne pepper",
        "1 tablespoon allspice"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Grilling Recipes",
        "Grilling",
        "Ribs Recipes",
        "Meat",
        "Pork",
        "Lunch",
        "Outdoor Party",
        "Recipes for Parties"
    ],
    "title": "Backyard Baby Back Ribs",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/backyard-baby-back-ribs-recipe"
}
