{
    "directions": [
        "Combine onions, vinegar, sugar, salt, and 1 tablespoon water in a small bowl and toss to combine; let stand for 30 minutes.",
        "Preheat oven to 350°F. Place bacon on a foil-lined large rimmed baking sheet; brush both sides with syrup. Bake until bacon begins to crisp but is still pliable, 20-25 minutes.",
        "Mix mayonnaise and Sriracha in a small bowl to combine; set aside.",
        "Spread 1 side of bread slices with plain mayonnaise. Heat a large skillet over medium-low heat. Working in batches, cook bread, mayonnaise side down, until brown and crisp, about 3 minutes. Wipe out skillet.",
        "Melt butter in same skillet over medium heat; crack eggs into skillet. Cook, occasionally basting with butter in skillet, until whites are set, about 3 minutes. Season with salt and pepper.",
        "Spread untoasted side of each bread slice with spicy mayo. Build sandwiches with bread, bacon, eggs, pickled spring onions, and arugula."
    ],
    "ingredients": [
        "4 spring onions or 6 scallions, whites only, thinly sliced",
        "1/4 cup apple cider vinegar",
        "2 teaspoons sugar",
        "1 teaspoon kosher salt",
        "12 slices thick-cut bacon",
        "2 tablespoons pure maple syrup",
        "1/4 cup mayonnaise",
        "1 tablespoon Sriracha",
        "8 slices white sandwich bread, such as Pullman",
        "1/4 cup mayonnaise",
        "2 tablespoons unsalted butter",
        "4 large eggs",
        "Kosher salt, ground pepper",
        "1 cup arugula leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Egg",
        "Breakfast",
        "Brunch",
        "Lunch",
        "Bacon",
        "Green Onion/Scallion",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Bacon and Egg Sandwiches with Pickled Spring Onions",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-and-egg-sandwiches-with-pickled-spring-onions-51155270"
}
