{
    "directions": [
        "Cook and stir bacon in a large skillet over medium heat until bacon is translucent and beginning to brown, about 5 minutes; stir in onion and continue cooking and stirring until bacon is browned and sweet onion is translucent, about 5 more minutes.",
        "Mix 1/2 cup ketchup, 2 tablespoons chili powder, 2 tablespoons ancho chile powder, 1 tablespoon Worcestershire sauce, cumin, salt, black pepper, and garlic powder in a large bowl. Mix in ground sirloin, bacon-onion mixture, Cheddar cheese, pepper jack cheese, eggs, and bread crumbs until thoroughly combined. Form the mixture into a loaf shape and refrigerate 1 hour.",
        "Preheat oven to 425 degrees F (220 degrees C). Line a 9x13-inch baking pan with aluminum foil and spray the foil with cooking spray.",
        "Place loaf into the prepared baking dish. Mix 1/2 cup ketchup, 1 tablespoon Worcestershire sauce, 1 teaspoon chili powder, and 1 teaspoon ground ancho chile in a bowl. Spread the mixture over the loaf.",
        "Bake in the preheated oven until the loaf is no longer pink inside and the juices run clear, 1 hour and 5 minutes to 1 hour and 15 minutes. An instant-read meat thermometer inserted into the center of the loaf should read at least 160 degrees F (70 degrees C)."
    ],
    "ingredients": [
        "1 (12 ounce) package center-cut smoked bacon, diced",
        "1 sweet onion (such as Vidalia®), chopped",
        "1/2 cup ketchup",
        "2 tablespoons chili powder",
        "2 tablespoons ancho chile powder",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon ground cumin",
        "1 teaspoon salt",
        "2 teaspoons freshly ground black pepper",
        "1 teaspoon garlic powder",
        "2 pounds ground sirloin",
        "4 ounces shredded extra-sharp Cheddar cheese",
        "4 ounces shredded pepper jack cheese",
        "2 eggs, beaten",
        "1 cup bread crumbs",
        "1 serving cooking spray",
        "1/2 cup ketchup",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon chili powder",
        "1 teaspoon ground ancho chile pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bacon Chili Cheeseburger Meatloaf",
    "url": "http://allrecipes.com/recipe/223500/bacon-chili-cheeseburger-meatloaf/"
}
