{
    "directions": [
        "In a large heavy skillet cook 8 of the bacon slices over moderate heat, turning them occasionally, until they are crisp, transfer them to paper towels to drain, and pour off the fat. Crumble the cooked bacon into a small bowl and stir in the minced sage. In the skillet cook the remaining 16 bacon slices in 2 batches until the bacon just becomes translucent and the edges begin to curl, transfer them to paper towels to drain, and pour off the fat.",
        "Preheat the oven to 375°F. Rinse the trout under cold water and pat them dry inside and out. Sprinkle the cavity of each trout with one eighth of the crumbled bacon mixture and salt and pepper to taste. Wrap 2 of the whole bacon slices around each trout, using wooden picks to secure the bacon and close the cavities. Mound the cornmeal on a sheet of wax paper and roll each trout in it, coating it completely and gently shaking off the excess.",
        "Heat the skillet over moderately high heat until it is hot, add the oil, and heat it until it is hot but not smoking. In the oil fry the trout, not touching each other, in batches for 3 minutes on each sides, or until they are just firm and the bacon is golden, transferring them as they are fried with long spatulas to a shallow baking pan. When all the trout has been fried, bake them for 5 minutes, or until they just flake and are heated through. Discard the wooden picks, arrange the trout carefully on a platter, and garnish them with the sage sprigs and the lemon wedges."
    ],
    "ingredients": [
        "24 slices of bacon",
        "3 tablespoons minced fresh sage leaves or 1 tablespoon dried, crumbled, plus fresh sage springs for garnish",
        "8 trout (about 10 ounces each), cleaned and boned, leaving the head  and tail intact",
        "about 2 cups yellow cornmeal for coating the trout",
        "1/3 cup olive oil",
        "lemon wedges for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Fry",
        "Bacon",
        "Cornmeal",
        "Trout",
        "Spring",
        "Sage",
        "Gourmet"
    ],
    "title": "Bacon and Sage Panfried Trout",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-and-sage-panfried-trout-11692"
}
