{
    "directions": [
        "Spread a layer of parchment paper over a baking sheet small enough to fit into your freezer.",
        "Wrap each filet tightly with a strip of bacon, pinning with a toothpick.",
        "Place each wrapped filet onto the parchment paper, being careful to ensure the bacon is wrapped tightly in the way you'd want the final product to look. Place sheet of steaks into the freezer until frozen solid, ideally overnight.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Remove steaks from freezer and allow to sit at room temperature 10 minutes.",
        "Prepare Idahoan Signature™ Russets Mashed Potatoes according to package instructions. Keep warm.",
        "When surface of the steaks is moist but not thawed, season with salt and pepper as desired.",
        "Place 1 tablespoon butter in a skillet over high heat.",
        "Place one steak into hot pan, top with a sprig of thyme, and sear to desired level of browning 2 to 3 minutes. Spoon hot butter over the top of the steak. Turn the steak and thyme sprig over and sear the other side. Transfer back to parchment-lined baking sheet. Repeat with the remaining steaks.",
        "Bake steaks in preheated oven for 7 minutes for rare, 10 for medium rare, 15 for medium, or 20 for well-done.",
        "Transfer steaks to a work surface. Crisp the bacon with a chef's torch, keeping the flame at least 1 inch away from the bacon to avoid burning. Remove toothpicks. Top each steak with smoked blue cheese crumbles and allow to rest 8 minutes.",
        "Serve with Idahoan Signature™ Russets Mashed Potatoes."
    ],
    "ingredients": [
        "6 (3 ounce) beef tenderloin (filet mignon)",
        "6 slices thick-cut peppered bacon",
        "1 (9.74 ounce) package Idahoan Signature™ Russets Mashed Potatoes",
        "Salt to taste",
        "Ground black pepper to taste",
        "4 tablespoons butter, divided",
        "4 sprigs fresh thyme",
        "4 ounces smoked blue cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bacon Wrapped Filets with Smokey Bleu Cheese",
    "url": "http://allrecipes.com/recipe/255424/bacon-wrapped-filets-with-smokey-bleu/"
}
