{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Transfer bacon slices to paper towels, reserving bacon drippings in the skillet. Crumble bacon when cooled.",
        "Remove stems from mushrooms and set stems aside. Place mushrooms, hollow sides up, on a baking sheet; brush the insides with melted butter.",
        "Chop mushroom stems; cook and stir chopped stems, black olives, green onion, and crumbled bacon in the bacon drippings over medium heat until mushroom stems release their liquid, about 5 minutes. Add garlic, salt, black pepper, and cayenne pepper; stir to coat.",
        "Tilt the skillet slightly; move vegetable-bacon mixture to one side, allowing the bacon drippings to pool to the other side. Whisk flour into bacon drippings until smooth and paste-like; slowly stir in milk until gravy is smooth. Mix vegetable-bacon mixture into the gravy. Add American cheese and Parmesan cheese; cook and stir until  cheeses melt, about 5 minutes. Spoon filling into mushroom caps.",
        "Bake in the preheated oven until mushrooms are tender and filling is lightly browned, about 20 minutes. Remove mushrooms from baking sheet and cool on platter for 2 minutes before serving."
    ],
    "ingredients": [
        "4 slices bacon",
        "2 (12 ounce) packages fresh white mushrooms",
        "3 tablespoons butter, melted",
        "6 pitted black olives, finely chopped",
        "1/4 cup finely chopped green onion",
        "1 teaspoon oil-packed minced garlic",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 pinch cayenne pepper",
        "1 tablespoon all-purpose flour",
        "1/4 cup milk",
        "4 slices Swiss-flavored American cheese, chopped",
        "3 tablespoons grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bacon Stuffed Mushrooms",
    "url": "http://allrecipes.com/recipe/230108/bacon-stuffed-mushrooms/"
}
