{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper, and set aside.",
        "Place a baking rack into a baking dish, and lay the bacon slices out flat onto the rack. Cover the bacon with another flat baking dish or other flat, heavy heatproof surface such as a baking sheet.",
        "Bake the bacon in the preheated oven until golden brown, 25 to 30 minutes; retain 1/4 cup of the drippings. Allow bacon to cool, then chop finely.",
        "In a bowl, thoroughly mix the chopped bacon with ricotta, mozzarella, and 1/3  of the Parmesan cheese. Place 1 rounded teaspoon of filling into the center of a wonton wrapper on a work surface; dip your finger in a little water, and moisten the edge of the wrapper. Fold the wrapper over the filling, matching points to make a triangular ravioli, and gently squeeze any air out of the little package. Press the edges down to seal the ravioli, and lay the finished ravioli onto the prepared baking sheet. Store finished ravioli in freezer after you make them, to prevent bottoms from becoming soggy.",
        "Bring a large pot of salted water to a boil, and add the ravioli, a few at a time, stirring to prevent sticking. Gently boil the ravioli until they float to the top and become tender, 3 to 5 minutes; remove to a serving dish with a slotted spoon and keep warm.",
        "While ravioli are cooking, melt butter and bacon drippings together in a saucepan over medium heat, and whisk in cream cheese until smooth. Whisk in the milk, a little at a time, the remaining 2/3 of the package of shredded Parmesan cheese, garlic powder, and black pepper. Bring the mixture to a bare simmer, and cook gently until the cheese has melted and the sauce is smooth, whisking constantly. Whisk in about 1/3 cup of the pasta water, or to desired consistency. Serve the ravioli topped with the sauce."
    ],
    "ingredients": [
        "8 slices bacon",
        "1 (15 ounce) container ricotta cheese",
        "1/2 cup shredded mozzarella cheese",
        "1 (6 ounce) package shredded Parmesan cheese, divided",
        "1 (16 ounce) package wonton wrappers",
        "1/4 cup butter",
        "1/4 cup bacon drippings",
        "2/3 cup cream cheese, softened",
        "1 1/3 cups milk",
        "1 tablespoon garlic powder",
        "ground black pepper to taste",
        "1/3 cup pasta boiling water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bacon Stuffed Ravioli",
    "url": "http://allrecipes.com/recipe/218618/bacon-stuffed-ravioli/"
}
