{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x13 inch baking dish.",
        "Heat olive oil in a large skillet over medium-high heat. Add garlic; cook and stir until it begins to brown, about 30 seconds. Quickly stir in spinach, and continue cooking until the spinach has wilted. Transfer the mixture into a bowl, and set aside to cool.",
        "Slice through the chicken breast horizontally to within 1/2 inch of one long edge, then open the meat like a book. Place each opened chicken breast in between two pieces of plastic wrap, and pound with a meat mallet to a thickness of 1/4 inch.",
        "Stir the ricotta cheese, Parmesan cheese, Italian seasoning, garlic salt, and onion powder into the cooked spinach until blended. Evenly divide this mixture among the chicken breasts, then roll each into an oblong shape, like a burrito, tucking in the ends. Season to taste with salt and pepper, and sprinkle with Italian seasoning. Wrap each breast with 2 strips of bacon, and secure with toothpicks. Place into the prepared pan.",
        "Bake in preheated oven until the bacon is brown and crispy, and the chicken is no longer pink, 45 to 60 minutes. Remove from oven, and allow to rest for 5 to 10 minutes before removing toothpicks and serving."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "2 teaspoons minced garlic",
        "1 (10 ounce) bag washed fresh spinach",
        "4 skinless, boneless chicken breast halves",
        "1/2 (15 ounce) container ricotta cheese",
        "2/3 cup grated Parmesan cheese",
        "1/2 teaspoon garlic salt",
        "1/2 teaspoon onion powder",
        "2 teaspoons Italian seasoning",
        "salt and pepper to taste",
        "8 slices thick sliced bacon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bacon-Wrapped Chicken Stuffed with Spinach and Ricotta",
    "url": "http://allrecipes.com/recipe/149828/bacon-wrapped-chicken-stuffed-with-sp/"
}
