{
    "directions": [
        "In a heavy saucepan boil vinegar, water, onions, sugar, and 2 teaspoons chopped rosemary, stirring occasionally, 7 minutes, or until onions are slightly softened. Remove pan from heat and let stand 15 minutes. In a coarse sieve set over another saucepan drain onions, reserving cooking liquid. Transfer onion compote to a bowl and cool.",
        "Boil reserved cooking liquid with remaining 2 teaspoons chopped rosemary until reduced to about 3/4 cup. Add broth and boil liquid until reduced to about 1 1/2 cups. Stir in cream and boil sauce until reduced to about 2 cups. Reserve sauce in pan.",
        "Preheat oven to 450°F. and lightly oil a large shallow baking pan.",
        "Rinse trout under cold water and pat dry inside and out. Fill cavity of each trout with onion compote and season with salt and pepper. Wrap 4 slices bacon around middle of each trout, overlapping them slightly and leaving head and tail exposed.",
        "In a 12-inch heavy skillet heat oil over moderately high heat until hot but not smoking and brown trout, 2 at a time, until bacon is completely browned, about 5 minutes, pouring off excess fat between batches and transferring trout as browned with a long spatula to oiled pan. Top each trout with 2 rosemary sprigs and bake in middle of oven 15 to 20 minutes, or until cooked through.",
        "Pour off remaining fat from skillet and deglaze skillet with reserved sauce over moderate heat, scraping up any brown bits. Strain sauce through a fine sieve into saucepan. Season sauce with salt and pepper and keep warm.",
        "Divide sauce among 6 plates and top with trout."
    ],
    "ingredients": [
        "3/4 cup balsamic vinegar",
        "1 1/2 cups water",
        "2 large onions, sliced thin (about 4 cups)",
        "1/3 cup sugar",
        "4 teaspoons chopped fresh rosemary leaves plus 12 sprigs",
        "2 cups low-salt chicken broth",
        "1 cup heavy cream",
        "six 10-ounce trout, cleaned, leaving heads and tails intact",
        "24 slices bacon (about 1 1/2 pounds)",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Beef",
        "Fish",
        "Onion",
        "Bake",
        "Vinegar",
        "Rosemary",
        "Trout",
        "Winter",
        "Pan-Fry",
        "Gourmet"
    ],
    "title": "Bacon-Wrapped Trout Stuffed with Balsamic Onion Compote in Rosemary Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-wrapped-trout-stuffed-with-balsamic-onion-compote-in-rosemary-cream-sauce-10049"
}
