{
    "directions": [
        "Preheat oven to 375 degrees F.",
        "Place bacon onto a baking sheet and bake until crisp about 12 minutes. Remove from baking sheet and place onto a plate lined with a paper towel. Reserve 1 tablespoon of the bacon fat. Once bacon is cool enough to handle, chop into small pieces.",
        "Spray a 24-count mini muffin tray with non-stick cooking spray and set aside.",
        "In a large bowl combine flour, cornmeal, salt, baking powder, and brown sugar. In a separate bowl whisk the milk and egg. Whisk the milk mixture, melted butter and bacon fat into the dry ingredients. Add 3/4 of the chopped cooked bacon, reserve remaining 1/4 for a garnish.",
        "Fill each muffin cup with 1 tablespoon of the batter so the cups are filled about 3/4 of the way up. Bake in oven for 10 to 12 minutes or until a tooth pick inserted into the muffins comes out clean. Allow to cool completely before icing.",
        "While muffins are cooling, in a medium bowl beat the cream cheese, honey and hot sauce with a hand mixer until soft and combined. Add 3/4 of the sliced chives, reserve remaining 1/4 for a garnish. Mix until well combined.",
        "Transfer mixture to a pastry bag and snip off the end.",
        "Once the muffins have cooled, pipe a small amount of the cream cheese mixture on top of each one. Garnish with remaining crumbled bacon and remaining chopped chives."
    ],
    "ingredients": [
        "8 strips bacon",
        "3/4 cup all-purpose flour",
        "1/2 cup cornmeal",
        "3/4 teaspoon salt",
        "2 teaspoons baking powder",
        "2 tablespoons brown sugar",
        "3/4 cup milk",
        "1 egg",
        "3 tablespoons butter, melted",
        "1 tablespoon reserved bacon fat",
        "8 ounces cream cheese, softened",
        "2 tablespoons honey",
        "1 tablespoon hot sauce",
        "1 bunch chives, sliced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheese",
        "Cream Cheese Recipes",
        "Frosting Recipes",
        "Muffin",
        "Bacon Recipes",
        "Meat",
        "Cornmeal",
        "Grain Recipes",
        "Appetizer",
        "Lunch",
        "Brunch"
    ],
    "title": "Bacon Corn Muffins with Savory Cream Cheese Frosting",
    "url": "http://www.foodnetwork.com/recipes/brian-boitano/bacon-corn-muffins-with-savory-cream-cheese-frosting-recipe"
}
