{
    "directions": [
        "Line 2 baking sheets with parchment paper. Cook bacon in a large skillet over medium-low heat, stirring occasionally, until deep golden brown and crisp. Using a slotted spoon, transfer bacon to paper towels.",
        "Whisk flour and next 3 ingredients in a medium bowl. Using an electric mixer, beat both sugars and butter in a large bowl, occasionally scraping down sides, until well blended, 2-3 minutes. Add eggs one at a time, mixing well between additions. Add vanilla; mix on medium speed until pale and fluffy, 4-5 minutes. Mix in dry ingredients.",
        "Fold bacon, oats, and raisins into batter and stir until evenly incorporated (dough will be sticky; chill briefly for easier handling, if desired). Using a 2-ounce ice cream scoop or 1/4-cup measure and forming dough into balls, scoop batter onto prepared sheets, spaced at least 3\" apart. Chill dough for 1 hour or cover and chill overnight.",
        "Arrange racks in upper and lower thirds of oven; preheat to 375°F Bake cookies, rotating pans halfway through, until edges are light golden brown and centers are still slightly soft, 20-22 minutes. Let cool on baking sheets for 10 minutes. Transfer to a wire rack; let cool completely. DO AHEAD: Can be made 3 days ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "8 ounces sliced bacon, cut into 1/4\" squares",
        "2 1/4 cups cake flour",
        "1 teaspoon baking powder",
        "1 teaspoon kosher salt",
        "1/2 teaspoon baking soda",
        "1 cup (packed) dark brown sugar",
        "2/3 cup sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 large eggs",
        "1/2 teaspoon vanilla extract",
        "1 cup old-fashioned oats",
        "2/3 cup raisins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Raisin",
        "Bacon",
        "Oatmeal",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Bacon, Oatmeal, and Raisin Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-oatmeal-and-raisin-cookies-394670"
}
