{
    "directions": [
        "Place a pizza stone on the center rack of the oven and preheat the oven to 500 degrees F. Line a baking sheet with parchment paper and place it on top of the pizza stone.",
        "In a small skillet or pot, warm the olive oil over medium heat until very warm to the touch. Add the rosemary, thyme, red pepper flakes and garlic. Remove from the heat and let cool slightly. Stir in the parsley and season to taste with salt.",
        "In a medium skillet over medium-low heat, cook the bacon until crispy, turning occasionally, about 10 minutes. Drain on a paper towel-lined plate, then crumble.",
        "Lightly dust a work surface with flour. Flatten and shape each piece of dough into a 3 1/2-inch round.",
        "Spread 1/4 teaspoon tomato paste in the center of a round, leaving a small border around the edge. Tear a basil leaf into pieces and add to the center, along with about 1 teaspoon of bacon. Top with 3/4-ounce (about 1 heaping tablespoon) mozzarella. Sprinkle with a pinch of salt and some red pepper flakes. Very lightly brush the circumference of the dough with water. Bring the edges of the round towards the center, lightly pleating to form a tight enclosure, and pinch to seal. Using a metal skewer dipped in flour, make a hole in the center of the dough to create a steam vent. Place on a sheet of parchment and repeat with the remaining dough and fillings. Remove the hot baking sheet from the oven, then transfer all the dough balls to the hot baking sheet, spacing them 2 inches apart. Brush them liberally with the herb oil.",
        "Transfer the baking sheet to the pizza stone and bake, 5 minutes. Rotate the pan and bake until golden brown, about 5 minutes more. Brush with herb oil and serve immediately with marina sauce and the remaining herb oil for dipping."
    ],
    "ingredients": [
        "1/2 cup extra-virgin olive oil",
        "1 tablespoon finely chopped fresh rosemary",
        "1 tablespoon fresh thyme leaves",
        "1 teaspoon red pepper flakes, plus additional for seasoning",
        "3 cloves garlic, grated",
        "1 tablespoon finely chopped fresh parsley",
        "Kosher salt",
        "4 slices thick-cut bacon",
        "All-purpose flour, for dusting",
        "2 pounds pizza dough, divided into sixteen 2-inch balls weighing 2 ounces each",
        "4 teaspoons tomato paste",
        "16 basil leaves",
        "12 ounces fresh mozzarella, cut into 1/4-inch cubes",
        "Marinara sauce, warmed, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pizza Recipes",
        "Bacon Recipes",
        "Meat",
        "Cheese",
        "Appetizer",
        "Snack"
    ],
    "title": "Bacon-Cheese Pizza Bombs",
    "url": "http://www.foodnetwork.com/recipes/eddie-jackson/bacon-cheese-pizza-bombs"
}
