{
    "directions": [
        "Preheat oven to 300°F. Heat popcorn and oil in covered heavy large pot over medium-high heat until kernels begin to pop. Using oven mitts, hold lid on pot and shake pot until popping stops. Pour popcorn into very large bowl. Cook bacon in heavy large skillet over medium heat until almost crisp. Using slotted spoon, transfer to paper towels to drain; cool. Add bacon and cashews to bowl with popcorn. Sprinkle with coarse salt and cayenne; toss to coat.",
        "Bring cream and tea bag just to boil over medium heat. Remove from heat; let steep 15 minutes, occasionally pressing on tea bag with back of spoon to release flavor. Discard tea bag.",
        "Line rimmed baking sheet with foil; coat with nonstick spray. Coat 2 wooden spoons or heat-resistant spatulas with nonstick spray; set aside. Stir sugar, 1/4 cup water, and corn syrup in large saucepan over medium-low heat until sugar dissolves. Increase heat to high; boil without stirring until syrup turns deep amber, occasionally swirling pan and brushing down sides with wet pastry brush, about 13 minutes. Remove from heat and immediately add cream (mixture will bubble up). Stir until blended. Immediately drizzle caramel over popcorn mixture; toss with sprayed spoons until evenly coated. Transfer to sheet.",
        "Place caramel corn in oven and bake until caramel is shiny and coats popcorn, tossing mixture occasionally, about 20 minutes. Cool completely on sheet on rack, tossing occasionally to break up large clumps. DO AHEAD: Can be made 2 days ahead. Store airtight in refrigerator.",
        "The folks at Colt & Gray suggest The Derby, a classic cocktail made with bourbon, Bénédictine, and bitters."
    ],
    "ingredients": [
        "1/2 cup popcorn kernels",
        "2 tablespoons vegetable oil",
        "6 ounces bacon, chopped",
        "1/2 cup unsalted raw cashews (one 2.5-ounce package)",
        "1 teaspoon coarse kosher salt or coarse sea salt",
        "1/4 teaspoon cayenne pepper",
        "1/4 cup heavy whipping cream",
        "1 oolong tea bag",
        "Nonstick vegetable oil spray",
        "1 1/2 cups sugar",
        "1/4 cup water",
        "2 tablespoons light corn syrup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cocktail Party",
        "Low Cal",
        "Bacon",
        "Cashew"
    ],
    "title": "Bacon and Cashew Caramel Corn",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-and-cashew-caramel-corn-360755"
}
