{
    "directions": [
        "Preheat oven to 350°F. Spread bread cubes on 2 large rimmed baking sheets. Toast until light golden and crisp around edges, about 20 minutes. Cool completely.",
        "Preheat oven to 425°F. Combine bacon and 4 cups water in large saucepan; bring to boil. Reduce heat; simmer 10 minutes.",
        "Drain, discarding liquid. Place bacon in large roasting pan. Pour 2 cups chicken broth over. Roast until broth evaporates and bacon begins to crisp around edges, stirring occasionally, about 45 minutes.",
        "Meanwhile, melt butter in large nonstick skillet over medium-high heat. Add onions and 1 cup water; bring to boil. Reduce heat to medium; simmer until water evaporates, stirring occasionally, about 15 minutes. Reduce heat to medium-low; sauté until onions are soft, about 5 minutes longer.",
        "Remove roasting pan with bacon from oven; reduce oven temperature to 375°F. Mix cooked onions, apples, fennel, and celery into bacon in roasting pan. Roast until apples and all vegetables are tender, stirring occasionally, about 1 hour. Cool slightly. DO AHEAD: Can be made 1 day ahead. Store toasted bread in large resealable plastic bags. Chill bacon-apple mixture uncovered until cool, then cover and keep chilled. Let stand at room temperature 1 hour before continuing.",
        "Preheat oven to 375°F. Butter 13x9x2- inch glass baking dish. Combine toasted bread, 3/4 cup chicken broth, and baconapple mixture in very large bowl. Mix in 1 teaspoon coarse salt and 3/4 teaspoon pepper. Mix in eggs, then 1/2 cup parsley. Add more chicken broth by 1/4 cupfuls if mixture is dry. Transfer to prepared dish. Cover dish with buttered foil; bake 35 minutes. Uncover; bake until top is browned, about 30 minutes longer. Sprinkle with remaining parsley."
    ],
    "ingredients": [
        "1 pound applewood-smoked bacon slices, coarsely chopped (about 4 cups)",
        "2 3/4 cups (or more) low-salt chicken broth, divided",
        "1/4 cup (1/2 stick) butter",
        "4 cups finely chopped onions",
        "6 cups 1/2-inch pieces peeled cored sweet-tart heir loom apples (such as Arkansas Black; about 5 large) or other sweet-tart apples (such as Pink Lady)",
        "2 cups finely chopped fresh fennel bulbs",
        "1 cup finely chopped celery",
        "1 teaspoon coarse kosher salt",
        "3/4 teaspoon freshly ground black pepper",
        "3 large eggs, beaten to blend",
        "2/3 cup chopped fresh Italian parsley, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Roast",
        "Sauté",
        "Thanksgiving",
        "High Fiber",
        "Dinner",
        "Stuffing/Dressing",
        "Apple",
        "Bacon",
        "Fennel",
        "Fall",
        "Family Reunion",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Bacon, Apple and Fennel Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-apple-and-fennel-stuffing-350422"
}
