{
    "directions": [
        "Preheat oven according to instructions on cake mix box; prepare mix. Grease and flour a 9 inch pan, and a shallow metal bowl at least 9 inches in diameter. Fill the 9 inch cake pan 2/3 full with cake batter; pour the remaining batter into the prepared metal bowl (this will be the top of your \"bun\"). Bake according to directions, remove from pans, and cool on a wire rack.",
        "Grease and flour a 9 inch pan. Prepare brownie batter, and bake according to instructions on box. Remove from pan, and cool on a wire rack.  Shave off the sharp edges of the brownie, making it resemble a hamburger patty.",
        "Place 1/4 cups of vanilla frosting in a heavy duty plastic sandwich bag, and color with yellow food coloring to make your mustard. Repeat a second time using the red food coloring to make your ketchup.  Place remaining frosting in a bowl, and color with a mix of red and yellow food coloring until you arrive at the color of a hamburger bun.",
        "Cut the cookies in half and wrap with pieces of red fruit leather to create your tomatoes.  Unwrap the caramels, and heat in microwave for 10 to 15 seconds to slightly soften.  Roll the caramels individually between sheets of waxed paper to create bacon strips. Microwave the chewy fruit-flavored candy squares, place together, and roll between sheets of waxed paper to create your cheese slice; trim into a square shape.",
        "To assemble, place bottom bun on your serving dish, and spread with some of the hamburger bun frosting.  Place brownie on top of this, and spread it with chocolate frosting. Decorate edges with the tomatoes, bacon, cheese, mustard, and ketchup; use the green fruit leather as lettuce.  Place top bun over this and spread with the remaining hamburger bun frosting; sprinkle with sesame seeds."
    ],
    "ingredients": [
        "1 (18.25 ounce) package yellow cake mix",
        "1 (13 ounce) package brownie mix",
        "2 (12 fluid ounce) cans vanilla frosting",
        "yellow food coloring",
        "red food coloring",
        "3 vanilla wafer cookies",
        "1 large roll of red fruit leather",
        "4 caramels, with stripes",
        "8 yellow chewy fruit-flavored candy squares",
        "1 (16 ounce) container chocolate frosting",
        "1 large roll of green fruit leather",
        "2 teaspoons sesame seeds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bacon Cheeseburger Cake",
    "url": "http://allrecipes.com/recipe/81072/bacon-cheeseburger-cake/"
}
