{
    "directions": [
        "Sterilize two jam jars: wash them in hot soapy water then transfer them to a moderate oven to dry.",
        "Fry the bacon in a wide low-sided sauté pan, stirring frequently, until cooked and beginning to brown. Remove the bacon with a slotted spoon and set aside. If there is a lot of fat in the pan, discard most of it, leaving just enough to sweat the shallots—about 1 tablespoon. If there is not enough fat, add a little knob of butter—about 1/2 oz.",
        "Add the shallots and garlic to the pan and cook gently on a low heat until softened. Then add the spices and cook for a few minutes. Next, add the whiskey, turn up the heat and stir to deglaze the bottom of the pan and cook out most of the alcohol, being very careful as it may flame. Do not measure out the whiskey near the pan or flame.",
        "Finally, return the bacon to the pan, add the sugar, honey, vinegar and marmalade and let it bubble until it becomes sticky and glossy. Transfer into the sterilized jars, allow to cool, then label and store. This will keep up to 1 month in the fridge.",
        "Serve at room temperature, or even a little warm, on buttered toast."
    ],
    "ingredients": [
        "2 pounds bacon, cut into strips",
        "Scant 1/2 ounce butter (optional)",
        "14 ounces shallots, peeled and chopped",
        "2 cloves garlic, not too large, peeled and chopped",
        "1/2 teaspoon sweet smoked paprika",
        "1 teaspoon ground ginger",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "5 fl. ounces Irish whiskey",
        "3 1/2 ounces light soft brown sugar",
        "3 1/2 ounces honey",
        "5 fl. ounces cider vinegar",
        "3 1/2 ounces marmalade"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Bacon",
        "Jam or Jelly",
        "Onion",
        "Breakfast",
        "Condiment/Spread",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Bacon and Whiskey Jam",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-and-whiskey-jam"
}
