{
    "directions": [
        "Combine all brining ingredients except pork loin in a 3- to 4-quart saucepan and heat over high heat, stirring, until salt is dissolved. Pour brine into a deep 4- to 5-quart pot; cool to room temperature, uncovered, about 2 hours.",
        "Add pork to brine, making sure it is completely covered by brine, and marinate, covered and chilled, 8 to 24 hours.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Pat pork dry (discard brine) and remove any strings, then transfer to a roasting pan. Stir together garlic, sage, and 1 tablespoon syrup in a small bowl and rub all over pork. Lay bacon slices crosswise over loin, overlapping slightly, and tuck ends of bacon underneath loin.",
        "Roast pork until thermometer registers 140°F, about 1 1/4 hours. Stir together 1 tablespoon syrup and vinegar until combined. Brush vinegar mixture over bacon slices and continue to roast pork until thermometer registers 150°F, about 10 minutes more. Remove from oven and let stand in pan 15 minutes. Transfer roast to a cutting board with a lip, reserving juices in pan, and let roast stand, uncovered, while making sauce.",
        "Skim fat from pan juices and discard, then transfer jus to a small saucepan and bring to a simmer. Stir together cornstarch and water and whisk into jus. Simmer, stirring, until slightly thickened, about 1 minute. Remove from heat and stir in remaining tablespoon syrup. Serve pork with sauce."
    ],
    "ingredients": [
        "8 cups water",
        "1/3 cup kosher salt",
        "2 tablespoons maple syrup (Grade B or amber)",
        "1/2 teaspoon crushed black peppercorns",
        "2 sprigs fresh sage",
        "1 large garlic clove, smashed",
        "1 Turkish or 1/2 California bay leaf",
        "1 (4- to 4 1/2-lb) boneless pork loin roast, trimmed",
        "3 garlic cloves, finely chopped",
        "2 tablespoons finely chopped fresh sage",
        "3 tablespoons maple syrup (Grade B or amber)",
        "16 bacon slices (about 1 lb)",
        "1 tablespoon cider vinegar",
        "1/2 teaspoon cornstarch",
        "1 teaspoon water",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Roast",
        "Super Bowl",
        "Quick & Easy",
        "Bacon",
        "Pork Tenderloin",
        "Fall",
        "Winter",
        "Brine",
        "Engagement Party",
        "Maple Syrup",
        "Simmer",
        "Gourmet"
    ],
    "title": "Bacon-Wrapped Maple Pork Loin",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-wrapped-maple-pork-loin-233983"
}
