{
    "directions": [
        "Lay 2 overlapping sheets of plastic wrap, measuring a few inches longer than the beef tenderloin, on a work surface.",
        "Season the beef with salt and pepper. Place the roast in the center of the plastic wrap and wrap a bacon slice around one end of the roast. Continue to wrap the roast with the remaining bacon slices, slightly overlapping them, to cover the entire roast. If the bacon does not completely cover the roast, carefully turn the roast over and continue wrapping it with another bacon slice. Pull the plastic wrap tightly around the roast, making sure to secure the bacon in place, and refrigerate for 1 hour.",
        "Preheat an oven to 400ºF.",
        "Remove the roast from the plastic wrap. In a roasting pan over medium heat, warm the oil. Add the roast and sear for 5 to 7 minutes. Gently turn the roast over and sear for 5 to 7 minutes. Then turn the roast and sear on the remaining 2 sides until the bacon fat is rendered and begins to crisp, about 5 minutes per side. Transfer the meat to a roasting rack set over a baking sheet.",
        "Carefully pour off all but 4 Tbs. of the fat from the pan. Add the mushrooms and garlic to the pan and season with salt and pepper. Set the roasting rack, with the roast on top, over the mushrooms and transfer the pan to the oven. Roast until an instant-read thermometer inserted into the center of the roast registers 135ºF for medium-rare, about 20 minutes.",
        "Transfer the roast to a carving board, cover loosely with aluminum foil and let rest for 10 minutes. Carve the roast into thin slices and arrange on a warmed platter. Spoon the mushrooms alongside, sprinkle with the parsley and serve immediately. Serves 8 to 10."
    ],
    "ingredients": [
        "1 beef tenderloin roast, about 3 1/2 lb., trimmed of excess fat",
        "Kosher salt and freshly ground pepper, to taste",
        "1 lb. bacon, thinly sliced",
        "1 Tbs. vegetable oil",
        "1 lb. cremini mushrooms, quartered",
        "3 garlic cloves, sliced",
        "1 Tbs. minced fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Bacon-Wrapped Beef Tenderloin Roast",
    "url": "http://www.williams-sonoma.com/recipe/bacon-wrapped-beef-tenderloin.html"
}
