{
    "directions": [
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned and crisp, about 10 minutes. Drain bacon slices on paper towels. Crumble or finely chop. Drain fat from skillet, reserving 1 tablespoon.",
        "Mix cream cheese, creme fraiche, green onions, and lime juice together in a bowl. If mixture seems too thick, add enough water to thin it to your preferred consistency.",
        "Place skillet over medium-high heat. Add cold water, butter, reserved bacon fat, and salt. Bring mixture to a simmer; reduce heat to medium. Pour in flour all at once. Stir to mix and mash with a wooden spoon until dough starts to pull together, 2 to 3 minutes. Remove pan from heat; transfer dough to a mixing bowl and let cool for about 5 minutes.",
        "When dough is cool, whisk in 1 egg. Mixture will separate slightly. Continue whisking in first egg until mixture pulls back together. Repeat with the second egg. Scrape down sides of bowl. Add diced jalapeno, bacon pieces, shredded cheese, cayenne pepper, and black pepper. Mix thoroughly with a spatula. Wrap dough in plastic wrap and refrigerate until cool, 30 minutes to 1 hour.",
        "Heat oil in deep fryer to 375 degrees F.",
        "Using a small scoop, scoop out rounds of dough. Drop rounds of dough into hot oil and cook until golden brown and cooked through, 3 to 4 minutes. Work in batches if necessary. Transfer to a cooling rack.",
        "serve with dipping sauce garnished with a few green onion slices."
    ],
    "ingredients": [
        "4 strips bacon",
        "Dipping Sauce:",
        "1/2 cup cream cheese, softened",
        "1/4 cup creme fraiche or sour cream",
        "2 tablespoons minced green onions, plus some for garnish",
        "1 teaspoon fresh lime juice",
        "Dough:",
        "2/3 cup water",
        "3 tablespoons butter",
        "1 tablespoon bacon fat",
        "1 teaspoon kosher salt",
        "2/3 cup all-purpose flour",
        "2 eggs",
        "2 ounces shredded extra-sharp white Cheddar cheese",
        "1/2 cup finely diced jalapeno peppers",
        "1 pinch cayenne pepper",
        "1 pinch freshly ground black pepper",
        "2 cups vegetable oil for deep frying, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bacon Jalapeno Popper Puffs",
    "url": "http://allrecipes.com/recipe/246256/bacon-jalapeno-popper-puffs/"
}
