{
    "directions": [
        "Melt butter in large pot over medium heat. Add garlic; sauté 2 minutes. Add breadcrumbs. Sauté until golden brown, about 4 minutes. Remove from heat; mix in parsley. Season stuffing with salt and pepper. Cool completely.",
        "Starting at 1 long side, cut each tenderloin lengthwise almost in half, stopping about 1/2 inch from opposite long side. Open tenderloins like books. Sprinkle cut sides with salt and pepper. Pack half of stuffing on 1 side of each tenderloin. Fold plain side over stuffing.",
        "Slightly overlap half of bacon slices on sheet of parchment paper, forming rectangle equal in length to 1 tenderloin. Place tenderloin at 1 edge, across bacon ends. Using parchment as aid, roll up tenderloin in bacon. Using kitchen string, secure bacon around tenderloin, tying at 1 1/2-inch intervals, then tie once lengthwise. Repeat with remaining bacon and tenderloin. (Can be prepared 1 day ahead. Wrap tenderloins and refrigerate. Let stand at room temperature 1 hour before continuing.)",
        "Preheat oven to 400°F. Pour enough oil into large skillet to coat bottom; heat over high heat. Add 1 tenderloin. Sauté until bacon is brown, turning often, about 10 minutes. Transfer to rimmed baking sheet. Repeat with second tenderloin. Roast until thermometer inserted into center of each registers 130°F to 135°F for medium-rare, about 30 minutes. Transfer to platter. Let stand 15 minutes. Cut off strings. Cut tenderloins into 1/2-inch-thick slices."
    ],
    "ingredients": [
        "1 cup (2 sticks) butter",
        "6 garlic cloves, chopped",
        "4 cups fresh breadcrumbs made from crustless French bread",
        "2 1/2 cups chopped fresh parsley (from 2 to 3 large bunches)",
        "2 2 1/4- to 2 1/2-pound center-cut beef tenderloin roasts",
        "20 to 24 bacon slices (about 1 1/2 pounds)",
        "Canola oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Herb",
        "Pork",
        "Roast",
        "Christmas",
        "Beef Tenderloin",
        "Bacon",
        "Winter"
    ],
    "title": "Bacon-Wrapped Beef Tenderloin with Herb Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-wrapped-beef-tenderloin-with-herb-stuffing-231287"
}
