{
    "directions": [
        "Heat oil in a 12-inch heavy skillet over medium heat until it shimmers, then cook onions with 1/2 teaspoon salt and 1/4 teaspoon freshly ground black pepper, covered, stirring occasionally, until golden and softened, 15 to 20 minutes.",
        "Reduce heat to medium-low, then add vinegar, scraping up the brown bits on bottom of the skillet, and cook, uncovered, stirring, until liquid evaporates, 1 to 2 minutes. Season to taste with salt and pepper. Transfer to a small bowl and keep warm, covered.",
        "Prepare grill for indirect-heat cooking over medium-hot charcoal (medium heat for gas; see grilling procedure ).",
        "Meanwhile, cut frozen bacon crosswise into eight sections and distribute evenly in bowl of a food processor, then pulse until finely chopped.",
        "In a large bowl, distribute bacon evenly over beef and drizzle mixture with Worcestershire sauce. Sprinkle evenly with 1 teaspoon salt and 1/2 teaspoon freshly ground black pepper.",
        "Combine mixture as gently and thoroughly as possible with your fingers (be careful not to overmix). Form into 4 patties, about 4 inches in diameter and 1 inch thick.",
        "Brush cut sides of buns with butter.",
        "Oil grill rack, then sear patties directly over coals (or lit burner or burners), covered only if using a gas grill, moving to area of grill with no coals (or over shut-off burner) if flare-ups occur, until browned, 2 to 3 minutes on each side.",
        "Move burgers to area with no coals (or over shut-off burner) and grill, covered, turning once, until they reach 155°F on instant-read thermometer, about 4 minutes total. Top with cheese to taste and heat, covered, until it melts and burgers register 160°F, about 1 minute. Transfer burgers to a clean platter.",
        "Grill buns, buttered side down, until grill marks appear, about 1 minute.",
        "Assemble burgers with buns and accompaniments, topping cheese with caramelized onions."
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil",
        "1 1/2 pounds onions (2 large), sliced into 1/2-inch-thick rings",
        "Salt and freshly ground black pepper",
        "3 tablespoons seasoned rice vinegar",
        "1/2 pound sliced bacon, frozen 1 hour",
        "1 1/2 pounds ground beef chuck",
        "1 tablespoon Worcestershire sauce",
        "Salt",
        "Freshly ground black pepper",
        "2 tablespoons unsalted butter, melted",
        "4 to 8 thin slices extra-sharp Cheddar",
        "4 hamburger buns or alternatives such as kaiser or brioche rolls",
        "Sliced tomato",
        "Soft-leaf lettuce leaves or baby arugula",
        "Special equipment: An instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Cheese",
        "Onion",
        "Fourth of July",
        "Kid-Friendly",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Cheddar",
        "Meat",
        "Ground Beef",
        "Bacon",
        "Tailgating",
        "Grill",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Bacon-Cheddar Burgers with Caramelized Onions",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-cheddar-burgers-with-caramelized-onions-51112220"
}
