{
    "directions": [
        "Preheat oven to 350°F",
        "In a food processor, pulse the nuts until they are ground, but not turned into meal. Add the bacon, sugar, and cardamom and pulse a few more times until the nut mixture is finely chopped and evenly blended.",
        "Begin layering the baklava. Brush a jellyroll pan, or sheet pan with sides, generously with the melted butter. Unroll the phyllo dough and cover the sheets with a piece of plastic wrap and a damp towel. This keeps the sheets from drying out while you are layering the baklava. Read the package for detailed handling instructions.",
        "Place a sheet of phyllo on the sheet pan and brush it with melted butter. Repeat with 6 more sheets of phyllo dough and butter for a total of 7 sheets. You do not have to cover every last inch of the phyllo with butter, but try and have it evenly dispersed between all of the layers. Spread 1/3 cup of the nut mixture evenly over the phyllo. Top the nuts with two more buttered sheets of phyllo. Continue sprinkling with 1/3 cup of the nut mixture adding two sheets of buttered phyllo until all of the nut mixture is used. Top with a final layer of 7 buttered phyllo sheets.",
        "Use a sharp knife to cut the uncooked baklava into 24 diamond shapes. Bake the baklava until it is brown and crisp, 30-35 minutes.",
        "While the baklava is baking, combine the water, sugar, and honey in a saucepan. Gradually heat the mixture until the sugar dissolves. Add the cinnamon stick and bring the mixture to a boil. Reduce the heat slightly and simmer for 25-30 minutes. Remove the pan from heat, add the orange flower water and cool slightly. Pour the syrup evenly over the baklava as soon as it comes out of the oven. Make sure you get the syrup in every crack and crevice. Leave to soak for several hours. Serve at room temperature and store leftovers in the refrigerator."
    ],
    "ingredients": [
        "1/2 pound raw walnut pieces",
        "1/2 pound raw pistachio meats",
        "1 cup cooked and crumbled bacon (about 12 slices)",
        "1/3 cup sugar",
        "1 teaspoon ground cardamom",
        "1 1/4 cup (2 1/2 sticks) unsalted butter, melted",
        "1 package (16 ounces) phyllo dough, thawed",
        "1 cup water",
        "1 cup sugar",
        "1 cup honey",
        "1 cinnamon stick",
        "1/4 cup orange flower water or rose water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Nut",
        "Dessert",
        "Bake",
        "Bacon",
        "Pistachio",
        "Walnut",
        "Honey",
        "Phyllo/Puff Pastry Dough",
        "Kidney Friendly",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Bacon Baklava",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-baklava-51225820"
}
