{
    "directions": [
        "1. If you will be grilling the burgers, preheat a barbecue grill to medium-high.",
        "2. While the grill is heating up, cook the bacon on the stovetop in a large skillet over medium-low heat until it is just crisp, 6 to 7 minutes. Transfer the bacon to a plate lined with paper towels and set it aside to drain. (If you prefer to panfry the burgers, reserve 2 tablespoons of the bacon fat in the skillet.)",
        "3. Place the beef, Worcestershire, Tabasco, thyme, and salt and pepper in a bowl, and toss lightly with a fork to combine. Form the mixture into 4 patties, each about 3 inches in diameter and 1 inch thick.",
        "4. When you are ready to grill the burgers, oil the grill grate well. Add the burgers and grill for about 3 minutes for rare, 4 minutes for medium-rare meat. Turn them over and grill for another 3 or 4 minutes, topping the burgers with the cheese in the last minute of cooking. (Or panfry the burgers in the hot bacon fat over medium heat for 3 minutes per side for rare meat, adding the cheese as described.)",
        "5. Place the burgers on the toasted buns, and top them with the bacon, tomato, onion, avocado, and lettuce. Cover with the tops of the buns and serve immediately."
    ],
    "ingredients": [
        "8 slices bacon",
        "1 pound ground beef chuck or sirloin",
        "1 teaspoon Worcestershire sauce",
        "1 or 2 dashes Tabasco sauce",
        "1/4 teaspoon dried thyme leaves",
        "Salt and freshly ground black pepper, to taste",
        "Vegetable oil, for grilling",
        "4 slices Swiss cheese",
        "4 hamburger buns, toasted, for serving",
        "Thinly sliced ripe tomato, for garnish",
        "Thinly sliced red onion, for garnish",
        "Sliced ripe avocado, for garnish",
        "Boston lettuce leaves, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Tomato",
        "Kid-Friendly",
        "Quick & Easy",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Ground Beef",
        "Bacon",
        "Avocado",
        "Grill",
        "Grill/Barbecue",
        "Swiss Cheese",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Bacon Swiss Burgers with Tomato and Avocado",
    "url": "http://www.epicurious.com/recipes/food/views/bacon-swiss-burgers-with-tomato-and-avocado-350990"
}
