{
    "directions": [
        "In a large bowl or very large plastic bag with a secure seal, mix together the onions, leeks, carrot, garlic, bay leaves, juniper berries, thyme, parsley, wine, beef, pork, lamb, 1 1/2 teaspoons salt, and 1 teaspoon pepper. Mix well, seal, and refrigerate for at least 12 hours and up to 24 hours. Mix the meats and marinade occasionally; if they are in a bag, just turn it over once or twice.",
        "When ready to cook, preheat the oven to 350°. Smear the olive oil all over the bottom of a 6- or 8-quart Dutch oven.",
        "Peel the potatoes if you like; using a mandoline, slice them thinly and season well with salt and pepper. Do not wash the potatoes after slicing. The potato starch thickens the broth. Cover the bottom of the pot with half of them. Strain the solids and meat from the marinade, reserving both separately. Spread the meats and vegetables on top of the potatoes and then top with the remaining potatoes. Carefully pour the reserved marinade over the potatoes. If the liquid does not cover the top of the potatoes, add more wine or water until they are just covered.",
        "Cover the pot and bring the stew to a gentle simmer on top of the stove. Place the pot in the oven and bake until the meats are very tender, about 3 1/2 hours. Serve, directly from the casserole, in warm, generously sized soup plates."
    ],
    "ingredients": [
        "2 medium yellow onions, finely chopped",
        "2 small leeks, white and pale green parts, finely chopped",
        "1 large carrot, peeled and finely chopped",
        "2 or 3 cloves garlic, very finely chopped",
        "2 bay leaves",
        "1 teaspoon whole juniper berries",
        "1 1/2 teaspoons finely chopped fresh thyme",
        "3 tablespoons finely chopped fresh flatleaf parsley",
        "3 cups (one 750-milliliter bottle) dry white wine, such as an Alsatian pinot gris, plus more, if needed, for the pot",
        "1 pound boneless beef chuck roast, cut into 1¼-inch chunks",
        "1 pound boneless pork butt, trimmed and cut into 1¼-inch chunks",
        "1 pound boneless lamb shoulder, trimmed and cut into 1¼ inch cubes",
        "Sea salt and freshly ground black pepper",
        "1 tablespoon extra-virgin olive oil",
        "4 pounds Russet potatoes, peeled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Christmas",
        "Winter",
        "Christmas Eve",
        "Mandoline"
    ],
    "title": "Baeckeoffe / Laundry Day Stew of Beef, Pork, and Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/baeckeoffe-laundry-day-stew-of-beef-pork-and-lamb-51125400"
}
