{
    "directions": [
        "In large bowl, sprinkle yeast over warm water to soften; stir to dissolve. Add 2 tablespoons sugar, oil, 6 cups of flour, and salt. Mix thoroughly until the dough forms up and leaves the sides of the bowl. Turn dough out on floured board and knead, adding small amounts of flour as necessary. Bagel dough should be pretty stiff. Work in as much extra flour as you can comfortably knead. Knead until smooth and elastic, 12-15 minutes.",
        "Roll the dough into a ball, place it in a large oiled bowl, and turn to coat. Cover and let fully rise until an impression made with your finger remains and does not sink into the dough (about an hour).",
        "Punch down and cut into thirds, and roll each piece between your palms into a rope. Cut each rope into 4 equal pieces and shape into balls. Roll the first ball into another rope that is about 2\" longer than the width of your hand. Make a ring with the dough, overlapping ends about 1/2\" and sealing the ends by rolling with your palm on the board. If the dough resists rolling, dab on a drop of water with your finger. Evenly place the bagels on 2 nonstick baking pans or very lightly oiled baking sheets. Cover and let stand until puffy, about 20 minutes.",
        "While bagels are proofing, fill a 4 quart saucepan 2/3 full with cold water; add 1 tablespoon sugar and bring to a boil. When ready to cook, drop 2 or 3 bagels at a time into the boiling water and wait until they rise to the top. Cook for a total of 1 minute, turning once.",
        "Carefully lift each bagel out with a slotted spoon or skimmer. Drain momentarily. Turn into a dish with topping,  if desired. Evenly space bagels on 2 nonstick baking pans or very lightly oiled baking sheets.",
        "Bake with steam in a preheated 500 degree F (260 degrees C) oven until well-browned, about 20 minutes. Turn bagels over when the tops begin to brown, and continue baking until done."
    ],
    "ingredients": [
        "2 cups warm water (110 degrees F/45 degrees C)",
        "1/2 (.25 ounce) package active dry yeast",
        "2 tablespoons white sugar",
        "1 tablespoon vegetable oil",
        "7 cups bread flour",
        "1 tablespoon salt",
        "1 tablespoon white sugar",
        "3 tablespoons poppy seeds (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bagels II",
    "url": "http://allrecipes.com/recipe/6928/bagels-ii/"
}
