{
    "directions": [
        "Preheat oven to 350\u0081°. Butter a shallow 3-quart baking dish and a sheet of foil. Place bread in a very large bowl.",
        "Toast nuts on a rimmed baking sheet, tossing once, until golden brown, 6-8 minutes. Let cool; add to bowl with bread.",
        "Meanwhile, heat oil in a large skillet over medium-high. Cook pancetta, stirring often, until browned and crisp, 5.8 minutes. Transfer to bowl with a slotted spoon.",
        "Add leeks and celery to skillet, season with salt and pepper, and cook, stirring often, until leeks are golden brown and soft, 10.15 minutes. Transfer to bowl.",
        "Reduce heat, add Cognac to skillet (take care, as it can ignite), and cook, scraping up any browned bits, until almost all evaporated, about 1 minute. Add 1/2 cup butter; cook, stirring, until melted. Drizzle over bread mixture.",
        "Whisk eggs and 2 cups stock in a medium bowl; pour over bread mixture. Add oysters, thyme, sage, and lemon zest, season with salt and pepper, and toss, adding more stock 1/4-cupful at a time as needed (you may not use it all), until combined and bread is hydrated. Transfer to prepared dish and dot with remaining 1/4 cup butter. Top with lemon slices.",
        "Cover with buttered foil; bake until a paring knife inserted into the center comes out hot, 30-35 minutes. Increase oven temperature to 450\u0081°. Uncover and bake until top is golden brown and crisp, 20-25 minutes. Let sit 10 minutes before serving.",
        "Do ahead: Stuffing can be assembled 1 day ahead. Cover and chill."
    ],
    "ingredients": [
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into pieces, divided, plus more",
        "10 cups coarsely torn baguette, dried out overnight",
        "1/4 cup pine nuts",
        "3 tablespoons olive oil",
        "4 ounces pancetta, cut into 1/4\" pieces",
        "2 large leeks, white and pale-green parts only, thinly sliced",
        "4 celery stalks, chopped",
        "Kosher salt, freshly ground pepper",
        "1/4 cup Cognac",
        "2 large eggs",
        "3 cups chicken stock or low-sodium chicken broth, divided",
        "1 cup coarsely chopped canned smoked oysters",
        "2 tablespoons chopped fresh thyme",
        "2 tablespoons finely chopped fresh sage",
        "2 teaspoons finely grated lemon zest",
        "1/2 lemon, thinly sliced, seeds removed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Side",
        "Thanksgiving",
        "Kid-Friendly",
        "Stuffing/Dressing",
        "Oyster",
        "Leek",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Baguette, Smoked Oyster, and Pancetta Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/baguette-smoked-oyster-and-pancetta-stuffing-51255130"
}
