{
    "directions": [
        "Whisk together 2 tablespoons olive oil, 2 tablespoons lime juice, half of garlic, 1 teaspoon salt, and 1/2 teaspoon pepper in a large bowl. Add chicken and toss to coat, then marinate, chilled, 30 minutes.",
        "Whisk together 1 tablespoon olive oil, 1 tablespoon lime juice, remaining garlic, and remaining 1/4 teaspoon pepper in another bowl. Add peeled shrimp and toss to coat, then marinate, covered and chilled, until ready to use (not more than 1 hour).",
        "Meanwhile, grind dried shrimp in grinder until very fluffy, about 1 minute. Pulse peanuts and cashews separately, in small batches, in a food processor, until finely ground (do not grind to a paste).",
        "Remove chicken from marinade and pat dry. Heat remaining tablespoon olive oil in a 5- to 6-quart wide heavy pot over moderately high heat until hot but not smoking, then, starting skin sides down, brown chicken, in batches if necessary, turning over once, about 6 minutes total per batch, transferring to a large plate. Add onions and bell pepper to pot and sauté, stirring occasionally and scraping up brown bits (from chicken), until onions are golden, 6 to 8 minutes. Add tomatoes and malagueta peppers or Thai chiles and cook, stirring occasionally, until tomatoes begin to break down, about 3 minutes. Stir in stock and bring to a simmer. Add chicken, along with juices accumulated on plate, and simmer, covered, until chicken is cooked through, 25 to 30 minutes.",
        "Stir in ground shrimp and ground nuts and return to a simmer. Toss marinated shrimp with remaining 1/2 teaspoon salt and add to stew along with marinade. Simmer until shrimp are just cooked through, 3 to 4 minutes.",
        "Stir in coconut milk, cilantro, remaining tablespoon lime juice, and dendê oil (if using).",
        "*Available at Asian markets.",
        "**Available at some Latino markets.",
        "***Available at some Lantino markets and sendexnet.com."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil",
        "1/4 cup fresh lime juice",
        "3 garlic cloves, chopped",
        "1 1/2 teaspoons salt",
        "3/4 teaspoon black pepper",
        "1 (3 1/2-lb) chicken, cut into 8 serving pieces",
        "1/2 lb medium shrimp in shell (21 to 25 per lb), peeled and deveined",
        "1 oz dried shrimp*",
        "1/2 cup salted roasted cocktail peanuts",
        "1/2 cup salted roasted cashews",
        "2 medium onions, chopped",
        "1 green bell pepper, chopped",
        "1 lb fresh tomatoes, chopped",
        "4 bottled red malagueta peppers** or 1- to 2-inch fresh red Thai chiles",
        "1 3/4 cups chicken stock or reduced-sodium chicken broth (14 fl oz)",
        "1 cup well-stirred canned unsweetened coconut milk (8 fl oz)",
        "1/2 cup chopped fresh cilantro",
        "2 tablespoons dendê oil***, optional",
        "Special equipment: an electric coffee/spice grinder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Chicken",
        "Onion",
        "Tomato",
        "Stew",
        "Lime",
        "Peanut",
        "Cashew",
        "Shrimp",
        "Hot Pepper",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Bahian Chicken and Shrimp Stew",
    "url": "http://www.epicurious.com/recipes/food/views/bahian-chicken-and-shrimp-stew-232607"
}
