{
    "directions": [
        "Preheat oven to 350°F. Combine first 6 ingredients in large bowl. Add butter and rub in with fingertips until mixture forms moist clumps. Mix in walnuts. Sprinkle mixture onto rimmed baking sheet. Bake until golden brown and crisp, occasionally stirring gently and leaving mixture in clumps, about 35 minutes. Cool completely. (Can be made 2 days ahead. Store airtight.)",
        "Combine 3/4 cup cream, 6 tablespoons Baileys liqueur, sugar, yolks and nutmeg in large metal bowl. Place over saucepan of simmering water (do not allow bottom of bowl to touch water). Using electric mixer, beat until custard thickens and thermometer registers 160°F, about 8 minutes. Remove from over water and beat until cool, about 8 minutes. Mix in remaining 6 tablespoons liqueur. Beat remaining 1/2 cup cream in medium bowl to medium peaks. Fold into custard. Cover and chill at least 4 hours or overnight.",
        "Layer 1/4 cup pudding, 1 tablespoon currants and 3 tablespoons crunch in each of six 12-ounce goblets; repeat layering 1 more time. Serve immediately or refrigerate up to 1 hour."
    ],
    "ingredients": [
        "1 cup old-fashioned oats",
        "3/4 cup all purpose flour",
        "1/2 cup (packed) golden brown sugar",
        "2 teaspoons instant coffee crystals",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "3/4 cup coarsely chopped walnuts",
        "1 1/4 cups chilled whipping cream",
        "12 tablespoons Baileys Original Irish Cream",
        "3/4 cup (packed) golden brown sugar",
        "6 large egg yolks",
        "1/4 teaspoon ground nutmeg",
        "12 tablespoons dried currants"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Nut",
        "Dessert",
        "Freeze/Chill",
        "Vegetarian",
        "St. Patrick's Day",
        "Spring",
        "Chill",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Baileys Pudding Parfaits with Oatmeal-Walnut Crunch",
    "url": "http://www.epicurious.com/recipes/food/views/baileys-pudding-parfaits-with-oatmeal-walnut-crunch-100970"
}
