{
    "directions": [
        "For the Beer Batter:",
        "Mix the flour, salt and pepper in a medium bowl. Gradually add in the beer while whisking. Set aside and let the batter rest for 15 minutes before using.",
        "For Cream Sauce:",
        "Add the mayonnaise and crema to a medium bowl. Whisk in the lemon zest, lemon juice and water. Season, to taste, with salt and pepper (can be made 3 days ahead, covered and refrigerated).",
        "For the Fish:",
        "In a large skillet, over medium heat, add enough oil to reach a depth of 1-inch. Heat the oil until a deep-fry thermometer registers 350 degrees F or when the end of a wooden spoon sizzles when inserted into the oil.",
        "On a large plate, combine the flour and salt. Season the fish pieces all over with salt and pepper and coat with the flour. Working in batches, dip the fillets in the beer batter and coat on both sides. Fry in the hot oil until golden brown and cooked through, about 5 minutes. Transfer to paper towels to drain.",
        "Make tacos with the tortillas and fish and top each with cream, shredded cabbage, tomatillo salsa and pickled jalapenos, if desired.",
        "*Cook's Note: Crack open a cold Mexican cerveza like a Negra Modelo or a 2 Equis (XX) Amber to make this tasty beer batter, which will change the way you think about fried fish! You can use it for vegetables, too.",
        "**Cook's Note: Mexican Crema is Mexico's version of creme fraiche and is found at many supermarkets and can easily be substituted with sour cream."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 cup dark Mexican beer*",
        "1/3 cup mayonnaise",
        "2/3 cup Mexican crema** or sour cream",
        "1 teaspoon grated lemon zest",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons water",
        "Salt and freshly ground black pepper",
        "Oil, for frying",
        "1 cup all-purpose flour",
        "1 teaspoon salt, plus more for seasoning",
        "2 pounds skinned halibut cut into 5 by 1/2-inch strips",
        "Freshly ground black pepper",
        "Corn tortillas",
        "2 cups shredded cabbage",
        "2 cups tomatillo salsa (store-bought or homemade) for garnish, optional",
        "Pickled jalapenos, for garnish, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Taco Recipes",
        "Fruit",
        "Lemon Recipes",
        "Fish",
        "Halibut Recipes",
        "Deep-Frying"
    ],
    "title": "Baja Style Fish Tacos",
    "url": "http://www.foodnetwork.com/recipes/marcela-valladolid/baja-style-fish-tacos-recipe"
}
