{
    "directions": [
        "Cook garlic and ginger in oil in an 8- to 9-inch heavy skillet over moderate heat, stirring, until softened and fragrant, about 1 minute. Add mirin, soy sauce, and salt (omit salt if making ahead; see cooks' note, below) and simmer, stirring, 15 seconds. Transfer marinade to a bowl and cool to room temperature.",
        "Add shrimp and cilantro, tossing to coat, and marinate, covered and chilled, 1 hour.",
        "Put oven rack in upper third of oven and preheat oven to 350°F.",
        "Turn bread loaf on its side and evenly cut crust from bottom of loaf using a long serrated knife, discarding crust, then cut a 3/8-inch-thick slice from bottom and trim crust from sides of slice. Put slice on a baking sheet (reserve rest of loaf for another use) and bake, turning over once, until dry but not colored, 8 minutes total. Remove bread from oven but leave on baking sheet.",
        "Immediately increase oven temperature to 475°F.",
        "Spread top of hot toast with all of shrimp mixture, packing it down into a thick even layer and covering surface entirely. Make sure oven temperature has reached 475°F, then bake shrimp toast until topping is cooked through, 12 to 15 minutes. Transfer with a large flat spatula to a rack to cool 5 minutes, then transfer to a cutting board.",
        "Halve shrimp toast crosswise with a very sharp knife, then cut each half lengthwise into fourths, making 8 strips total. Cut each strip into 4 pieces. Serve toasts warm or at room temperature.",
        "*Available at Asian markets and some supermarkets."
    ],
    "ingredients": [
        "4 teaspoons minced garlic",
        "1 tablespoon minced peeled fresh ginger",
        "1 tablespoon vegetable oil",
        "1 tablespoon mirin*",
        "2 teaspoons soy sauce",
        "1/2 teaspoon salt",
        "3/4 pound medium shrimp in shell (31 to 35 per pound), peeled, deveined, and cut into 1/2-inch pieces",
        "3 tablespoons chopped fresh cilantro",
        "1 (9- by 4-inch) white Pullman loaf, unsliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Garlic",
        "Ginger",
        "Shellfish",
        "Bake",
        "Christmas",
        "Cocktail Party",
        "Shrimp",
        "Winter",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Baked Shrimp Toasts",
    "url": "http://www.epicurious.com/recipes/food/views/baked-shrimp-toasts-108879"
}
