{
    "directions": [
        "In a 2- to 3-quart microwave-safe casserole with a lid microwave the bacon, uncovered, at high power (100%), stirring after each minute, for 2 to 2 1/2 minutes, or until it is almost crisp. Pour off all but 1 tablespoon of the fat from the casserole and stir in the onions. Microwave the mixture, uncovered, at high power, stirring every 2 minutes, for 8 minutes, or until the onions are softened but not browned, and transfer the onion mixture to a bowl.",
        "To the casserole add the water, the broth, and the sage, whisk in the cornmeal, a little at a time, whisking until the mixture is smooth, and microwave the mixture, covered, at high power, whisking after 3 minutes, for 5 minutes, or until it is thickened and the liquid is absorbed. Stir in the butter, 2 tablespoons of the Parmesan, half the onion mixture, and salt and pepper to taste and divide the polenta mixture between two 1 1/2-cup gratin dishes or spread it in a 3-cup gratin dish.",
        "Top the polenta with the remaining onion mixture, spreading the onion mixture evenly, sprinkle it with the remaining 2 tablespoons Parmesan, and bake it in the middle of a preheated 400°F. oven for 15 minutes, or until the Parmesan is melted."
    ],
    "ingredients": [
        "3 slices of lean bacon, chopped",
        "2 onions, sliced thin",
        "1 cup water",
        "3/4 cup chicken broth",
        "1/4 teaspoon crumbled dried sage",
        "1/2 cup cornmeal",
        "1 tablespoon unsalted butter",
        "1/4 cup freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Microwave",
        "Onion",
        "Side",
        "Bake",
        "Quick & Easy",
        "Parmesan",
        "Bacon",
        "Cornmeal",
        "Sage",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Baked Polenta with Onions and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/baked-polenta-with-onions-and-bacon-11598"
}
