{
    "directions": [
        "Position rack in center of oven and preheat to 450°F. Unfold pie crust. Press out fold lines. If crust cracks, wet fingers and push edges together. Sprinkle flour over crust. Place crust floured side down in 9-inch-diameter glass pie dish. Fold edges over; crimp decoratively. Pierce crust all over with fork. Bake until crust is pale golden, about 12 minutes. Cool crust completely on rack.",
        "Whisk 1 1/4 cups sugar, water, 5 tablespoons cornstarch, egg yolks, lemon peel and salt in heavy medium saucepan to blend. Whisk over medium heat until mixture comes to boil. Whisk over medium heat until mixture comes to boil. Whisk until mixture thickens, about 2 minutes. Remove from heat. Add lemon juice and butter; whisk until smooth. Cool completely, stirring occasionally, about 1 hour.",
        "Preheat oven to 350°F. Mix 1/3 cup sugar and 1 tablespoon cornstarch in small bowl. Beat egg whites in large bowl until foamy; add cream of tartar and beat until soft peaks form. Add sugar mixture 1 tablespoonful at a time, beating until stiff peaks form after each addition.",
        "Spread cooled lemon filling in crust. Spoon dollops of meringue around edge of pie atop filling. Spoon remaining meringue onto center of pie. Spread meringue to cover filling, mounding in center and sealing completely to crust edge. Using rubber spatula or spoon, swirl meringue decoratively, forming peaks. Bake pie until meringue peaks are light brown, about 12 minutes. Transfer to rack and cool completely. refrigerate pie until cold, about 1 1/2 hours. (Can be prepared 3 hours ahead. Keep refrigerated.)"
    ],
    "ingredients": [
        "1 refrigerated pie crust (half of 15-ounce package), room temperature",
        "1 teaspoon all purpose flour",
        "1 1/4 cups plus 1/3 cup sugar",
        "1 1/2 cups water",
        "6 tablespoons cornstarch",
        "5 large eggs, separated",
        "1 tablespoon grated lemon peel",
        "Pinch of salt",
        "1/2 cup fresh lemon juice",
        "2 tablespoons (1/4 stick) unsalted butter, room temperature",
        "1/2 teaspoon cream of tartar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Lemon",
        "Summer",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Bake-Salé Lemon Meringue Pie",
    "url": "http://www.epicurious.com/recipes/food/views/bake-sale-lemon-meringue-pie-689"
}
