{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Line baking sheet with foil. Pierce potatoes in several places with fork; place on prepared baking sheet. Bake until potatoes are tender when pierced with fork, about 55 minutes. Cool slightly.",
        "Meanwhile, place cranberries in small bowl; pour enough hot water over to cover. Let stand 5 minutes to soften. Drain well. Melt 2 tablespoons butter in large nonstick skillet over medium-high heat. Add pears and sauté until tender and golden, about 4 minutes. Stir in cranberries, pecans, ginger, and brown sugar; sauté 1 minute. Mix in 2 teaspoons vinegar and 1/2 teaspoon salt.",
        "Cut off top 1/4 of each potato lengthwise; discard tops. Using fork, gently mash pulp inside each potato. Sprinkle with salt and pepper. Melt remaining 2 tablespoons butter in small saucepan over low heat. Whisk in remaining 1 1/2 tablespoons vinegar. Drizzle about 1 teaspoon butter-vinegar mixture into each potato; mix with fork to blend.",
        "Mound cranberry mixture in sweet potatoes. (Can be prepared 4 hours ahead. Cover loosely with plastic wrap; let stand at room temperature. Rewarm sweet potatoes uncovered in 350°F oven until heated through, about 20 minutes.)"
    ],
    "ingredients": [
        "8 8-ounce red-skinned sweet potatoes (yams), scrubbed",
        "1 cup dried cranberries",
        "4 tablespoons (1/2 stick) butter",
        "2 large firm but ripe pears, peeled, cored, cut into 1/2-inch cubes",
        "1 cup pecans, coarsely chopped",
        "4 teaspoons minced peeled fresh ginger",
        "4 teaspoons (packed) golden brown sugar",
        "2 teaspoons plus 1 1/2 tablespoons balsamic vinegar",
        "1/2 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Potato",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Cranberry",
        "Pear",
        "Pecan",
        "Sweet Potato/Yam",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Baked Sweet Potatoes Stuffed with Cranberries, Pears, and Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/baked-sweet-potatoes-stuffed-with-cranberries-pears-and-pecans-107295"
}
