{
    "directions": [
        "Heat 1 tablespoon oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté one fourth of mushrooms with 1 tablespoon shallot, 1/2 teaspoon garlic, 1/2 tablespoon butter, 1/2 tablespoon thyme, 1/4 teaspoon kosher salt, and 1/8 teaspoon pepper, stirring, until mushrooms are browned and tender, about 3 minutes. Transfer to a shallow baking pan lined with paper towels (you want the flavor of the butter, but not the grease). Wipe out skillet. Sauté remaining mushrooms with seasoning in 3 batches in same manner, wiping out skillet between batches.",
        "Wash leek in a bowl of cold water, agitating water to loosen any grit, then lift out leek and drain in a sieve.",
        "Heat 2 tablespoons oil in cleaned 12-inch skillet over moderately low heat until hot, then cook leek, celery, carrot, and remaining teaspoon kosher salt, stirring occasionally, until vegetables soften, about 10 minutes. Add whole garlic clove, bay leaf, and coriander seeds and cook, stirring occasionally, until vegetables are very tender, 8 to 10 minutes more. Stir in mushrooms, stock, vinegar, and bouquet garni and simmer 2 minutes. Remove from heat and stir in remaining 1/4 cup oil. Let stand 5 minutes. Discard bouquet garni, bay leaf, and garlic clove and season with salt and pepper, then transfer mixture to a colander set over a bowl and let drain 3 minutes. Reserve vinaigrette. (You will have about 3/4 cup.)",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Arrange crottins in 1 layer in a 9-inch baking pan and spoon about half of reserved vinaigrette over them.",
        "Bake crottins, basting with vinaigrette once or twice, until they are slightly softened and bubbling on the bottom, 10 to 15 minutes.",
        "Toss salad greens with remaining vinaigrette to coat and divide among 8 salad plates. Cut crottins in half, then top salad greens with crottin halves and mushrooms.",
        "*Available at Murray's Cheese Shop (888-692-4339; murrayscheese.com)."
    ],
    "ingredients": [
        "1/2 cup plus 2 tablespoons extra-virgin olive oil",
        "2 pounds mixed fresh mushrooms such as chanterelle, shiitake, oyster, cremini, and white, trimmed, then quartered if large",
        "1/4 cup finely chopped shallot",
        "2 teaspoons minced garlic plus 1 whole clove, peeled",
        "2 tablespoons unsalted butter",
        "2 tablespoons chopped fresh thyme",
        "2 teaspoons kosher salt",
        "1/2 teaspoon black pepper",
        "1 leek (white and pale green parts only), thinly sliced crosswise",
        "2 celery ribs, thinly sliced crosswise",
        "1 carrot, thinly sliced crosswise",
        "1 Turkish or 1/2 California bay leaf",
        "1 tablespoon crushed coriander seeds",
        "2/3 cup concentrated brown chicken stock (see cooks' note, below)",
        "2 1/2 tablespoons Sherry vinegar",
        "A bouquet garni of 2 sprigs thyme and 2 sprigs flat-leaf parsley tied together with kitchen string",
        "4 (2 1/2-ounce) crottins* (small aged goat cheese rounds) at room temperature",
        "3/4 pound mixed salad greens such as radicchio, frisée, and arugula, torn into bite-size pieces (8 cups)",
        "Accompaniment: grilled or toasted slices of country bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cheese",
        "Leafy Green",
        "Mushroom",
        "Bake",
        "Sauté",
        "Goat Cheese",
        "Leek",
        "Healthy",
        "Gourmet"
    ],
    "title": "Baked Crottins with Sauteed Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/baked-crottins-with-sauteed-mushrooms-230737"
}
