{
    "directions": [
        "In a large skillet cook the onion, the garlic, the red pepper flakes, the basil, and the orégano in the oil over moderately low heat, stirring, until the onion is softened. Add the mushrooms, cook the mixture over moderate heat, stirring, for 10 to 15 minutes, or until the mushrooms are tender, and transfer the mushroom mixture to a large bowl. In the skillet melt 3 tablespoons of the butter over moderately low heat, whisk in the flour, and cook the roux, stirring, for 3 minutes. Add the milk in a stream, whisking, and simmer the mixture, whisking, for 2 minutes, or until it is thickened. Pour the sauce over the mushroom mixture and add the tomatoes, the prosciutto, the Fontina, the Gorgonzola, 1 1/4 cups of the Parmesan, and the parsley.",
        "In a kettle of boiling salted water cook the pasta for 5 minutes (the pasta will not be tender) and drain it well. Add the pasta and salt and pepper to taste to the mushroom mixture, toss the mixture until it is combined well, and transfer it to a buttered 3- to 4-quart baking dish. The pasta may be prepared up to this point and kept covered and chilled overnight. Bring the pasta to room temperature before continuing with the recipe. Sprinkle the pasta with the remaining 1/4 cup Parmesan, dot it with the remaining 1 tablespoon butter, cut into bits, and bake it in the middle of a preheated 450°F. oven for 25 to 30 minutes, or until the top is golden and the pasta is tender."
    ],
    "ingredients": [
        "2 cups finely chopped onion",
        "2 large garlic cloves, minced",
        "1/4 teaspoon dried hot red pepper flakes, or to taste",
        "1 teaspoon dried basil, crumbled",
        "1 teaspoon dried orégano, crumbled",
        "2 tablespoons olive oil",
        "1 pound fresh shiitake mushrooms, stems discarded and the caps  sliced",
        "1/2 stick (1/4 cup) unsalted butter",
        "3 tablespoons all-purpose flour",
        "2 cups milk",
        "two 28-ounce cans Italian tomatoes, drained well and chopped",
        "1/4 pound thinly sliced prosciutto, cut into strips",
        "1/4 pound Italian Fontina, grated (about 1 cup)",
        "1/4 pound Gorgonzola, crumbled (about 1 cup)",
        "1 1/2 cups freshly grated Parmesan",
        "2/3 cup minced fresh parsley leaves",
        "1 pound farfalle (large bow-tie-shaped pasta) or penne (quill-shaped  macaroni)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Tomato",
        "Bake",
        "Sauté",
        "Kid-Friendly",
        "Chill",
        "Prosciutto",
        "Gourmet"
    ],
    "title": "Baked Pasta with Tomatoes, Shiitake Mushrooms, and Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/baked-pasta-with-tomatoes-shiitake-mushrooms-and-prosciutto-13344"
}
