{
    "directions": [
        "Stir 1 cup lemon juice, 1/2 cup mint, sugar, fish sauce, 1 teaspoon lemon peel, and chili paste in small bowl until sugar dissolves. Set Thai lemon-mint sauce aside.",
        "Mix remaining 1/2 cup lemon juice, 1 cup mint, and 2 teaspoons lemon peel in small bowl. Set mint topping aside.",
        "Heat oil in heavy medium skillet over medium-high heat. Add lemongrass and shallots and sauté until shallots are slightly softened and golden, about 6 minutes. Cool.",
        "Place 1 banana leaf or parchment sheet on work surface. Place 2 tablespoons cooled shallot-lemongrass mixture in center of banana leaf. Place 1 fish fillet on lemongrass mixture on banana leaf. Sprinkle fish with salt and pepper. Top with 1 tablespoon butter; spoon 2 tablespoons mint topping over. Fold 1 short side of banana leaf over fish. Fold long sides in. Roll up to completely enclose fish. Repeat with remaining banana leaves, shallot-lemongrass mixture, fish, butter, and mint topping.",
        "Preheat oven to 450°F. Place fish packets on rimmed baking sheet and roast until fish is opaque in center, about 10 minutes. Unwrap fish and serve with Thai lemon-mint sauce."
    ],
    "ingredients": [
        "1 1/2 cups fresh lemon juice, divided",
        "1 1/2 cups chopped fresh mint leaves, divided",
        "1/2 cup sugar",
        "5 teaspoons fish sauce (such as nam pla or nuoc nam)*",
        "3 teaspoons finely grated lemon peel, divided",
        "1 teaspoon hot chili paste (such as sambal oelek)*",
        "3 tablespoons corn oil",
        "2/3 cup finely chopped lemongrass** (bottom 3 inches of about 6 stalks)",
        "1/2 cup finely chopped shallots",
        "6 banana leaves, each leaf cut into 10-inch-wide, 20-inch-long piece** or six 10-inch-wide, 20-inch-long pieces of parchment paper",
        "6 6-ounce halibut fillets (1 1/4 to 1 1/2 inches thick)",
        "6 tablespoons (3/4 stick) unsalted butter,divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Lemon",
        "Mint",
        "Halibut",
        "Hot Pepper",
        "Healthy",
        "Lemongrass"
    ],
    "title": "Baked Fish with Thai Lemon Mint Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/baked-fish-with-thai-lemon-mint-sauce-243442"
}
