{
    "directions": [
        "Drain beans and place in a large heavy pot along with halved onion, Parmesan rind (if using), halved head of garlic, bay leaves, and 2 teaspoons salt. Add water to cover by 2\". Bring to a boil, reduce heat, and simmer until beans are tender, 1–1 1/2 hours.",
        "Meanwhile, cook bacon in a large skillet over medium heat, turning occasionally, until brown and most of fat has rendered, 8–10 minutes. Transfer to a plate with tongs or a slotted spoon.",
        "Add thinly sliced onion, shallot, thyme sprigs, and three-fourths of chopped garlic to pan drippings in skillet; season with salt and pepper. Cook, stirring occasionally, until onion is starting to caramelize and is very soft, 10–15 minutes. Add wine, bring to a simmer, and cook, stirring occasionally, until liquid is almost completely evaporated, about 4 minutes. Remove from heat and pluck out thyme sprigs.",
        "Preheat oven to 400°. Drain beans, reserving cooking liquid. Transfer beans to a large bowl and mix in bacon, onion mixture, thyme leaves, and 1 1/2–2 cups cooking liquid (this will be most of it; mixture should be consistency of stew); season with salt and pepper. Transfer beans to a shallow 1 1/2-quart baking dish.",
        "Mix breadcrumbs, oil, and remaining chopped garlic in a medium bowl; season with salt and pepper. Scatter over beans; bake until liquid is thickened and bubbling and crumbs are golden brown, 45–55 minutes. Let cool slightly before serving.",
        "Do ahead: Beans can be baked 5 days ahead. Let cool; cover and chill."
    ],
    "ingredients": [
        "2 cups dried navy or cannellini beans, soaked overnight",
        "2 medium onions, 1 halved, 1 thinly sliced",
        "1 Parmesan rind (optional), plus",
        "1/2 cup finely grated Parmesan",
        "1 head garlic, halved crosswise, plus 4 cloves, finely chopped, divided",
        "2 bay leaves",
        "2 teaspoons kosher salt, plus more",
        "8 ounce slab bacon, cut into 2x1/4\" pieces",
        "1 large shallot, thinly sliced",
        "4 sprigs thyme plus 1 tablespoon leaves",
        "Freshly ground black pepper",
        "1/4 cup dry white wine",
        "1 1/2 cups coarsely torn fresh breadcrumbs",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Kid-Friendly",
        "Dinner",
        "Parmesan",
        "Bacon",
        "Fall",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Baked Beans with Slab Bacon and Breadcrumbs",
    "url": "http://www.epicurious.com/recipes/food/views/baked-beans-with-slab-bacon-and-breadcrumbs-51264630"
}
