{
    "directions": [
        "In a 12-inch nonstick skillet, heat 1 tablespoon of oil over medium heat. Add sausage, crumble and cook until no longer pink and lightly browned. Drain and transfer into a large mixing bowl. Meanwhile prepare ziti according to package directions. Drain and rinse with cold water, cover and set aside.",
        "Using the same skillet, heat 1 tablespoon of oil over medium-high heat. Add eggplant and cook until tender and lightly browned. Transfer to bowl with sausage.",
        "Using the same skillet, heat remaining oil over medium heat. Add onion and garlic, sauté until tender. Pour wine into skillet, increase heat to medium-high and continue to stir until most of the liquid has evaporated. Add tomatoes and reduce heat to medium. Simmer for 10 minutes. To the bowl with the sausage mixture, add cooked pasta, basil, olives, 2 cups of mozzarella cheese, tomato sauce, salt and pepper. Stir to combine ingredients.",
        "Transfer mixture to a greased 3-quart baking dish. Sprinkle with remaining mozzarella and Parmesan cheese. Cover and bake at 400 degrees F for 25 to 30 minutes. Uncover and bake for 5 minutes longer, or until lightly browned. Let stand 5 minutes before serving."
    ],
    "ingredients": [
        "1 (19 ounce) package Johnsonville® Fresh Italian Sweet Sausage Links, casings removed",
        "3 tablespoons olive oil, divided",
        "12 ounces ziti pasta",
        "1 small eggplant, cut into 1/2-inch cubes",
        "1 medium onion, chopped",
        "3 cloves garlic, minced",
        "1/2 cup red wine",
        "1 (28 ounce) can crushed plum tomatoes",
        "1/4 cup chopped fresh basil",
        "1/3 cup pitted kalamata olives, chopped",
        "2 1/2 cups shredded mozzarella cheese, divided",
        "salt and fresh ground pepper to taste",
        "1/2 cup shredded Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baked Ziti with Johnsonville Italian Sausage",
    "url": "http://allrecipes.com/recipe/220068/baked-ziti-with-johnsonville-italian/"
}
