{
    "directions": [
        "Preheat oven to 500°F.",
        "Bring a 6- to 8-quart pot three-fourths full of water to a boil with kosher salt, then stir in spinach and cook 30 seconds. Transfer with a slotted spoon to a large bowl filled with ice and cold water to stop cooking. Drain spinach and squeeze dry, then finely chop.",
        "Wash leeks well in a bowl of cold water, then lift out and drain well.",
        "Heat oil in a 10-inch heavy skillet over moderately high heat until hot but not smoking, then sauté bacon, stirring, until golden and just cooked through (but not crisp), about 3 minutes. Transfer with slotted spoon to paper towels to drain. Add leeks, shallot, and garlic to fat in skillet and cook over low heat, covered, stirring occasionally, until softened, about 8 minutes.",
        "Toss together leek mixture, spinach, bacon, bread crumbs, herbs, lemon zest and juice, sea salt, white pepper, nutmeg, and butter in a large bowl with a fork.",
        "Spread 2 to 3 cups rock salt in each of 2 large shallow baking pans and nestle oysters (in shells) in it. Spoon a heaping tablespoon bread-crumb stuffing loosely on top of each oyster. Bake in batches in upper third of oven until golden, about 6 minutes.",
        "Serve warm oysters in shells on plates lined with rock salt."
    ],
    "ingredients": [
        "1/4 cup kosher salt",
        "2 (10-ounce) bags fresh spinach, coarse stems discarded",
        "2 leeks (white and pale green parts only), quartered lengthwise and thinly sliced crosswise",
        "1 tablespoon olive oil",
        "3 ounces slab or thick-sliced bacon, cut into 1/4-inch dice",
        "1 shallot, quartered lengthwise and thinly sliced crosswise",
        "1 garlic clove, minced",
        "1 day-old baguette, crust discarded and bread coarsely ground in a food processor (2 cups)",
        "2 tablespoons finely chopped fresh chervil",
        "2 tablespoons finely chopped fresh chives",
        "2 tablespoons finely chopped fresh flat-leaf parsley",
        "2 tablespoons finely chopped fresh tarragon",
        "Finely grated zest and juice of 1 medium lemon",
        "3/4 teaspoon fine sea salt, or to taste",
        "Rounded 1/4 teaspoon white pepper, or to taste",
        "Pinch of freshly grated nutmeg, or to taste",
        "1 stick (1/2 cup) unsalted butter, melted",
        "About 10 cups rock or kosher salt for baking and serving (3 pounds)",
        "40 oysters on the half shell",
        "Accompaniment: lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Bake",
        "Bacon",
        "Oyster",
        "Leek",
        "Spinach",
        "Fall",
        "Gourmet"
    ],
    "title": "Baked Oysters with Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/baked-oysters-with-bacon-107186"
}
