{
    "directions": [
        "Preheat oven to 375°F. and lightly butter a heavy baking sheet.",
        "Sprinkle a work surface with granulated sugar and roll out puff pastry about 1/8 inch thick, turning once to coat both sides with sugar. Cut out 4 rectangles, each about 4 1/2 by 3 1/2 inches, and transfer to baking sheet, reserving scraps for another use. Prick pastry all over with a fork and put baking sheet in freezer until pastry is chilled well, about 15 minutes.",
        "Lightly butter bottom of another heavy baking sheet and put directly on top of pastry rectangles to weight them while baking. Bake pastry (between 2 baking sheets) in middle of oven 25 to 35 minutes, or until golden brown, and transfer to a rack to cool. Pastry bases may be made 1 day ahead and kept in an airtight container.",
        "Preheat oven to 375°F. (if pastry bases have been made ahead) and lightly butter a small baking dish just large enough to hold 4 pear halves in one layer.",
        "Peel, halve, and core pears. Arrange pear halves in baking dish, cut sides up. Divide butter among pear cavities and sprinkle 1/4 cup granulated sugar over pears. Sprinkle lemon juice over pears and bake in middle of oven 15 minutes. Remove baking dish from oven and turn pears so that cut sides are down. Baste pears with cooking juices and return to oven. Bake pears until tender, about 15 minutes more. Transfer pears to a plate and keep warm.",
        "Transfer cooking juices to a small heavy saucepan. Add remaining 1/4 cup granulated sugar and boil, swirling pan, until mixture turns a deep golden caramel. Slowly add cream (caramel will bubble up) and simmer sauce, whisking, until slightly thickened, about 5 minutes. Stir poire William into caramel sauce.",
        "Sprinkle each pastry base with confectioners' sugar and top with a pear half. Serve baked pears with caramel sauce."
    ],
    "ingredients": [
        "1/4 cup granulated sugar",
        "1 sheet frozen puff pastry (about 1/2 pound), thawed",
        "2 large firm-ripe Bartlett pears (about 1 pound)",
        "2 tablespoons unsalted butter, cut into bits",
        "1/2 cup granulated sugar",
        "1 tablespoon fresh lemon juice",
        "1/2 cup heavy cream",
        "1 tablespoon Poire William",
        "confectioners' sugar for sprinkling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fruit",
        "Dessert",
        "Bake",
        "Pear",
        "Brandy",
        "Eau de Vie",
        "Winter",
        "Gourmet"
    ],
    "title": "Baked Pears on Sugared Puff Pastry with Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/baked-pears-on-sugared-puff-pastry-with-caramel-sauce-10012"
}
