{
    "directions": [
        "In a skillet cook the bacon over moderate heat until it is crisp, transfer it to paper towels to drain, and discard all but 2 tablespoons of the fat. In the fat remaining in the skillet cook the shallot and the bell pepper over moderately low heat, stirring, for 3 minutes, add the wine, and boil the mixture, scraping up the brown bits, for 1 minute. Add the tomatoes with the juice, the basil, and salt and pepper to taste and simmer the sauce, stirring occasionally, for 10 minutes, or until it is thickened.",
        "On a work surface arrange the flounder fillet halves, skinned sides up, beginning with the narrow end roll up each fillet half jelly-roll fashion, and secure each roll with a wooden pick.",
        "In an oiled flameproof baking pan, 15 by 10 by 2 inches, arrange the fish rolls, seam sides down and not touching each other, pour the sauce evenly over them, and bake the mixture in the middle of a preheated 400°F. oven for 10 minutes. In a bowl stir together the bread crumbs, the parsley, the bacon, and salt and pepper to taste and sprinkle the topping over the rolls. Drizzle the fish rolls with the oil and bake the mixture for 10 minutes, or until the fish just flakes. (For a crisper topping, the cooked mixture may be broiled under a preheated broiler about 4 inches from the heat for 1 to 2 minutes.) Transfer the fish rolls to a heated platter and spoon the sauce and topping over them."
    ],
    "ingredients": [
        "6 slices of lean bacon, chopped fine",
        "1/4 cup finely chopped shallot",
        "2/3 cup minced green bell pepper",
        "1/2 cup dry white wine",
        "a 28-ounce can tomatoes including the juice, chopped",
        "1/2 teaspoon crumbled dried basil",
        "six 1/2-pound flounder fillets, halved lengthwise and seasoned with salt and pepper",
        "1/2 cup fine fresh bread crumbs",
        "2 tablespoons finely chopped fresh parsley leaves",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Pork",
        "Tomato",
        "Bake",
        "Bacon",
        "Bell Pepper",
        "White Wine",
        "Gourmet"
    ],
    "title": "Baked Flounder Rolls with Tomato, Bell Pepper, and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/baked-flounder-rolls-with-tomato-bell-pepper-and-bacon-11934"
}
