{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Butter 2 small ramekins (6 to 8 ounce) and dust with white sugar.",
        "Place apple slices on a plate, overlapping slightly if necessary. Microwave on High about 45 seconds just until slices have softened a bit. Cover plate with plastic wrap and a kitchen towel.",
        "Mix together sugar and cinnamon in a bowl.",
        "Roll puff pastry sheet to less than 1/8-inch thickness. Using a pizza cutter, cut two 3-inch by 12-inch rectangles. Reserve remaining pieces for another use.",
        "Spread melted butter over dough; top with a generous amount of cinnamon-sugar. Place apple slices along 1 long edge of dough, about 1/4 inch beyond edge of dough, overlapping slices slightly. Fold bottom half of dough over the apple slices to form a long \"folder\" of dough with rounded edges of apple slices exposed.",
        "Beat egg and water together in a bowl. Paint surface of dough with egg wash. Sprinkle with more cinnamon-sugar, to taste.",
        "Starting from one end, roll dough not too tightly to form a rose-shaped pastry. Seal roll with end of dough strip.",
        "Transfer roses to prepared ramekins. Sprinkle with a little more cinnamon-sugar. Place ramekins directly on middle rack of preheated oven.",
        "Bake until well browned, about 45 minutes. Remove ramekins with tongs and place on baking sheet to cool 5 to 10 minutes. Remove apple roses from ramekins and finish cooling on rack. Dust with confectioners' sugar before serving."
    ],
    "ingredients": [
        "1 large red apple, cored and very thinly sliced",
        "1/4 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1 sheet frozen puff pastry, thawed",
        "1/4 cup melted butter",
        "1 egg",
        "2 teaspoons water",
        "1 teaspoon confectioners' sugar (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baked Apple Roses",
    "url": "http://allrecipes.com/recipe/244198/baked-apple-roses/"
}
