{
    "directions": [
        "Preheat the oven to 450 degrees F. Spray a baking sheet with nonstick spray.",
        "To make the dipping sauce: Toast the curry and red pepper flakes in a saucepan over medium heat, about 1 minute. Add the honey, vinegar and orange juice and zest. Bring to a simmer, stirring occasionally, until the sauce is heated through, 1 to 2 minutes. Remove from the heat and set aside.",
        "To make the shrimp: Combine the coconut, panko and flour in a bowl or baking dish. Beat the egg whites in a medium bowl until slightly frothy. Sprinkle the shrimp with salt and pepper. Add to the egg whites and toss to coat. Lift each shrimp from the egg whites, letting the excess drip off the shrimp, and then coat in the crumb mixture, pressing to adhere. Place the shrimp on the baking sheet in a single layer. Lightly spray with nonstick spray. Bake until the shrimp are golden on the outside and opaque in the center, 8 to 10 minutes. Serve with the dipping sauce."
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "1 teaspoon curry powder",
        "Pinch crushed red pepper flakes",
        "1 tablespoon honey",
        "2 teaspoons rice vinegar",
        "1 orange, zested and juiced",
        "1/2 cup flaked unsweetened coconut",
        "6 tablespoons plain panko breadcrumbs",
        "3 tablespoons all-purpose flour",
        "2 large egg whites",
        "1 pound large (21/25 count) shrimp, peeled (tails left on), deveined, butterflied and patted dry",
        "Salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Coconut Shrimp",
        "Coconut Recipes",
        "Fruit",
        "Shellfish Recipes",
        "Shrimp",
        "Healthy",
        "Appetizer",
        "Low-Carb",
        "Low-Fat",
        "Diabetes-Friendly",
        "Low Calorie"
    ],
    "title": "Baked Coconut Shrimp",
    "url": "http://www.foodnetwork.com/recipes/bobby-deen/baked-coconut-shrimp-recipe"
}
