{
    "directions": [
        "In a heavy skillet cook onion, 1 1/2 tablespoons shallot, and garlic in butter with salt and pepper to taste over moderate heat, stirring, until onion is pale golden, about 10 minutes.",
        "Stir in vinegar and cook, covered 5 minutes. Stir in tomato and cook, covered, stirring occasionally, 10 minutes. Stir in bell pepper and 1/4 cup oil and cook, uncovered, stirring, 2 minutes. Stir in parsley and remaining 1/4 cup oil and keep vinaigrette warm.",
        "Preheat oven to 425°F. and butter a baking dish just large enough to hold fillets in one layer.",
        "Sprinkle remaining 1 1/2 tablespoons shallot in baking dish and in it arrange fillets, seasoned with salt and pepper. Add thyme sprig, wine, and stock or clam juice and cover fillets with a buttered piece of wax paper. Bake fish in middle of oven 10 to 15 minutes (depending upon thickness of fillets), or until just cooked through.",
        "Transfer fillets to a large plate and keep warm. Pour cooking liquid through a fine sieve set over skillet of vinaigrette. Cook vinaigrette over moderate heat, stirring, until it is warm and cooking liquid is incorporated.",
        "Serve fish, garnished with additional thyme sprigs, with warm vinaigrette."
    ],
    "ingredients": [
        "1 1/2 cups finely chopped onion",
        "3 tablespoons minced shallot",
        "1 large garlic clove, minced",
        "1 tablespoon unsalted butter",
        "4 tablespoons Sherry vinegar*",
        "1 plum tomato, seeded and chopped fine",
        "1/3 cup finely diced red bell pepper",
        "1/2 cup olive oil",
        "1 1/2 teaspoons minced fresh thyme plus 1 thyme sprig and additional sprigs for garnish if desired",
        "4 Kalamata or other brine-cured large black olives, pitted and chopped fine",
        "2 tablespoons minced fresh parsley leaves",
        "three 10- to 12-ounce pieces of halibut fillet, halved crosswise",
        "2 tablespoons dry white wine",
        "1/4 cup fish stock or bottled clam juice",
        "*available at specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Olive",
        "Bake",
        "Quick & Easy",
        "Vinegar",
        "Halibut",
        "Spring",
        "Gourmet"
    ],
    "title": "Baked Halibut with Warm Sherry Onion Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/baked-halibut-with-warm-sherry-onion-vinaigrette-11532"
}
