{
    "directions": [
        "Preheat an oven to 425°F. Lightly oil a large flameproof roasting pan.",
        "Brush the skin of the chicken breast halves with 1 Tbs. of the olive oil. Season the breasts with 2 tsp. of the salt and 1/2 tsp. of the pepper, then sprinkle with the minced rosemary. Place the chicken, skin side up, in the center of the prepared pan.",
        "Place the onions in a bowl. Drizzle with the remaining 1 Tbs. olive oil and toss to coat evenly. Season the onions with the remaining 1/2 tsp. salt and 1/2 tsp. pepper and toss again. Place the onions around the edges of the roasting pan.",
        "Transfer the pan to the oven and roast, stirring the onions occasionally, until the chicken is golden brown and an instant-read thermometer inserted into the thickest part of the breast, away from the bone, registers 160°F, about 35 minutes. Transfer the chicken to a platter and cover loosely with aluminum foil. Increase the oven temperature to 475°F, and continue roasting the onions until they are very tender and deep beige, about 5 minutes more.",
        "Transfer the onions and any pan juices to a food processor. Place the roasting pan over medium-high heat. Add the sherry and broth and bring to a boil, stirring to scrape up the browned bits from the pan bottom. Boil until the liquid is reduced to 3/4 cup, about 2 minutes. Remove from the heat.",
        "Process the onions, adding as much of the liquid from the roasting pan as needed to make a pourable sauce. Adjust the seasonings with salt and pepper. Pour some of the sauce over the chicken, garnish with the rosemary sprigs and serve immediately. Pass the remaining sauce at the table. Serves 4.",
        "Adapted from Williams-Sonoma",
        "New Flavors for Chicken",
        ", by Rick Rodgers (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "2 Tbs. extra-virgin olive oil, plus more for roasting pan",
        "4 bone-in, skin-on chicken breast halves, each about 3/4 lb.",
        "2 1/2 tsp. kosher salt, plus more, to taste",
        "1 tsp. freshly ground pepper, plus more, to taste",
        "1 Tbs. minced fresh rosemary, plus sprigs for garnish",
        "2 large Vidalia onions, about 1 1/2 lb. total, quartered",
        "1/4 cup dry sherry",
        "3/4 cup low-sodium chicken broth or stock"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Baked Chicken with Vidalia Onion Sauce",
    "url": "http://www.williams-sonoma.com/recipe/baked-chicken-with-vidalia-onion-sauce.html"
}
