{
    "directions": [
        "Preheat oven to 400°F. Rub potatoes with olive oil; sprinkle with coarse salt. Place on baking sheet. Pierce with fork. Bake until tender, about 1 hour.",
        "Sprinkle steak with salt and pepper. Heat 2 tablespoons oil in large nonstick skillet over medium-high heat. Add steak and sear until brown but still very rare, about 2 minutes per side. Transfer steak to plate. Reduce heat to medium. Add bell peppers, onion, and jalapeños to skillet. Sauté until peppers are soft and onion caramelizes, about 30 minutes.",
        "Cut steak crosswise into 1/4-inch-thick slices. Halve slices lengthwise into strips. Add cream, chopped marjoram, and steak to pepper mixture. Simmer until steak is heated through and cream thickens slightly, about 1 minute. Season to taste with salt and pepper.",
        "Cut cross in potatoes and press on sides to open slightly. Add salt, pepper, and 1 teaspoon butter to each and mash slightly with fork. Top each with steak mixture. Garnish with marjoram."
    ],
    "ingredients": [
        "4 large russet potatoes (each about 10 ounces)",
        "Olive oil",
        "Coarse kosher salt",
        "1 10-ounce rib-eye steak, trimmed",
        "2 tablespoons olive oil",
        "2 bell peppers (preferably 1 red and 1 orange), cut into 1/4-inch-wide strips",
        "1 large onion, halved, thinly sliced",
        "2 red jalapeño chiles, halved, seeded, very thinly sliced crosswise",
        "1 cup heavy whipping cream",
        "2 teaspoons chopped fresh marjoram",
        "4 teaspoons butter",
        "Fresh marjoram sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Potato",
        "Bake",
        "Sauté",
        "Meat",
        "Steak",
        "Bell Pepper",
        "Winter"
    ],
    "title": "Baked Potatoes with Rib-Eye Steak Hash",
    "url": "http://www.epicurious.com/recipes/food/views/baked-potatoes-with-rib-eye-steak-hash-231730"
}
