{
    "directions": [
        "Line heavy baking sheet with foil; brush with oil. Arrange fish skin side down on foil. Finely chop dill and onion in processor. Sprinkle each fillet with half of salt and pepper. Press dill mixture firmly over. Pour vinegar evenly over. Cover and chill overnight, basting occasionally with juices.",
        "Position rack in center of oven and preheat to 375°F. Uncover fish and bake until just cooked through, about 25 minutes. Let stand at room temperature 30 minutes. Cover and chill at least 2 hours and up to 2 days.",
        "Combine first 5 ingredients in medium bowl. Let stand 3 hours, stirring occasionally. Season with pepper.",
        "Scrape most of dill off fish. Cut crosswise into 12 portions; trim neatly. Slide spatula under each, separating from skin. Arrange fish on plates. Drain relish and spoon over. Garnish with dill sprigs."
    ],
    "ingredients": [
        "Vegetable oil",
        "1 4- to 4 1/2-pound whitefish, cut into 2 fillets, fatty portions trimmed along center and flap edges",
        "3 cups coarsely chopped fresh dill (about six 1/2-ounce packages)",
        "1 medium onion, coarsely chopped",
        "1 teaspoon coarse salt",
        "1/4 teaspoon ground pepper",
        "6 tablespoons white vinegar",
        "4 cups diced peeled seeded cucumber (about 4)",
        "2 pounds plum tomatoes (about 12 large), seeded, chopped",
        "1/2 cup chopped fresh dill",
        "1/4 cup white vinegar",
        "4 teaspoons coarse kosher salt",
        "Fresh dill sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fish",
        "Tomato",
        "Appetizer",
        "Bake",
        "Passover",
        "Cucumber",
        "Chill",
        "Kosher",
        "Dill",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Baked Whitefish with Dill and Tomato-Cucumber Relish",
    "url": "http://www.epicurious.com/recipes/food/views/baked-whitefish-with-dill-and-tomato-cucumber-relish-1626"
}
