{
    "directions": [
        "Make 4 vertical cuts, about 1/2 inch deep and 2 inches long, in skin of each lemon. Place lemons in microwave-safe bowl (such as soufflé dish). Cover and cook in microwave on high until skins soften and lemons release juices, about 8 minutes. Uncover and cool lemons 15 minutes. Cut lemons in half. Squeeze juice into strainer set over small bowl; reserve juice. Scoop out and discard lemon pulp and white pith from halves; reserve rinds.",
        "Combine 6 tablespoons reserved lemon juice, lemon rinds, garlic, olive oil, thyme, rosemary, fennel, salt, pepper, and brown sugar in processor and grind to paste. Generously smear paste on both sides of baby back ribs. Arrange ribs, meaty side up, on 2 large rimmed baking sheets. Cover with plastic wrap and refrigerate overnight.",
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 350°F. Scrape some of marinade off ribs. Place baking sheets with ribs in oven. Bake ribs 30 minutes. Reverse position of baking sheets and roast until ribs are very tender and meat begins to pull away from bones, about 35 minutes longer. Let ribs stand 15 minutes. Transfer to work surface and cut racks between bones into individual ribs. Pile ribs onto platter and serve."
    ],
    "ingredients": [
        "4 large lemons",
        "8 large garlic cloves, peeled",
        "1/4 cup olive oil",
        "3 tablespoons chopped fresh thyme",
        "3 tablespoons (scant) coarsely chopped fresh rosemary",
        "2 tablespoons fennel seeds, ground",
        "2 tablespoons coarse kosher salt",
        "1 tablespoon freshly ground black pepper",
        "1 tablespoon (packed) golden brown sugar",
        "5 pounds meaty baby back pork ribs (about 4 large racks)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Citrus",
        "Bake",
        "Marinate",
        "Quick & Easy",
        "Pork Rib",
        "Winter",
        "Thyme",
        "Potluck"
    ],
    "title": "Baked Baby Back Ribs with Lemon Confit Marinade",
    "url": "http://www.epicurious.com/recipes/food/views/baked-baby-back-ribs-with-lemon-confit-marinade-109164"
}
