{
    "directions": [
        "Preheat oven to 350°F. Line a 13x9x2\" metal baking pan with parchment paper and grease with butter. Whisk flour, baking powder, and salt in a medium bowl to blend. Whisk egg yolks, 1/2 cup sugar, oil, and 1/2 cup water in a large bowl. Beat in flour mixture. Stir in coconut. Using an electric mixer fitted with clean, dry beaters, beat egg whites in another medium bowl until soft peaks form. Gradually beat in remaining 1/4 cup sugar. Fold into batter just to blend. Pour into prepared pan and bake until puffed, lightly golden, and a tester inserted into center of cake comes out clean, about 30 minutes. Let cool in pan on rack (cake may fall slightly).",
        "Set a strainer over a large bowl; set aside. Combine pineapple, sugar, and 3 cups water in a saucepan and bring to a boil, stirring to dissolve sugar. Purée in a blender until smooth. Pour through strainer; press on solids to extract as much liquid as possible; discard solids. Stir in rum and lime juice. Process in an ice cream maker according to manufacturer's instructions.",
        "Preheat oven to 325°F. Combine sugar, salt, and 3/4 cup water in a small saucepan and bring to a boil. Reduce heat to medium and stir in nuts. Cook for 5 minutes, stirring occasionally. Strain, then transfer nuts to a parchment paper-lined baking sheet. Cook until golden and roasted, 10-12 minutes. Let cool.",
        "In a stand mixer fitted with a whisk attachment, beat egg whites with cream of tartar on low speed until foamy. With machine running on medium speed, gradually add sugar, 1 tablespoon at a time. Add rum and xanthan gum (if using); continue beating until firm peaks form.",
        "Invert cake onto a work surface; peel off parchment. Using a ramekin as a guide, cut cake into 6 rounds, so that each will fit into an 8-ounce ramekin.",
        "Working with 1 ramekin at a time, spoon 3/4 cup sorbet into ramekin; smooth top and place 1 cake round over, pressing to adhere; immediately transfer to freezer. Repeat with remaining ramekins. Freeze for 4 hours.",
        "Run a thin knife around 1 ramekin. Invert onto a work surface. Spread 1 scant cup meringue over top and sides of cake with an offset spatula. Transfer to a rimmed baking sheet and freeze for 30 minutes. Repeat with remaining cakes and meringues; add each to rimmed baking sheet in freezer. DO AHEAD: Assembled cakes can be made 3 days ahead. Cover and keep frozen.",
        "Preheat oven to 450°F. Transfer cakes on sheet pan to oven. Bake until meringue is toasted, 1-2 minutes. Using a large spatula, transfer cakes to plates. Spoon passion fruit juice and pulp around plate. Sprinkle lime zest over meringue. Garnish with macadamia nuts, if using."
    ],
    "ingredients": [
        "Unsalted butter (for pan)",
        "2/3 cup all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 teaspoons kosher salt",
        "4 large eggs, separated",
        "3/4 cup sugar, divided",
        "1/2 cup vegetable oil",
        "1/2 cup unsweetened shredded coconut",
        "6 3/4 cups 1/2\" cubes fresh pineapple (cut from two 4-pound pineapples)",
        "3/4 cup (packed) dark brown sugar",
        "3 tablespoons dark rum (such as Gosling's)",
        "3 tablespoons fresh lime juice",
        "1/4 cup sugar",
        "2 teaspoons kosher salt",
        "1/2 cup whole macadamia nuts",
        "1 cup egg whites (from about 7 large eggs), room temperature",
        "1/4 teaspoon cream of tartar",
        "3/4 cup sugar",
        "1 teaspoon coconut rum (such as Malibu)",
        "1/8 teaspoon xanthan gum (optional)",
        "4 ripe (wrinkled) passion fruits, halved, pulp scooped out",
        "2 teaspoons finely grated lime zest",
        "Special equipment: An ice cream maker; six 8-ounce ramekins",
        "Ingredient info: Unsweetened shredded coconut is sold at specialty foods stores and at natural foods stores. Xanthan gum adds an extra-creamy texture to the meringue; it's sold at better supermarkets, natural foods stores, and bobsredmill.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Dessert",
        "Coconut",
        "Pineapple",
        "Macadamia Nut",
        "Fall",
        "Passion Fruit",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Baked Hawaiian Islands",
    "url": "http://www.epicurious.com/recipes/food/views/baked-hawaiian-islands-367730"
}
