{
    "directions": [
        "Place bread in medium bowl. Pour warm water over; soak 5 minutes. Drain, then squeeze bread dry. Return bread to same bowl. Add 1/2 cup oil, purchased breadcrumbs, mint, capers, anchovies, and chopped garlic; blend well. Season stuffing with salt and pepper. Preheat oven to 375°F. Fill large bowl with water. Squeeze in juice from lemon. Cut off all but 1 1/2 inches of stem from 1 artichoke. Peel stem with vegetable peeler. Starting at bottom of artichoke, snap off outer 3 rows of leaves. Cut off top 1/3 of artichoke. Spread leaves, exposing center. Remove center leaves and bristly choke. Place artichoke in lemon water. Repeat with remaining artichokes.",
        "Pour cold water into 13x9x2-inch glass baking dish to reach depth of 1/2 inch. Add halved garlic. Drain artichokes. Pack centers with stuffing. Place artichokes, stuffed side down, in prepared dish. Drizzle with 1/4 cup oil; sprinkle with salt and pepper. Cover dish. Bake until tester inserted into artichoke bottoms meets no resistance, about 1 hour 15 minutes. Place artichokes on platter. Serve warm or at room temperature."
    ],
    "ingredients": [
        "4 ounces French bread (1/4 of 1-pound loaf), crusts removed, bread torn into pieces",
        "3/4 cup extra-virgin olive oil",
        "1/2 cup purchased unseasoned dry breadcrumbs",
        "6 tablespoons chopped fresh mint",
        "1/4 cup drained capers",
        "6 anchovy fillets, finely chopped",
        "6 garlic cloves; 4 chopped, 2 halved",
        "1 lemon, halved",
        "6 medium artichokes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Garlic",
        "Side",
        "Bake",
        "Artichoke",
        "Spring",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Baked Artichokes Stuffed with Anchovies and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/baked-artichokes-stuffed-with-anchovies-and-garlic-106486"
}
