{
    "directions": [
        "Preheat an oven to 300 degrees F (150 degrees C).",
        "Mix graham cracker crumbs, 2 tablespoons of white sugar, and melted butter together in a bowl. Reserve a couple tablespoons of the cracker mixture to use as garnish. Press the remaining cracker mixture into a 9-inch pie plate to form a crust.",
        "Place 1/2 cup of sugar, cornstarch, and salt in the top of a double boiler over just-barely simmering water. Slowly stir in the scalded milk, stirring until mixture thickens. Slowly whisk 1/3 of the milk mixture into the beaten egg yolks, then pour the egg mixture back into the double boiler. Cook for 2 minutes, stirring constantly so as not to scramble the eggs. Remove from heat, and cool slightly, then stir in the remaining 2 tablespoons of butter and 1 teaspoon of vanilla extract, until butter is melted. Pour the egg mixture into the prepared pie shell. Set aside.",
        "Beat egg whites until foamy in a large glass or metal mixing bowl. Gradually add 1/4 cup of sugar and 1/2 teaspoon of vanilla extract, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites should form a sharp peak that holds its shape. Spread the meringue over the pie.",
        "Bake in the preheated oven until the meringue is lightly browned, about 10 minutes. Cool, and sprinkle with the reserved graham cracker mixture before serving."
    ],
    "ingredients": [
        "1 1/2 cups graham cracker crumbs",
        "2 tablespoons white sugar",
        "1 tablespoon butter, melted",
        "1/2 cup white sugar",
        "1/4 cup cornstarch",
        "1/3 teaspoon salt",
        "2 1/2 cups scalded milk",
        "4 egg yolks, beaten",
        "2 tablespoons butter",
        "1 teaspoon vanilla extract",
        "4 egg whites",
        "1/4 cup white sugar",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bakery Graham Cracker Pie",
    "url": "http://allrecipes.com/recipe/214018/bakery-graham-cracker-pie/"
}
