{
    "directions": [
        "In a heavy skillet, saute the onion and the pepper in 1/2 cup of butter. Cook until tender. Mix in 1/2 cup of the flour, and cook over medium heat for 10 minutes, stirring frequently. Stir in crabmeat, remove from heat, and set aside.",
        "In a large Dutch oven, bring the water to a boil. Add the shrimp, scallops, and flounder, and simmer for 3 minutes. Drain, reserving 1 cup of the cooking liquid, and set the seafood aside.",
        "In a heavy saucepan, melt the remaining 1/2 cup butter over low heat. Stir in remaining 1/2 cup flour. Cook and stir constantly for 1 minute. Gradually add the milk plus the 1 cup reserved cooking liquid. Raise heat to medium; cook, stirring constantly, until the mixture is thickened and bubbly. Mix in the shredded Cheddar cheese, vinegar, Worcestershire sauce, salt, pepper, and hot sauce. Stir in cooked seafood.",
        "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 9x13 inch baking dish. Press crabmeat mixture into the bottom of the prepared pan. Spoon the seafood mixture over the crabmeat crust, and sprinkle with the Parmesan cheese.",
        "Bake in the preheated oven for 30 minutes, or until lightly browned. Serve immediately."
    ],
    "ingredients": [
        "1 onion, chopped",
        "1 green bell pepper, chopped",
        "1 cup butter, divided",
        "1 cup all-purpose flour, divided",
        "1 pound fresh crabmeat",
        "4 cups water",
        "1 pound fresh shrimp, peeled and deveined",
        "1/2 pound small scallops",
        "1/2 pound flounder fillets",
        "3 cups milk",
        "1 cup shredded sharp Cheddar cheese",
        "1 tablespoon distilled white vinegar",
        "1 teaspoon Worcestershire sauce",
        "1/2 teaspoon salt",
        "1 pinch ground black pepper",
        "1 dash hot pepper sauce",
        "1/2 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baked Seafood Au Gratin",
    "url": "http://allrecipes.com/recipe/12765/baked-seafood-au-gratin/"
}
