{
    "directions": [
        "Work tomatoes with juice through food mill set over a large bowl, scraping pulp from underside into bowl. Discard seeds and other solids remaining in mill.",
        "Preheat oven to 400°F.",
        "Cook onion in 3 tablespoons oil in a 3-quart heavy saucepan over moderately low heat, stirring, until softened. Add pork and sauté over moderately high heat, stirring and breaking up lumps, until lightly browned, 3 to 5 minutes. Stir together tomato paste and water and stir into pork. Simmer until most of tomato paste is absorbed, about 2 minutes, then add tomatoes, sugar, cinnamon, pepper, and 1 tablespoon sea salt. Simmer, uncovered, stirring occasionally, until reduced to about 4 cups, about 30 minutes.",
        "While pork ragù simmers, bring 6 quarts water to a boil with 2 tablespoons oil and remaining 2 tablespoons sea salt in an 8-quart pot for rigatoni. Toast almonds in a shallow baking pan in middle of oven until fragrant and a few shades darker, 8 to 10 minutes. Immediately sprinkle nuts with extract, tossing. Cool and coarsely chop.",
        "Reduce oven temperature to 375°F.",
        "Stir together bread crumbs and remaining tablespoon oil in a small heavy skillet and cook over low heat, stirring, until deep golden, 10 to 15 minutes. Transfer to a small bowl.",
        "Cook rigatoni in boiling water, stirring occasionally, until just al dente, then drain. Toss pasta with about 1/2 cup of liquid from ragù in a large bowl. Spread a thin coating of rag‹ in bottom of a lightly oiled 13- by 9- by 2-inch baking dish, then spread half of rigatoni over it. Top with half of almonds, half of remaining ragù, half of bread crumbs, and half of cheese. Repeat layers with remaining ingredients and bake until edges are lightly browned, about 20 minutes."
    ],
    "ingredients": [
        "35-oz can Italian plum tomatoes, including juice",
        "1 medium onion, finely chopped",
        "6 tablespoons extra-virgin olive oil",
        "3/4 lb ground pork",
        "1 tablespoon tomato paste",
        "1/4 cup water",
        "2 teaspoons sugar",
        "1/8 teaspoon cinnamon",
        "1/2 teaspoon black pepper",
        "3 tablespoons fine sea salt",
        "1 1/8 cups whole almonds with skins (6 oz)",
        "1/2 teaspoon almond extract",
        "1/2 cup fresh bread crumbs",
        "1 lb rigatoni",
        "3/4 cup grated Pecorino Romano cheese (2 oz)",
        "Special equipment: a food mill fitted with disk with smallest holes (1 mm)",
        "Garnish: 2 tablespoons chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Pasta",
        "Pork",
        "Tomato",
        "Sauté",
        "Mardi Gras",
        "Dinner",
        "Winter",
        "Gourmet"
    ],
    "title": "Baked Rigatoni with Pork Ragù and Almonds (Pasta Chi Civa)",
    "url": "http://www.epicurious.com/recipes/food/views/baked-rigatoni-with-pork-ragu-and-almonds-pasta-chi-civa-103056"
}
