{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F.",
        "Cook bacon in a 12-inch heavy skillet over moderate heat, turning over once, until edges are lightly browned but bacon is still flexible (it will continue to cook in oven), 6 to 8 minutes total. Transfer to paper towels to drain, reserving fat in skillet.",
        "While bacon cooks, core apples, if desired, from bottom, with pointed end of a vegetable peeler or a paring knife, leaving stems intact. Wrap a slice of bacon around each of 8 apples, securing ends of bacon by piercing with stem or using half a wooden pick.",
        "Brush a 3-quart (13- by 9-inch) shallow baking dish with some bacon fat, then add apples to dish and bake, uncovered, 10 minutes.",
        "Meanwhile, pat chicken dry and sprinkle with salt and pepper. Heat bacon fat in skillet over moderately high heat until hot but not smoking, then cook chicken, turning over once, until browned, about 8 minutes total. Transfer chicken with tongs to baking dish, rearranging some of apples so that chicken fits in bottom of dish, and bake, uncovered, 5 minutes.",
        "While chicken bakes, pour off fat from skillet and add cider, vinegar, and marjoram sprigs to skillet. Boil, stirring and scraping up brown bits, until reduced by half (about 3/4 cup), about 5 minutes. Pour sauce through a fine-mesh sieve into a measuring cup, pressing on and then discarding solids. Add butter and chopped marjoram to sauce, stirring until butter is melted. Pour sauce over chicken and apples and continue to bake, uncovered, until chicken is cooked through and apples are tender, about 20 minutes more."
    ],
    "ingredients": [
        "8 thin slices bacon (from a 1/2-lb package)",
        "12 lady apples (about 1 to 2 inches in diameter",
        "6 chicken thighs (2lb; with skin and bones)",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 cup unfiltered apple cider",
        "1/2 cup cider vinegar",
        "2 sprigs fresh marjoram plus 2 teaspoons chopped fresh marjoram, or to taste",
        "1 tablespoon cold unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Herb",
        "Bake",
        "Dinner",
        "Apple",
        "Bacon",
        "Fall",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Baked Chicken and Bacon-Wrapped Lady Apples",
    "url": "http://www.epicurious.com/recipes/food/views/baked-chicken-and-bacon-wrapped-lady-apples-235740"
}
