{
    "directions": [
        "Preheat oven to 350°F. Lightly oil 2-quart glass baking dish. Heat oil in heavy large deep skillet over medium heat. Add onion; sauté until tender, about 15 minutes. Stir in garlic and crushed red pepper, then chard; cover and cook until chard is tender, stirring occasionally, about 8 minutes. Uncover; stir until any excess liquid in skillet evaporates. Season with salt and pepper.",
        "Meanwhile, bring 3 1/2 cups water and salt to boil in heavy large saucepan. Gradually stir polenta into boiling water. Reduce heat to medium-low; simmer until polenta is very thick, stirring frequently, about 10 minutes. Remove from heat.",
        "Whisk ricotta and eggs in bowl; whisk in 1 cup hot polenta. Stir ricotta mixture into polenta in saucepan. Spread half of polenta mixture in baking dish. Spread half of chard mixture over. Sprinkle with half of mozzarella. Repeat layering with remaining polenta, chard, and cheese. Bake until puffed and brown on top, about 45 minutes. Cool 30 minutes."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "1 large white onion, thinly sliced",
        "2 garlic cloves, minced",
        "1/4 teaspoon dried crushed red pepper",
        "1 pound Swiss chard, thick stems and ribs removed, leaves cut crosswise into 1/2-inch-wide strips",
        "3 1/2 cups water",
        "1 teaspoon salt",
        "1 cup polenta (coarse cornmeal) or yellow cornmeal",
        "1 cup part-skim ricotta cheese",
        "2 large eggs",
        "2 cups coarsely grated low-fat mozzarella cheese (about 8 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Leafy Green",
        "Bake",
        "Thanksgiving",
        "Low Fat",
        "Vegetarian",
        "Mozzarella",
        "Ricotta",
        "Cornmeal",
        "Fall",
        "Healthy",
        "Chard"
    ],
    "title": "Baked Polenta with Swiss Chard and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/baked-polenta-with-swiss-chard-and-cheese-107270"
}
