{
    "directions": [
        "Heat olive oil in a stockpot over medium-low heat; cook and stir garlic in the hot oil until lightly browned, 1 to 2 minutes.",
        "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir ground beef into garlic. Add crushed tomatoes and tomato puree to ground beef mixture; season with salt and pepper. Cover stockpot and simmer mixture, stirring occasionally, until flavors have blended, about 2 hours.",
        "Heat a large skillet over medium-high heat. Cook sausage links in the hot skillet until browned and not longer pink in the center, 10 to 15 minutes; drain and discard grease. Slice sausages into 1/4-inch rounds. Stir sausage, green bell pepper, and onion into the simmering tomato sauce; cook, stirring occasionally until bell pepper and onion are softened, about 1 hour.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally until cooked through but firm to the bite, 10 to 11 minutes. Drain and return rigatoni to pot.",
        "Dice about 3/4 the mozzarella into 1/8-inch cubes. Mix cubed mozzarella with ricotta cheese in a bowl. Stir cheese mixture into cooked rigatoni until mozzarella cheese begins to melt. Pour rigatoni-cheese mixture into 2 large casserole dishes; add tomato-meat sauce. Toss well.",
        "Slice the remaining mozzarella cheese and arrange on top of rigatoni mixtures.",
        "Bake in the preheated oven until mozzarella cheese is melted and browned, about 45 minutes."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "2 cloves garlic, sliced",
        "2 pounds ground beef",
        "2 (28 ounce) cans crushed tomatoes",
        "1 (28 ounce) can tomato puree",
        "salt and ground black pepper to taste",
        "3 pounds Italian link sausage",
        "2 green bell peppers, cut into 1/2-inch strips",
        "1 large onion, sliced",
        "2 (16 ounce) packages rigatoni",
        "2 (16 ounce) packages mozzarella cheese",
        "1 (24 ounce) carton ricotta cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baked Ziti Plus",
    "url": "http://allrecipes.com/recipe/232921/baked-ziti-plus/"
}
