{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Cook asparagus in a large pot of lightly salted boiling water until tender, 5 to 8 minutes. Drain well and set aside.",
        "Scoop yolks out of hard-cooked eggs and transfer to a bowl; mash yolks with a fork.",
        "Mash deviled ham spread, cream, onion, 3/4 teaspoon dry mustard powder, Worcestershire sauce, and 1/2 teaspoon salt into the yolks until thoroughly combined.",
        "Fill cavities in egg halves with the yolk mixture; set deviled eggs aside.",
        "Melt 6 tablespoons of butter in a saucepan over medium heat, and whisk flour into butter until smooth and bubbling.",
        "Whisk in milk, a little at a time, until the sauce is smooth and thickened; reduce heat to low and simmer for 5 minutes.",
        "Whisk in Cheddar cheese, 1/4 teaspoon dry mustard powder, salt to taste, and black pepper; stir sauce until cheese is melted and incorporated.",
        "Spread asparagus into the bottom of a 9x13-inch baking dish.",
        "Arrange the deviled eggs on top of asparagus; pour the cheese sauce evenly over the deviled eggs.",
        "Mix crushed corn flakes with 2 tablespoons melted butter in a bowl; sprinkle over the casserole.",
        "Bake in the preheated oven until the sauce bubbles and the topping is browned, about 20 minutes."
    ],
    "ingredients": [
        "2 pounds fresh asparagus, trimmed and cut into 1-inch pieces",
        "10 hard-cooked eggs, peeled and sliced in half lengthwise",
        "1 (4.5 ounce) can deviled ham spread",
        "1 tablespoon heavy cream",
        "1 teaspoon grated onion",
        "3/4 teaspoon dry mustard powder",
        "1/2 teaspoon Worcestershire sauce",
        "1/2 teaspoon salt",
        "6 tablespoons butter",
        "6 tablespoons all-purpose flour",
        "3 cups milk",
        "2 cups shredded mild Cheddar cheese",
        "1/4 teaspoon dry mustard powder",
        "salt to taste",
        "1/8 teaspoon ground black pepper",
        "1 cup crushed corn flake cereal",
        "2 tablespoons butter, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baked Deviled Eggs with Asparagus",
    "url": "http://allrecipes.com/recipe/220277/baked-deviled-eggs-with-asparagus/"
}
