{
    "directions": [
        "Melt butter in small skillet over medium heat. Add flour; whisk 2 minutes. Add cream slowly and whisk until mixture thickens slightly. Remove from heat.",
        "Sauté bacon in heavy large skillet over medium heat until crisp, about 6 minutes. Transfer bacon to paper towels to drain. Discard all but 2 tablespoons drippings from skillet. Add leeks, celery, bay leaf, and cayenne to skillet and sauté over medium heat until vegetables are soft, about 12 minutes. Add wine and cook until absorbed, about 15 seconds. Add cream mixture and bring to simmer. Stir until leek mixture thickens slightly, about 3 minutes. Stir in bacon and cheese. Season generously with salt and pepper. (Can be made 1 day ahead. Cool slightly. Cover and refrigerate.)",
        "Place 1 oyster on each of 20 oyster shells or place 2 oysters in each of 10 small ramekins. Top oyster in each shell with 2 tablespoons leek mixture, or top oysters in ramekins with 1/4 cup leek mixture. Place on rimmed baking sheet. (Can be made 4 hours ahead. Cover and chill.)",
        "Preheat oven to 500°F. Divide breadcrumbs among shells or ramekins. Bake until leek mixture bubbles and crumbs are golden, about 8 minutes."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "1 tablespoon all purpose flour",
        "1 cup whipping cream",
        "8 ounces bacon (preferably applewood-smoked), chopped",
        "4 cups thinly sliced leeks (white and pale green parts only; from 4 large)",
        "1 cup finely chopped celery",
        "1 bay leaf",
        "1/8 teaspoon cayenne pepper",
        "2 tablespoons dry white wine",
        "2 tablespoons grated Pecorino Romano cheese",
        "20 medium oysters, shucked, or four 8-ounce jars shucked oysters",
        "1 cup fresh breadcrumbs made from crustless French bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Appetizer",
        "Bake",
        "Oyster",
        "Leek",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Baked Oysters with Bacon and Leeks",
    "url": "http://www.epicurious.com/recipes/food/views/baked-oysters-with-bacon-and-leeks-231061"
}
