{
    "directions": [
        "Mix water, 1/4 cup salt, 1/4 cup sugar, and hot sauce together in a large bowl until sugar and salt are dissolved into the brine. Place chicken pieces in the brine and refrigerate, 30 minutes to 1 hour. Pour brine from the bowl.",
        "Preheat oven to 350 degrees F (175 degrees C). Place a baking rack onto a baking sheet and coat rack with cooking spray.",
        "Combine flour, 1/2 teaspoon cayenne pepper, 1/2 teaspoon paprika, 1/2 teaspoon salt, 1/4 teaspoon garlic powder, and black pepper in a shallow bowl until coating is well mixed. Press chicken pieces into the coating until both sides are evenly coated; place on the prepared rack.",
        "Bake in the preheated oven for 20 minutes. Spray each chicken piece with cooking spray; flip and spray the other side. Continue baking until chicken is no longer pink in the center, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
        "Heat oil in a small pan over medium heat until shimmering. Mix 1 tablespoon cayenne pepper, 1/2 teaspoon paprika, 1/2 teaspoon salt, 1/2 teaspoon sugar, and 1/4 teaspoon garlic powder together in a bowl; add to oil and cook for 30 seconds. Brush oil mixture onto cooked chicken, adding more layers for extra heat."
    ],
    "ingredients": [
        "Brine:",
        "1 quart water",
        "1/4 cup salt",
        "1/4 cup white sugar",
        "1/4 cup hot sauce",
        "4 skinless, boneless chicken breast halves, cut into strips",
        "Coating:",
        "1 cup all-purpose flour",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon paprika",
        "1/2 teaspoon salt",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon ground black pepper",
        "Sauce:",
        "3 tablespoons vegetable oil",
        "1 tablespoon cayenne pepper",
        "1/2 teaspoon paprika",
        "1/2 teaspoon salt",
        "1/2 teaspoon white sugar",
        "1/4 teaspoon garlic powder",
        "cooking spray"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baked Nashville Hot Chicken Breasts",
    "url": "http://allrecipes.com/recipe/247042/baked-nashville-hot-chicken-breasts/"
}
