{
    "directions": [
        "Place porcini in small bowl. Add 2 cups hot water and let soften 20 minutes. Using slotted spoon, remove porcini. Reserve liquid. Coarsely chop porcini.",
        "Melt 3 tablespoons butter in heavy large skillet over medium-high heat. Add onions and sauté until soft, about 5 minutes. Add button and shiitake mushrooms and sauté 5 minutes. Mix in porcini and reserved soaking liquid, leaving any sediment behind in bowl. Simmer over medium-high heat 10 minutes.",
        "Melt remaining 3 tablespoons butter in heavy medium saucepan over medium heat. Add flour and stir constantly until golden, about 2 minutes. Gradually whisk in milk. Stir until sauce thickens and boils, about 3 minutes. Stir into mushroom mixture. Simmer 2 minutes, stirring occasionally. Stir in 1/2 cup Parmesan cheese and chives. Season sauce to taste with salt and pepper. Set aside. (Sauce can be prepared 1 day ahead. Cover and refrigerate. Rewarm over medium-low heat before continuing.)",
        "Preheat oven to 425°F. Butter 13 x 9 x 2-inch glass baking dish. Cook pasta in large pot of boiling salted water until tender but still firm to bite. Drain well. Return to pot. Add mushroom sauce and toss well to coat. Transfer to prepared baking dish. Sprinkle breadcrumbs and remaining 1/4 cup Parmesan over. Bake casserole until heated through and light golden, about 25 minutes."
    ],
    "ingredients": [
        "1/2 ounce dried porcini mushrooms",
        "2 cups hot water",
        "6 tablespoons (3/4 stick) butter",
        "1 3/4 cups finely chopped onions",
        "8 ounces fresh button mushrooms, chopped",
        "6 ounces fresh shiitake mushrooms, stemmed, sliced",
        "2 1/2 tablespoons all purpose flour",
        "2 1/2 cups whole milk",
        "3/4 cup freshly grated Parmesan cheese",
        "1/2 cup finely chopped fresh chives",
        "12 ounces penne pasta",
        "1/2 cup fresh breadcrumbs made from French bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Bake",
        "Vegetarian",
        "Parmesan",
        "Fall"
    ],
    "title": "Baked Penne Pasta with Wild Mushroom Ragoût",
    "url": "http://www.epicurious.com/recipes/food/views/baked-penne-pasta-with-wild-mushroom-ragout-5907"
}
