{
    "directions": [
        "Preheat an oven to 300°F. Generously coat the cups of a 12-cup miniature muffin pan with butter.",
        "Thinly slice the asparagus spears crosswise, keeping the tips whole. Set the asparagus tips aside.",
        "In a sauté pan over medium-low heat, melt 2 tsp. of the butter. Add the sliced asparagus and the leek and cook gently, stirring often, until just softened slightly, 1 to 2 minutes. Transfer to a small bowl and let cool.",
        "Crumble the goat cheese into another bowl. Add the ricotta cheese and egg and mash together with a fork until well combined, then mix in the cooled vegetables. Divide the filling evenly among the prepared muffin cups. Bake the “bites” until puffed and lightly golden on top, 20 to 25 minutes.",
        "Meanwhile, cut each asparagus tip in half lengthwise. In a small nonstick fry pan over low heat, melt the remaining 1/2 tsp. butter. Add the asparagus tips and sauté until just tender, about 1 minute. Transfer to a small bowl.",
        "When the bites are done, transfer the pan to a wire rack. Run a table knife around the inside of each cup to loosen the edges and let cool slightly. Invert a large plate or tray over the muffin pan, invert the pan and plate together and lift off the pan.",
        "Arrange the bites on a platter or individual plates and top each with an asparagus-tip half. Serve warm or at room temperature. Makes 12 bites; serves 6 to 12.",
        "Adapted from Williams-Sonoma",
        "New Flavors for Appetizers",
        ", by Amy Sherman (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "2 1/2 tsp. unsalted butter, plus more for greasing",
        "6 asparagus spears, tough ends trimmed",
        "1 leek, halved lengthwise and rinsed well, white and light green portions finely chopped",
        "2 oz. fresh goat cheese",
        "1/2 cup whole-milk ricotta cheese",
        "1 egg"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Baked Asparagus, Leek and Goat Cheese Bites",
    "url": "http://www.williams-sonoma.com/recipe/baked-asparagus-leek.html"
}
