{
    "directions": [
        "In a bowl whisk together the wine, the lemon juice, the parsley, the oil, the pepper, and salt to taste and add the onion. In another bowl toss together the carrots, the squash, and the zucchini, add about 1/4 cup of the liquid from the onion mixture, and toss the mixture well. Spread the onion mixture in the bottom of a greased glass baking dish, 15 by 10 by 2 inches. On a work surface arrange the flounder fillet halves, skinned sides up, beginning with the narrow end roll up each fillet half jelly-roll fashion, and secure each roll with a wooden pick. Arrange the fish rolls, seam sides down and not touching each other, on the onion mixture, put an oiled sheet of parchment or wax paper directly on them, and bake the mixture in the middle of a preheated 400°F. oven for 8 minutes. Spread the vegetable mixture around the rolls and bake the mixture, the fish covered directly with the parchment, for 7 to 12 minutes more, or until the fish just flakes. Transfer the vegetables to a heated platter, arrange the fish rolls on top of them, and spoon the juices over the top."
    ],
    "ingredients": [
        "1/4 cup dry white wine",
        "3 tablespoons fresh lemon juice",
        "2 tablespoons finely chopped fresh parsley leaves",
        "1/4 cup olive oil",
        "1/2 teaspoon coarsely ground black pepper",
        "1 onion, sliced thin",
        "3 carrots, cut into 2-inch julienne strips",
        "1 yellow squash, cut into 2-inch julienne strips",
        "1 zucchini, cut into 2-inch julienne strips",
        "six 6- to 8-ounce flounder fillets, halved lengthwise and seasoned with salt and pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Bake",
        "Lemon",
        "Carrot",
        "Zucchini",
        "Yellow Squash",
        "Gourmet"
    ],
    "title": "Baked Flounder Fillets with Lemon-Pepper Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/baked-flounder-fillets-with-lemon-pepper-vegetables-11938"
}
