{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C).",
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the ziti, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink. Rinse with cold water to stop the cooking process. Transfer to a large roasting pan.",
        "Whisk together 1 jar of spaghetti sauce and the ricotta cheese in a large bowl. Add to the pasta and stir.",
        "Place the spinach in the bowl of a food processor; blend until finely chopped; remove and set aside. Then place the carrots in the food processor and process until finely chopped.",
        "Heat the olive oil in a large skillet over medium-high heat. Cook the chopped carrots in the hot oil until they begin to soften, about 2 minutes. Stir in the zucchini, portobello mushrooms, button mushrooms, and garlic; cook and stir until the zucchini is soft, about 4 minutes. Remove from heat and stir in the chopped spinach, tomatoes, and 2 tablespoons Italian seasoning; drain. Add to the ziti and mix. Sprinkle about 1/2 the bag of the Italian cheese blend over the pasta and stir through. Pour in the 3 remaining jars of spaghetti sauce; stir until the pasta and vegetables are evenly coated. Season with 2 tablespoons Italian seasoning, salt, and pepper; mix. Cover the pan with aluminum foil.",
        "Bake in the preheated oven until completely heated through, 1 to 1 1/2 hours. Remove the foil and sprinkle the remaining cheese over the dish. Return dish to oven and bake until the cheese melts and begins to brown, about 10 minutes more."
    ],
    "ingredients": [
        "2 (16 ounce) packages ziti",
        "1 (16 ounce) jar spaghetti sauce",
        "1 (15 ounce) container ricotta cheese",
        "1 (6 ounce) package baby spinach leaves",
        "1 pound ready-peeled baby carrots",
        "2 tablespoons olive oil",
        "3 small zucchini, diced",
        "1 (6 ounce) package portobello mushroom caps, diced",
        "1 (8 ounce) package button mushrooms, diced",
        "1 1/2 tablespoons minced garlic",
        "1 (28 ounce) can diced tomatoes, drained",
        "2 tablespoons Italian seasoning",
        "1 (8 ounce) package shredded Italian cheese blend",
        "3 (16 ounce) jars spaghetti sauce",
        "2 tablespoons Italian seasoning",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baked Ziti Primavera",
    "url": "http://allrecipes.com/recipe/190199/baked-ziti-primavera/"
}
