{
    "directions": [
        "Preheat the oven to 375° F.",
        "Clean the trout and wash well, making sure to remove the line of blood from the inside near the backbone. Dry with paper towels and season inside and out with salt and freshly ground pepper. Put a lump of butter and a sprig of fennel into the center of each trout. Take a large sheet of aluminum foil and smear a little butter on the center. Put the trout onto the buttered bit and fold over the edges into a papillote shape. Seal well to ensure that none of the juices can escape. Repeat with the other trout. Put the two foil parcels on a baking sheet, making sure they are not touching. Bake in the preheated oven for about 30 minutes.",
        "Meanwhile, make the spinach-butter sauce. Remove any large stems from the spinach and wash well. Cook in 2 1/2 cups salted boiling water for 4–5 minutes or until just soft and tender. Drain, pressing out every last drop of water, then mince the spinach. Put the cream into a saucepan and simmer on low heat until reduced to about 3 tablespoons. Then, on a very low heat, whisk in the butter bit by bit as though you were making a hollandaise sauce. Stir in the spinach.",
        "When the fish is cooked, open the parcels and use some of the delicious juices to thin the sauce. Put the two parcels on a hot serving dish and bring to the table. Skin the fish and lift the juicy pink flesh onto hot plates. Spoon the spinach-butter sauce over the fish and eat immediately."
    ],
    "ingredients": [
        "2 rainbow trout, weighing 2 pounds each",
        "Salt and freshly ground pepper",
        "2–4 tablespoons butter",
        "2 sprigs of fresh herb fennel",
        "1 cup spinach leaves",
        "2/3 cups heavy cream",
        "6 tablespoons butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fish",
        "Leafy Green",
        "Herb",
        "Bake",
        "Quick & Easy",
        "Trout"
    ],
    "title": "Baked Trout with Spinach-Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/baked-trout-with-spinach-butter-sauce-238043"
}
