{
    "directions": [
        "Preheat oven to 300 degrees F.",
        "Prepare oven-dried tomatoes:",
        "Skin the tomatoes by placing them in boiling water for 30 seconds and then plunging them right away in ice water. This will help you remove the skin without cooking the tomatoes. Using a paring knife, peel the skin off the tomatoes and then cut them in 1/2 lengthwise. Place the tomatoes in a bowl, sprinkle with alt and add the thyme and 2 ounces of olive oil. Arrange the tomatoes with the thyme sprigs on a non-reactive baking pan. Leave enough space around the tomato halves so they don't touch, allowing air to circulate and dry them out. Put them in a 300 degree F oven to dry for 2 hours.",
        "Prepare the garlic:",
        "Place the garlic cloves in a small pot and cover with 2 cups of olive oil. Simmer very slowly for 40 minutes, until the garlic is soft. Remove them from the oil and set aside at room temperature.",
        "Preheat oven to 375 degrees F.",
        "Prepare the eggplant:",
        "Slice the eggplant into 1-inch rounds. Put them in a bowl and sprinkle generously with salt. Drizzle olive oil over them and toss. Arrange the rounds on a baking pan, leaving enough space between each slice so that they cook evenly. Bake until they are soft and slightly brown, about 30 minutes.",
        "Prepare the pasta:",
        "In a large pot, bring to a boil 4 quarts of salted water. Add the rigatoni and cook until \"al dente\" or even slightly undercooked, about 6 to 8 minutes. Since the pasta will be cooked in the oven, it's important not to overcook the pasta in the boiling water. Drain the pasta in a colander and toss with a little olive oil to prevent them from sticking. Set aside.",
        "Assemble and bake dish:",
        "Raise oven temperature to 425 degrees F.",
        "In a large bowl, combine the pasta, eggplant, tomato, garlic, scallion and basil and mix well. Add the ricotta and toss gently so that the ingredients are distributed among the pasta but that the ricotta is not completely mixed through. The idea here is to have distinct and differing flavors, so it is important that the ricotta be spread in roughly tablespoon size pieces. Season, if necessary, with salt and freshly ground black pepper.",
        "Transfer to a large greased earthenware or glass baking dish. Sprinkle with Parmesan and bake in the oven until the pasta is brown and crisp on top, about 10 to 15 minutes."
    ],
    "ingredients": [
        "3 Roma tomatoes",
        "Sea salt and fresh ground black pepper",
        "4 sprigs fresh thyme",
        "2 ounces olive oil, plus 2 cups olive oil, plus extra for drizzling",
        "2 heads garlic, cloves peeled",
        "2 Italian eggplants",
        "1/4 pound dried rigatoni",
        "2 scallions, cut into 1/4-inch slices",
        "1 bunch fresh basil, leaves only",
        "1 cup fresh ricotta cheese",
        "1/4 cup grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roasted Tomato",
        "Roasted Vegetable",
        "Roasting",
        "Tomato",
        "Vegetable",
        "Vegetarian",
        "Italian",
        "Pasta Recipes",
        "Cheese",
        "Ricotta",
        "Eggplant Recipes",
        "Main Dish Recipes"
    ],
    "title": "Baked Rigatoni with Roasted Eggplant and Tomato",
    "url": "http://www.foodnetwork.com/recipes/baked-rigatoni-with-roasted-eggplant-and-tomato-recipe"
}
