{
    "directions": [
        "Position an oven rack in the top position of the oven, and preheat to 450 degrees F. Set a cooling rack on a rimmed baking sheet.",
        "Heat the oil in a large skillet over medium-high heat. Add the onions, and cook, stirring frequently, until browned and soft, about 5 minutes. Remove from the heat, and let cool in the skillet.",
        "Remove the outer leaves and core of the cauliflower heads. Separate the heads into large florets, and trim away most of the remaining smaller stems. In 2 batches, process the florets in a food processor until very finely chopped, almost a paste, then transfer the paste to a large bowl. Wipe out the food processor.",
        "Put the cauliflower in the middle of a double layer of cheesecloth, and gather up the sides into a bundle. Squeeze out as much liquid as you can over the sink, then put the cauliflower back in the bowl. Add the browned onion, almond meal, egg whites and 2 teaspoons salt, and work together with your hands until combined and the mixture holds together when squeezed. Scoop out even tablespoonfuls, roll each into a ball and shape into a squared-off tot shape, and line them up on a baking sheet. (The tots can be covered loosely with plastic wrap and refrigerated overnight.)",
        "Pulse the rice cereal in the food processor until finely ground, and transfer to a small dish. Whisk the egg yolks with 1/4 cup water in a medium bowl. Line up the tots, egg wash, ground cereal and prepared baking sheet with the rack on your work surface. Dip the tots in the egg wash (let the excess drip off), roll them in the cereal to fully coat and place on the rack. (To avoid a mess, designate one hand for dipping and retrieving in the egg and the other for rolling in the cereal.) Spray each tot all over with the cooking spray, turning as needed. (Unsprayed breaded tots can be placed on a parchment-lined baking sheet, frozen until solid, about 2 hours, then transferred to a large freezer bag for up to 1 month. Coat with cooking spray before baking.)",
        "Bake the tots on the prepared baking sheet until golden brown outside and hot inside, 15 to 20 minutes. Let cool for a few minutes, then transfer to a serving platter. Serve with desired dipping sauces."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1/2 small onion, finely chopped",
        "2 small heads cauliflower",
        "1 cup almond meal",
        "2 large eggs, separated",
        "Kosher salt",
        "2 cups crispy rice cereal",
        "Cooking spray",
        "Dipping sauces, such as ketchup, grainy mustard, pesto or red-pepper hummus, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Cauliflower",
        "Vegetable",
        "Diabetes-Friendly",
        "Low-Cholesterol",
        "Low-Carb",
        "Low Calorie",
        "Gluten Free"
    ],
    "title": "Baked Cauliflower Tots",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/baked-cauliflower-tots"
}
