{
    "directions": [
        "Put oven rack in middle position and preheat oven to 450°F. Oil a baking sheet.",
        "Halve apples lengthwise and remove core with a melon-ball cutter or a paring knife. Melt butter in a 10-inch heavy ovenproof skillet over moderate heat and sprinkle with 1/2 tablespoon sugar. Arrange apple halves, cut sides down, on sugar and cook, undisturbed, until sugar begins to caramelize, 3 to 5 minutes. Transfer skillet to oven and bake apples until tender, about 15 minutes.",
        "While apples are baking, cook remaining 1/4 cup sugar with salt in a dry 7- to 8-inch heavy skillet over moderately high heat, undisturbed, until sugar begins to melt, about 2 minutes. Continue to cook, stirring occasionally with a fork, until sugar is melted into a deep golden caramel, 1 to 2 minutes more. Remove from heat. Add walnuts, stirring to coat, then pour onto baking sheet and cool 10 minutes. Break nuts into small pieces if necessary.",
        "Stir together yogurt and 2 teaspoons honey.",
        "Serve apples, cut sides up, topped with yogurt and nuts. Drizzle with additional honey if desired."
    ],
    "ingredients": [
        "2 Gala or Golden Delicious apples",
        "1/2 tablespoon unsalted butter",
        "1/4 cup plus 1/2 tablespoon sugar",
        "1/4 teaspoon salt",
        "1/2 cup walnut pieces, toasted",
        "1/4 cup thick yogurt (preferably Greek), sour cream, or crème fraîche",
        "2 teaspoons honey plus additional (optional) for drizzling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Quick & Easy",
        "Yogurt",
        "Apple",
        "Walnut",
        "Fall",
        "Honey",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Baked Apples with Candied Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/baked-apples-with-candied-walnuts-230775"
}
