{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Mix the garlic powder, seasoned salt, onion powder, dried oregano, salt, and ground black pepper in a small bowl; set aside. Pour 1/3 of one can of beer into the bottom of a 9x13-inch baking dish. Place the open beer can in the center of the baking dish.",
        "Rinse chicken under cold running water. Discard giblets and neck from chicken; drain and pat dry. Fit whole chicken over the open beer can with the legs on the bottom. With the breast of the chicken facing you, use a paring knife to cut a small slit on each side and press the tip of each wing into the slit to encourage even cooking.",
        "Rub the prepared seasoning mixture to taste over the entire chicken. Pat the sliced green onions around the whole chicken evenly. Some will fall into the beer, that's fine. Press the halved green onions into the top cavity of the chicken. Open the remaining beer and pour 1/2 of it into the pan under then chicken. Reserve the remaining beer.",
        "Bake the chicken in the preheated oven. After 45 minutes, pour remaining beer into the pan under the chicken. Continue baking until no longer pink at the bone and the juices run clear, about 30 additional minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove the chicken from the oven and discard the beer can. Cover the chicken with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing."
    ],
    "ingredients": [
        "1/4 cup garlic powder",
        "2 tablespoons seasoned salt",
        "2 tablespoons onion powder",
        "1 tablespoon dried oregano",
        "1 tablespoon salt",
        "1 1/2 teaspoons ground black pepper",
        "1 (12 fluid ounce) can light-flavored beer (such as Bud Light®)",
        "1 (3 pound) whole chicken",
        "4 green onions, sliced",
        "4 green onions, cut in half crosswise",
        "1 (12 fluid ounce) can light-flavored beer (such as Bud Light®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baked Beer Can Chicken",
    "url": "http://allrecipes.com/recipe/214617/baked-beer-can-chicken/"
}
