{
    "directions": [
        "Preheat oven to 375°F.",
        "Spread 1 1/2 bunches of dill evenly in baking pan, reserving remainder for garnish. Simmer water, clam juice, onion, salt, peppercorns, and bay leaf in a 2- to 3-quart saucepan, uncovered, 10 minutes, then pour hot mixture over dill in pan.",
        "Arrange fish, skin sides up, in 1 layer on dill in pan and season with salt and pepper. Bake, uncovered, in middle of oven until fish is just cooked through, 10 to 20 minutes, depending on thickness of fillets. Transfer fish, skin sides up, to a platter and keep warm, loosely covered with foil.",
        "Pour cooking liquid through a sieve into a bowl, pressing hard on solids. Discard solids and reserve 2/3 cup cooking liquid.",
        "Whisk together egg yolk and lemon juice in a small bowl. Beat egg white with a clean whisk in a medium bowl until it just holds stiff peaks, then whisk in yolk mixture.",
        "Pour egg mixture into a 2-quart heavy saucepan, then whisk in reserved cooking liquid. Cook sauce over moderately low heat, stirring constantly with a wooden spoon (it will be foamy), until it is thick enough to coat back of spoon and registers 170 to 175°F on an instant-read thermometer, 2 to 3 minutes. (Do not let boil.) Immediately pour sauce through a fine sieve into a bowl, then serve over fish."
    ],
    "ingredients": [
        "2 large bunches fresh dill (1/2 pound)",
        "2 cups water",
        "1 cup bottled clam juice",
        "1 medium onion, sliced",
        "1/2 teaspoon salt",
        "1/4 teaspoon whole black peppercorns",
        "1 Turkish bay leaf or 1/2 California bay leaf",
        "6 (5-ounce) pieces red snapper fillets with skin",
        "1 large egg, separated",
        "1/4 cup fresh lemon juice",
        "Special equipment: a 17- by 12- by 1-inch baking pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Wheat/Gluten-Free",
        "Lemon",
        "Snapper",
        "Spring",
        "Healthy",
        "Dill",
        "Gourmet"
    ],
    "title": "Baked Red Snapper with Avgolemono",
    "url": "http://www.epicurious.com/recipes/food/views/baked-red-snapper-with-avgolemono-106367"
}
