{
    "directions": [
        "Preheat oven to 425°F.",
        "Cook onion, garlic, oregano, and red pepper flakes in 1 tablespoon oil in a 4-quart heavy pot over moderately high heat, stirring, until onion is softened, about 3 minutes. Add wine and boil until reduced by half, about 3 minutes. Stir in tomatoes and salt, then reduce heat and simmer briskly, stirring frequently, until slightly thickened, about 8 minutes. Stir shrimp into sauce and simmer, stirring occasionally, until shrimp are just cooked through, about 3 minutes.",
        "While sauce and shrimp are cooking, cook orzo in a 6-quart pot of boiling salted water (see Tips, page 204) until al dente. Reserve 1/2 cup cooking water, then drain orzo in a sieve. Return orzo to pot and toss with remaining tablespoon oil. Stir in sauce with shrimp and reserved cooking water, then add olives and salt and pepper to taste.",
        "Spoon half of pasta into an oiled 13- by 9- by 2-inch glass baking dish, then sprinkle with half of feta. Top with remaining pasta and feta, then bake in middle of oven, uncovered, until cheese is slightly melted and pasta is heated through, 10 to 15 minutes."
    ],
    "ingredients": [
        "1 medium onion, finely chopped",
        "3 garlic cloves, minced",
        "1/2 teaspoon dried oregano, crumbled",
        "1/4 teaspoon dried hot red pepper flakes",
        "2 tablespoons olive oil",
        "1/2 cup dry white wine",
        "1 (28- to 32-oz) can crushed tomatoes",
        "1 teaspoon salt",
        "1 1/2 lb large shrimp (about 36), shelled and deveined",
        "1 lb orzo (rice-shaped pasta)",
        "1/2 cup Kalamata or other brine-cured black olives, pitted and chopped",
        "1 lb feta, patted dry and crumbled (3 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Olive",
        "Pasta",
        "Shellfish",
        "Tomato",
        "Bake",
        "Shrimp",
        "Fall",
        "Gourmet"
    ],
    "title": "Baked Orzo with Shrimp, Tomato Sauce, and Feta",
    "url": "http://www.epicurious.com/recipes/food/views/baked-orzo-with-shrimp-tomato-sauce-and-feta-105722"
}
