{
    "directions": [
        "1. Turn on the oven to 400°F.",
        "2. Place the potato wedges in the baking dish, pour 2 tablespoons of the olive oil over them, add 2 sprigs of rosemary, all the garlic cloves, and salt, and pepper. Toss thoroughly. Put the dish in the preheated oven.",
        "3. After 15 minutes, remove the dish to turn the potatoes over, then put it back in the oven. Cook until the potatoes feel tender when tested with a fork, another 10 minutes or so.",
        "4. Remove the dish from the oven. Push the potatoes to the sides, making room in the center for the fish fillet to lie flat.",
        "5. Wash the fish fillet, pat it dry with paper towels, and lay it flat in the dish, skin side down. Strip the leaves from the remaining rosemary sprigs, scatter them over the fish, add salt and pepper, and sprinkle the bread crumbs and the remaining 2 tablespoons olive oil over the fillet. Return the dish to the oven and bake for 14 minutes. Let the dish settle out of the oven for 3 to 4 minutes before bringing it to the table."
    ],
    "ingredients": [
        "1 pound new potatoes, peeled, washed, and cut into wedges",
        "An oven-to-table baking dish that can accommodate both the fish and the potatoes in one layer",
        "4 tablespoons extra virgin olive oil",
        "4 or 5 fresh rosemary sprigs",
        "4 whole garlic cloves, peeled",
        "Fine sea salt",
        "Black pepper ground fresh from the mill",
        "A 2-pound fillet from a firm-fleshed fish, such as grouper, striped bass, red snapper, or mahi mahi",
        "2 tablespoons fine, dry, unflavored bread crumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Garlic",
        "Herb",
        "Potato",
        "Bake",
        "Rosemary",
        "Healthy"
    ],
    "title": "Baked Fish and Potatoes with Rosemary and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/baked-fish-and-potatoes-with-rosemary-and-garlic-230907"
}
