{
    "directions": [
        "Bring large pot of salted water to boil. Mix in lemon juice. Add endive and boil until crisp-tender, about 10 minutes. Drain. Transfer to bowl of ice water; cool. Drain. Squeeze endive gently from root end to tip to remove excess water. (Can be made 6 hours ahead. Cover and chill.)",
        "Preheat oven to 375°F. Butter 11x7x2-inch glass baking dish. Sauté pancetta in medium skillet over medium heat until crisp, about 4 minutes. Using slotted spoon, transfer pancetta to bowl.",
        "Melt butter in heavy medium saucepan over medium-low heat. Add flour and whisk 2 minutes. Gradually whisk in milk. Bring to boil, whisking until sauce is smooth. Add nutmeg. Reduce heat to medium and simmer until sauce thickens, stirring often, about 15 minutes. Mix in Gruyère cheese. Stir in pancetta. Season with salt and pepper. Pour 1/3 of the sauce into prepared baking dish. Arrange endive atop sauce. Spoon remaining sauce over. Sprinkle with breadcrumbs and Parmesan cheese. Bake until endive is tender, about 25 minutes."
    ],
    "ingredients": [
        "2 tablespoons fresh lemon juice",
        "8 small heads Belgian endive",
        "5 ounces pancetta, finely chopped",
        "3 tablespoons unsalted butter",
        "3 tablespoons all purpose flour",
        "2 1/2 cups whole milk",
        "1/4 teaspoon ground nutmeg",
        "3/4 cup grated Gruyère cheese",
        "1/3 cup fresh breadcrumbs",
        "1/3 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Leafy Green",
        "Pork",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Casserole/Gratin",
        "Parmesan",
        "Fall",
        "Winter",
        "Endive",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Baked Endive with Pancetta and Parmesan Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/baked-endive-with-pancetta-and-parmesan-cheese-104057"
}
