{
    "directions": [
        "» Preheat the oven to 350 degrees F and line a baking sheet with parchment paper. Slice the top quarter off each pumpkin and remove the seeds and stringy bits.",
        "» In a medium skillet over medium-high heat, sauté the sausage for 3 to 4 minutes, until cooked through. Drain off any rendered fat and set aside.",
        "» Whisk 1 of the eggs, and toss it in a large bowl with the sausage, bread cubes, sage, parsley, salt, and pepper until well combined.",
        "» Fill each pumpkin with the stuffing mixture to a little less than 1 inch from the top, and place it on the prepared sheet. Bake for 40 minutes, until the pumpkins have soft- ened. Remove the pan from the oven and use a spoon to compress the stuffing a little. Pour 1 of the remaining 4 eggs into each pumpkin. Lightly cover the pumpkins with a sheet of aluminum foil. Increase the heat to 400 degrees F and return the sheet to the oven. Bake for another 10 minutes, until the eggs are just set.",
        "» Serve hot, topped with about a teaspoon of crème fraîche and more salt and pepper to taste."
    ],
    "ingredients": [
        "4 mini pumpkins (about 1 pound each)",
        "4 ounces sweet or hot bulk sausage",
        "5 eggs",
        "4 pieces stale bread (any nonsweet kind), cut into cubes",
        "1 tablespoon minced fresh sage, or 1 teaspoon dried",
        "1 tablespoon minced Italian parsley",
        "1/2 teaspoon salt",
        "1/2 teaspoon freshly ground pepper",
        "4 teaspoons crème fraîche (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Herb",
        "Side",
        "Bake",
        "Sauté",
        "Vegetarian",
        "Dinner",
        "Pumpkin",
        "Fall",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Baked Mini Pumpkin Pots",
    "url": "http://www.epicurious.com/recipes/food/views/baked-mini-pumpkin-pots-51200620"
}
