{
    "directions": [
        "Preheat the oven to 425°F/220°C. Put the pumpkin in a roasting pan with the onion and sage. Season and pour over the olive oil. Cook for around 30 minutes, or until the pumpkin is tender.",
        "While the pumpkin is cooking, make your dressing. In a small frying pan on a medium heat, toast the cumin seeds. This should only take a minute, and you will know it's ready when the dusk of the cumin is wafting round your kitchen. Cool for a minute, then squeeze the lemon juice into the pan and add the olive oil. Put this into a pitcher or something and leave to the side, stirring in the crème fraîche just before serving.",
        "Now, the greens. In a big frying pan, heat the olive oil and garlic. Throw in the greens and cook until tender, 5 to 10 minutes.",
        "Take the pumpkin out of the oven. Put the greens on a plate, top with the pumpkin, and cover with the dressing."
    ],
    "ingredients": [
        "2 pounds/1 kg pumpkin, seeded and chopped into coarse slices",
        "1 large red onion, peeled and coarsely sliced",
        "A few fresh sage leaves, coarsely torn",
        "Salt and pepper",
        "2 tablespoons olive oil",
        "1 1/2 teaspoons cumin seeds or ground cumin",
        "Juice of 1/2 lemon",
        "1 tablespoon olive oil",
        "1 teaspoon crème fraîche or sour cream",
        "2 tablespoons olive oil",
        "1 clove garlic, peeled and finely chopped",
        "A handful of Swiss chard",
        "A handful of curly kale"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Side",
        "Bake",
        "Vegetarian",
        "Kale",
        "Squash",
        "Pumpkin",
        "Fall",
        "Winter",
        "Chard",
        "Lemon Juice",
        "Cumin",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Baked Pumpkin with Lemon, Sautéed Greens, and Toasted Cumin Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/baked-pumpkin-with-lemon-sauteed-greens-and-toasted-cumin-dressing-51137420"
}
