{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray 2 standard-size, 6-well (3 1/2-inch) doughnut pans with cooking spray.",
        "Stir together flour, pumpkin pie spice, baking powder, baking soda, and salt in a small bowl. Whisk together brown sugar, butter, oil, buttermilk, whole egg, egg yolk, pumpkin puree, and vanilla in a large bowl until smooth. Add flour mixture to pumpkin mixture, stirring just until no streaks of flour remain.",
        "Spoon mixture into prepared doughnut pans (they'll be quite full), and bake until tops spring back when lightly pressed, 15 to 18 minutes. Remove doughnuts from pans and transfer to a wire rack to cool while you prepare glaze.",
        "Melt butter in a small saucepan over medium heat just until it begins to brown, about 3 minutes. Remove from heat and whisk in brown sugar, cream, and maple syrup. Return pan to low heat and cook until bubbly, about 30 seconds. Remove from heat and whisk in powdered sugar and vanilla until smooth.",
        "Spread about 4 teaspoons of glaze over top of each doughnut, then immediately sprinkle with pecans (if using). Let stand until glaze is set, about 15 minutes."
    ],
    "ingredients": [
        "Doughnuts:",
        "1 1/2 cups all-purpose flour",
        "2 teaspoons pumpkin pie spice",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup packed dark brown sugar",
        "1/2 stick butter, melted",
        "1/4 cup vegetable oil",
        "1/3 cup buttermilk",
        "1 large egg",
        "1 large egg yolk",
        "1 cup pumpkin puree",
        "1 teaspoon vanilla extract",
        "Glaze:",
        "1/4 cup butter",
        "1/2 cup packed dark brown sugar",
        "2 tablespoons cream or milk",
        "2 tablespoons pure maple syrup",
        "1 cup confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "1/2 cup coarsely chopped pecans (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baked Buttermilk Pumpkin Doughnuts",
    "url": "http://allrecipes.com/recipe/245831/baked-buttermilk-pumpkin-doughnuts/"
}
