{
    "directions": [
        "Arrange the tomatoes, cut sides down, on a rack to drain. On a microwave-safe plate lined with several layers of paper towel microwave the bacon at high power (100%) for 2 to 3 minutes, or until it is browned. Transfer the bacon to another paper towel to drain and when it is crisp crumble it coarse. Sprinkle the inside of the tomatoes with salt and pepper to taste, arrange them, cut sides up, in a microwave-safe shallow baking dish, and microwave them at medium power (50%) for 30 seconds to 1 minute, or until they are softened. (Do not overcook the tomatoes or they will collapse.)",
        "In a shallow microwave-safe bowl melt the butter at high power (100%), whisk in the eggs, the mustard, the scallions, and salt and pepper to taste, and microwave the mixture at high power (100%), stirring every 30 seconds, for 1 1/2 minutes, or until the eggs are in large chunks and almost set. Stir the mixture briskly to break up the chunks and stir in the bacon and the shredded basil. Divide the egg mixture between the tomatoes, top it with the Monterey Jack strips, forming Xs, and microwave the filled tomatoes at high power (100%) for 15 seconds, or until the cheese is melted."
    ],
    "ingredients": [
        "2 large tomatoes (about 1 1/2 pounds), a 1/2-inch slice cut from the stem end of each and is carded and the pulp scooped out",
        "4 slices of lean bacon",
        "1 teaspoon unsalted butter, melted",
        "3 large eggs, beaten lightly",
        "1/4 teaspoon Dijon-style mustard",
        "2 scallions, sliced thin",
        "1 tablespoon finely shredded fresh basil leaves plus basil sprigs for garnish",
        "thin 2-inch strips of Monterey Jack"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Tomato",
        "Appetizer",
        "Quick & Easy",
        "Bacon",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Baked Tomatoes Filled with Egg, Bacon, and Scallions",
    "url": "http://www.epicurious.com/recipes/food/views/baked-tomatoes-filled-with-egg-bacon-and-scallions-12372"
}
