{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Trim off any skin and excess fat from the fresh ham, leaving 1/4 inch of fat at most. Place the ham, fat-side up, in a roasting pan.",
        "Combine the coconut oil, garlic, rosemary, thyme and 2 tablespoons each salt and pepper in a bowl. Rub the mixture all over the ham. Bake until the internal temp reaches 160 to 165 degrees F, 5 to 5 1/2 hours (essentially 30 minutes per pound), basting every hour with beer. Let rest for 20 to 30 minutes before carving.",
        "Slather aioli on the bottom and top sides of the buns. Top the bottom buns with sliced ham, fried pickles and a bun top.",
        "For the Cajun aioli: In a bowl, whisk together the mayonnaise, lemon juice and Cajun seasoning until combined. Fold in the green onions, cover and refrigerate until ready to serve.",
        "For the fried pickles: Combine the sour cream and pickle juice in a shallow dish. In a second shallow dish, whisk the flour, cornmeal and cayenne until combined.",
        "Drain the pickles and add them to the sour cream mixture. Then, using a fork, add the pickles, a few at a time, to the flour mixture and toss to coat.",
        "Heat 1/2 inch of canola oil to 350 degrees F in a large cast-iron skillet. In several batches, fry the pickles, flipping constantly, until golden brown and crispy all over, 2 1/2 minutes per batch. Drain on a paper-towel-lined baking sheet and season with salt."
    ],
    "ingredients": [
        "One 10- to 12-pound bone-in fresh ham, at room temp",
        "2 tablespoons unrefined coconut oil, melted",
        "3 cloves garlic, minced",
        "1 tablespoon finely chopped fresh rosemary",
        "1 tablespoon chopped fresh thyme",
        "Kosher salt and freshly ground black pepper",
        "One 12-ounce beer, amber or dark",
        "Fried Pickles and Cajun Aioli, for garnish and spreading, recipe follows",
        "8 to 12 sandwich buns, split",
        "1 cup mayonnaise",
        "2 tablespoons lemon juice",
        "1 teaspoon Cajun seasoning",
        "3 green onions, green parts only, sliced",
        "1/2 cup sour cream",
        "3 tablespoons pickle juice",
        "1/2 cup all-purpose flour",
        "1/2 cup stone-ground yellow cornmeal",
        "Pinch cayenne pepper",
        "32 dill pickle slices",
        "Canola oil, for frying",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Cajun",
        "Pickle Recipes",
        "Sandwich",
        "Ham",
        "Meat",
        "Main Dish Recipes",
        "Roasting"
    ],
    "title": "Baked Fresh Ham Sandwiches with Fried Pickles and Cajun Aioli",
    "url": "http://www.foodnetwork.com/recipes/damaris-phillips/baked-fresh-ham-sandwiches-with-fried-pickles-and-cajun-aioli"
}
