{
    "directions": [
        "Rinse porcini mushrooms. Place in medium bowl. Add 4 cups hot water, cover, and let stand until softened, about 20 minutes. Drain, reserving soaking liquid. Chop porcini.",
        "Heat 2 tablespoons oil in each of 2 heavy large pots over medium heat. Divide onions between pots; sauté until tender, about 10 minutes. Divide sausage between pots. Increase heat to high and cook until no longer pink, breaking up into small pieces with back of fork, about 12 minutes. Divide button mushrooms and chopped rosemary between pots and stir until mushrooms begin to soften, about 8 minutes. Divide porcini, wine, and bay leaves between pots and boil until almost all liquid evaporates, stirring frequently, about 6 minutes. Divide porcini soaking liquid between pots, leaving sediment behind. Divide beef broth between pots. Boil until sauce is syrupy, stirring occasionally, about 20 minutes. Divide half and half between pots; boil until thickened slightly, stirring occasionally, about 5 minutes. (Sauce can be made 1 day ahead. Cool slightly, then cover and chill. Rewarm before continuing.)",
        "Brush four 3 1/2-quart glass or porcelain baking dishes with oil. Cook pasta in 2 large pots of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain. Divide pasta between sauce in pots; stir to coat. Mix 3 cups cheese into each pot. Season pasta with salt and pepper. Divide among prepared baking dishes. (Can be prepared 1 day ahead. Cover and refrigerate. Bring to room temperature before continuing.)",
        "Preheat oven to 375°F. Cover dishes with foil. Bake pasta just until hot but not bubbling, about 25 minutes. Sprinkle with additional cheese. Garnish with rosemary sprigs and serve with additional cheese."
    ],
    "ingredients": [
        "4 ounces dried porcini mushrooms",
        "4 cups hot water",
        "4 tablespoons olive oil",
        "4 large onions, finely chopped",
        "5 pounds hot Italian sausages, casings removed",
        "4 pounds button mushrooms, sliced",
        "4 teaspoons chopped fresh rosemary",
        "2 cups dry white wine",
        "4 bay leaves",
        "2 14-ounce cans beef broth",
        "4 cups half and half",
        "4 pounds rigatoni",
        "6 cups freshly grated Parmesan cheese",
        "Additional grated Parmesan cheese",
        "Fresh rosemary sprigs (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Pork",
        "Bake",
        "Christmas",
        "Casserole/Gratin",
        "Sausage",
        "White Wine",
        "Winter",
        "Family Reunion"
    ],
    "title": "Baked Rigatoni with Sausage and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/baked-rigatoni-with-sausage-and-mushrooms-231288"
}
