{
    "directions": [
        "Preheat oven to 325°F. Butter 8x8x2-inch glass baking dish. Bring 43/4 cups water and salt to boil in heavy medium pot. Add corn grits to boiling water in thin steady stream, stirring constantly. Reduce temperature and simmer grits until thick, stirring frequently, about 20 minutes. Pour cooked grits into large mixing bowl. Whisk in 1/4 cup grated Parmesan cheese, grated cheddar cheese and 2 tablespoons butter. Season grits to taste with pepper. Whisk in egg. Transfer to prepared baking dish. Place dish in large roasting pan. Fill roasting pan with enough hot water to come halfway up sides of baking dish. Bake until grits are firm to touch, about 45 minutes.",
        "Meanwhile, melt remaining 2 tablespoons butter in heavy large skillet over medium-high heat. Add assorted mushrooms, ham and minced shallot and sauté until mushrooms are tender, about 4 minutes. Add white wine and cook until almost all liquid is absorbed, about 3 minutes. Add whipping cream and cook until slightly thickened, about 3 minutes. Stir in fresh thyme. Season mixture to taste with salt and pepper.",
        "Spoon baked corn grits onto plates. Top with mushroom and ham mixture. Sprinkle with remaining 1/2 cup grated Parmesan cheese and serve immediately."
    ],
    "ingredients": [
        "4 3/4 cups water",
        "1 teaspoon salt",
        "1 cup corn grits*",
        "3/4 cup grated Parmesan cheese (about 3 ounces)",
        "1/2 cup (packed) grated white cheddar cheese (about 2 ounces)",
        "4 tablespoons (1/2 stick) butter",
        "1 large egg",
        "4 cups assorted fresh wild mushrooms (such as chanterelle, morel, stemmed shiitake or oyster), sliced",
        "1/2 cup matchstick-size strips country ham",
        "2 tablespoons minced shallot",
        "1/2 cup dry white wine",
        "1/2 cup whipping cream",
        "2 tablespoons minced fresh thyme",
        "*Corn grits, also known as polenta, are available at Italian markets, natural foods stores and some supermarkets. If unavailable, substitute 1 cup regular yellow cornmeal, and simmer about 10 minutes."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Side",
        "Bake",
        "Dinner",
        "Parmesan",
        "Ham",
        "Fall",
        "Hominy/Cornmeal/Masa",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Baked Grits with Ham, Wild Mushrooms and Parmesan",
    "url": "http://www.epicurious.com/recipes/food/views/baked-grits-with-ham-wild-mushrooms-and-parmesan-104069"
}
