{
    "directions": [
        "Preheat oven to 400°F. Butter 13 x 9 x 2-inch glass baking dish. Stir butter, maple syrup and apple juice in small saucepan over medium-low heat until butter melts. Increase heat and boil until mixture is slightly reduced, about 5 minutes. Remove from heat; whisk in cinnamon, allspice and salt.",
        "Arrange 1/3 of squash slices in prepared dish. Top with half of apple slices, then 1/3 of squash slices. Arrange remaining slices of squash and apple atop, alternating squash and apple slices and overlapping slightly. Sprinkle lightly with salt and pepper. Pour maple syrup mixture over. Cover baking dish tightly with foil.",
        "Bake casserole until squash is almost tender, about 50 minutes. Uncover and bake until squash is tender, basting occasionally with syrup, about 20 minutes longer. (Can be made 1 day ahead. Cover with foil and refrigerate. Rewarm, covered, in 350°F oven about 25 minutes, or microwave on high about 8 minutes.) Spoon syrup from dish over vegetables and serve."
    ],
    "ingredients": [
        "1/2 cup (1 stick) butter",
        "3/4 cup pure maple syrup",
        "1/4 cup apple juice",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon salt",
        "3 small butternut squashes, peeled, halved lengthwise, seeded, cut crosswise into 1/3-inch-thick slices",
        "4 6-ounce Granny Smith apples, peeled, halved, cored, cut into 1/4-inch-thick slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Vegetable",
        "Side",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Kid-Friendly",
        "Apple",
        "Spice",
        "Butternut Squash",
        "Fall",
        "Maple Syrup"
    ],
    "title": "Baked Spiced Butternut Squash with Apples and Maple Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/baked-spiced-butternut-squash-with-apples-and-maple-syrup-15643"
}
