{
    "directions": [
        "Preheat the oven to 425°F. Line a baking sheet with parchment paper, and set aside.",
        "Cook the potato in a microwave, an oven, or in boiling water until almost fork-tender (see Cooks' Note). Let cool completely. Using a paring knife, peel the potato, and then shred with a box grater.",
        "In a large mixing bowl, combine the flour, baking powder, baking soda, salt, and pepper. Add the cold butter and cut in using 2 knives, a pastry blender, potato masher, or your hands, until the dough resembles coarse crumbs the size of peas. Fold in the cheese, chives, and shredded potato.",
        "Add the buttermilk and stir with a wooden spoon until the dough just comes together. It’ll be sticky, but don’t panic. Transfer to a well-floured work surface and knead a few times to smooth it out. Fold the dough onto itself about 4 times, turning clockwise after each fold. Pat the dough with your hands until it’s about 3/4 inch thick.",
        "Use a 2-inch round cookie or biscuit cutter to cut into rounds. Place the biscuits on the prepared baking pan just barely touching each other. Gather scraps and repeat patting and cutting (you should have 20).",
        "Brush the biscuits with the melted butter, and bake until golden brown, 18 to 20 minutes. Let cool before serving. Store any leftovers in an airtight container in the refrigerator for up to 4 days."
    ],
    "ingredients": [
        "1 medium baking potato, rinsed and dried",
        "2 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1/4 teaspoon baking soda",
        "1 teaspoon salt",
        "1/2 teaspoon coarsely ground black pepper",
        "6 tablespoons very cold unsalted butter, diced, plus 2 tablespoons, melted",
        "1/4 cup shredded white Cheddar cheese",
        "2 tablespoons chopped chives",
        "1 cup buttermilk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Biscuit",
        "Potato",
        "Chive",
        "Cheese",
        "Cheddar"
    ],
    "title": "Baked-Potato Buttermilk Biscuits",
    "url": "http://www.epicurious.com/recipes/food/views/baked-potato-buttermilk-biscuits"
}
