{
    "directions": [
        "Preheat the oven to 375 degrees F. Bring a large pot of salted water to a boil. Add the pasta and cook until just slightly softened, about 6 minutes. Reserve 1/2 cup cooking water, then drain the pasta and rinse under cold water.",
        "Meanwhile, melt 4 tablespoons butter in a large saucepan over medium heat. Whisk in the flour, mustard powder, Worcestershire sauce, hot sauce and cayenne and cook, whisking, until the mixture is smooth and slightly golden, about 2 minutes. Whisk in the milk and cook, whisking occasionally, until the sauce begins to boil and thicken, about 5 minutes. Stir in the havarti and all but 1 cup each of the cheddar and American cheese; cook, stirring, until the cheese just melts, about 1 more minute. Stir in the pasta, adding the reserved pasta water as needed to make a creamy sauce. Season with salt.",
        "Brush a 9-by-13-inch baking dish with melted butter. Spread the pasta mixture in the dish. Melt the remaining 4 tablespoons butter in a bowl in the microwave; stir in the crushed crackers and parmesan. Sprinkle the reserved cheddar and American cheese evenly over the pasta, then scatter the cracker mixture on top. Cover with aluminum foil and bake until heated through, about 25 minutes. Remove the foil; continue baking until browned and bubbly, about 20 more minutes. Let rest 10 minutes before serving.",
        "Photograph by Con Poulos"
    ],
    "ingredients": [
        "Kosher salt",
        "1 pound elbow macaroni",
        "1 stick unsalted butter, plus melted butter for brushing",
        "1/4 cup all-purpose flour",
        "2 teaspoons mustard powder",
        "1 teaspoon Worcestershire sauce (optional)",
        "1 teaspoon hot sauce",
        "1/4 teaspoon cayenne pepper",
        "1 quart whole milk",
        "8 ounces havarti cheese, grated (about 2 cups)",
        "1 pound sharp yellow cheddar cheese, grated (about 4 cups)",
        "12 ounces white American cheese, grated (about 3 cups)",
        "1 sleeve butter crackers (such as Ritz), crushed (about 35 crackers)",
        "2 tablespoons grated parmesan cheese (optional)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Macaroni and Cheese",
        "Cheese"
    ],
    "title": "Baked Macaroni and Cheese",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/baked-macaroni-and-cheese-recipe"
}
