{
    "directions": [
        "Chop yellow bell peppers and onion and mince garlic. In a 3- to 4-quart heavy saucepan cook yellow peppers, onion, and garlic in 1 tablespoon oil, covered, over moderately low heat, stirring occasionally, until peppers are soft, about 30 minutes. Stir in cream. In a blender puree mixture in batches (use caution when blending hot liquids), transferring to a large bowl, and season with salt and pepper. (Sauce may be made 2 days ahead and chilled, covered. Bring sauce to room temperature before proceeding.)",
        "Thinly slice mushrooms lengthwise and cut red and orange bell peppers into 1/4-inch-wide strips. In a deep large heavy skillet cook mushrooms and peppers in remaining 2 tablespoons oil over moderately high heat, stirring occasionally, until peppers are softened and most of liquid is evaporated, about 8 minutes, and season with salt and pepper.",
        "Preheat oven to 375°F.",
        "Fill a 6- to 7-quart kettle three fourths full with salted water and bring to a boil. Stir in ziti and cook until just tender, about 10 minutes. Reserve 1 cup pasta cooking water and drain ziti well in a colander. Rinse ziti and drain well. Thinly slice scallion greens. Into sauce stir ziti, mushroom mixture, scallion greens, 1 1/2 cups Parmesan, reserved cooking water, and salt and pepper to taste. Spoon mixture into a 3-quart shallow baking dish and sprinkle with remaining 1/2 cup Parmesan.",
        "Bake ziti in middle of oven until hot and pasta begins to brown, about 20 minutes."
    ],
    "ingredients": [
        "3 large yellow bell peppers (about 1 1/2 pounds)",
        "1 large onion",
        "3 garlic cloves",
        "3 tablespoons olive oil",
        "1 1/2 cups heavy cream",
        "1 1/2 pounds mushrooms",
        "2 medium red bell peppers",
        "2 medium orange bell peppers",
        "1 pound ziti",
        "8 scallions (green part only)",
        "2 cups freshly grated Parmesan (about 6 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Pasta",
        "Pepper",
        "Bake",
        "Super Bowl",
        "Vegetarian",
        "Winter",
        "Gourmet"
    ],
    "title": "Baked Ziti with Mushrooms, Peppers, and Parmesan",
    "url": "http://www.epicurious.com/recipes/food/views/baked-ziti-with-mushrooms-peppers-and-parmesan-14637"
}
