{
    "directions": [
        "In a heavy skillet cook bacon over moderate heat, stirring occasionally, until golden and add shallot. Cook mixture, stirring, until shallot is softened. Stir in Cognac and cool mixture to room temperature. In a small bowl stir together bacon mixture, butter, and parsley. Butter may be prepared 3 days ahead formed into a 3-inch-long log, and chilled, wrapped well in plastic wrap.",
        "Preheat oven to 425°F.",
        "In a steamer set over 1/2 inch simmering water steam spinach, covered, until just wilted, about 1 minute. Gently rinse spinach under cold water to stop cooking and pat each leaf dry.",
        "Loosen each oyster from shell with a small knife if necessary and wrap in a spinach leaf. Return oysters to shells and top with butter. In a small roasting pan spread coarse salt 1/4 inch deep and nestle shells in salt to keep them level. Oysters may be prepared up to this point 8 hours ahead and chilled, covered. Bake oysters in middle of oven until plump and butter is sizzling, about 10 minutes.",
        "Spread coarse salt 1/4 inch deep on each of 2 plates and nestle oysters in salt."
    ],
    "ingredients": [
        "1 1/2 slices lean bacon (about 1 ounce), chopped fine",
        "1 tablespoon minced shallot",
        "1 1/2 tablespoons Cognac",
        "2 tablespoons unsalted butter, softened",
        "1 1/2 teaspoons minced fresh flat-leafed parsley leaves (wash and dry before chopping)",
        "6 spinach leaves, tough stems discarded, washed",
        "6 oysters on the half shell",
        "coarse sea or coarse salt for filling roasting pan and plates"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Bacon",
        "Oyster",
        "Cognac/Armagnac",
        "Spinach",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Baked Oysters in Jackets with Bacon Cognac Butter",
    "url": "http://www.epicurious.com/recipes/food/views/baked-oysters-in-jackets-with-bacon-cognac-butter-14267"
}
