{
    "directions": [
        "Place an oven rack in the center of the oven. Preheat the oven to 350 degrees F. Spray a 9-by-13-by-2-inch glass baking dish with vegetable oil cooking spray. Set aside.",
        "For the fonduta sauce: In a medium heavy-bottomed saucepan, bring the milk and cream to a simmer over medium heat. Reduce the heat to low. Add the Pecorino Romano and whisk until the cheese is melted and the sauce is smooth. Remove the pan from the heat and stir in the basil. Set aside.",
        "In a large skillet, heat 2 tablespoons of olive oil over medium-high heat. Add the sausage, shallots, garlic, 1/4 teaspoon salt, and 1/4 teaspoon pepper. Cook until the sausage is cooked through and the vegetables have softened, 8 to 10 minutes. Using a wooden spoon, break the sausage into 1/2-inch pieces. Increase the heat to high. Add the wine and scrape up the brown bits that cling to the bottom of the pan with a wooden spoon. Cook until the wine has evaporated, about 2 minutes. Remove the pan from the heat and set aside to cool slightly. Add the peas, ricotta, and 1 cup of the fonduta sauce. Season with remaining 1/2 teaspoon kosher salt and 1/4 teaspoon pepper.",
        "Bring a large pot of salted water to a boil over high heat. Add the pasta and cook until just tender, 7 to 8 minutes. Drain and set aside.",
        "Spread half of the marinara sauce over the bottom of the prepared baking dish. Using a small spoon, fill the manicotti shells with the sausage filling and arrange in a single layer in the baking dish. Pour the remaining marinara sauce on top of the filled shells. Spoon the remaining fonduta sauce on top and sprinkle with the mozzarella. Drizzle with olive oil and bake until bubbly and golden brown, 30 to 35 minutes."
    ],
    "ingredients": [
        "Vegetable oil cooking spray",
        "3/4 cup milk",
        "1/2 cup heavy cream",
        "6 ounces (about 3 cups) grated Pecorino Romano",
        "1/4 cup chopped fresh basil leaves",
        "2 tablespoons olive oil, plus extra for drizzling",
        "1 pound sweet Italian sausage, casings removed",
        "1 large or 2 small shallots, finely chopped",
        "2 cloves garlic, minced",
        "1/4 teaspoon kosher salt, plus 1/2 teaspoon",
        "1/4 teaspoon freshly ground black pepper, plus 1/4 teaspoon",
        "1/4 cup white wine, such as Pinot Grigio",
        "3/4 cup (4 ounces) frozen petite peas, thawed",
        "1/2 cup whole milk ricotta",
        "12 manicotti shells",
        "1 (26-ounce) jar marinara sauce",
        "2 cups (8 ounces) shredded mozzarella"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Pasta Recipes",
        "Beans and Legumes",
        "Pea Recipes",
        "Cheese",
        "Sausage Recipes",
        "Main Dish Recipes"
    ],
    "title": "Baked Manicotti with Sausage and Peas",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/baked-manicotti-with-sausage-and-peas-recipe"
}
