{
    "directions": [
        "Heat oil in heavy large skillet over medium heat. Add onion and sauté until translucent, about 8 minutes. Add mushrooms and sauté until tender, about 4 minutes. Add jamón and dried crushed red pepper and stir 1 minute. Add tomatoes. Simmer until mixture mounds on spoon, stirring frequently, about 10 minutes. Season sauce with salt and pepper.",
        "Cook asparagus in large pot of boiling salted water until just crisp-tender. Drain. Rinse under cold water and drain well. (Can be prepared 1 day ahead. Cover tomato sauce and asparagus separately and refrigerate. Bring to room temperature before using.)",
        "Preheat oven to 400°F. Grease four, 5 to 6-inch-diameter shallow earthenware casseroles or baking dishes with olive oil. Divide sauce among dishes. Make large well in center of sauce in each dish. Break 2 eggs into each well. Sprinkle eggs with pepper and then cheese. Arrange asparagus around edge of dishes. Cover with foil. Bake until eggs are almost set, about 12 minutes. Garnish with parsley and serve immediately."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1 large onion, chopped",
        "12 ounces mushrooms, chopped",
        "6 ounces jamón serrano or prosciutto, chopped",
        "1/4 teaspoon dried crushed red pepper",
        "2 1/2 cups crushed tomatoes in puree (about 3/4 of 28-ounce can)",
        "12 ounces asparagus, trimmed",
        "8 eggs",
        "2/3 cup grated manchego or Romano cheese (about 2 1/2 ounces)",
        "Fresh Italian parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Mushroom",
        "Tomato",
        "Brunch",
        "Bake",
        "Lunch",
        "Ham",
        "Asparagus",
        "Spring",
        "Prosciutto",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Baked Eggs with Tomato-Ham Sauce and Asparagus",
    "url": "http://www.epicurious.com/recipes/food/views/baked-eggs-with-tomato-ham-sauce-and-asparagus-1880"
}
