{
    "directions": [
        "Preheat oven to 375°F. Thinly slice one-third of onion. Toss slices with 1/4 cup orange juice, 1/4 cup vinegar, and 1/2 tsp. salt in a small bowl; set aside.",
        "Pulse chickpeas, garlic, coriander, cumin, 3/4 cup parsley, 1 tsp. salt, and remanining onion in a food processor until very coarsely chopped, about 30 seconds. Add flour and baking powder and pulse a few more times to combine.",
        "Lightly oil a rimmed baking sheet. Using a 1/4-cup measuring cup, portion out 12 ping pong-sized balls and place on sheet, spacing 1\" apart. Gently press down on tops to flatten slightly. Brush tops with 1 Tbsp. oil. Bake falafel, turning balls halfway through, until golden brown and crispy, 20–25 minutes. Wrap pitas in foil and warm in oven during last 5 minutes of baking.",
        "Meanwhile, whisk 1/4 cup oil and remaining 1/4 cup plus 1 tablespoon orange juice, 2 tsp. vinegar, and 1 tsp. salt in a medium bowl. Whisk in tahini and 1/4 cup water until a smooth sauce forms.",
        "Whisk 2 Tbsp. pickling liquid from reserved onions with remaining 3 Tbsp. oil in another medium bowl. Add cabbage, tomatoes, and onions and toss to coat.",
        "Cut each pita into 4 pieces. Drizzle falafel with 2 Tbsp. tahini sauce and top with remaining 1/4 cup parsley. Serve with pita, hummus, salad, and remaining tahini sauce alongside.",
        "Falafel can be made 5 days ahead; store in an airtight container and chill, or freeze up to 1 month."
    ],
    "ingredients": [
        "1 small red onion",
        "1/2 cup plus 1 tablespoon freshly squeezed orange juice, divided",
        "1/4 cup plus 2 teaspoons distilled white vinegar, divided",
        "2 1/2 teaspoons kosher salt, divided",
        "2 (15-ounce) cans chickpeas, drained, rinsed",
        "1 garlic clove, crushed",
        "1 teaspoon ground coriander",
        "1 teaspoon ground cumin",
        "1 cup chopped parsley, divided",
        "5 tablespoons chickpea flour",
        "1 teaspoon baking powder",
        "1/2 cup vegetable oil, divided, plus more for pan",
        "4 pita breads",
        "1/2 cup tahini",
        "2 cups shredded green cabbage",
        "1 cup cherry tomatoes, quartered",
        "Homemade or store-bought hummus (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetarian",
        "Vegan",
        "Wheat/Gluten-Free",
        "Dinner",
        "Chickpea",
        "Coriander",
        "Cumin",
        "Orange Juice",
        "Bake",
        "No Meat, No Problem"
    ],
    "title": "Baked Falafel With Orange-Tahini Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/baked-falafel-with-orange-tahini-sauce"
}
