{
    "directions": [
        "Heat the oven to 400 degrees F.",
        "Toss the banana slices and lemon juice in a small bowl and set aside.",
        "Combine 1/2 cup of the sugar, the flour and salt in a 3-quart saucier. Add the egg yolks and whisk to combine. Add the half-and-half and carefully whisk to combine. Cook over medium-low heat, stirring constantly until the mixture reaches 172 to 180 degrees F, approximately 5 to 10 minutes. The mixture will begin to thicken and bubble around the edges. Remove the pan from the heat and whisk in the vanilla extract.",
        "Spread a small amount of the pudding in the bottom of an oven-safe 1 1/2-quart glass mixing bowl. Cover with a layer of vanilla wafers, followed by a layer of banana slices. Pour 1/3 of the remaining pudding on top of the bananas and repeat, ending with a layer of pudding.",
        "Whisk the egg whites and cream of tartar in the bowl of a stand mixer on medium speed until soft peaks form. Gradually add the remaining 2 tablespoons of sugar and continue whisking until stiff peaks form. Spoon the meringue over the warm pudding, being sure to cover the edges. Bake until the meringue is evenly browned, about 8 to 10 minutes. Remove the pudding from the oven and cool for 15 minutes before serving. Cool completely before refrigerating. Refrigerate for up to 3 days."
    ],
    "ingredients": [
        "3 ripe bananas, peeled and sliced into 1/4-inch rounds",
        "1 tablespoon freshly squeezed lemon juice",
        "1/2 cup granulated sugar, plus 2 tablespoons",
        "1/3 cup all-purpose flour",
        "1/4 teaspoon kosher salt",
        "4 large eggs, separated",
        "2 cups half-and-half",
        "1/2 teaspoon vanilla extract",
        "45 vanilla wafers",
        "1 pinch cream of tartar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Banana Pudding",
        "Banana",
        "Fruit",
        "Pudding Recipes"
    ],
    "title": "Baked Banana Pudding",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/baked-banana-pudding-recipe"
}
