{
    "directions": [
        "Heat olive oil in heavy large pot over medium-high heat. Add pancetta and sauté until brown and crisp. Using slotted spoon, transfer pancetta to bowl. Sprinkle pork with salt and pepper. Add half of pork to drippings in pot; sauté until brown, about 7 minutes. Transfer to bowl with pancetta. Repeat with remaining pork. Add sausage to same pot. Sauté until no longer pink, breaking up with back of fork, about 5 minutes. Add onions, carrots, celery, thyme, garlic, bay leaves, and crushed red pepper. Reduce heat to medium-low; sauté until vegetables are tender, about 10 minutes. Add wine and bring to boil, scraping up browned bits. Add pancetta and pork with any accumulated juices; boil 2 minutes. Add tomatoes with juice. Cover and cook until pork is very tender, adjusting heat as needed to maintain gentle simmer and stirring occasionally, about 2 hours.",
        "Uncover pot; tilt to 1 side and spoon off fat from surface of ragù. Gently press pork pieces with back of fork to break up meat coarsely. Season ragù to taste with salt and pepper. (Can be made 2 days ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep refrigerated. Rewarm over low heat before continuing.)",
        "Preheat oven to 400°F. Butter 15x10x2-inch glass baking dish or other 4-quart baking dish. Cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain pasta; mix into ragù. Season mixture to taste with salt and pepper; transfer to prepared dish. Sprinkle both cheeses over. Bake until heated through and golden, about 20 minutes.",
        "*Pancetta (Italian bacon cured in salt) is available at Italian markets and in the refrigerated deli case of many supermarkets."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "4 ounces thinly sliced pancetta,* chopped",
        "2 pounds Boston butt (pork shoulder), cut into 1 1/4-inch cubes",
        "1 pound Italian hot sausages, casings removed",
        "2 cups chopped onions",
        "3/4 cup chopped carrots",
        "3/4 cup chopped celery",
        "6 large fresh thyme sprigs",
        "6 large garlic cloves, chopped",
        "2 bay leaves",
        "1/2 teaspoon dried crushed red pepper",
        "2 cups dry red wine",
        "1 28-ounce can plum tomatoes in juice, tomatoes chopped, juice reserved",
        "1 1/4 pounds ziti pasta",
        "2 cups (packed) coarsely grated whole-milk mozzarella cheese (about 8 ounces)",
        "1/2 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pasta",
        "Pork",
        "Tomato",
        "Sauté",
        "Super Bowl",
        "Mozzarella",
        "Bacon",
        "Carrot",
        "Red Wine",
        "Winter",
        "Thyme",
        "Potluck",
        "Simmer"
    ],
    "title": "Baked Ziti with Spicy Pork and Sausage Ragù",
    "url": "http://www.epicurious.com/recipes/food/views/baked-ziti-with-spicy-pork-and-sausage-ragu-109165"
}
