{
    "directions": [
        "Preheat oven to 400°F. Using melon baller, core apples, leaving bottoms intact. Place in glass pie dish, spacing apart. Microwave uncovered at 50 percent power until tender, about 10 minutes. Refrigerate 5 minutes to cool.",
        "Meanwhile, mix brown sugar and cinnamon in small bowl. Transfer 3 tablespoons cinnamon sugar to small saucepan. Add raisins and 3 tablespoons heavy cream and stir over low heat until sugar dissolves. Combine 3 tablespoons cinnamon sugar and remaining heavy cream in medium bowl and whisk to peaks. Cover and refrigerate. Roll out each biscuit on floured surface to thin 8-inch round; brush lightly with egg. Place apple in center of each round; fill apples with raisin mixture, overfilling slightly. Pull 4 sides of dough up to top of apple (from 3, 6, 9, and 12 o'clock positions) and twist in center, making apple stem shape. Using fingertips, press seams tightly to seal. Transfer dumplings to baking sheet. Brush dumplings with egg; sprinkle with remaining cinnamon sugar.",
        "Bake dumplings until golden, about 18 minutes. Serve with cinnamon whipped cream."
    ],
    "ingredients": [
        "4 8-ounce Golden Delicious apples, peeled",
        "1/2 cup (packed) dark brown sugar",
        "1 1/4 teaspoons ground cinnamon",
        "1/3 cup raisins",
        "1 cup chilled heavy whipping cream, divided",
        "4 purchased refrigerated uncooked large flaky biscuits (from 16.3-ounce tube), room temperature",
        "1 large egg, beaten to blend"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Quick & Easy",
        "High Fiber",
        "Raisin",
        "Apple",
        "Fall",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Baked Apple, Raisin, and Brown Sugar Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/baked-apple-raisin-and-brown-sugar-dumplings-241099"
}
