{
    "directions": [
        "In a large deep skillet cook the onion, the garlic, and the rosemary in the oil over moderate heat, stirring, until the onion is softened, add the mushrooms and salt to taste, and cook the mixture over moderately high heat, stirring, for 10 minutes, or until the liquid the mushrooms give off is evaporated. Stir in the tomato paste and the wine and boil the mushroom mixture until most of the liquid is evaporated. In a small bowl stir the cornstarch into the broth, add the mixture and the Worcestershire sauce to the mushroom mixture, and bring the ragout to a boil, stirring. Simmer the ragout for 2 minutes and season it with salt and pepper.",
        "In a large heavy saucepan bring the water with the oil to a boil and add 1 cup of the cornmeal, a little at a time, stirring constantly. Reduce the heat to low, add the remaining 1 cup cornmeal in a slow stream, stirring constantly, and bring the mixture to a boil. Remove the pan from the heat and stir in the butter, 2/3 cup of the Parmesan, the parsley, and salt and pepper to taste.",
        "Spread one third of the polenta evenly in a buttered 13- by 9-inch baking dish and chill the polenta sheet for 20 minutes, or until it is firm. While the polenta is chilling, working quickly, spread half the remaining polenta in a buttered 3-quart shallow baking dish, top it with half the mushroom ragout, and top the ragout with the mozzarella. Spread the remaining polenta quickly over the mozzarella and top it with the remaining ragout.",
        "Invert the polenta sheet onto a work surface and with 1 or more star-shaped cutters cut out as many stars as possible. Arrange the stars decoratively on the ragout and sprinkle them with the remaining 1/3 cup Parmesan. The layered polenta may be prepared up to this point 2 days in advance and kept covered and chilled.",
        "Preheat the oven to 400°F. Bake the layered polenta in the upper third of the oven for 30 to 40 minutes, or until the polenta stars are golden."
    ],
    "ingredients": [
        "1 large onion, chopped fine",
        "4 garlic cloves, minced",
        "1 teaspoon dried rosemary, crumbled",
        "3 tablespoons olive oil",
        "1 pound white mushrooms, sliced thin",
        "1 pound fresh shiitake mushrooms, stems discarded and if large, the caps quartered",
        "1 tablespoon tomato paste",
        "1 cup dry red wine",
        "1 tablespoon cornstarch",
        "1 1/3 cups beef broth",
        "2 teaspoons Worcestershire sauce",
        "6 cups water",
        "1 tablespoon olive oil",
        "2 cups yellow cornmeal",
        "2 tablespoons unsalted butter, cut into pieces",
        "1 cup freshly grated Parmesan",
        "1/3 cup minced fresh parsley leaves",
        "1/4 pound mozzarella, diced fine (about 1 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Mushroom",
        "Onion",
        "Appetizer",
        "Bake",
        "Mozzarella",
        "Parmesan",
        "Cornmeal",
        "Red Wine",
        "Winter",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Baked Polenta with Shiitake Ragoût",
    "url": "http://www.epicurious.com/recipes/food/views/baked-polenta-with-shiitake-ragout-10988"
}
