{
    "directions": [
        "Layer eggplant slices in a bowl, sprinkling salt onto each layer. Set aside for 30 minutes. Spread a layer of paper towel on a work surface; drain eggplant slices on paper towels.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.",
        "Mix diced tomatoes, tomato sauce, artichoke hearts, and roasted red peppers in a bowl.",
        "Heat a skillet over medium-low heat; toast pine nuts, stirring occasionally, in the hot skillet until fragrant and lightly browned, 3 to 5 minutes. Stir toasted pine nuts, garlic, parsley, basil, oregano, and black pepper into tomato mixture using a fork.",
        "Spread a layer of eggplant in the bottom of the prepared baking dish; spoon 1/3 the tomato mixture atop eggplant layer. Sprinkle 1/3 the red onion, 1/3 the mozzarella, and 1/3 the Pecorino-Romano cheese over tomato layer. Repeat layering until all ingredients are used.",
        "Bake in the preheated oven until cheese is melted and golden brown, about 40 minutes."
    ],
    "ingredients": [
        "2 large eggplant, cut into 1/4-inch rounds",
        "salt to taste",
        "1 (14 ounce) can diced tomatoes, undrained",
        "1 (8 ounce) can tomato sauce",
        "1 (8 ounce) jar marinated artichoke hearts, undrained",
        "1 (8 ounce) jar roasted red peppers, drained and cut into strips",
        "1/2 cup pine nuts",
        "6 cloves garlic, minced",
        "2 tablespoons chopped fresh parsley, or to taste",
        "2 tablespoons chopped fresh basil, or to taste",
        "1 tablespoon chopped fresh oregano, or to taste",
        "ground black pepper to taste",
        "1 red onion, thinly sliced",
        "1/2 cup shredded mozzarella cheese, or to taste",
        "1/4 cup grated Pecorino-Romano cheese, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baked Eggplant Antipasto",
    "url": "http://allrecipes.com/recipe/232479/baked-eggplant-antipasto/"
}
