{
    "directions": [
        "Preheat the oven to 375°F.",
        "Mix together the walnuts, sugar, and spices and set aside.",
        "As you work, keep the sheets of phyllo covered with plastic wrap to keep them from drying out. Place 1 sheet of phyllo on the bottom of a jelly roll pan (12-inch x16-inch). Brush the dough lightly with melted butter. Repeat this process until there are 8 sheets of phyllo in the pan.",
        "Sprinkle one-third of the nut mixture onto the phyllo sheets.",
        "Place 4 more sheets of phyllo on top of the nuts, brushing melted butter between each sheet.",
        "Place another one-third of the nut mixture on the dough.",
        "Layer the remaining sheets of phyllo on top of the nuts, brushing melted butter in between each sheet. Brush the top sheet with butter as well.",
        "Trim the edges so that they do not stand above the level of the dough.",
        "Cut the pastry into 2-inch squares, making sure not to slice through the bottom layer of phyllo dough. Leaving the bottom layer uncut will allow the syrup to soak in more efficiently.",
        "Bake at 375°F for 25-30 minutes or until the top layer of the phyllo takes on a light golden brown color.",
        "While the dough bakes prepare the syrup. Combine all of the ingredients and bring to a boil. Remove the clove and lemon peel.",
        "Remove the pan from the oven and immediately pour hot syrup over the baklava.",
        "Before serving allow the baklava to stand at room temperature until cooled. Slice through the bottom layer of phyllo dough and serve."
    ],
    "ingredients": [
        "3 1/2 cups walnuts, chopped",
        "1/2 cup sugar",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground cardamom",
        "1/4 teaspoon ground cloves",
        "1 pound package phyllo sheets, thawed",
        "1 1/2 cups butter, melted",
        "2 cups, plus 2 tablespoons sugar",
        "1 1/2 cups water",
        "1/2 cup honey",
        "1/4 lemon, peel only",
        "1 clove"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Cocktail Party",
        "Picnic",
        "Ramadan",
        "Walnut",
        "Fall",
        "Honey",
        "Cinnamon",
        "Party",
        "Phyllo/Puff Pastry Dough",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Baklava",
    "url": "http://www.epicurious.com/recipes/food/views/baklava-352471"
}
