{
    "directions": [
        "Combine sugar and water in a 2 1/2- to 3-quart saucepan. Squeeze juice from lemon and orange into sugar mixture. Add fruit halves and cinnamon sticks. Bring mixture to a boil over moderate heat, uncovered, stirring occasionally, until sugar is dissolved, then simmer 10 minutes. Stir in honey and return to a boil. Remove from heat and cool to room temperature. Pour through a sieve into a large measuring cup or bowl, pressing hard on, then discarding, solids. Chill, uncovered, until cold, about 1 hour.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Whisk together almonds, walnuts, sugar, cinnamon, nutmeg, cloves, and salt until combined well.",
        "Generously brush a 13- by 9- by 2-inch glass baking dish with melted butter. Halve phyllo sheets crosswise and stack sheets. Keep stack covered with 2 overlapping sheets of plastic wrap and then a dampened clean kitchen towel. Lay 2 sheets of phyllo in bottom of baking dish and brush top sheet generously with butter. Continue to layer 2 sheets at a time, staggering sheets in each double layer slightly to cover bottom of dish, then brushing every second sheet generously with butter, until you have used 10 sheets of phyllo total. After brushing top layer of phyllo with butter, spread a rounded 1 1/2 cups of nut mixture over it. Drizzle with 2 tablespoons butter.",
        "Repeat layering 3 more times. Top with 10 more sheets of phyllo. (You will use 50 sheets of phyllo total.) Butter top and let baklava stand at room temperature to harden slightly (to facilitate cutting), 10 to 15 minutes.",
        "Using a sharp knife, cut baklava into 16 equal rectangles, then cut each piece in half diagonally. (Be sure to cut all the way through.)",
        "Bake baklava until golden, 50 minutes to 1 hour. Transfer dish to a rack to cool, then slowly pour cold syrup around edges of hot baklava, in between all cuts, and over top. Let stand at room temperature at least 8 hours. (Cover once baklava is at room temperature.) Do not chill."
    ],
    "ingredients": [
        "2 cups sugar",
        "2/3 cup water",
        "1 lemon, halved",
        "1 orange, halved",
        "1 1/2 (3-inch) cinnamon sticks",
        "2/3 cup honey",
        "3 1/4 cups whole almonds with skins (1 lb), finely chopped",
        "2 1/3 cups walnuts (1/2 lb), finely chopped",
        "1 1/4 cups sugar",
        "1 tablespoon cinnamon",
        "2 teaspoons freshly grated nutmeg",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon salt",
        "3 sticks (1 1/2 cups) unsalted butter, melted and cooled slightly",
        "1 (1-lb) package phyllo dough (17 by 12 inches; about 28 sheets), thawed if frozen"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Ramadan",
        "Lemon",
        "Orange",
        "Almond",
        "Walnut",
        "Honey",
        "Cinnamon",
        "Clove",
        "Phyllo/Puff Pastry Dough",
        "Nutmeg",
        "Pastry",
        "Gourmet"
    ],
    "title": "Baklava",
    "url": "http://www.epicurious.com/recipes/food/views/baklava-109545"
}
