{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). In a saucepan over medium heat, combine 2 cups sugar, water, honey, cinnamon stick, lemon and vanilla. Bring to a boil, then simmer for 15 minutes, skimming any foam that is formed. Set side.",
        "In a small bowl, combine chopped almonds, 2 tablespoons sugar, ground cinnamon and cloves; set aside. Brush butter on bottom of a 9x13 inch pan. Each sheet of phyllo dough is twice as big as the pan, so cut each in half, making 2 sheets. Place a sheet of phyllo on bottom of pan, and brush with melted butter. Repeat process for a total of 8 sheets, buttering each. Sprinkle about 1/4 to 1/3 cup of nut mixture evenly over the phyllo, and cover with 4 more sheets, buttering each. Continue sprinkling nuts after every 4 sheets of phyllo, until all but 8 sheets (4 full sheets) are used.",
        "Use remaining 8 sheets for the top layer, buttering each sheet of phyllo. Before buttering the last sheet, tuck in any loose edges. Press down layers with palms of your hands. Pour remaining butter over the top. With a large knife, cut 5 strips lengthwise about 1/2 inch deep, then cut diagonally to form diamond shapes.",
        "Bake in preheated oven for 50 to 60 minutes, or until golden brown. Remove from oven, and immediately pour syrup over baklava. Allow to cool thoroughly. Cut diamonds to go all the way through, and serve."
    ],
    "ingredients": [
        "2 cups white sugar",
        "2 cups water",
        "1 cup honey",
        "1 cinnamon stick",
        "1/4 lemon",
        "1 teaspoon vanilla extract",
        "1 1/2 pounds chopped almonds",
        "2 tablespoons white sugar",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1 1/2 cups unsalted butter, melted",
        "1 (16 ounce) package frozen phyllo pastry, thawed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Baklava II",
    "url": "http://allrecipes.com/recipe/43383/baklava-ii/"
}
