{
    "directions": [
        "1. Place a layer of paper towels over a baking sheet. Arrange the eggplant in single layers and sprinkle with 1 teaspoon of salt. Let stand for 30 minutes. Pat dry.",
        "2. Preheat the oven to 450°F.",
        "3. Whisk together the olive oil, vinegar, remaining salt, and pepper, and set aside.",
        "4. Divide the eggplant, zucchini, red onions, peppers, and endive between 2 large baking pans with sides. Gently toss the vegetables with 3/4 of the blended oil and vinegar. Place 1 baking sheet on the bottom oven rack and the second on the middle rack. Roast the vegetables for 15 to 20 minutes, turning them once and rotating the pans between the shelves after 10 minutes. The vegetables should be crisp to the bite when they are done.",
        "5. Arrange the vegetables in colorful bunches on round or oval platters, mixing together the different types of vegetables. Sprinkle the vegetables with salt and pepper, and drizzle them with the remaining olive oil/balsamic vinegar dressing. Serve at room temperature."
    ],
    "ingredients": [
        "2 medium eggplants, unpeeled, cut crosswise into 1/4-inch thick rounds",
        "2 teaspoons of salt, divided in half",
        "1 cup extra-virgin olive oil",
        "1/3 cup balsamic vinegar",
        "1/2 teaspoon freshly ground black pepper",
        "1 1/2 pounds zucchini, washed, dried, and cut on the bias into 1/4-inch rounds",
        "3 large red onions, sliced into 1/4-inch rounds",
        "2 medium red bell peppers, cored, seeded, and cut into 3/4-inch squares",
        "2 medium yellow bell peppers, cored, seeded, and cut into 3/4-inch squares",
        "6 large heads of endive, cored, halved, and quartered lengthwise",
        "Garnish: 4 sprigs fresh basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Side",
        "Roast",
        "Vinegar",
        "Eggplant",
        "Bell Pepper",
        "Zucchini",
        "Fall",
        "Kosher",
        "Endive",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Balsamic Mixed Vegetable Roast",
    "url": "http://www.epicurious.com/recipes/food/views/balsamic-mixed-vegetable-roast-104866"
}
