{
    "directions": [
        "Bring 2 cups water, quinoa, and bouillon granules to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 15 to 20 minutes. Spread quinoa onto a baking sheet and refrigerate until cooled, about 30 minutes. Rinse saucepan.",
        "Place lima beans into the saucepan and add enough water to cover beans by 1 inch; season with salt and pepper. Cover saucepan with a lid and bring water to a boil. Reduce heat to medium and simmer until beans are cooked through but still tender, 3 to 4 minutes. Drain water and rinse beans under cold water to stop the cooking process; refrigerate until cool, about 10 minutes.",
        "Cook and stir almonds in a skillet over medium heat until toasted, about 5 minutes. Remove skillet from heat and cool almonds to room temperature, about 5 minutes.",
        "Mix quinoa, lima beans, almonds, tomatoes, scallions, and mozzarella cheese together in a large bowl.",
        "Whisk vinegar, almond oil, olive oil, Italian seasoning, basil, garlic, and salt together in a bowl until smooth; pour over quinoa mixture and stir to coat."
    ],
    "ingredients": [
        "Salad:",
        "2 cups water",
        "1 cup quinoa",
        "1 teaspoon chicken bouillon granules",
        "1/2 cup frozen baby lima beans",
        "water to cover",
        "salt and freshly ground black pepper to taste",
        "1/3 cup slivered almonds",
        "3 Campari tomatoes, diced",
        "2 tablespoons thinly sliced scallions",
        "2 ounces fresh mozzarella cheese, cut into small chunks",
        "Dressing:",
        "3 tablespoons balsamic vinegar",
        "3 tablespoons almond oil",
        "2 tablespoons extra-virgin olive oil",
        "2 teaspoons Italian seasoning",
        "2 teaspoons dried basil",
        "1 teaspoon minced garlic",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Balsamic and Herb Quinoa Salad",
    "url": "http://allrecipes.com/recipe/238336/balsamic-and-herb-quinoa-salad/"
}
