{
    "directions": [
        "Pour a few tablespoons water into heavy large nonstick skillet. Place over medium-high heat. Add 1 bag spinach (skillet will be full). Using 2 wooden spoons, turn and toss spinach until most of leaves are wilted, about 2 minutes. Add remaining spinach leaves in 2 batches. Turn and toss spinach until just wilted but still bright green. Transfer cooked spinach to strainer set over bowl.",
        "Wipe skillet dry if necessary. Add 1 tablespoon oil and heat over medium-high heat. Sprinkle salmon with salt and pepper. Place in skillet, skin side up. Sear until brown, about 3 minutes; turn fish. Cook until just opaque in center, 3 to 4 minutes. Transfer to plate; wipe skillet clean.",
        "Add 1 tablespoon olive oil to same skillet. Add chopped shallot, halved olives, and golden raisins. Stir 1 minute. Add spinach; toss until heated through, about 1 minute. Season to taste with salt and pepper. Mound spinach mixture on plates. Top with salmon.",
        "Add balsamic vinegar and honey to skillet. Boil until reduced to glaze, about 30 seconds. Spoon glaze over salmon and spinach and serve."
    ],
    "ingredients": [
        "2 9-ounce bags spinach leaves",
        "2 tablespoons olive oil, divided",
        "2 5-ounce salmon fillets with skin",
        "1/3 cup chopped shallot (1 very large)",
        "1/3 cup halved pitted Kalamata olives",
        "1/3 cup golden raisins",
        "3 tablespoons balsamic vinegar",
        "1 tablespoon honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Fruit",
        "Leafy Green",
        "Olive",
        "Vegetable",
        "Sauté",
        "Valentine's Day",
        "High Fiber",
        "Dinner",
        "Dried Fruit",
        "Raisin",
        "Seafood",
        "Salmon",
        "Spinach",
        "Winter",
        "Healthy",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Balsamic-Glazed Salmon with Spinach, Olives, and Golden Raisins",
    "url": "http://www.epicurious.com/recipes/food/views/balsamic-glazed-salmon-with-spinach-olives-and-golden-raisins-357270"
}
