{
    "directions": [
        "Mince garlic cloves in food processor or blender. Add 1/3 of the basil leaves to the processor, and chop until fine.  Pour in 1/2 cup of olive oil, and continue to process until mixture turns light yellow with flecks of basil. Add the balsamic vinegar; process just until combined.",
        "Place the chicken breasts in a large zip-top storage bag along with 1 tablespoon salt, 1 1/2 teaspoons pepper, and the contents of the food processor. Squeeze air out of bag and seal. Allow chicken to marinate for 2 hours, or up to overnight, turning occasionally.",
        "Preheat the oven to 300 degrees F (150 degrees C).",
        "Brown chicken in a large skillet over large heat, about 4 to 5 minutes per side. Transfer chicken to a large baking dish, and place in the oven until cooked through, about 15 to 20 minutes. Remove chicken from oven, slice into 1/4 inch strips, and return to baking dish to absorb cooking juices. Keep warm.",
        "While chicken is baking, bring a large pot of water to a boil over high heat. Boil the pasta until cooked through, but still firm to the bite, about 11 minutes. Drain well. Stir the chicken and the juices from the baking dish into the hot pasta.",
        "Thinly slice the remaining basil leaves, and place in a large serving bowl along with the tomatoes. Stir in 1/4 cup olive oil, 1/4 cup balsamic vinegar, and salt and pepper to taste. Top basil and tomatoes with the hot pasta, sauce, and chicken; toss to combine."
    ],
    "ingredients": [
        "3 cloves garlic, minced",
        "2 ounces fresh basil leaves",
        "1/2 cup olive oil",
        "1/2 cup balsamic vinegar",
        "6 skinless, boneless chicken breast halves",
        "1 tablespoon salt",
        "1 1/2 teaspoons ground black pepper",
        "1 pound penne pasta",
        "2 pints grape tomatoes, halved",
        "1/4 cup olive oil",
        "1/4 cup balsamic vinegar",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Balsamic Chicken and Pasta",
    "url": "http://allrecipes.com/recipe/102020/balsamic-chicken-and-pasta/"
}
