{
    "directions": [
        "Brown the meat",
        "In a resealable plastic bag, combine the flour, the 1/2 tsp. salt and the 1/2 tsp. pepper. Add the beef, seal the bag and shake to coat the beef with the seasoned flour.",
        "In a heavy pot or Dutch oven over medium-high heat, warm the oil. Working in batches if needed to avoid crowding, remove the beef from the bag, shake off the excess flour and add the meat to the pot in a single layer. Cook, turning as needed, until browned on all sides, 6 to 8 minutes total. Using a slotted spoon, transfer the meat to a plate.",
        "Add the onion to the drippings in the pan and sauté over medium heat until golden, about 5 minutes. Stir in the bay leaves, wine and broth.",
        "Braise the meat and vegetables",
        "Return the meat and any juices from the plate to the pot. Bring to a simmer, then reduce the heat to low. Cover and braise until the meat is nearly fork-tender, 1 1/2 to 2 hours. Add the potatoes and carrots, re-cover and continue to braise until the vegetables are tender, about 30 minutes more.",
        "Finish the dish",
        "Season the stew with salt and pepper. Remove the bay leaves and discard. Stir in the vinegar, divide among individual shallow bowls and serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Simple Suppers,",
        "by Melanie Barnard (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "3 Tbs. all-purpose flour",
        "1/2 tsp. salt, plus more, to taste",
        "1/2 tsp. freshly ground pepper, plus more, to  taste",
        "2 lb. boneless beef chuck, trimmed of excess fat  and cut into 1 1/2-inch pieces",
        "3 Tbs. canola oil",
        "1 large red onion, sliced",
        "2 bay leaves",
        "1 cup full-bodied red wine",
        "2 cups beef broth",
        "1 lb. red or Yukon Gold potatoes, cut into 1 1/2-\n  inch chunks",
        "3 large carrots, peeled and cut into 1-inch  chunks",
        "2 Tbs. balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Balsamic Beef Stew",
    "url": "http://www.williams-sonoma.com/recipe/balsamic-beef-stew.html"
}
