{
    "directions": [
        "Whisk together milk, flour, egg, sugar, cinnamon, salt, and 2 teaspoons butter until smooth. Chill batter, covered, 30 minutes.",
        "Lightly brush a 10-inch nonstick skillet with butter, then heat over moderately high heat until hot but not smoking. Holding skillet off heat, pour in half of batter (1/4 cup), immediately tilting and rotating skillet to coat bottom. (If batter sets before skillet is coated, reduce heat slightly for next crêpe.) Return skillet to heat and cook crêpe until just set and golden around edges, 10 to 15 seconds. Loosen edge of crêpe with a heatproof plastic spatula, then flip crêpe over carefully with your fingertips. Cook until underside is set, about 20 seconds more. Transfer crêpe to a plate. Brush skillet with more butter and make another crêpe in same manner. Reserve skillet.",
        "Cut peel, including all white pith, from orange with a sharp paring knife. Working over a bowl, cut segments free from membranes, letting segments fall into bowl, then squeeze 2 tablespoons juice from membranes into bowl (discard membranes).",
        "Peel banana and halve lengthwise, then cut crosswise into 1/2-inch pieces.",
        "Melt butter in reserved skillet over moderate heat until foam subsides. Add sugar, then pour juice from bowl into sugar mixture and cook, swirling skillet, until sugar is dissolved. Add 1 crêpe to sauce and cook until crêpe is coated and heated through, about 15 seconds. Fold crêpe into quarters using tongs, then transfer to a heated dessert plate. Repeat with second crêpe.",
        "Add orange segments and banana to skillet and cook, shaking skillet occasionally, until fruit is heated through, about 2 minutes. Add Grand Marnier or Cognac (if using) and cook, stirring, 1 minute. Spoon fruit over crêpes and sprinkle with pecans."
    ],
    "ingredients": [
        "1/3 cup whole milk",
        "3 tablespoons all-purpose flour",
        "1 large egg",
        "2 teaspoons sugar",
        "1/8 teaspoon cinnamon",
        "1/8 teaspoon salt",
        "2 teaspoons unsalted butter, melted and cooled slightly, plus additional for cooking crêpes",
        "1 navel orange",
        "1 firm-ripe finger banana or 1 (4-inch) piece firm-ripe regular banana",
        "1 tablespoon unsalted butter",
        "2 tablespoons sugar",
        "1 teaspoon Grand Marnier or other orange-flavored liqueur or Cognac (optional)",
        "2 tablespoons chopped pecans, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Quick & Easy",
        "Orange",
        "Banana",
        "Pecan",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banana Orange Crepes",
    "url": "http://www.epicurious.com/recipes/food/views/banana-orange-crepes-109044"
}
