{
    "directions": [
        "In a bowl whisk together sugar and cornstarch and whisk in eggs and a pinch of salt until combined well. In a heavy saucepan heat milk and cream just to a boil. Add milk mixture to egg mixture in a slow stream, whisking, and transfer to pan. Bring custard to a boil over moderate heat, whisking constantly, and boil, whisking, 1 minute. Stir in chopped ginger and cool custard completely, stirring occasionally to prevent a skin from forming. Custard may be made 3 days ahead and chilled, covered.",
        "Peel 1 banana and cut into 1/8-inch slices. Lightly brush slices with lemon juice to prevent discoloration. Into a 1-cup stemmed glass, spoon 1/4 cup custard and sprinkle evenly with about 2 1/2 tablespoons cookies crumbs. Drizzle 1 1/2 teaspoons liqueur over crumbs. Arrange some banana slices decoratively around inside of glass, pressing lightly to make adhere, and layer remaining banana slices on crumbs. Sprinkle about 2 1/2 tablespoons cookie crumbs evenly over bananas and drizzle with 1 1/2 teaspoons liqueur. Top crumbs with about 1/4 cup custard and some ginger pieces. Make 3 more trifles in the same manner with remaining bananas, lemon juice, custard, cookie crumbs, liqueur, and ginger pieces. Chill trifles, covered loosely with plastic wrap, at least 3 hours and up to 1 day."
    ],
    "ingredients": [
        "1/2 cup sugar",
        "2 1/2 teaspoon cornstarch",
        "2 large eggs",
        "1 1/4 cups milk",
        "1/2 cup heavy cream",
        "3 tablespoons crystallized ginger, chopped fine",
        "4 firm-ripe bananas",
        "juice of 1/2 lemon",
        "20 chocolate wafer cookies, crumbled coarse (about 1/3 cups)",
        "1/4 cup banana liqueur",
        "Garnish: crystallized ginger pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Ginger",
        "Dessert",
        "Banana",
        "Spring",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banana Ginger Trifles",
    "url": "http://www.epicurious.com/recipes/food/views/banana-ginger-trifles-12204"
}
