{
    "directions": [
        "In a bowl, sift together the flour, light brown sugar, cinnamon, and salt. Cut in the butter until the mixture resembles coarse crumbs. Sprinkle with the ice water, and toss the mixture with a fork until evenly moistened. Pat into a round, and wrap in plastic. Refrigerate for 30 minutes.",
        "In the top half of a double boiler, heat the milk until it begins to bubble. In a bowl, beat together the egg whites, sugar, and 1 tablespoon of the hot milk. Whisk the egg white mixture into the remaining hot milk . Cook and stir without boiling about 10 minutes, until the mixture is thick enough to coat the back of a metal spoon. Remove from heat, and stir in the vanilla. Cool to room temperature.",
        "Preheat oven to 375  degrees F (190 degrees C). Lightly grease an 8 inch tart pan with a removable bottom.",
        "On a floured surface, roll the tart dough out to 1/4 inch thickness. Press the chilled dough into the prepared tart pan. Trim the edges, and pierce the bottom with a fork. Bake 15 to 18 minutes in the preheated oven, until golden brown. Remove to a wire rack, and cool completely.",
        "Spoon the filling mixture into the crust. Bake 18 to 20 minutes in the preheated oven. Cool to room temperature on a wire rack. Refrigerate 8 hours. Arrange banana, kiwi, and strawberry slices over the filling just before serving."
    ],
    "ingredients": [
        "1/2 cup all-purpose flour",
        "1 tablespoon light brown sugar",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon salt",
        "2 tablespoons unsalted butter",
        "1 1/2 tablespoons ice water",
        "1 cup skim milk",
        "3 egg whites",
        "2 tablespoons white sugar",
        "1/4 teaspoon vanilla extract",
        "1 bananas, peeled and sliced",
        "1 kiwi, peeled and sliced",
        "1 cup sliced fresh strawberries"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Banana Kiwi Strawberry Tart",
    "url": "http://allrecipes.com/recipe/35986/banana-kiwi-strawberry-tart/"
}
