{
    "directions": [
        "Preheat oven to 350°F. Butter and flour two 9-inch-diameter cake pans with 1 1/2-inch-high sides. Sift flour, baking powder, and sea salt into medium bowl. Beat butter and 1 cup sugar in large bowl until well blended. Add 2 eggs; beat until blended. Add dry ingredients to butter mixture in 4 additions alternately with buttermilk in 3 additions. Beat remaining 4 eggs and remaining 1 1/2 cups sugar in medium bowl until mixture is thick and pale in color, about 4 minutes. Fold egg mixture into batter. Fold in bananas. Divide batter between prepared pans (about 3 1/2 cups for each).",
        "Bake cakes until tester inserted into center comes out clean, about 35 minutes. Transfer to rack; cool 15 minutes. Invert cakes onto racks; cool completely. (Can be made 1 day ahead. Wrap in foil; store at room temperature.)",
        "Combine brown sugar, banana, and 3 tablespoons butter in processor; blend until smooth. Add 1 1/2 cups whipping cream; blend. Transfer to heavy medium saucepan. Whisk over medium heat until sugar dissolves and mixture boils. Attach candy thermometer to inside of pan; cook without stirring or swirling pan until temperature registers 218°F, about 10 minutes. Pour caramel into bowl. Cool to room temperature, whisking occasionally.",
        "Whisk remaining 2 1/4 cups whipping cream in large bowl until cream mounds softly. Gradually fold in cool caramel mixture. Chill until cream is firm enough to spread, about 3 hours.",
        "Cut each cake horizontally into 2 layers. Place 1 layer, cut side up, on platter. Drizzle 1 1/2 teaspoons lime juice and 1 1/2 teaspoons rum over. Spread 1 1/4 cups banana cream over. Top with second cake layer. Drizzle 1 1/2 teaspoons lime juice and 1 1/2 teaspoons rum over. Spread 1 1/2 cups cream over. Repeat with third cake layer, lime juice, rum, and cream. Top with fourth cake layer, cut side down; spread remaining cream over top.",
        "Scatter roasted pecans over top of cake. (Can be made 1 day ahead. Cover with cake dome and refrigerate.)"
    ],
    "ingredients": [
        "2 1/2 cups all purpose flour",
        "1 tablespoon baking powder",
        "1/2 teaspoon (generous) fine sea salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "2 1/2 cups sugar, divided",
        "6 large eggs",
        "1 cup plus 2 tablespoons buttermilk",
        "2 small ripe bananas, peeled, cut into 1/4-inch cubes (about 1 1/2 cups)",
        "1 1/2 cups (packed) golden brown sugar",
        "1 small ripe banana, peeled, cut into 1-inch pieces",
        "3 tablespoons unsalted butter, room temperature",
        "3 3/4 cups chilled heavy whipping cream, divided",
        "4 1/2 teaspoons fresh lime juice, divided",
        "4 1/2 teaspoons dark rum, divided",
        "Sea Salt-Roasted Pecans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Rum",
        "Blender",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Lime",
        "Banana",
        "Pecan",
        "Fall",
        "Spring",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banana Layer Cake with Caramel Cream and Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/banana-layer-cake-with-caramel-cream-and-pecans-233719"
}
