{
    "directions": [
        "Preheat oven to 350°F. Coat cake pans with nonstick spray. Line bottom of pans with parchment; coat paper. Whisk flour, baking soda, and salt in a medium bowl. Using an electric mixer, beat sugar, butter, and brown sugar in a large bowl until light and fluffy, about 3 minutes. Add eggs one at a time, beating to blend between additions and occasionally scraping down sides and bottom of bowl. Beat in vanilla.",
        "Add dry ingredients; beat on low speed just to blend. Add bananas and sour cream; beat just to blend. Fold in mini chips. Divide batter evenly among pans; smooth tops.",
        "Bake cakes until a tester inserted into the center comes out clean, about 35 minutes. Transfer to wire racks; let cool in pans for 10 minutes. Invert cakes onto racks; peel off parchment and let cool completely.",
        "Using an electric mixer, beat first 4 ingredients in a medium bowl until a light and fluffy frosting forms, 2-3 minutes.",
        "Place 1 cake on a platter. Spread 1 1/4 cups frosting over. Place remaining cake on top. Cover top and sides of cake with remaining frosting. Garnish with chocolate chips and kisses. DO AHEAD: Cake can be made 2 days ahead. Cover and chill. Let stand at room temperature for 1 hour before serving."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "3 cups all-purpose flour",
        "2 teaspoons baking soda",
        "2 teaspoons kosher salt",
        "1 1/2 cups sugar",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1/2 cup (packed) light brown sugar",
        "3 large eggs",
        "1 1/2 teaspoons vanilla extract",
        "2 cups mashed very ripe bananas",
        "1 cup sour cream",
        "1 10-ounce bag mini chocolate chips",
        "2 cups creamy peanut butter",
        "1 1/2 cups powdered sugar",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "2 1/2 teaspoons vanilla extract",
        "Chocolate chips, mini chocolate chips, and chocolate kisses",
        "Two 8x8x2\" cake pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Tropical Fruit",
        "Banana",
        "Party",
        "Peanut Butter",
        "Birthday",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banana-Chocolate Chip Cake With Peanut Butter Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/banana-chocolate-chip-cake-with-peanut-butter-frosting-51117350"
}
