{
    "directions": [
        "Preheat oven to 350 degrees F and lightly grease a 9 by 5-inch loaf pan.",
        "In a large bowl, combine the flour, baking soda, and salt; set aside.",
        "Mash 2 of the bananas with a fork in a small bowl so they still have a bit of texture. With an electric mixer fitted with a wire whisk, whip the remaining bananas and sugar together for a good 3 minutes; you want a light and fluffy banana cream. Add the melted butter, eggs, and vanilla; beat well and scrape down the sides of the bowl. Mix in the dry ingredients just until incorporated; no need to overly blend. Fold in the nuts and the mashed bananas with a rubber spatula. Pour the batter into the prepared loaf pan. Give the pan a good rap on the counter to get any air bubbles out.",
        "Bake for about 1 hour and 15 minutes, until golden brown and a toothpick inserted into the center of the loaf comes out clean. Don't get nervous if the banana bread develops a crack down the center of the loaf; that's no mistake, it's typical. Rotate the pan periodically to ensure even browning.",
        "Cool the bread in the pan for 10 minutes or so, and then turn out onto a wire rack to cool completely before slicing. Toast the slices of banana bread, dust with confectioners' sugar, and serve."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking soda",
        "1/2 teaspoon salt",
        "4 overripe bananas",
        "1 cup sugar",
        "3/4 cup (1 1/2 sticks) unsalted butter, melted and cooled",
        "2 large eggs",
        "1 teaspoon pure vanilla extract",
        "1/2 cup pecans, finely chopped",
        "Confectioners' sugar, for dusting"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "American",
        "Banana Bread",
        "Banana",
        "Fruit",
        "Nut Recipes",
        "Brunch"
    ],
    "title": "Banana Bread with Pecans",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/banana-bread-with-pecans-recipe"
}
