{
    "directions": [
        "Stir sugar and 1/2 cup water in heavy medium saucepan over medium-low heat until sugar dissolves. Increase heat and boil until syrup turns deep amber, brushing down sides of pan with wet pastry brush and swirling pan occasionally, about 12 minutes. Reduce heat to low. Add cream (mixture will bubble vigorously) and stir until caramel bits dissolve. Remove from heat. Mix in rum. (Can be made 1 day ahead. Chill. Before serving, rewarm over low heat, stirring occasionally.)",
        "Arrange 4 spring roll wrappers on work surface (keep remainder covered). Place 1 banana piece diagonally across 1 corner of each wrapper. Brush opposite corner with water. Drizzle each banana with 1 teaspoon caramel sauce, 1 teaspoon toffee bits and 1 teaspoon walnuts. Fold in wrapper corner closest to banana. Roll wrapper over banana once, then fold in sides and roll up as for egg roll, pressing ends to seal. Repeat filling and rolling remaining wrappers. (Can be made 2 hours ahead. Cover and chill.)",
        "Pour enough oil into heavy large saucepan to reach depth of 3 inches. Heat oil to 375°F. Working in batches, fry rolls in oil until deep golden brown, turning frequently, about 3 minutes per batch. Using slotted spoon, transfer rolls to paper towels and drain. Arrange 2 rolls on each plate. Sift powdered sugar over. Sprinkle with five-spice powder. Drizzle caramel sauce around rolls and serve."
    ],
    "ingredients": [
        "1 cup sugar",
        "1/2 cup water",
        "3/4 cup whipping cream",
        "1 1/2 tablespoons dark rum",
        "12 spring roll wrappers",
        "3 small bananas, peeled, quartered lengthwise, trimmed to 4 inches",
        "1/4 cup toffee bits (such as Skor)",
        "1/4 cup finely chopped toasted walnuts",
        "Vegetable oil (for deep-frying)",
        "Powdered sugar",
        "Chinese five-spice powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Dairy",
        "Fruit",
        "Dessert",
        "Fry",
        "Banana",
        "Walnut",
        "Fall"
    ],
    "title": "Banana-Walnut Spring Rolls with Caramel-Rum Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/banana-walnut-spring-rolls-with-caramel-rum-sauce-4275"
}
