{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch cake pan and line the bottom with a circle of waxed paper.",
        "Mix graham cracker crumbs, melted butter, 3/4 teaspoon banana extract, and 3 tablespoons sugar in a bowl until mixture holds together; transfer into bottom of prepared cake pan. Use a second 8-inch cake pan to press the crust firmly.",
        "Bake in the preheated oven until crust is lightly browned, about 8 minutes. Set aside to cool.",
        "Pour water to a depth of about 1 inch into the bottom of a double boiler and bring to a boil. Place peanut butter chips and half-and-half into the top of the boiler and set over the bottom of the boiler (boiling water shouldn't touch top boiler). Stir until the chips have melted and the mixture is smooth; set aside to cool.",
        "Place cream cheese into the mixing bowl of a stand mixer and slowly mix, using paddle attachment, until cream cheese is smooth. Increase speed to medium and beat in 1/2 cup sugar. Beat eggs into mixture, 1 at a time, blending the next egg in after the previous one is fully incorporated. Beat in bananas, vanilla extract, 1/2 teaspoon banana extract, and lemon juice, stopping occasionally to scrape the sides of the bowl. Finally, beat in peanut butter chip mixture until cheesecake batter is smooth and even. Pour filling into the graham cracker crust.",
        "Set the cheesecake on a large baking pan. Pour enough water into the baking pan to reach most of the way up the sides of the cheesecake pan, creating a water bath. Bake cheesecake in the preheated oven until filling is set, about 1 hour. Turn off oven, open door, and let cheesecake cool slowly in the oven for 1 hour.",
        "Run a knife around the inside of the cheesecake pan and flip the pan over onto a cooling rack. Place a dish towel on the bottom of the pan. Use a hot water-filled tea kettle to rub the dish towel, gently heating the bottom of the cheesecake; slowly remove pan. Place a serving platter on top and use the wire rack to flip the cake back over onto platter. Refrigerate cheesecake for 8 hours."
    ],
    "ingredients": [
        "1 cup graham cracker crumbs",
        "3 tablespoons butter, melted",
        "3/4 teaspoon banana extract",
        "3 tablespoons white sugar",
        "1 cup peanut butter chips",
        "1/4 cup half-and-half",
        "3 (8 ounce) packages cream cheese at room temperature",
        "1/2 cup white sugar",
        "3 eggs at room temperature",
        "2 large ripe bananas, mashed",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon banana extract",
        "1 tablespoon lemon juice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Banana Peanut Butter Cheesecake aka \"The Elvis\"",
    "url": "http://allrecipes.com/recipe/228315/banana-peanut-butter-cheesecake-aka/"
}
