{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Grease two 7x3-inch loaf pans.",
        "In a bowl, whisk together 2 3/4 cups of flour, 2 teaspoons of cinnamon, the baking soda, and salt until thoroughly combined. In a separate mixing bowl, beat the melted butter with 2 cups of sugar until smooth, and mix in the eggs, one at a time, followed by the Greek yogurt and vanilla extract. Stir in the flour mixture just until incorporated.",
        "Fold in the bananas, apples, and chopped walnuts until combined; do not overmix. There should be small chunks of banana visible in the batter. Pour half the batter into each prepared loaf pan.",
        "Mix the brown sugar, 1/2 cup of white sugar, 1 tablespoon of cinnamon, 1/4 cup of flour, and 3 tablespoons of softened butter together in a bowl until the mixture resembles coarse crumbs. Sprinkle half the crumb topping over each loaf. Garnish each loaf with banana and apple slices.",
        "Bake in the preheated oven for 30 minutes, then remove and cover each pan with aluminum foil. Return to oven, and bake an additional 15 or 20 minutes, or until a toothpick inserted into the center of the loaves comes out clean. Allow to cool before serving."
    ],
    "ingredients": [
        "2 3/4 cups all-purpose flour",
        "2 teaspoons ground cinnamon",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup butter, melted",
        "2 cups white sugar",
        "4 eggs",
        "1 cup plain Greek yogurt",
        "1 1/2 teaspoons vanilla extract",
        "3 large very ripe bananas, mashed",
        "2 apples, cubed",
        "3/4 cup chopped walnuts (optional)",
        "1/2 cup packed brown sugar",
        "1/2 cup white sugar",
        "1 tablespoon ground cinnamon",
        "1/4 cup all-purpose flour",
        "3 tablespoons butter, softened",
        "banana slices for garnish",
        "apple slices for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Banana Apple Bread",
    "url": "http://allrecipes.com/recipe/218978/banana-apple-bread/"
}
