{
    "directions": [
        "For the banana bread: Put a rack in the lower third of the oven and preheat to 350 degrees F. Spray a 9-inch loaf pan with nonstick cooking spray.",
        "Put the butter in a small saucepan over medium heat and cook until the butter turns a deep golden brown. Remove and let cool slightly.",
        "Sift the flour, baking soda, salt and cinnamon into a small bowl. Mash the bananas in a medium bowl, and then whisk in the granulated and brown sugars, egg and cooled brown butter. Add the flour mixture and whisk until just combined; don't over-mix.",
        "Scrape the batter into the prepared pan and bake on the lower rack of the oven until a toothpick inserted into the center comes out clean, 45 to 55 minutes. Let cool on a baking rack in the pan for 15 minutes. Remove from the pan and let cool completely on the rack. Once completely cool, wrap and keep overnight.",
        "For the bananas Foster sauce: Melt the butter in a skillet over high heat. Stir in the muscovado sugar and cook, stirring, until melted. Stir in the rum and cook, stirring, until the rum is almost completely evaporated. Whisk in the cream and cook until just heated through. Add the bananas and cook for 1 minute longer. Keep warm while you make the waffles.",
        "For the waffles: Heat a waffle iron according to the manufacturer's instructions. Spray with nonstick spray. Slice the banana bread about 1 inch thick, lay the slices on the waffles grates (you may be able to fit just 3 in comfortably), close the cover and cook, pressing if necessary to squeeze the bread, until golden brown and slightly crisped, 40 seconds to 1 minute. Repeat with the remaining banana bread slices. Serve with some of the bananas Foster sauce spooned over the top."
    ],
    "ingredients": [
        "Nonstick cooking spray, for the pan and waffle iron",
        "5 tablespoons unsalted butter",
        "1 1/4 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/4 teaspoon kosher salt",
        "1/8 teaspoon ground cinnamon",
        "3 overripe bananas",
        "1/4 cup granulated sugar",
        "1/4 cup light brown sugar",
        "1 large egg, beaten",
        "Bananas Foster Sauce:",
        "1 stick (8 tablespoons) unsalted butter, cut into pieces",
        "3/4 cup light brown muscovado sugar",
        "1/4 cup dark rum",
        "1/4 cup heavy cream",
        "2 large ripe bananas, peeled and sliced into 1/2-inch pieces on the bias"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Waffle Recipes",
        "Bananas Foster",
        "Banana Bread",
        "Banana",
        "Fruit",
        "Main Dish Recipes",
        "Brunch"
    ],
    "title": "Banana Bread Waffles with Bananas Foster Sauce",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/banana-bread-waffles-with-bananas-foster-sauce"
}
