{
    "directions": [
        "Preheat the oven to 375 degrees F. Combine the graham-cracker crumbs with the butter and brown sugar in a medium bowl, and stir well. Transfer the mixture to a 10 inch pie plate, and pat it evenly along the bottom and sides.",
        "Bake the crust for 7 to 9 minutes, or until edges darken slightly. Let the crust cool.",
        "Melt the chocolate with the 2 tablespoons cream over simmering water in the top of a double broiler or in a heat proof bowl set on top of a saucepan. Whisk the chocolate and cream until they form a smooth liquid. Take the pan off the heat, and spoon the chocolate mixture onto the graham-cracker crust. Let the chocolate cool for at least 15 minutes.",
        "Meanwhile, make the filling. Heat the milk in a heavy bottomed saucepan. When the milk is just about to boil, take the pan off of the heat.",
        "In a medium bowl, whisk together the sugar, eggs, and flour. Slowly add the hot milk to the bowl, whisking constantly. Then transfer the mixture to the saucepan.",
        "Whisking constantly, bring the mixture to a boil over medium heat, and continue whisking while it boils for 3 minutes. Take the pan off the heat, and add the 2 tablespoons whiskey. Let the filling cool for 20 minutes.",
        "Slice the bananas, and toss them with the lemon juice. Lay the banana slices on the chocolate lined crust. Pour the filling over and chill the pie for at least 2 hours.",
        "Whip one cup cream to stiff peaks, add 2 tablespoons whiskey and serve with pie."
    ],
    "ingredients": [
        "1 1/2 cups graham cracker crumbs",
        "1/4 cup butter, melted",
        "2 tablespoons brown sugar",
        "2 (1 ounce) squares bittersweet chocolate",
        "2 tablespoons heavy whipping cream",
        "3 cups low-fat milk",
        "3/4 cup white sugar",
        "2 eggs",
        "1/2 cup all-purpose flour",
        "2 tablespoons Irish whiskey",
        "4 bananas",
        "2 tablespoons lemon juice",
        "1 cup heavy whipping cream",
        "2 tablespoons Irish whiskey"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Banana Cream Pie with Chocolate Lining",
    "url": "http://allrecipes.com/recipe/12626/banana-cream-pie-with-chocolate-linin/"
}
