{
    "directions": [
        "Pulse cookies in a food processor until coarsely ground. Transfer to a large bowl and add coconut oil and salt. Mix with your hands until crumbs are coated in oil and mixture resembles wet sand.",
        "Press 2 cups cookie crumbs into the bottom of springform pan and freeze until ready to use. Spread out remaining crumbs on a parchment-lined rimmed baking sheet in an even layer (do not press). Freeze crumbs on baking sheet 30 minutes, then crumble into very small pieces with your hands. Freeze until ready to use.",
        "Bring sugar and 1/4 cup water to a boil in a medium saucepan over medium-high heat, stirring to dissolve sugar. Cook, swirling pan occasionally, until caramel is a deep amber color, 8–10 minutes. Reduce heat to low and add bananas a few pieces at a time, stirring between additions. Add cream and salt and cook, stirring often, until bananas are almost entirely broken down (only a few chunks should remain), about 5 minutes. Transfer to a medium bowl and let cool.",
        "Mix 2 1/2 pints ice cream in a large bowl with a wooden spoon until it resembles thick cake batter (it should be soft but not melted). Fold in 1 1/2 cups cookie crumble with a rubber spatula and scrape into pan with cookie crust; smooth top. Sprinkle 1 cup cookie crumble over ice cream, pressing lightly to adhere. Working quickly, scrape caramel-banana jam over cookie crumble and spread evenly. Top caramel with 1 cup cookie crumble. Freeze 20 minutes.",
        "Mix remaining 2 1/2 pints ice cream in the same bowl to cake-batter consistency. Fold in 1 3/4 cups cherries. Scrape into pan over cookie crumble and smooth top (it may come up over the edge of the pan). Top with remaining cookie crumble. Freeze cake until frozen, about 3 hours (or overnight).",
        "Sprinkle gelatin over 1/2 cup water in a small saucepan. Let sit 5 minutes to soften. Add sugar and bring to a bare simmer, stirring to dissolve gelatin and sugar. Let cool slightly, then transfer to a large bowl and whisk in cream. Beat to medium peaks.",
        "Unmold cake (run a knife around the edge to help release, if needed) and transfer to a platter. Spread threequarters of whipped cream over sides and top of cake. Use remaining whipped cream to create dramatic height, swirling decoratively. Top with nuts and cherries with stems. Freeze cake at least 2 hours before serving. Slice with a warm knife.",
        "Cake can be frosted 1 day ahead; freeze uncovered."
    ],
    "ingredients": [
        "2 (9-ounce) packages chocolate wafer cookies",
        "1 cup virgin coconut oil, melted",
        "1/4 teaspoon kosher salt",
        "3/4 cup sugar",
        "4 large ripe bananas (about 1 1/2 pounds), cut into 2\" pieces",
        "1/4 cup heavy cream",
        "1/4 teaspoon kosher salt",
        "5 pints vanilla ice cream, softened at room temperature 10 minutes, divided",
        "1 3/4 cups maraschino cherries (from two 10-ounce jars), drained, patted dry, stems removed, plus more with stems for serving",
        "2 1/4 teaspoons powdered unflavored gelatin (from one 1/4-ounce envelope)",
        "1/2 cup sugar",
        "3 cups heavy cream",
        "1/3 cup salted, roasted peanuts, coarsely chopped",
        "A 9\" springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Kid-Friendly",
        "Frozen Dessert",
        "Banana",
        "Summer",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Banana Split Ice Cream Cake",
    "url": "http://www.epicurious.com/recipes/food/views/banana-split-ice-cream-cake-56389894"
}
