{
    "directions": [
        "Preheat oven to 350°F. Lightly butter 2 (8-inch) round cake pans and dust with flour, knocking out excess.",
        "Sift together flour, baking soda, baking powder, and salt.",
        "Beat together butter and sugar in mixer at high speed until lightened, about 5 minutes. Add yolks 1 at a time, beating well after each addition, then beat in vanilla. Add half of flour mixture and mix at low speed until just blended. Add buttermilk, mixing until just combined, then add remaining flour mixture, mixing at low speed until smooth. Transfer batter to a large shallow bowl. Clean mixing bowl and beaters.",
        "Beat whites with a pinch of salt in mixer until they just hold stiff peaks, then fold into batter gently but thoroughly.",
        "Divide batter between pans, smoothing tops. Bake in middle of oven until cake is springy to the touch and a tester comes out clean, 15 to 20 minutes. (Layers will be about 3/4 to 1 inch high.) Cool in pans on racks 5 minutes. Run a sharp thin knife around edges, then invert onto racks and cool completely.",
        "Whisk together yolks, sugar, cornstarch, salt, and 2 tablespoons milk in a bowl. Bring remaining milk to a boil in a 2-quart heavy saucepan and add to yolk mixture in a slow stream, whisking constantly. Pour custard into saucepan and bring to a boil over moderately low heat, whisking constantly, then boil, whisking constantly, 2 minutes. Remove from heat and whisk in butter and vanilla. Transfer custard to a bowl and chill, its surface covered with wax paper, until cold, about 2 hours.",
        "Stir together evaporated milk, sugar, and corn syrup in a small heavy saucepan and simmer, stirring constantly, until caramel-colored and slightly thickened, about 6 minutes (be careful not to burn). Remove from heat and add chopped chocolate, whisking until smooth. Stir together cocoa, hot water, and vanilla in a small bowl, then stir into glaze. Chill, covered, until cool, about 15 minutes.",
        "Place 1 cake layer, upside down, on a platter. Whisk custard until smooth and spread 2/3 cup on top. Cut banana into 1/4-inch-thick slices and arrange evenly over custard, then spread remaining custard over banana. Top with remaining cake layer, upside down. Pour chocolate glaze over top (some may drip onto plate)."
    ],
    "ingredients": [
        "1 1/4 cups cake flour (not self-rising)",
        "1 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "2 tablespoons unsalted butter, softened",
        "1/2 cup sugar",
        "2 large eggs, separated",
        "1 teaspoon vanilla",
        "3/4 cup well-shaken low-fat buttermilk",
        "2 large egg yolks",
        "3 tablespoons sugar",
        "2 tablespoons cornstarch",
        "1/8 teaspoon salt",
        "1 cup fat-free (skim) milk",
        "1 teaspoon unsalted butter",
        "1/2 teaspoon vanilla",
        "1 firm-ripe banana",
        "1/2 cup evaporated skim milk",
        "1/4 cup sugar",
        "1 tablespoon light corn syrup",
        "1 oz semisweet chocolate, coarsely chopped",
        "3 tablespoons unsweetened cocoa powder (not Dutch-process)",
        "2 1/2 tablespoons boiling-hot water",
        "1/2 teaspoon vanilla",
        "Special equipment: a standing electric mixer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Banana",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banana Boston Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/banana-boston-cream-pie-106078"
}
