{
    "directions": [
        "Preheat oven to 350°F. Pulse peanuts in a food processor until coarsely ground. Transfer 1/4 cup ground nuts to a small bowl; cover and set aside for garnish. Pulse remaining peanuts until peanut butter forms, about 2 minutes.",
        "Whisk flour, salt, and baking soda in a medium bowl. Using an electric mixer, beat both sugars, peanut butter, and butter until well combined and mixture resembles wet sand, 2-3 minutes. Beat in egg yolk and vanilla, occasionally scraping down sides of bowl, until well blended, about 3 minutes (mixture will be clumpy). Gradually add dry ingredients; beat just to combine (mixture will be crumbly; do not overmix or crust will be tough). Gather dough with your hands, place in pie dish, and press evenly onto bottom and up sides of dish. Bake until edges are deep golden brown, 15-17 minutes. Let cool on a wire rack. DO AHEAD: Can be made 2 days ahead. Cover tightly.",
        "Bring milk and cream to a simmer in a medium saucepan. Meanwhile, whisk sugar, cornstarch, flour, and salt in a large mixing bowl. Add egg yolks; whisk until smooth (mixture will be very thick). Whisking constantly, gradually add milk mixture to yolk mixture. Return to saucepan and cook over medium-low heat, whisking constantly, until thick, 2-3 minutes. Transfer to a blender with butter and vanilla. Purée until smooth, 1-2 minutes. Transfer to a medium bowl; press plastic wrap directly onto surface of pastry cream. Chill until set, at least 2 hours. DO AHEAD: Can be made 2 days ahead.",
        "Using an electric mixer or whisk, beat 1/2 cup cream and powdered sugar until medium-stiff peaks form. Cover and chill.",
        "Stir sugar, 1 tablespoon bourbon, corn syrup, and 1 tablespoon water in a medium deep saucepan over medium-low heat until sugar dissolves. Increase heat, bring to a boil without stirring, and cook, occasionally swirling pan and brushing down sides with a wet pastry brush, until sugar is deep amber in color, 6-8 minutes. Remove caramel from heat; whisk in remaining 1/4 cup cream, butter, and salt (mixture will bubble vigorously). Let cool for 5 minutes; whisk in remaining 1/2 tablespoon bourbon and vanilla. Let bourbon caramel cool slightly. DO AHEAD: Whipped cream and bourbon caramel can be made 2 hours ahead. Rewhisk whipped cream before serving. Let bourbon caramel stand at room temperature.",
        "Spread 1/4 cup vanilla pastry cream evenly over bottom of peanut crust. Slice bananas into 1/4\"-thick rounds. Layer half of the bananas over pastry cream. Top with 1 1/2 cups pastry cream. Arrange remaining bananas over; top bananas with remaining pastry cream. Garnish with whipped cream and reserved ground peanuts. Serve with bourbon caramel."
    ],
    "ingredients": [
        "1 1/4 cups unsalted, dry-roasted peanuts",
        "1/2 cup all-purpose flour",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon baking soda",
        "1/4 cup (packed) light brown sugar",
        "1/4 cup sugar",
        "2 tablespoons (1/4 stick) unsalted butter, room temperature",
        "1 large egg yolk",
        "1/4 teaspoon vanilla extract",
        "2 cups whole milk",
        "3/4 cup heavy cream",
        "1/2 cup sugar",
        "3 tablespoons cornstarch",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon kosher salt",
        "5 large egg yolks",
        "1/4 cup (1/2 stick) unsalted butter, cut into 1/2\" cubes",
        "1 teaspoon vanilla extract",
        "3/4 cup heavy cream, divided",
        "2 tablespoons powdered sugar",
        "1/2 cup sugar",
        "1 1/2 tablespoons bourbon, divided",
        "1/2 teaspoon corn syrup",
        "3 tablespoons unsalted butter, cut into 1/2\" cubes",
        "1/4 teaspoon kosher salt",
        "3/4 teaspoon vanilla extract",
        "3 ripe bananas",
        "Special equipment: A 9\"-diameter glass or ceramic pie dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Milk/Cream",
        "Dairy",
        "Dessert",
        "Banana",
        "Peanut",
        "Family Reunion",
        "Potluck",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banana Cream Pie with Salty Bourbon Caramel",
    "url": "http://www.epicurious.com/recipes/food/views/banana-cream-pie-with-salty-bourbon-caramel-388653"
}
