{
    "directions": [
        "Melt 2 tablespoons butter in heavy large skillet over medium heat. Add 2 tablespoons sugar and 2 tablespoons water and stir until sugar dissolves. Continue stirring until mixture is foamy, about 2 minutes. Add bananas; cook until tender, stirring occasionally, about 5 minutes. Transfer to small bowl; cool. (Can be prepared 4 hours ahead. Cover and chill.)",
        "Preheat oven to 350°F. Using small sharp knife, cut 2-inch-long slit in 1 side of each bread slice, cutting 3/4 of way through bread and creating pocket that leaves 3 sides of bread intact. Divide banana mixture equally among pockets in bread. Whisk milk, eggs, 1/2 teaspoon cinnamon, vanilla and 1/2 cup sugar in large bowl to blend. Pour into large glass baking dish. Place bread in egg mixture; let soak 10 minutes, turning occasionally.",
        "Place almonds in shallow bowl. Carefully remove bread from egg mixture and coat both sides with almonds. Place bread on heavy large baking sheet. Mix brown sugar, oats, flour and remaining 2 teaspoons cinnamon in medium bowl. Add remaining 1/4 cup butter and rub in, using fingertips, until moist clumps form. Sprinkle topping over bread.",
        "Bake French toast until topping is golden brown and filling is hot, about 25 minutes. Transfer toast to plates. Serve hot with maple syrup."
    ],
    "ingredients": [
        "2 tablespoons plus 1/4 cup ( 1/2 stick) unsalted butter",
        "2 tablespoons plus 1/2 cup sugar",
        "2 tablespoons water",
        "2 large ripe bananas, peeled, cut into 1/2-inch-thick rounds",
        "1 1-pound unsliced loaf egg bread, ends trimmed, bread cut  into 6 slices (each about 1 1/2 inches thick)",
        "2 cups milk (do not use low-fat or nonfat)",
        "6 large eggs",
        "2 1/2 teaspoons ground cinnamon",
        "1/4 teaspoon vanilla extract",
        "1 1/2 cups thinly sliced almonds, toasted",
        "1/4 cup (packed) golden brown sugar",
        "1/4 cup quick-cooking oats",
        "2 tablespoons all purpose flour",
        "Maple syrup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fruit",
        "Nut",
        "Brunch",
        "Bake",
        "Kid-Friendly",
        "Mother's Day",
        "Father's Day",
        "Banana",
        "Almond",
        "New York",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banana-Stuffed French Toast with Streusel Topping",
    "url": "http://www.epicurious.com/recipes/food/views/banana-stuffed-french-toast-with-streusel-topping-2983"
}
