{
    "directions": [
        "Preheat an oven to 325 degrees F (165 degrees C). Combine flour, baking powder, baking soda, and salt in a bowl. Set aside. Grease and flour a fluted tube pan.",
        "Beat 1 cup of butter, shortening, 2 cups of brown sugar, and 1 cup of white sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the bananas, followed by the eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in 2 teaspoons of vanilla extract with the last egg.  Pour in the flour mixture alternately with the milk, mixing until just incorporated. Fold in the pecans; mixing just enough to evenly combine. Pour the batter into prepared pan.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour and 20 minutes.",
        "Meanwhile, prepare the glaze. Heat 1/2 cup of butter, 1/4 cup of brown sugar, 1/4 cup of white sugar, 1 teaspoon of vanilla extract, and heavy cream in a saucepan over medium heat. Stir continuously until the sugars have dissolved, then gently simmer for 1 minute. Pour over baked cake while still in the pan. Cool in the pan for 10 minutes before removing to cool completely on a wire rack."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1 teaspoon salt",
        "1 cup butter",
        "1/2 cup vegetable shortening",
        "2 cups brown sugar",
        "1 cup white sugar",
        "4 ripe bananas, mashed",
        "5 eggs",
        "2 teaspoons vanilla extract",
        "1/2 cup milk",
        "1 cup chopped pecans",
        "1/2 cup butter",
        "1/4 cup brown sugar",
        "1/4 cup white sugar",
        "1 teaspoon vanilla extract",
        "1/4 cup heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Banana Pound Cake With Caramel Glaze",
    "url": "http://allrecipes.com/recipe/213103/banana-pound-cake-with-caramel-glaze/"
}
