{
    "directions": [
        "Spray 9-inch-diameter glass pie dish with nonstick spray. Arrange 3/4 of cookie dough in prepared dish (reserve remaining dough for another use). Press dough evenly onto bottom and up sides of dish, building high-standing dough edge on rim of dish. Sprinkle with 1/2 cup nuts; press nuts into dough. Pierce dough all over with toothpick. Freeze crust 1 hour.Position rack in bottom third of oven and preheat to 350°F. Fold 36-inch-long piece of foil lengthwise into thirds, forming 36x4-inch strip. Place pie dish on baking sheet. Stand foil strip snugly around dish, protecting outer edge of crust; secure overlap with paper clip. Bake crust until golden and dry to touch, about 25 minutes. Cool completely.",
        "Meanwhile, whisk 1/3 cup sugar, cornstarch, and salt to blend in heavy medium saucepan. Whisk in yolks; gradually add milk, whisking until smooth. Whisk over medium-high heat until custard thickens and boils, about 6 minutes. Remove from heat. Whisk in butter, rum, and 1 teaspoon vanilla. Transfer to large bowl; cool to lukewarm, whisking occasionally, about 45 minutes.",
        "Spread 1 cup custard in crust. Top with 3 sliced bananas, then remaining custard, covering bananas completely. Chill pie until filling sets, about 2 hours. Beat cream, powdered sugar and remaining 1 teaspoon vanilla in medium bowl to peaks. Spread cream over pie. Refrigerate at least 1 and up to 8 hours. Garnish pie with chocolate curls, if desired. Cut into wedges and serve."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 pound purchased frozen semisweet chocolate chip cookie dough, thawed",
        "1/2 cup chopped walnuts",
        "1/3 cup sugar",
        "1/4 cup cornstarch",
        "1/8 teaspoon salt",
        "5 large egg yolks",
        "2 1/3 cups whole milk",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 tablespoon dark rum",
        "2 teaspoons vanilla extract",
        "3 medium bananas, peeled, cut into 1/2-inch-thick slices",
        "1 cup chilled whipping cream",
        "2 tablespoons powdered sugar",
        "Chocolate curls (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Quick & Easy",
        "Banana",
        "Walnut",
        "Spring",
        "Chill"
    ],
    "title": "Banana Cream Pie with Chocolate-Chip-Cookie Crust",
    "url": "http://www.epicurious.com/recipes/food/views/banana-cream-pie-with-chocolate-chip-cookie-crust-104983"
}
