{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Line 12 standard (1/3-cup) muffin cups with paper liners. Whisk flour, baking powder, baking soda, and salt in medium bowl to blend. Mash bananas with fork in another medium bowl until smooth. Mix sour cream and vanilla into bananas.",
        "Using electric mixer, beat sugar and butter in large bowl until light and fluffy, about 3 minutes. Add egg and egg yolk and beat until well blended. Add flour mixture in 3 additions alternately with banana-sour cream mixture in 2 additions, beginning and ending with flour mixture and beating just until blended after each addition. Divide batter among prepared muffin cups (generous 1/4 cup for each).",
        "Bake cupcakes until tester inserted into center of each comes out clean, about 20 minutes. Transfer cupcakes to rack and let cool completely.",
        "Sift powdered sugar into large bowl. Add cream cheese, butter, and peanut butter. Using electric mixer, beat mixture until smooth. Spread frosting over top of cupcakes, dividing equally. Sprinkle lightly with chopped peanuts, if desired. DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "1 1/4 cups all purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "2 very ripe large bananas, peeled",
        "1/2 cup sour cream",
        "1 1/2 teaspoons vanilla extract",
        "3/4 cup sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 large egg",
        "1 large egg yolk",
        "1 1/2 cups powdered sugar",
        "1 8-ounce package cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup smooth peanut butter (do not use old-fashioned or freshly ground)",
        "Chopped lightly salted roasted peanuts (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Breakfast",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Cream Cheese",
        "Banana",
        "Peanut",
        "Birthday",
        "Party",
        "Sour Cream",
        "Peanut Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banana Cupcakes with Peanut Butter Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/banana-cupcakes-with-peanut-butter-frosting-358240"
}
