{
    "directions": [
        "To make the tart shells: Combine all the ingredients in a bowl and stir to mix well. Place 2 tablespoons of the mixture in the bottom of each of 4 ring molds each 2 inches in diameter. Pack the mixture firmly into the molds. (You will have more dough than you need for 4 molds. Because the tiny tart shells are fragile and time-consuming to make, it is a good idea to line additional ring molds with the remaining dough in case of breakage.) Place the molds on a nonstick drying sheet on a dehydrator shelf and dehydrate at 105°F for 3 hours. Remove the tart shells from the drying sheet and dehydrate directly on the shelf for about 10 hours longer, or until just dry.",
        "To make the Caramel Sauce: Drain the cashews, pat them dry, and then measure them. You should have 1/4 cup; discard any excess. In a high-speed blender, combine the cashews, Cashew Milk, honey, Date Paste, and maple syrup and process until smooth. Strain the purée through a fine-mesh sieve. Set aside 4 tablespoons for the tarts; reserve the remainder for another use.",
        "Spoon 1 tablespoon of the Mexican Chocolate Sauce in a circle on each plate. Put a tart shell on top of the sauce. Spread 2 tablespoons of the Chocolate Fudge-Almond on the tart shell. Arrange 7 banana slices on top. Drizzle 1 tablespoon Caramel Sauce over the bananas and on the plate. Sprinkle with the Honey Walnuts."
    ],
    "ingredients": [
        "3/4 cup plus 2 tablespoons sprouted flour (see tips, below)",
        "1 tablespoon maple syrup",
        "2 tablespoons plus 1 teaspoon extra virgin olive oil",
        "Seeds from 1/2 vanilla bean",
        "Pinch of Celtic sea salt",
        "3 heaping teaspoons raw cashews, soaked for 8 hours in filtered water",
        "1/4 cup plus 1 teaspoon Cashew Milk",
        "2 tablespoons raw dark honey",
        "2 tablespoons Cashew Milk",
        "2 tablespoons maple syrup",
        "4 tablespoons Cashew Milk",
        "8 tablespoons Chocolate Fudge-Almond",
        "28 banana slices",
        "4 tablespoons Honey Walnuts , broken"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Fruit",
        "Dessert",
        "No-Cook",
        "Banana",
        "Raw"
    ],
    "title": "Banana Chocolate Tart with Caramel and Chocolate Sauces",
    "url": "http://www.epicurious.com/recipes/food/views/banana-chocolate-tart-with-caramel-and-chocolate-sauces-231404"
}
