{
    "directions": [
        "Preheat oven to 350°F. Butter an 8-inch square, 2-inch deep baking pan and line bottom with wax paper. Butter paper and dust with flour, knocking out excess flour.",
        "On a baking sheet toast coconut in the middle of the oven, stirring once, until golden, about 6 minutes.",
        "Into a bowl sift together flour, baking soda, baking powder, and salt. In a small bowl whisk together eggs, bananas, crème fraîche or sour cream, and vanilla.",
        "In a bowl of a standing electric mixer beat together butter and sugar until light and fluffy. Beat in flour and egg mixtures alternately, beginning and ending with flour mixture and beating after each addition until batter is smooth, and fold in coconut.",
        "Turn batter into pan, smoothing top, and bake in middle of oven until a tester inserted into center comes out clean, about 30 minutes. Cool cake in pan on rack 10 minutes. Run a thin knife around edges of pan and invert cake onto rack. Remove wax paper carefully and cool cake completely. Cake layer may be made 3 days ahead and chilled, wrapped in plastic wrap and foil.",
        "In a small saucepan bring water and sugar to a boil over moderate heat, stirring until sugar is dissolved, and simmer 1 minute. Stir in rum and simmer 1 minute. Cool syrup completely. Syrup may be made 3 days ahead and chilled, covered.",
        "In a bowl with an electric mixer beat together cream cheese and butter until light and fluffy. Add confectioners' sugar, 1/2 cup at a time, beating well after each addition, and beat in vanilla and pinch salt. In a food processor coarsely grind banana chips and stir into frosting.",
        "With serrated knife halve cake layer horizontally and with pastry brush dab cut sides with rum syrup, using it all. Spread half of frosting on cut side of bottom layer and arrange top layer, cut side down, on frosting. Spread remaining frosting on top of cake. Cake may be assembled 3 hours ahead and chilled, covered with an overturned bowl or in a cake keeper."
    ],
    "ingredients": [
        "1/2 cup sweetened flaked coconut",
        "1 cup cake flour (not self-rising)",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon baking powder",
        "1/8 teaspoon salt",
        "2 large eggs",
        "1/2 cup mashed banana (about 1 large)",
        "3 tablespoons crème fraîche or sour cream",
        "1/2 teaspoon vanilla",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "1/2 cup granulated sugar",
        "1/4 cup water",
        "2 tablespoons granulated sugar",
        "2 tablespoons dark rum",
        "1/2 pound cream cheese, softened",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1 1/2 cups confectioners' sugar, sifted",
        "1 teaspoon vanilla",
        "2/3 cup crisp banana chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Fruit",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Banana",
        "Coconut",
        "Spring",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banana Coconut Crunch Cake",
    "url": "http://www.epicurious.com/recipes/food/views/banana-coconut-crunch-cake-12205"
}
