{
    "directions": [
        "Preheat oven to 350°F. Butter and flour two 9-inch-diameter cake pans with 11/2-inch-high sides. Combine banana muffin mix, mashed ripe bananas, eggs, vegetable oil, and whole milk in large bowl. Using electric mixer, beat mixture at medium speed until well blended, about 2 minutes. Using clean dry beaters, beat egg whites in medium bowl until soft peaks form. Gradually add sugar, beating until mixture is stiff but not dry. Fold egg whites into batter in 2 additions. Divide cake batter between prepared pans. Bake cake batter until tester inserted into center comes out clean, about 30 minutes. Cool cakes in pans on racks 10 minutes. Turn out cakes onto racks and cool completely.",
        "Stir chopped white chocolate in top of double boiler over barely simmering water until almost melted. Remove from over water; stir white chocolate until smooth. Cool to lukewarm, about 4 minutes. Beat cream cheese and unsalted butter in large bowl until fluffy. Gradually beat in lukewarm white chocolate, then powdered sugar, vanilla extract, and lemon juice.",
        "Place 1 cake layer on platter. Spread with 1 1/3 cups white chocolate-cream cheese frosting. Thinly slice 2 bananas. Arrange banana slices over frosting. Top with second cake layer. Spread remaining frosting over top and sides of cake. Press toasted chopped walnuts into frosting on sides of cake. Refrigerate cake until frosting is set, at least 2 hours and up to 1 day.",
        "Slice remaining banana; arrange slices atop cake and serve."
    ],
    "ingredients": [
        "2 6.4-ounce packages banana muffin mix",
        "1 cup mashed ripe bananas (about 2)",
        "2 large eggs",
        "3 tablespoons vegetable oil",
        "2/3 cup whole milk",
        "2 large egg whites",
        "2 tablespoons sugar",
        "6 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
        "12 ounces cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "3/4 cup powdered sugar",
        "2 1/4 teaspoons vanilla extract",
        "3/4 teaspoon fresh lemon juice",
        "3 ripe bananas",
        "1 cup walnuts (4 ounces), toasted, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Banana",
        "Walnut",
        "Fall",
        "Kansas City",
        "Missouri"
    ],
    "title": "Banana Layer Cake with White Chocolate-Cream Cheese Frosting and Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/banana-layer-cake-with-white-chocolate-cream-cheese-frosting-and-walnuts-107330"
}
