{
    "directions": [
        "Heat the oven to 350°F. Grease a 9x5-inch loaf pan with softened butter.",
        "Whisk together the flour, salt, baking powder, and sugar in a large bowl.",
        "Mix together the melted butter and mashed bananas in a separate bowl. Beat in the eggs and vanilla until well combined. Stir this mixture into the dry ingredients just enough to combine everything. Gently fold in the nuts and coconut if you’re using them.",
        "Pour the batter into the prepared pan. Bake for 50 to 60 minutes or until the bread is golden brown and a toothpick inserted in the center of the bread comes out almost entirely clean. Cool the pan on a rack for 15 minutes, then carefully turn it upside down to release the loaf. Serve warm or at room temperature or wrap in plastic and keep at room temperature for a couple days.",
        "Honey Whole Grain Banana Bread: For a delicately sweet, nuttier bread, substitute 1 1/4 cups whole wheat flour and 3/4 cup oat bran for the all-purpose flour. Reduce the sugar to 3/4 cup and whisk in 1 teaspoon cinnamon. Add 1/4 cup honey to the melted butter.",
        "Chocolate Banana Bread: Reduce the flour to 1 1/2 cups. Add 1/2 cup Dutch-process cocoa powder to the flour. Fold up to 1 cup chopped dark chocolate into the batter.",
        "Tropical Banana Bread: Brown sugar and a few choice add-ins transform basic banana bread into a tropical treat. Replace half the sugar with 1/2 cup packed dark brown sugar. Fold 1/3 cup chopped dried pineapple, 1/3 cup shredded unsweetened coconut, and 1/3 cup chopped macadamia nuts into the batter.",
        "Orange Banana Bread: Whisk 2 tablespoons grated orange zest into the dry ingredients. Mix 1/4 cup fresh orange juice into the melted butter and bananas.",
        "Pumpkin Bread: Substitute 1 cup pumpkin purée for the bananas. Whisk 1 teaspoon cinnamon, 1/4 teaspoon nutmeg, 1/4 teaspoon ginger, and 1/8 teaspoon ground cloves into the dry ingredients.",
        "Peanut Butter Banana Bread: Add 1/3 cup peanut butter to the bananas. Cut the butter down to 5 tablespoons.",
        "Apricot Cream Cheese Bread: The soft tang of cream cheese is a wonderful flavor and texture enhancer for quick breads. Replace the bananas with 1/2 cup apricot purée (soak 1/2 cup dried apricots in boiling water for 10 minutes and drain, reserving 2 tablespoons soaking water, and then purée). Reduce the butter to 3 tablespoons. In a separate bowl, beat 1/4 cup (2 ounces) cream cheese with the eggs, vanilla, and sugar until well combined. Stir the apricot purée and butter mixture into the cream cheese mixture, then add the dry ingredients."
    ],
    "ingredients": [
        "1 stick butter, melted, plus softened butter for greasing",
        "2 cups flour",
        "1/2 teaspoon salt",
        "1 1/2 teaspoons baking powder",
        "1 cup sugar",
        "3 very ripe bananas, mashed with a fork until smooth",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "1/2 cup chopped walnuts (optional)",
        "1/2 cup shredded unsweetened coconut (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Banana",
        "Bread",
        "Breakfast",
        "snack",
        "Walnut",
        "Coconut"
    ],
    "title": "Banana Bread",
    "url": "http://www.epicurious.com/recipes/food/views/banana-bread"
}
