{
    "directions": [
        "Cut butter into 1/4-inch slices. In a large bowl with your fingertips or a pastry blender blend together flour, salt, and butter until mixture resembles coarse meal with some pea-size lumps of butter. Stir in sour cream with a fork until incorporated and form dough into a ball.",
        "Divide dough into 6 portions and form each piece into a 5-inch square. Chill dough, wrapped separately in plastic wrap, until firm, at least 2 hours, and up to 3 days, or freeze, wrapped well, up to 1 month.",
        "Mash enough of bananas to measure 1 cup and in a bowl stir together with remaining filling ingredients until smooth.",
        "On a lightly floured surface roll out 1 dough square (keep remaining dough chilled or frozen) into a 15- by 6-inch rectangle (about 1/8 inch thick). With a sharp knife and a ruler cut rectangle into ten 3-inch squares. Lay squares over ungreased mini-muffin cups (2 cups will remain empty) and drop 1 heaping teaspoon filling onto center of squares. Bring all four corners of squares together and press gently to seal (filling will not be completely enclosed; this process will ease filled pastries into muffin cups). Chill filled pastries 30 minutes. Make more pastries in same manner.",
        "Preheat oven to 375°F.",
        "Bake pastries in batches in lower third of oven until pale golden, 20 to 25 minutes. Cool pastries in pans on racks 10 minutes and transfer to racks to cool completely. Pastries keep, layered between sheets of wax paper in airtight containers, and frozen, 2 weeks. Before serving, thaw puffs and reheat in one layer on a baking sheet in a 325°F oven 7 to 10 minutes. Cool puffs on a rack.",
        "Dust puffs with confectioners' sugar before serving."
    ],
    "ingredients": [
        "4 sticks (2 cups) cold unsalted butter",
        "4 cups all-purpose flour",
        "1/4 teaspoon salt",
        "1 cup sour cream",
        "2 large firm-ripe bananas",
        "12 ounces cream cheese, softened",
        "1/2 cup granulated sugar",
        "2 large egg yolks",
        "2 tablespoons rum",
        "2 teaspoons fresh lemon juice",
        "1/2 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Rum",
        "Cheese",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Banana",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banana Rum Puffs",
    "url": "http://www.epicurious.com/recipes/food/views/banana-rum-puffs-14538"
}
