{
    "directions": [
        "Preheat oven to 350°F.",
        "Into a food processor crumble graham crackers and grind to fine crumbs (you should have about 1 1/3 cups crumbs). Add walnuts, sugar, butter, and salt and pulse motor until nuts are finely chopped. Press crumb mixture evenly onto bottom and side of a glass 10- by 2-inch deep dish pie plate and bake in middle of oven 8 minutes. Cool shell in plate on rack.",
        "In a dry heavy 3-quart saucepan cook granulated sugar over moderate heat, stirring with fork, until melted and cook without stirring, swirling pan, until a golden caramel. Add corn syrup and boil over moderate heat, stirring until combined well. Add 2/3 cup cream (caramel will steam and harden) and boil, stirring occasionally, until a candy thermometer registers 210°F. Stir cornstarch mixture and stir into caramel. Boil caramel, stirring constantly, 1 minute and remove pan from heat. When caramel stops bubbling, stir in vanilla and pour into shell. Sprinkle chocolate chips evenly over hot caramel and cool completely. Pie may be prepared up to this point 1 day ahead and chilled, covered.",
        "Peel bananas and slice thin. Arrange bananas evenly over chocolate layer. In a bowl beat remaining cup cream until thickened and beat in confectioners' sugar. Beat cream until it holds stiff peaks and spread over bananas.",
        "Sprinkle chocolate curls over pie and chill, uncovered, in freezer 30 minutes, so pie can be cut easily."
    ],
    "ingredients": [
        "ten 5- by 2 1/2-inch graham crackers",
        "1/2 cup walnuts, toasted lightly",
        "1/4 granulated sugar",
        "1 stick (1/2 cup) unsalted butter, melted",
        "1/4 teaspoon salt",
        "1/3 cup granulated sugar",
        "1/2 cup light corn syrup",
        "1 2/3 cups chilled heavy cream",
        "1 teaspoon cornstarch mixed with 1 tablespoon cold water",
        "1/2 teaspoon vanilla extract",
        "3/4 cup semisweet chocolate chips",
        "4 firm-ripe bananas (about 1 1/2 pounds total)",
        "1/4 cup confectioners' sugar",
        "Garnish: a 3-ounce bar fine-quality bittersweet chocolate (not unsweetened) at room temperature, shaved with a vegetable peeler into curls and chilled, covered loosely"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chocolate",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Kid-Friendly",
        "Banana",
        "Walnut",
        "Spring",
        "Chill",
        "Gourmet"
    ],
    "title": "Banana Caramel Chocolate Pie",
    "url": "http://www.epicurious.com/recipes/food/views/banana-caramel-chocolate-pie-13149"
}
