{
    "directions": [
        "Whisk first 4 ingredients in heavy medium saucepan until no lumps remain. Gradually whisk in milk. Add yolks; whisk to blend. Scrape in seeds from vanilla bean; add bean. Whisk over medium-high heat until pastry cream thickens and boils 1 minute, about 8 minutes total. Remove from heat; whisk in butter and rum. Remove vanilla bean. Transfer mixture to bowl; press plastic wrap onto surface. Chill until firm, at least 4 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
        "Combine first 7 ingredients in processor. Blend until finely ground. Transfer to large bowl. Using fork, cut in butter until mixture resembles coarse crumbs. Mix orange juice, 1 tablespoon ice water, and vanilla in small bowl. Sprinkle over chocolate mixture, tossing until dough comes together in clumps and adding more water by tablespoonfuls if dry. Using floured hands, gather dough into ball; flatten into disk. Wrap; chill dough at least 2 hours and up to 1 day.",
        "Preheat oven to 375°F. Spray 9-inch-diameter glass pie dish (including rim) with nonstick spray. Roll out dough between 2 sheets of parchment paper to 12-inch round. Peel off top parchment. Using bottom parchment as aid, turn dough over into prepared dish. Peel off parchment. Fold overhang under and crimp crust edges decoratively. Pierce crust all over with fork; freeze 10 minutes.",
        "Line crust with foil; fill with dried beans. Bake crust 20 minutes. Remove foil with beans. Continue to bake crust until dry and firm to touch, about 10 minutes longer. Cool crust completely on rack.",
        "Spread 1 cup pastry cream over bottom of crust. Slice enough bananas into 1/4-inch-thick rounds to cover cream in overlapping circles. Cover bananas with remaining pastry cream. DO AHEAD: Can be made 6 hours ahead. Cover and chill.",
        "Slice 3 (or more) bananas on slight diagonal into 1/4-inch-thick ovals. Arrange in overlapping circles atop pie. Sprinkle with sugar. Caramelize, if desired, using handheld torch. Alternatively, cover bananas with whipped cream, sprinkle with chocolate sprinkles, and garnish with additional banana slices."
    ],
    "ingredients": [
        "1/2 cup sugar",
        "2 tablespoons unbleached all purpose flour",
        "2 tablespoons cornstarch",
        "1/4 teaspoon salt",
        "3 cups whole milk",
        "4 large egg yolks",
        "1 vanilla bean, split lengthwise",
        "1/4 cup (1/2 stick) unsalted butter, diced",
        "1 tablespoon dark rum",
        "1 cup whole wheat pastry flour",
        "1/3 cup (2 ounces) bittersweet chocolate chips",
        "1/4 cup unbleached bread flour",
        "2 tablespoons unsweetened cocoa powder",
        "2 tablespoons sugar",
        "1/4 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, diced",
        "2 tablespoons orange juice",
        "1 tablespoon (or more) ice water",
        "1/2 teaspoon vanilla extract",
        "Nonstick vegetable oil spray",
        "7 bananas (about), peeled",
        "Additional sugar",
        "Whipped cream (optional)",
        "Chocolate sprinkles (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Food Processor",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Banana",
        "Chill",
        "Whole Wheat",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Banana Cream Pie with Whole Grain Chocolate Crust",
    "url": "http://www.epicurious.com/recipes/food/views/banana-cream-pie-with-whole-grain-chocolate-crust-241365"
}
