{
    "directions": [
        "Combine raisins and 2 tablespoons rum in a small bowl. Let stand 20 minutes.",
        "Melt 2 tablespoons butter in heavy large skillet over medium heat. Add bananas and 2 tablespoons sugar and cook until bananas are tender, about 2 minutes per side. Remove from heat. Combine whipping cream, eggs, vanilla extract and remaining 1/4 cup rum and 3 tablespoons sugar in a medium bowl and whisk to blend.",
        "Preheat oven to 350°F. Butter 9X5X3-inch loaf pan. Arrange 1/3 of bread strips crosswise in bottom of prepared pan. Arrange 6 banana pieces atop bread. Sprinkle with half of raisins and half of pecans. Arrange 1/3 of bread strips crosswise atop bananas. Pour half of egg mixture over. Arrange remaining banana pieces atop bread. Sprinkle with remaining raisins and pecans. Arrange remaining bread strips crosswise atop bananas. Pour remaining egg mixture over. Press gently on top layer to compact. Let stand 15 minutes.",
        "Bake bread pudding until puffed and golden and knife inserted into center comes out clean, about 45 minutes. Transfer to rack and cool slightly.",
        "Cut bread pudding into slices. Arrange on plates; drizzle with warm Rum Sauce and serve.",
        "Melt butter in heavy medium saucepan over medium-high heat. Add cream, sugar and salt. Bring to boil, stirring until sugar dissolves. Remove from heat. Stir in rum. (Can be prepared 2 days ahead. Cover and refrigerate. Rewarm over low heat, stirring constantly.)"
    ],
    "ingredients": [
        "1/3 cup raisins or currants",
        "2 tablespoons plus 1/4 cup dark rum",
        "2 tablespoons (1/4 stick) butter",
        "3 bananas, peeled, halved crosswise and then lengthwise",
        "5 tablespoons sugar",
        "2 cups whipping cream",
        "4 large eggs",
        "1 teaspoon vanilla extract",
        "8 ounces firm white bread slices, crusts trimmed, each slice cut into 3 strips",
        "1/2 cup chopped toasted pecans (about 2 ounces)",
        "1/4 cup (1/2 stick) unsalted butter",
        "1/2 cup whipping cream",
        "1/2 cup packed dark brown sugar",
        "Pinch of salt",
        "2 tablespoons dark rum"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Fruit",
        "Dessert",
        "Bake",
        "Kwanzaa",
        "Raisin",
        "Banana",
        "Pecan",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banana Bread Pudding with Rum Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/banana-bread-pudding-with-rum-sauce-509"
}
