{
    "directions": [
        "Place rice vinegar, water, and sugar into a saucepan over medium heat, bring to a boil, and stir until the sugar has dissolved, about 1 minute. Allow the mixture to cool.",
        "Pour the cooled vinegar mixture over the carrot, radish, and onion in a bowl, and allow to stand for at least 30 minutes. Drain off the excess vinegar mixture after the vegetables have marinated.",
        "While the vegetables are marinating, preheat the oven's broiler, and set the oven rack about 6 inches from the heat source. Lightly oil a slotted broiler pan.",
        "Sprinkle the chicken breast with garlic salt and pepper, and broil on slotted broiler pan, turning once, until the center of the chicken breast is no longer pink and the surface has browned, about 6 minutes per side. Remove the broiled chicken, and slice into bite-size pieces.",
        "Slice the baguette in half the long way, and pull the center of the bread out of the baguette halves, leaving a cavity for the filling. Place the baguette halves under the broiler to lightly toast, 2 to 3 minutes.",
        "To assemble the bahn mi sandwich, spread each half of the toasted baguette with mayonnaise, and fill the cavity of the bottom half of the bread with broiled chicken, cucumber slices, pickled carrot, onion, and radish, cilantro leaves, and jalapeno pepper. Squeeze a wedge of lime over the filling, and top with the other half of the baguette."
    ],
    "ingredients": [
        "1/2 cup rice vinegar",
        "1/4 cup water",
        "1/4 cup white sugar",
        "1/4 cup carrot, cut into 1/16-inch-thick matchsticks",
        "1/4 cup white (daikon) radish, cut into 1/16-inch-thick matchsticks",
        "1/4 cup thinly sliced white onion",
        "1 skinless, boneless chicken breast half",
        "garlic salt to taste",
        "ground black pepper to taste",
        "1 (12 inch) French baguette",
        "4 tablespoons mayonnaise",
        "1/4 cup thinly sliced cucumber",
        "1 tablespoon fresh cilantro leaves",
        "1 small jalapeno pepper - seeded and cut into 1/16-inch-thick matchsticks",
        "1 wedge lime"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Banh Mi",
    "url": "http://allrecipes.com/recipe/187342/banh-mi/"
}
