{
    "directions": [
        "Combine flour, butter, sugar and salt in processor. Blend until mixture resembles coarse meal. Add nuts; process using on/off turns until nuts are finely chopped. Add yolk and vanilla; process until moist clumps form. Press dough onto bottom and up sides of 9-inch-diameter glass pie dish. Freeze 1 hour.",
        "Preheat oven to 350°F. Bake crust until golden and cooked through, about 20 minutes. Cool on rack.",
        "Simmer sweetened condensed milk in heavy medium saucepan over medium heat until very thick and color of peanut butter, stirring frequently, about 25 minutes. Remove from heat; stir in whipping cream, dark rum and vanilla extract (mixture will be sticky and candy-like). Transfer warm filling to crust, spreading evenly. Cool completely. (Can be prepared 1 day ahead. Cover loosely and refrigerate.) Top pie with sliced bananas, covering filling completely. for topping: Stir instant coffee and 1 tablespoon water in small bowl until coffee dissolves. Combine coffee mixture, cream and sugar in large bowl; beat until peaks form. Spoon coffee whipped cream into pastry bag fitted with large star tip. Pipe whipped cream rosettes decoratively atop pie, covering completely. (Can be prepared 2 hours ahead. Chill.) Cut pie into wedges and serve."
    ],
    "ingredients": [
        "3/4 cup all purpose flour",
        "6 tablespoons (3/4 stick) chilled unsalted butter",
        "2 tablespoons sugar",
        "1/4 teaspoon salt",
        "1/2 cup dry-roasted macadamia nuts",
        "1 large egg yolk",
        "1 teaspoon vanilla extract",
        "2 14-ounce cans sweetened condensed milk",
        "1/2 cup whipping cream",
        "1 tablespoon dark rum",
        "1 tablespoon vanilla extract",
        "4 bananas, peeled, sliced",
        "3 tablespoons instant coffee crystals",
        "1 tablespoon water",
        "2 cups chilled whipping cream",
        "1/2 cup sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Banana",
        "Macadamia Nut",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Banoffee Pie",
    "url": "http://www.epicurious.com/recipes/food/views/banoffee-pie-103940"
}
