{
    "directions": [
        "Mix white wine, soy sauce, 1 tablespoon lime juice, and Worcestershire sauce together in a resealable bag; add chicken and seal bag. Marinate chicken in the refrigerator for 8 to 24 hours.",
        "Mix 1 tablespoon salt, onion powder, sugar, 1 teaspoon ground black pepper, white pepper, cayenne pepper, garlic powder, and oregano together in a bowl for the blackened seasoning; transfer to a shaker or an air-tight container.",
        "Place mayonnaise, chives, garlic, 1 teaspoon lime juice, ground chipotle pepper, salt, and black pepper in a food processor; pulse together until chives are minced and aioli is smooth and evenly mixed. Transfer to an air-tight container and store in the refrigerator.",
        "Heat 1 tablespoon olive oil and 1 tablespoon butter together in a skillet over medium heat; cook and stir onion until softened and translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until onion is very tender and dark brown, about 30 minutes more. Remove from heat.",
        "Remove chicken from marinade and pat dry with paper towels. Spray chicken pieces with cooking spray and sprinkle all sides with blackened seasoning.",
        "Heat 1 tablespoon butter and 1 tablespoon olive oil in a skillet; cook chicken until no longer pink in the center and the juices run clear, about 5 minutes per side.",
        "Assemble sliders by layering a piece of chicken, a strip of Cheddar cheese, and a spoonful of caramelized onion onto the bottom of each bun. Place a dollop of aioli on the top portion of bun before placing atop onion layer, forming a sandwich."
    ],
    "ingredients": [
        "Marinade:",
        "2 cups white wine",
        "2 tablespoons soy sauce",
        "1 tablespoon lime juice",
        "1 tablespoon Worcestershire sauce",
        "4 skinless, boneless chicken breast halves, each cut into 4 pieces",
        "Blackened seasoning:",
        "1 tablespoon salt",
        "2 teaspoons onion powder",
        "2 teaspoons white sugar",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground white pepper",
        "2 teaspoons cayenne pepper",
        "1 teaspoon garlic powder",
        "1 teaspoon ground oregano",
        "Chipotle aioli:",
        "1/2 cup mayonnaise",
        "1 tablespoon chopped fresh chives",
        "1 clove garlic",
        "1 teaspoon lime juice",
        "1/2 teaspoon ground chipotle chile pepper",
        "salt and ground black pepper to taste",
        "Caramelized onion:",
        "1 tablespoon olive oil",
        "1 tablespoon butter",
        "1 large onion, cut into thin rings",
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "cooking spray",
        "4 slices American cheese, cut into 4 strips",
        "16 small rolls, split and toasted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bar Chicks - Blackened Chicken Sliders",
    "url": "http://allrecipes.com/recipe/229991/bar-chicks---blackened-chicken-slider/"
}
