{
    "directions": [
        "In a small bowl, stir together the sugar, vinegar, tomatoes and broth. Set aside.",
        "Season the brisket generously with salt and pepper. In a large, heavy pot over medium-high heat, warm the oil. Add the brisket, fat side down, and cook, turning once, until browned on both sides, about 10 minutes. Transfer to a plate.",
        "Pour off all but 2 Tbs. of the fat from the pot. Add the onions and sauté over medium-high heat until softened, about 3 minutes. Add the garlic and sauté for 1 minute. Stir in the allspice. Sprinkle the flour over the onion mixture, reduce the heat to medium and cook, stirring frequently, until blended, about 3 minutes. Pour in the reserved broth mixture and stir to combine. Bring to a boil and season with salt and pepper.",
        "Preheat an oven to 300°F (150°C). Return the brisket to the pot, cover and cook in the oven until the brisket is very tender, 3 to 4 hours. Skim the fat from the surface of the cooking liquid.",
        "Let the brisket cool in the cooking liquid then transfer the brisket to a cutting board and slice the brisket across the grain. Warm the cooking liquid over medium heat. Arrange the slices on a platter, top with the warm cooking liquid and onions and serve. Serves 6 to 8.",
        "Adapted from Williams-Sonoma",
        "One Pot of the Day",
        ", by Kate McMillan (Weldon Owen, 2012)"
    ],
    "ingredients": [
        "1/4 cup (2 oz./60 g) firmly packed dark brown sugar",
        "1/4 cup (2 fl. oz./60 ml) cider vinegar",
        "2 tomatoes, seeded and chopped",
        "2 cups (16 fl. oz./500 ml) beef broth",
        "3 lb. (1.5 kg) beef brisket",
        "Salt and freshly ground pepper",
        "2 Tbs. canola oil",
        "2 yellow onions, thinly sliced",
        "2 garlic cloves, minced",
        "1/2 tsp. ground allspice",
        "2 Tbs. all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Barbecue-Style Brisket",
    "url": "http://www.williams-sonoma.com/recipe/barbecue-style-brisket.html"
}
