{
    "directions": [
        "Place sliced onion in medium bowl. Pour boiling water over. Let stand 10 minutes; drain well, then return to bowl. Add juice, vinegar, and salt and stir to blend. Cover and chill at least 2 hours and up to 1 day.",
        "Chop garlic with salt to paste; scrape into small bowl. Add barbecue sauce, orange juice, and lime juice to bowl. Gradually whisk in oil. Season vinaigrette to taste with pepper. DO AHEAD Can be made 1 day ahead. Cover and refrigerate.",
        "Blend pepper, smoked paprika, and salt in small bowl. Sprinkle seasoning mix evenly over both tenderloins. Let stand at least 30 minutes and up to 2 hours.",
        "Spray grill rack with nonstick spray. Prepare barbecue (high heat). Grill tenderloins uncovered 5 minutes, rolling over to sear all sides. Cover grill and continue to cook until thermometer inserted into thickest part registers 145°F, turning often and moving to cooler part of grill as needed, about 15 minutes longer. Transfer to cutting board; let rest 10 minutes.",
        "Thinly slice tenderloins crosswise into rounds. Mound pork on roll bottoms. Top with well-drained onion slices, then drizzle with vinaigrette. Cover with roll tops and serve, passing extra onion slices and vinaigrette separately."
    ],
    "ingredients": [
        "1 red onion, halved, thinly sliced",
        "1 1/2 cups boiling water",
        "1 cup plus 2 tablespoons orange juice",
        "6 tablespoons distilled white vinegar",
        "1/2 teaspoon (scant) salt",
        "1 garlic clove, peeled",
        "1/2 teaspoon smoked salt or coarse kosher salt",
        "3 tablespoons purchased tomato-based barbecue sauce",
        "2 tablespoons orange juice",
        "2 tablespoons fresh lime juice",
        "1/2 cup olive oil",
        "1 tablespoon coarsely ground black pepper",
        "1 tablespoon smoked Spanish paprika (Pimentón de La Vera)*",
        "1 teaspoon smoked salt or coarse kosher salt",
        "2 (1-pound) pork tenderloins",
        "Nonstick vegetable oil spray",
        "6 large onion rolls, split, toasted",
        "*Available at some supermarkets and specialty foods stores, and from tienda.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Citrus",
        "Fruit",
        "Onion",
        "Pork",
        "Fourth of July",
        "Backyard BBQ",
        "Lunch",
        "Meat",
        "Pork Tenderloin",
        "Summer",
        "Tailgating",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Barbecued Pork Sandwiches with Pickled Red Onion",
    "url": "http://www.epicurious.com/recipes/food/views/barbecued-pork-sandwiches-with-pickled-red-onion-238800"
}
