{
    "directions": [
        "Cook onion and jalapeños over a gas burner, turning often, until charred and beginning to soften, about 4 minutes (alternatively, cook in a hot dry medium skillet, preferably cast iron). Let cool. Finely chop onion. Remove seeds from chiles and finely chop. Toss onion, chiles, cilantro, pumpkin seeds, oil, and lime juice in a small bowl. Season with salt.",
        "Freeze pork until very firm around the edges, 20–30 minutes. Slice 1/4\" thick, then cut crosswise into 1 1/2\"–2\" strips if needed. Cover and chill until ready to grill.",
        "Mix brown sugar, mustard powder, paprika, garlic powder, black pepper, and cayenne in a small bowl to combine.",
        "Prepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Oil grates. Thread pork onto 6–8 skewers, folding and piling onto itself to form a compact shape. Season with salt, then sprinkle generously with brown sugar mixture in several passes, allowing a few minutes between each for rub to adhere. Grill over direct heat, turning every minute or so, until browned and beginning to char in spots, about 4 minutes. Move to cooler side of grill and continue to grill until cooked through, about 5 minutes longer. Serve pork topped with salsa.",
        "Salsa can be made 1 day ahead. Cover and chill.\nDry rub can be made 1 month ahead; store airtight at room temperature."
    ],
    "ingredients": [
        "1/4 large white onion",
        "2 jalapeños",
        "1/4 cup chopped cilantro",
        "1/4 cup finely chopped unsalted, roasted pumpkin seeds (pepitas)",
        "1/4 cup olive oil",
        "3 tablespoons fresh lime juice",
        "Kosher salt",
        "1 1/4 pounds boneless pork shoulder (Boston butt)",
        "2 tablespoons light brown sugar",
        "2 tablespoons mustard powder",
        "2 tablespoons paprika",
        "2 teaspoons garlic powder",
        "1 teaspoon freshly ground black pepper",
        "1/2 teaspoon cayenne pepper",
        "Vegetable oil (for grill)",
        "Kosher salt",
        "8 (8–12-inch-long) metal skewers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Skewer",
        "Pork",
        "Grill",
        "Grill/Barbecue",
        "Summer",
        "Chile Pepper",
        "Salsa",
        "Cilantro",
        "Seed",
        "Lime Juice",
        "Labor Day"
    ],
    "title": "Barbecue Pork Kebabs With Blistered-Chile–Pumpkin Seed Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/barbecue-pork-kebabs-with-blistered-chile-pumpkin-seed-salsa"
}
