{
    "directions": [
        "Remove tough stems from mushrooms and brush with damp towel to clean, Slice mushrooms. Chop chicken into small pieces.",
        "Preheat a large skillet or wok to high.",
        "Add oil to hot pan. Add chicken to the pan and sear meat by stir frying a minute or 2. Add mushrooms and cook another minute or two. Add salt and pepper to season, then garlic and ginger. Cook a minute more. Grate zest into pan, add bell pepper bits, chopped water chestnuts and scallions. Cook another minute, continuing to stir fry mixture. Add hoisin Chinese barbecue sauce and toss to coat the mixture evenly. Transfer the hot chopped barbecued chicken to serving platter and pile the quartered wedges of crisp iceberg lettuce along side. Add wedged oranges to platter to garnish. To eat, pile spoonfuls into lettuce leaves, wrapping lettuce around fillings and squeeze an orange wedge over."
    ],
    "ingredients": [
        "2 cups, 4 handfuls, fresh shiitake mushrooms",
        "1 1/3 to 1 1/2 pounds thin cut chicken breast or chicken tenders",
        "2 tablespoons light colored oil, such as vegetable oil or peanut oil",
        "Coarse salt and coarse black pepper",
        "3 cloves garlic, chopped",
        "1 inch ginger root, finely chopped or grated, optional",
        "1 orange, zested",
        "1/2 red bell pepper, diced small",
        "1 small tin, 6 to 8 ounces, sliced water chestnuts, drained and chopped",
        "3 scallions, chopped",
        "3 tablespoons hoisin, Chinese barbecue sauce, available on Asian foods aisle of market",
        "1/2 large head iceberg lettuce, core removed, head quartered",
        "Wedges of navel orange -- platter garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Appetizer",
        "Appetizer",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Asian Appetizer",
        "Asian",
        "Wok Recipes",
        "Chinese Recipes",
        "Vegetable",
        "Water Chestnut Recipes",
        "Mushroom",
        "Lettuce Recipes",
        "Fruit",
        "Orange Recipes",
        "Nut Recipes"
    ],
    "title": "Barbecued Chinese Chicken Lettuce Wraps",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/barbecued-chinese-chicken-lettuce-wraps-recipe"
}
