{
    "directions": [
        "Heat a heavy skillet over medium heat. Place the dried guajillo chiles into the skillet and cook, turning occasionally, until the color changes and the chiles have puffed, about 5 minutes. Set the chiles aside to cool for a moment. Meanwhile, toast the cumin and cloves in the hot skillet until the cumin seeds begin to pop; remove from the pan and set aside. Remove and discard the stems, seeds, and veins of the chiles, and place into a small bowl. Pour the boiling water over top, and cover. Let the chiles soak for 1 hour.",
        "Grind the toasted cumin and cloves into a powder, and place into a blender. Add the ancho chile powder, onion, garlic, oregano, thyme, vinegar, and lime juice. Remove the chiles from the soaking water, and place into the blender along with 1/3 cup of the soaking liquid. Cover, and blend until a smooth paste forms.",
        "Place the beef roast into a mixing bowl, and pour the guajillo chile past over top. Coat the roast on all sides with the paste, then cover the bowl with plastic wrap. Marinate in the refrigerator overnight.",
        "Preheat an oven to 325 degrees F (165 degrees C).",
        "Transfer the roast and marinade to a roasting pan, and arrange the bay leaves over top. Cover tightly with aluminum foil. Bake in the preheated oven until the meat is very tender and is easily pulled apart with a fork, about 6 hours. Let stand, covered, at room temperature for 1 hour before discarding the bay leaves and shredding with two forks."
    ],
    "ingredients": [
        "4 dried guajillo chilies",
        "2 teaspoons cumin seeds",
        "1/8 whole cloves",
        "1 cup boiling water",
        "1/2 teaspoon ground ancho chile powder",
        "1 large onion, quartered",
        "6 cloves garlic",
        "2 teaspoons dried oregano",
        "1 teaspoon ground thyme",
        "1/3 cup apple cider vinegar",
        "2 teaspoons lime juice",
        "1 (6 pound) boneless beef chuck roast",
        "2 bay leaves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Barbacoa",
    "url": "http://allrecipes.com/recipe/217410/barbacoa/"
}
