{
    "directions": [
        "Combine first 8 ingredients in very large pot. Bring mixture to simmer, stirring until salt and sugar dissolve. Cool brine completely.",
        "Rinse turkey inside and out. Place turkey in brine, pressing to submerge. Chill overnight, turning turkey twice.",
        "If using charcoal barbecue: Mound charcoal briquettes in barbecue and burn until light gray. Using tongs, carefully divide hot briquettes into 2 piles, 1 pile at each side of barbecue. Sprinkle each pile with generous 1/2 cup hickory chips. Place empty broiler pan between piles. Position grill at least 6 inches above briquettes. Position vents on barbecue so that chips smoke and briquettes burn but do not flame.",
        "If using gas or electric barbecue: Preheat barbecue with all burners on high. Turn off center burner and lower outside burners to medium-low heat. Place generous 1/2 cup hickory chips in each of 2 broiler pans. Set pans over 2 lit burners. Place empty broiler pan over unlit burner. Position grill at least 6 inches above burners.",
        "Remove turkey from brine; discard brine. Pat turkey dry with paper towels. Place orange wedges in main cavity. Mix olive oil and sesame oil in small bowl. Brush over turkey. Arrange breast side up on grill, centering above empty broiler pan. Cover; cook until thermometer inserted into thickest part of thigh registers 160°F, adding 1 cup hickory chips (and 6 briquettes if using charcoal barbecue) to barbecue every 30 minutes, about 3 hours.",
        "Bring all ingredients to simmer in heavy medium saucepan.",
        "Brush glaze over turkey; cover and cook until thermometer inserted into thickest part of thigh registers 180°F, covering any dark areas of turkey with foil, about 1 hour longer. Transfer turkey to platter. Tent with foil and let stand 30 minutes."
    ],
    "ingredients": [
        "6 quarts water",
        "2 large onions, quartered",
        "1 cup coarse salt",
        "1 cup chopped fresh ginger",
        "3/4 cup (packed) golden brown sugar",
        "4 large bay leaves",
        "4 whole star anise",
        "12 whole black peppercorns, crushed",
        "1 13- to 14-pound turkey, giblets discarded",
        "4 cups hickory smoke chips, soaked in water 30 minutes, drained",
        "Disposable 9x6 1/4x1-inch aluminum broiler pans",
        "2 large oranges, cut into wedges",
        "1/4 cup olive oil",
        "2 tablespoons oriental sesame oil",
        "3/4 cup pure maple syrup",
        "1/2 cup dry white wine",
        "1/3 cup Dijon mustard",
        "2 tablespoons (1/4 stick) butter",
        "Serve accompanied by Winter Fruit Chutney"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Herb",
        "Mustard",
        "Onion",
        "turkey",
        "Thanksgiving",
        "Fall",
        "Brine",
        "Grill/Barbecue"
    ],
    "title": "Barbecued Turkey with Maple-Mustard Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/barbecued-turkey-with-maple-mustard-glaze-4366"
}
