{
    "directions": [
        "Mix first 5 ingredients in small bowl to blend.",
        "Transfer 1 tablespoon dry rub to another small bowl and reserve for mop. Spread remaining dry rub all over brisket. Cover with plastic; chill overnight.",
        "Mix first 6 ingredients plus reserved dry rub in heavy medium saucepan. Stir over low heat 5 minutes. Pour 1/2 cup mop into bowl; cover and chill for use in sauce. Cover and chill remaining mop.",
        "Following manufacturer's instructions and using natural lump charcoal, start fire in smoker. When charcoal is ash gray, drain 1/2 cup wood chips and scatter over charcoal. Bring smoker to 200°F. to 225°F., regulating temperature by opening vents wider to increase temperature and closing slightly to reduce temperature.",
        "Place brisket, fat side up, on rack in smoker. Cover; cook until tender when pierced with fork and meat thermometer inserted into center registers 185°F., about 10 hours (turn brisket over for last 30 minutes). Every 1 1/2 to 2 hours, add enough charcoal to maintain single layer and to maintain 200°F. to 225°F. temperature; add 1/2 cup drained wood chips. Brush brisket with chilled mop in pan each time smoker is opened. Transfer brisket to platter; let stand 15 minutes. (Can be made 1 day ahead. Cool 1 hour. Wrap in foil; chill. Before continuing, rewarm brisket, still wrapped, in 350°F. oven about 45 minutes.) Combine barbecue sauce and chili powder in heavy small saucepan. Add any accumulated juices from brisket and bring to boil, thinning sauce with some of reserved 1/2 cup mop, if desired.",
        "Thinly slice brisket across grain. Serve, passing sauce separately."
    ],
    "ingredients": [
        "1/2 cup paprika",
        "3 tablespoons ground black pepper",
        "3 tablespoons coarse salt",
        "3 tablespoons sugar",
        "2 tablespoons chili powder",
        "1 7 1/2- to 8-pound untrimmed whole beef brisket",
        "12 ounces beer",
        "1/2 cup cider vinegar",
        "1/2 cup water",
        "1/4 cup vegetable oil",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons minced jalapeño chilies",
        "5 pounds (about) 100% natural lump charcoal",
        "4 cups (about) oak or hickory wood smoke chips, soaked in cold water at least 30 minutes",
        "1 cup purchased barbecue sauce (such as Bull's-Eye)",
        "1 tablespoon chili powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Summer",
        "Chill",
        "Grill/Barbecue"
    ],
    "title": "Barbecued Texas Beef Brisket",
    "url": "http://www.epicurious.com/recipes/food/views/barbecued-texas-beef-brisket-101806"
}
