{
    "directions": [
        "Preheat the oven to 200°F.",
        "Combine the chicken and barbecue sauce in a medium bowl, season to taste with salt and pepper, and toss gently to coat.",
        "In a separate medium bowl, combine the chickpeas and the reserved liquid, garlic, and scallions and mash the ingredients together with a potato masher, leaving the mixture slightly chunky. Season to taste with salt and pepper and stir to combine.",
        "To assemble the quesadillas, lay the tortillas on a flat work surface and spread the chickpea mixture over half of each tortilla, dividing it evenly. Top with the chicken and sprinkle each with a few cilantro leaves and the cheeses. Fold the tortillas in half to form half-moons.",
        "Lightly grease a grill pan or cast-iron skillet with olive oil and heat it over medium-high heat until it's hot. Place two of the quesadillas in the skillet to grill for about 2 minutes per side, turning once, until the cheese is melted and the tortillas are golden brown. Transfer the quesadillas to a baking sheet and place them in the oven to keep them warm. Repeat the process with the remaining quesadillas, adding more oil to the pan if it's dry. Cut the quesadillas into wedges and serve warm."
    ],
    "ingredients": [
        "2 cups shredded cooked chicken",
        "1/2 cup bottled barbecue sauce",
        "Sea salt and freshly ground black pepper",
        "1 15-ounce can chickpeas (about 2 cups), drained but not rinsed, 2 tablespoons liquid reserved",
        "2 garlic cloves, minced",
        "2 scallions, minced (white and green parts)",
        "8 7-inch flour tortillas",
        "1/2 cup fresh cilantro leaves",
        "2 ounces smoked Gouda cheese, shredded (about 1/2 cup)",
        "2 ounces Monterey Jack cheese, shredded (about 1/2 cup)",
        "Olive oil for oiling the grill pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chicken",
        "Poultry",
        "Appetizer",
        "Super Bowl",
        "Kid-Friendly",
        "Graduation",
        "Backyard BBQ",
        "Lunch",
        "Legume",
        "Chickpea",
        "Summer",
        "Monterey Jack",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Barbecued Chicken and Chickpea Quesadillas",
    "url": "http://www.epicurious.com/recipes/food/views/barbecued-chicken-and-chickpea-quesadillas-363314"
}
