{
    "directions": [
        "Mix all the ingredients together into a paste in a small bowl and rub it all over the lamb. Place the lamb in a shallow bowl and cover with any remaining marinade. Marinate for about 2 hours at room temperature, or, preferably, cover the lamb and marinate overnight in the refrigerator, turning the meat from time to time.",
        "To grill lamb chops: Depending on their thickness, grill the chops over medium-hot coals for 3 to 5 minutes per side, turning once or twice. The chops should register 120° to 135°F at the thickest part for rare to medium rare. You can also broil them 3 inches from the flame for 3 to 5 minutes per side, or until cooked as above.",
        "To grill kebabs: Skewer the marinated lamb chunks on wooden or metal skewers, alternating with chunks of onions or peppers, if desired. Grill until the meat reaches 130° to 135°F for medium-rare to medium.",
        "To grill a lamb leg: You may want to insert long metal skewers crosswise in the butterflied leg to hold it flat. Grill the leg over medium-hot coals, turning often, for 20 to 30 minutes. At its thickest point, the meat should register 120° to 130°F for rare to medium-rare; thinner parts will them be medium-rare to medium. Let the lamb rest, covered loosely with foil, for 5 to 10 minutes before slicing on the diagonal and serving. The internal temperature will rise 5° to 10°F more.",
        "Meanwhile make theSkordalia . Serve with the lamb."
    ],
    "ingredients": [
        "1/3 cup olive oil",
        "juice of 2 lemons",
        "1/4 cup dried oregano, preferably Greek, or 1/2 cup chopped fresh",
        "6 garlic cloves, chopped",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "3 1/2-4 1/2 pounds lamb loin or rib chops, 3/4-1 1/4 inch thick, trimmed, OR 4 pounds lamb for kebabs cut into 1 1/2-inch chunks, OR a 3 1/2- to 4 1/2-pound leg of lamb, fat trimmed and butterflied",
        "1 large onion, cut into 1-inch pieces",
        "1 red or green bell pepper, cut into 1-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Onion",
        "Pepper",
        "Marinate",
        "Backyard BBQ",
        "Lemon",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Oregano"
    ],
    "title": "Barba Yianni's Grilled Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/barba-yiannis-grilled-lamb-15842"
}
