{
    "directions": [
        "Mix paprika, savory, cumin, mustard powder, cayenne, and 1/4 cup brown sugar in a small bowl. Transfer 3 Tbsp. spice mixture to a medium bowl; mix in salt and remaining 3 Tbsp. brown sugar. Set remaining mixture aside for the next day. Cover turkey with dry brine, packing on until you've used it all. Chill on a rimmed baking sheet uncovered 8–12 hours.",
        "Thoroughly rinse turkey to remove brine; pat dry. Rub with reserved spice mixture and let sit 2 hours to bring to room temperature.",
        "Prepare grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off) and lightly oil grates. If using wood chips: Scatter over coals, if using a charcoal grill; place in a disposable foil pan and set over lit burner, if using a gas grill.",
        "Place turkey, skin side up, over indirect heat, breast halves facing each other, with legs closest to direct heat. Place oven thermometer in center of indirect heat zone; cover. Grill 20 minutes, then rotate halves so neck end is closest to coals. Check temperature inside grill; thermometer should register 325ºF (open or close vents as needed). Continue to grill turkey, checking for doneness after 20 minutes, then again every 10 minutes, until an instant-read thermometer inserted into thickest part of breast registers 150ºF, about 1 hour total.",
        "If desired, carefully move turkey over direct heat and turn skin side down. Grill to lightly char skin, about 2 minutes. Transfer to a platter and let rest at least 30 minutes before carving."
    ],
    "ingredients": [
        "2 tablespoons hot smoked paprika",
        "1 tablespoon dried savory",
        "1 tablespoon ground cumin",
        "1 tablespoon mustard powder",
        "1 teaspoon cayenne pepper",
        "1/4 cup (packed) plus 3 tablespoons light brown sugar",
        "1/2 cup kosher salt",
        "1 (12-14 pound) turkey, halved (backbone removed, breastbone split)",
        "Vegetable oil (for grill)",
        "A disposable foil pan and 1 cup wood chips soaked in water at least 1 hour (optional); oven thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Grill",
        "Thanksgiving",
        "Dinner",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher",
        "turkey"
    ],
    "title": "Barbecue Spice-Brined Grilled Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/barbecue-spice-brined-grilled-turkey"
}
