{
    "directions": [
        "Dredge the oxtails in the flour, shaking off the excess. In a heavy kettle heat 4 tablespoon of the oil over moderately high heat until it is hot but not smoking and in it brown the oxtails in batches, transferring them with a slotted spoon as they are browned to a plate. To the kettle add the remaining 2 tablespoon oil, in it cook the onion, the garlic, and the gingerroot over moderately low heat, stirring, until the onion is softened, and stir in the brown sugar, the ketchup, the mustard, the vinegar, the Worcestershire sauce, the lemon juice, the Tabasco, the cayenne, the tomatoes with the reserved juice, and salt and pepper to taste. Simmer the sauce, stirring occasionally, for 5 minutes, add the oxtails, and simmer the mixture, covered, stirring occasionally, for 2 1/2 hours.",
        "While the oxtails are cooking, in a large saucepan combine the beans with enough cold water to cover them by 2 inches, bring the liquid to a boil, and simmer the beans, covered, for 1 hour, or until they are tender. Drain the beans well and stir them into the oxtail mixture. Simmer the mixture, uncovered, stirring occasionally, for 30 minutes to 1 hour, or until the meat is very tender, and serve it sprinkle with the scallion greens.",
        "In a colander rinse the beans under cold water and discard any discolored ones. In a kettle combine the beans with enough cold water to cover them by 2 inches, bring the water to a boil, and boil the beans for 2 minutes. Remove the kettle from the heat and let the beans soak, covered, for 1 hour."
    ],
    "ingredients": [
        "6 pounds oxtails, trimmed",
        "seasoned flour for dredging the oxtails",
        "6 tablespoons vegetables oil",
        "3 cups finely chopped onion",
        "3 large garlic cloves, minced",
        "1 tablespoon grated peeled fresh gingerroot",
        "2/3 cup firmly packed light brown sugar",
        "1 1/2 cups ketchup",
        "3 tablespoons Dijon-style mustard",
        "1 cup cider vinegar",
        "1/4 cup Worcestershire sauce",
        "1/4 cup lemon juice",
        "Tabasco to taste",
        "cayenne to taste",
        "a 28-ounce can Italian tomatoes, drained, reserving the juice, and chopped",
        "1 pound dried small red chili beans, soaked in enough cold water to cover them by 2 inches overnight or quick-soaked (procedure follows) and drained",
        "chopped scallion greens for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Beef",
        "Onion",
        "Tomato",
        "Braise",
        "Fall",
        "Gourmet"
    ],
    "title": "Barbecue-Braised Oxtail with Red Chili Beans",
    "url": "http://www.epicurious.com/recipes/food/views/barbecue-braised-oxtail-with-red-chili-beans-11487"
}
