{
    "directions": [
        "Combine all ingredients except ribs in heavy medium saucepan. Bring to boil. Cool marinade completely. Place ribs in large heavy-duty resealable plastic bag; add marinade. Seal bag; turn to coat ribs. Refrigerate overnight, turning bag occasionally.",
        "Heat oil in heavy large saucepan over medium-high heat. Add onion and sauté until golden brown, about 6 minutes. Add vinegar and boil until mixture is reduced to 3/4 cup, about 5 minutes. Remove from heat. Add ketchup, molasses, and 1/4 cup water, then bourbon; stir to blend. Bring sauce to simmer. Stir in salt and white pepper. Simmer 10 minutes to blend flavors. Stir in thyme leaves. (Sauce can be prepared 1 day ahead. Cover and refrigerate.)",
        "Place handful of torn newspaper in bottom of charcoal chimney. Top with 30 charcoal briquettes. Remove top grill rack from barbecue. Place chimney on bottom rack. Light newspaper; let charcoal burn until ash is gray, about 30 minutes.",
        "Open bottom barbecue vent. Turn out hot charcoal onto 1 side of bottom rack. Using metal spatula, move charcoal to cover approximately 1/3 of rack at 1 side. Fill foil loaf pan halfway with water; place opposite charcoal on bottom rack.",
        "Return top rack to barbecue. Arrange ribs on top rack above water in loaf pan. Cover barbecue with lid, positioning top vent directly over ribs. Insert stem of candy thermometer through top vent, with gauge outside and tip near ribs (thermometer should not touch meat or barbecue rack); leave thermometer in place during cooking. Use top and bottom vents to maintain temperature between 250°F and 300°F, opening vents wider to increase heat and closing to decrease heat. Leave other vents closed. Check temperature every 10 minutes.",
        "Cook ribs until meat is very tender when pierced with knife, turning ribs occasionally and basting often with sauce the last 10 minutes of cooking, about 3 hours total. Open barbecue only when necessary to turn or baste meat and close quickly to minimize loss of heat and smoke.",
        "After first 30 minutes of cooking, use technique described earlier to light additional 15 charcoal briquettes in charcoal chimney set atop nonflammable surface. If cooking temperature drops below 250°F, use oven mitts to lift off top rack with ribs and place on heatproof surface. Using tongs, add half of hot gray charcoal from chimney to bottom rack. Replace top rack on barbecue, placing ribs above water in loaf pan. Cover with lid.",
        "Transfer ribs to plates; brush with more sauce and serve, passing any remaining sauce separately."
    ],
    "ingredients": [
        "1 1/2 cups water",
        "1 12-ounce bottle pale ale",
        "1/4 cup mild-flavored (light) molasses",
        "5 fresh thyme sprigs",
        "1 tablespoon sugar",
        "1 tablespoon salt",
        "1 bay leaf",
        "1/2 teaspoon ground white pepper",
        "16 beef short ribs or 8 whole beef ribs",
        "1 tablespoon vegetable oil",
        "1 small onion, finely chopped",
        "1 cup red wine vinegar",
        "2 cups ketchup",
        "1/2 cup mild-flavored (light) molasses",
        "1/4 cup water",
        "1/2 cup bourbon",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon ground white pepper",
        "Leaves from 5 fresh thyme sprigs",
        "Charcoal chimney",
        "45 charcoal briquettes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Beef",
        "Backyard BBQ",
        "Summer",
        "Tailgating",
        "Grill/Barbecue",
        "Molasses"
    ],
    "title": "Barbecued Beef Ribs with Molasses-Bourbon Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/barbecued-beef-ribs-with-molasses-bourbon-sauce-108294"
}
