{
    "directions": [
        "Preheat oven to 350°F.",
        "Trim any fat from pork and pat pork dry. In a bowl stir together remaining barbecued pork loin ingredients. Add pork to barbecue sauce, turning it to coat.",
        "In a small baking pan lined with foil roast pork 25 minutes, or until a meat thermometer inserted at least 2 inches into pork registers 155°F. Cool pork completely. Pork may be roasted 2 days ahead and chilled in a sealable plastic bag.",
        "Cut pork into 1/4-inch-thick slices and cut slices into 1/2-inch squares. Cut leeks crosswise into thin slices and in a bowl soak in water to cover, separating slices into rings and agitating occasionally to dislodge any grit, 5 minutes. Lift leeks from water and drain in a colander. Trim snow peas and halve diagonally.",
        "In a small bowl stir together seasoning liquid ingredients.",
        "Spread rice in a shallow baking pan and separate grains with a fork.",
        "In a deep 12-inch heavy non-stick skillet heat oil over moderately high heat until hot but not smoking and stir-fry leeks and gingerroot 1 1/2 minutes, or until leeks begin to soften. Add snow peas and toss to coat. Add rice wine or sake and stir-fry until snow peas are crisp-tender. Add rice and pork and cook, stirring frequently, 2 to 3 minutes, or until heated through. Stir seasoning liquid and add to fried rice, tossing to coat evenly."
    ],
    "ingredients": [
        "a 1-pound piece center-cut boneless pork loin",
        "1/4 cup hoisin sauce",
        "1 tablespoon soy sauce",
        "1 tablespoon minced garlic",
        "1 1/2 teaspoons ketchup",
        "1/4 teaspoon Chinese five-spice powder",
        "4 medium leeks (white and pale green parts only)",
        "1/2 pound snow peas",
        "3 1/2 tablespoons soy sauce",
        "1 tablespoon chicken broth",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "5 cups chilledChinese-style white or brown rice",
        "1 1/2 tablespoons corn or safflower oil",
        "1 tablespoon minced peeled fresh gingerroot",
        "1 1/2 tablespoons Chinese rice wine or sake"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pork",
        "Rice",
        "Side",
        "Stir-Fry",
        "Spring",
        "Soy Sauce",
        "Sugar Snap Pea",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Barbecued Pork Fried Rice",
    "url": "http://www.epicurious.com/recipes/food/views/barbecued-pork-fried-rice-101080"
}
