{
    "directions": [
        "To make the pickled fennel, sterilize a large mason jar. Remove the lid and put it and the jar in a large saucepan of water over high heat. Bring to the boil and let it sit for 10 to15 minutes. Put the jar and the lid on a clean tea towel to dry.",
        "Put the vinegar, 1 cup water, sugar, cloves, and fennel seeds in a large saucepan over medium heat. Bring to a simmer, reduce the heat to low and stir to dissolve the sugar. Add the fennel to the saucepan with the pickling liquid and bring it back to a simmer. Cook for 7 to 8 minutes, or until the fennel is tender.",
        "Transfer the fennel and liquid to the sterilized jar. Tap the jar as you pour in the liquid to release any air bubbles. Seal the jar well with its lid.",
        "Fill a medium saucepan with water over high heat. Put the jar in the boiling water, turn the heat off and allow it to sit there for 20 minutes, to create a vacuum seal. Set aside the jar on a cloth to cool down completely.",
        "Meanwhile, make the spice mixture for the brisket. Use a mortar and pestle or food processor to grind or process the garlic powder, coriander, paprika, brown sugar, black pepper and sea salt to a coarse powder.",
        "Rub some of the spice mixture into the brisket on all sides, put in a ziplock bag or covered baking dish and add the remaining spice mixture. Put in the fridge and marinate for at least 5 hours or overnight.",
        "Preheat the barbecue to high. Take the brisket out of the ziplock bag. The dry spice mixture will have drawn moisture from the meat, so give it a light wipe before placing it on the barbecue. Cook for 30 minutes, turning every 5 minutes, to create a beautifully dark colour and crust.",
        "Reduce the heat to low and cook for 2 1/2 hours, turning every 30 minutes and brushing with the remaining spice mixture every 10 to 20 minutes. Remove the brisket from the heat, wrap in foil and allow to rest for 20 minutes before slicing.",
        "I like to serve this brisket on a massive platter with the pickled fennel, a few brioche slider buns, slaw, lemon wedges and aïoli."
    ],
    "ingredients": [
        "1 cup (250 ml) apple cider vinegar",
        "1/2 cup (110 g) white sugar",
        "5 whole cloves",
        "1 teaspoon fennel seeds",
        "1 bulb fennel, trimmed and sliced",
        "3 teaspoons garlic powder",
        "3 teaspoons ground coriander",
        "2 tablespoons smoked paprika",
        "4 tablespoons dark brown sugar",
        "5 tablespoons whole black peppercorns",
        "3/4 cup (100 g) sea salt",
        "6 lb 10 oz beef brisket",
        "Brioche slider buns, to serve",
        "Apple Slaw, to serve",
        "Lemon wedges, to serve",
        "Aïoli, to serve"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Beef",
        "Dinner",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Brisket",
        "Spice",
        "Fennel",
        "Pickles",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Barbecue Brisket With Pickled Fennel",
    "url": "http://www.epicurious.com/recipes/food/views/barbecue-brisket-with-pickled-fennel"
}
