{
    "directions": [
        "Place the button mushrooms in a pan, cover with 8 cups of the water, and bring to a boil. Lower the heat to a simmer and cook for 3 hours.",
        "Strain the stock through a fine-mesh strainer, pressing on the mushrooms to release the liquid. You should have at least 2 cups mushroom stock. Season to taste with salt and pepper. Pour into a saucepan and set aside. (The stock can be made in advance and refrigerated for up to 3 days, or frozen for up to a month.)",
        "Trim the gyromitre or morel mushrooms, discarding the stems, and halve them. Because these mushrooms can be particularly sandy, soak them in cold water to remove any dirt. Lift out of the water, rinse, and repeat two more times.",
        "Heat the canola oil in a large sauté pan over high heat. Add the mushrooms, shallots, and garlic, season with salt and pepper, and sauté until the mushrooms are tender and have given up their liquid, but are not dry, 10 to 15 minutes. Add 3 tablespoons of the butter and the parsley and toss to incorporate. Set the pan aside.",
        "Bring the milk, the remaining 2 cups water, and 4 tablespoons of the butter to a boil in a medium saucepan. Lower the heat to a simmer. Whisking constantly, slowly add the polenta, continuing to whisk until the polenta is completely incorporated. Cook for 5 minutes. The polenta will be very thin. Add the Parmesan and stir to incorporate. Set the pan aside.",
        "Cut the salmon crosswise into 1-inch slices. Pull the ends of each side together, as if you were closing a book, and secure with a toothpick. In a flameproof shallow casserole large enough to accommodate all the salmon fillets, bring 1/4 inch of generously salted water to a simmer. Season each fillet on both sides with salt and pepper and add to the casserole. Gently poach for 3 to 5 minutes, until the salmon is warm to the touch on top, but still quite rare on top and inside.",
        "Meanwhile, gently reheat the mushroom broth, the wild mushrooms, and polenta. If the mushrooms are dry, add another tablespoon of butter and a bit of water to moisten.",
        "To serve, spoon a circle of polenta into the center of each plate. Spoon 1/4 cup of the mushroom broth around each polenta circle. Place 2 salmon fillets on each bed of polenta and spoon the mushrooms over the salmon. Serve immediately."
    ],
    "ingredients": [
        "1 pound button mushrooms",
        "10 cups water",
        "Fine sea salt and freshly ground white pepper",
        "1 pound gyromitre or morel mushrooms (see Note)",
        "1 tablespoon canola oil",
        "1 tablespoon chopped shallots",
        "1 tablespoon chopped garlic",
        "7 to 8 tablespoons (1 stick) butter",
        "1 tablespoon chopped flat-leaf parsley",
        "2 cups milk",
        "1/3 cup instant polenta",
        "1/2 cup freshly grated Parmesan",
        "One 2 1/2-pound salmon fillet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Mushroom",
        "Poach",
        "Sauté",
        "Quick & Easy",
        "Parmesan",
        "Cornmeal",
        "Salmon"
    ],
    "title": "Barely Cooked Salmon with Parmesan Polenta and Mushroom Consommé",
    "url": "http://www.epicurious.com/recipes/food/views/barely-cooked-salmon-with-parmesan-polenta-and-mushroom-consomme-231565"
}
