{
    "directions": [
        "Preheat the oven to 425 degrees F.",
        "Toss the carrot, celery root, and butternut squash with 2 tablespoons of the olive oil and the salt on a baking sheet and spread out in an even layer. Roast until golden and tender, about 25 minutes.",
        "Combine the chicken broth and thyme in a small saucepan and bring to a simmer.",
        "Heat the remaining 2 tablespoons olive oil in the saucepan over medium-high heat. Add the barley, onion and garlic, and cook, stirring occasionally, until the vegetables soften a bit, about 5 minutes. Pour in the wine, and cook, stirring constantly, until the liquid is absorbed. Add 2 cups of the broth, reduce the heat to medium-low, and simmer until the liquid is absorbed, stirring frequently. Add the remaining broth and simmer, stirring occasionally, until the barley is tender but still slightly firm and the mixture is still soupy, about 30 minutes. Add the roasted vegetables and cook until the vegetables are heated through. Stir the mustard greens into the risotto, then let the mixture sit until the greens wilt, about 3 minutes. If the risotto thickens up too much, thin it out with a little hot water. Season with salt and pepper. Serve immediately. Pass grated cheese at the table."
    ],
    "ingredients": [
        "4 cups chicken or vegetable broth, homemade or low-sodium canned",
        "2 sprigs fresh thyme",
        "1 medium carrot, sliced",
        "1 small celery root (about 1/2 pound), peeled and cut into 3/4-inch chunks",
        "1/2 small butternut squash, halved, peeled, seeded, and cut into 3/4-inch chunks",
        "4 tablespoons extra-virgin olive oil",
        "1 teaspoon kosher salt, plus additional for seasoning",
        "1 cup pearl barley",
        "1/2 medium onion, chopped",
        "2 cloves garlic, smashed",
        "1/2 cup dry white wine",
        "4 to 5 cups torn mustard greens (1 small bunch)",
        "Freshly ground black pepper",
        "1 cup freshly grated Parmesan, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Italian",
        "Risotto Recipes",
        "Barley",
        "Grain Recipes",
        "Celery",
        "Vegetable",
        "Carrot Recipes",
        "Cheese",
        "Butternut Squash",
        "Main Dish Recipes",
        "Appetizer",
        "Dinner Parties",
        "Recipes for Parties",
        "Roasting",
        "Sauteing Recipes"
    ],
    "title": "Barley Risotto with Roasted Winter Vegetables",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/barley-risotto-with-roasted-winter-vegetables-recipe"
}
