{
    "directions": [
        "In a small bowl let the mushrooms soak in the warm water. In a heavy saucepan cook the onions in the butter over moderately low heat, stirring occasionally, for 15 minutes, or until they are soft. Strain the mushrooms through a fine sieve into a bowl, reserving the liquid, and chop them into 1/4-inch pieces.",
        "Stir the barley into the onion mixture, coating it well, add the mushrooms, 1/2 cup of the reserved mushroom liquid, and 1/2 cup of the broth, and cook the mixture over moderate heat, stirring, for 5 minutes, or until almost all the liquid is absorbed. Add the remaining 1/2 cup broth and 1/2 cup of the remaining reserved mushroom liquid and cook the mixture, stirring, for 5 minutes, or until the liquid is absorbed. Stir in the remaining mushroom liquid and the salt and cook the mixture, adding up to 1/2 cup additional water if it is too dry, for 12 minutes, or until the barley is tender. Transfer the barley mixture to a jelly-roll pan and let it cool completely.",
        "Butter an 8-inch round cake pan (2 inches deep) and coat it with the bread crumbs, knocking out any excess. In a bowl stir together the Fontina, the whole egg, the egg yolk and the barley mixture gently but thoroughly and spoon the mixture into the prepared pan, pressing it down and smoothing the top. Cover the pan tightly with foil, bake the torte in a preheated 400°F. oven for 40 minutes, or until it is set, and let it cool in the pan on a rack for 10 minutes. Invert the torte onto a serving plate and serve it warm, cut into wedges."
    ],
    "ingredients": [
        "a 1/4-ounce package dried mushrooms (available at most supermarkets)",
        "2 cups warm water",
        "2 small onions, diced",
        "3 tablespoons unsalted butter",
        "1 cup pearl barley",
        "1 cup chicken broth",
        "3/4 teaspoon salt",
        "1/4 cup fine dry bread crumbs",
        "1/2 cup coarsely grated Fontina (about 1/4 pound)",
        "1 large whole egg, beaten lightly",
        "1 large egg yolk, beaten lightly"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Side",
        "Bake",
        "Barley",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Barley Torte",
    "url": "http://www.epicurious.com/recipes/food/views/barley-torte-11134"
}
