{
    "directions": [
        "In a large, heavy pot over medium-high heat, melt the butter with the 2 Tbs. olive oil. Add the leeks and garlic and sauté until very soft, about 5 minutes. Add the mushrooms and cook, stirring often, until they begin to soften, about 5 minutes. Add the tomato paste and wine, stir to combine and cook for 4 minutes. Add the barley and the 8 cups broth and bring to a boil. Reduce the heat to low, cover and simmer until the barley is tender, about 45 minutes",
        "Meanwhile, preheat an oven to 375°F (190°C). Oil a baking sheet.",
        "In a bowl, combine the ground chicken, cheese, bread crumbs, the 2 Tbs. parsley and the tomato paste. Add the 1 tsp. salt and the 1/2 tsp. pepper and stir to combine. The mixture will be very sticky. To form the meatballs, use 2 small spoons to scoop up the mixture and transfer it to the prepared baking sheet. Transfer to the oven and cook until the meatballs are cooked through and no longer pink in the center, 10 to 12 minutes.",
        "Add the meatballs to the soup and stir in gently. If the soup is too thick, add more broth and heat through. Season with salt and pepper and serve immediately, garnished with the 1/2 cup parsley. Serves 8 to 10.",
        "Adapted from Williams-Sonoma",
        "Soup of the Day,",
        "by Kate McMillan (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "1 Tbs. unsalted butter",
        "2 Tbs. olive oil, plus more for baking sheet",
        "3 leeks, white and light green portions, chopped",
        "3 garlic cloves, minced",
        "1/2 lb. (250 g) cremini mushrooms, sliced",
        "2 Tbs. tomato paste",
        "1/4 cup (2 fl. oz./60 ml) dry white wine",
        "2 cups (12 oz./375 g) pearl barley",
        "8 cups (64 fl. oz./2 l) chicken broth, plus more as needed",
        "1 lb. (500 g) ground chicken",
        "1/2 cup (2 oz./60 g) grated Parmigiano-Reggiano cheese",
        "1/4 cup (1 oz./30 g) plain dried bread crumbs",
        "2 Tbs. minced fresh flat-leaf parsley, plus 1/2 cup (3/4 oz./20 g)\n  chopped parsley",
        "1 Tbs. tomato paste",
        "1 tsp. salt, plus more, to taste",
        "1/2 tsp. freshly ground pepper, plus more, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Barley-Leek Soup with Mini Chicken Meatballs",
    "url": "http://www.williams-sonoma.com/recipe/barley-leek-soup-with-mini-chicken-meatball.html"
}
