{
    "directions": [
        "Slice the mushrooms, grate the parmesan, dice the mozzarella, chop the parsley, halve and seed the bell peppers.",
        "Cook the barley according to the package instructions. Transfer the barley to a bowl and set aside.",
        "Preheat the oven to 350°F and make sure the oven rack is positioned in the center.",
        "In a large sauté pan, heat 1 tablespoon of the olive oil over medium-high heat. When the oil is hot and rippling, add half the mushrooms and season with a pinch of salt and a crack of black pepper. Do not touch the pan!",
        "After 3 to 4 minutes, use tongs to flip one mushroom. If it's not browned to your liking, give them another minute or two. When they're ready, flip all the mushrooms and cook for another 2 to 3 minutes.",
        "Add the cooked mushrooms to the bowl with the barley and repeat with the remaining mushrooms.",
        "Add the Parmesan and mozzarella cheeses and the parsley to the bowl and stir to combine.",
        "Line the pepper halves cut side up on a baking sheet and season each with a pinch of kosher salt.",
        "Use a large spoon to divide the barley filling evenly among the pepper halves.",
        "Place the baking sheet in the oven and bake until the filling is hot in the center and the peppers are tender, about 20 minutes.",
        "Sprinkle the peppers with the bread crumbs and bake for 5 to 10 minutes more, or until the bread crumbs are golden brown."
    ],
    "ingredients": [
        "3/4 cup uncooked barley, or 2 cups cooked barley or other grain",
        "2 tablespoons olive oil",
        "2 cups sliced cremini mushrooms",
        "Kosher salt and freshly cracked black pepper",
        "freshly cracked black pepper",
        "1/2 cup grated Parmesan cheese",
        "1 cup small-diced fresh mozzarella",
        "1/4 cup chopped fresh parsley",
        "1 yellow bell pepper, halved lengthwise and seeded",
        "1 red bell pepper, halved lengthwise and seeded",
        "1 cup bread crumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pepper",
        "Kid-Friendly",
        "Dinner",
        "Mozzarella",
        "Barley",
        "Healthy",
        "HarperCollins"
    ],
    "title": "Barley-Stuffed Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/barley-stuffed-peppers-56390145"
}
