{
    "directions": [
        "Preheat oven to 350°F. Cook barley in a large pot of boiling salted water until tender, 15–20 minutes for pearl, 35–40 for hulled or hull-less. Drain and spread out on a rimmed baking sheet; let cool.",
        "Meanwhile, toss breadcrumbs with 1 tablespoon oil on another rimmed baking sheet; season with salt. Bake, tossing once, until golden brown, 10–12 minutes; let cool.",
        "Bring milk to a simmer in a medium saucepan over medium-high heat; season with salt. Add cauliflower and cook until just softened, about 3 minutes; drain well. Discard milk.",
        "Toss cauliflower, barley, breadcrumbs, shallot, celery hearts, celery leaves, parsley, parsley stems, lemon zest, lemon juice, and vinegar in a bowl; season salad with salt.",
        "Mix burrata and crème fraîche in a medium bowl; season with salt. Divide burrata mixture among plates, drizzle with oil, and top with barley salad; season with pepper.",
        "DO AHEAD: Barley can be cooked 1 day ahead; cover and chill. Breadcrumbs can be toasted 1 day ahead; store airtight at room temperature."
    ],
    "ingredients": [
        "1/2 cup pearl, hulled, or hull-less barley",
        "Kosher salt",
        "1/4 cup fine fresh breadcrumbs",
        "1 tablespoon extra-virgin olive oil, plus more for drizzling",
        "2 cups whole milk",
        "1 cup finely chopped cauliflower",
        "1 small shallot, finely chopped",
        "1/2 cup finely chopped celery hearts, plus 1/4 cup finely chopped leaves",
        "1/4 cup finely chopped fresh flat-leaf parsley, plus 1/4 cup finely chopped fresh flat-leaf parsley stems",
        "1/2 teaspoon finely grated lemon zest",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon Champagne vinegar or white wine vinegar",
        "8 ounces burrata or fresh mozzarella, torn",
        "1 tablespoon crème fraîche",
        "Coarsely ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Vegetarian",
        "Lunch",
        "Barley",
        "Cauliflower",
        "Healthy",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Barley, Cauliflower, and Herbs with Burrata",
    "url": "http://www.epicurious.com/recipes/food/views/barley-cauliflower-and-herbs-with-burrata-51214480"
}
