{
    "directions": [
        "Preheat oven to 400°F. Spray large rimmed baking sheet with nonstick spray. Arrange tomatoes and next 6 ingredients on sheet. Drizzle with oil; sprinkle with salt and pepper. Roast until vegetables are tender and brown around edges, stirring occasionally, about 55 minutes. Peel garlic and reserve. Coarsely chop half of vegetables and reserve. Transfer garlic and remaining vegetables from sheet to large pot (reserve sheet).",
        "Add 1/2 cup vegetable broth to baking sheet and scrape up browned bits; add to pot with vegetables. Add 7 1/2 cups broth, dried porcini, thyme, and bay leaf to pot. Bring to boil. Reduce heat to medium; cover and simmer until vegetables and porcini are very tender, about 20 minutes. Pour vegetables and broth into large strainer set over bowl. Transfer vegetables in strainer to processor and puree until smooth; set aside.",
        "Return broth and bay leaf to pot; add barley and bring to boil. Reduce heat to medium; cover and simmer until barley is tender, about 40 minutes. Add reserved vegetable puree and chopped vegetables to pot; simmer until soup thickens and flavors blend, about 10 minutes. Season soup to taste with salt and pepper. (Can be made 1 day ahead. Cool soup slightly. Chill soup uncovered until cold, then cover and keep chilled. Rewarm over medium heat, thinning with additional broth if desired before serving.)",
        "Ladle soup into bowls. Sprinkle with parsley and serve.",
        "*Dried porcini mushrooms are available at Italian markets, specialty foods stores, and many supermarkets."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "4 large plum tomatoes (about 1 1/4 pounds), halved lengthwise",
        "3 medium carrots, trimmed, peeled, quartered (about 8 ounces)",
        "6 ounces fresh crimini mushrooms, thickly sliced",
        "1 large onion, cut into 1-inch wedges through root end",
        "1 red bell pepper, quartered",
        "1 medium zucchini, trimmed, halved lengthwise",
        "3 garlic cloves, unpeeled",
        "2 tablespoons olive oil",
        "8 cups (or more) canned vegetable broth",
        "1 1/2-ounce package dried porcini mushrooms,* broken into pieces",
        "3 large fresh thyme sprigs",
        "1 bay leaf",
        "1 cup pearl barley",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Mushroom",
        "Vegetable",
        "Roast",
        "Stew",
        "Low Fat",
        "Vegetarian",
        "Low/No Sugar",
        "Barley",
        "Bell Pepper",
        "Carrot",
        "Winter",
        "Healthy",
        "Vegan"
    ],
    "title": "Barley and Roasted-Vegetable Soup",
    "url": "http://www.epicurious.com/recipes/food/views/barley-and-roasted-vegetable-soup-107687"
}
