{
    "directions": [
        "Slice the mushroom caps and chop the stems. Heat the butter in a skillet and add the chopped onion. Cook for 3 or 4 minutes and add the mushrooms. Cook another 4 minutes, stirring occasionally. Add the barley and brown it lightly, mixing it well with the onions and mushrooms. Season to taste with salt and pepper and pour into a buttered casserole. Add enough boiling broth to cover the mixture and come 1/2\" above it. Cover the casserole tightly and bake in a 350°F. oven for 25 minutes. Taste the barley for doneness. Add more broth, if necessary, and continue cooking until the liquid is absorbed and the barley tender. Serve as an accompaniment to duck, game, goose, squab and other kinds of poultry - wherever you would use wild rice.",
        "Add finely slivered buttered almonds to the barley just before serving.",
        "Cook chicken gizzards in a well-seasoned broth and use the broth to cook the barley. Add the thinly sliced gizzards at the last minute.",
        "Add sautéd chicken livers and some chopped fresh parsley to the barley casserole just before serving.",
        "Substitute 1/2 cup finely chopped green onions for the onion and add 1/4 cup finely chopped celery and 3/4 cup thinly sliced water chestnuts. Season the broth with a few dashes of soy sauce. Serve this oriental version of barley casserole topped with a sprinkling of chopped parsley."
    ],
    "ingredients": [
        "1/2 pound mushrooms",
        "4-5 tablespoons butter",
        "1 large onion, chopped very fine",
        "1 cup pearl barley",
        "Salt, pepper",
        "2-3 cups beef or chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Side",
        "Bake",
        "High Fiber",
        "Casserole/Gratin",
        "Barley",
        "Winter",
        "House & Garden",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Barley Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/barley-casserole-20057"
}
