{
    "directions": [
        "Bring 4 cups water, 2 cups broth, barley, and 1 scant teaspoon sea salt to boil in large pot. Reduce heat to medium-low, cover, and simmer until tender, about 40 minutes.",
        "Meanwhile, heat 2 tablespoons oil in heavy medium skillet over medium-high heat. Add onions, sprinkle with sea salt, and sauté until golden brown, stirring often, about 15 minutes. Add sautéed onions and remaining 6 cups broth to pot with barley. DO AHEAD: Can be made 1 day ahead. Cool, cover, and chill. Rewarm before continuing.",
        "Add kale and chard to soup. Simmer until greens are tender, about 15 minutes. Add spinach, green onions, dill, fennel fronds, and mint; simmer 5 minutes. Add 1 tablespoon lemon juice. Season soup with sea salt, pepper, and additional lemon juice, thinning with more broth, if desired.",
        "Divide soup among bowls. Sprinkle feta cheese over, drizzle with oil, and serve."
    ],
    "ingredients": [
        "4 cups water",
        "8 cups (or more) Light Vegetable Broth or good-quality canned vegetable broth (such as Swanson), divided",
        "1 cup (scant) pearl barley (about 6 ounces), rinsed",
        "1 teaspoon (scant) fine sea salt plus additional for sprinkling",
        "2 tablespoons extra-virgin olive oil plus additional for drizzling",
        "3 cups chopped onions",
        "8 cups coarsely chopped stemmed kale leaves (about one 7-ounce bunch)",
        "6 cups coarsely chopped stemmed chard leaves (about one 7-ounce bunch)",
        "5 cups spinach leaves (about 5 ounces)",
        "3/4 cup sliced green onions",
        "1/2 cup chopped fresh dill",
        "1/2 cup chopped fresh fennel fronds",
        "3 tablespoons chopped fresh mint",
        "1 to 2 tablespoons fresh lemon juice",
        "1 7-ounce package feta cheese, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Appetizer",
        "Sauté",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Barley",
        "Fennel",
        "Kale",
        "Spinach",
        "Healthy",
        "Chard",
        "Dill",
        "Lemon Juice",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Barley Soup with Greens, Fennel, Lemon, and Dill",
    "url": "http://www.epicurious.com/recipes/food/views/barley-soup-with-greens-fennel-lemon-and-dill-357291"
}
