{
    "directions": [
        "Whisk shallot, 1 teaspoon lime juice, lime peel, vinegar, and honey in small bowl. Whisk in 2 tablespoons oil. Season vinaigrette to taste with salt.",
        "Preheat oven to 450°F. Pierce sweet potatoes in several places with fork. Place on sheet of aluminum foil and roast 30 minutes. Turn potatoes over and roast until soft, about 20 minutes longer. Let stand until cool enough to handle. Scoop flesh into processor; discard skins. Puree sweet potatoes until smooth. Add 3 tablespoons butter, thyme, nutmeg, and remaining 2 teaspoons lime juice; process until blended and smooth. Add milk; process to blend. Transfer to microwave-safe bowl. Season to taste with salt and pepper. DO AHEAD: Vinaigrette and potatoes can be made 1 day ahead. Cover separately and chill. Bring vinaigrette to room temperature and rewhisk before using.",
        "Preheat oven to 450°F. Place brussels sprout leaves on rimmed baking sheet. Drizzle with 1 tablespoon oil, sprinkle with salt and pepper, and toss to coat. Spread leaves out in even layer. Roast until almost all leaves are brown in spots and crisp, tossing occasionally, about 15 minutes.",
        "Meanwhile, heat remaining 2 tablespoons oil in heavy large skillet over medium-high heat. Sprinkle fish with salt and pepper. Add to skillet and cook 30 seconds. Reduce heat to medium and add remaining 2 tablespoons butter to skillet. Continue to cook fish until edges appear opaque, occasionally basting by spooning juices in skillet over, about 4 minutes. Turn fish over. Cook until just opaque in center, about 2 minutes.",
        "Rewarm sweet potatoes in microwave in 30-second intervals until heated through, stirring occasionally. Divide sweet potatoes among plates. Arrange fish alongside and drizzle vinaigrette over. Sprinkle brussels sprout chips over and serve.",
        "Floral, subtly spiced Chehalem 2008 \"3 Vineyard\" Pinot Gris, Oregon ($19)."
    ],
    "ingredients": [
        "1 small shallot, minced (about 11/2 teaspoons)",
        "3 teaspoons fresh lime juice, divided",
        "1 1/4 teaspoons finely grated lime peel",
        "1 teaspoon white wine vinegar",
        "1/2 teaspoon honey",
        "5 tablespoons extra-virgin olive oil, divided",
        "1 3/4 pounds red-skinned sweet potatoes (yams)",
        "5 tablespoons unsalted butter, room temperature, divided",
        "1 teaspoon chopped fresh thyme",
        "Pinch of freshly grated nutmeg",
        "1/4 cup warm whole milk",
        "8 ounces brussels sprouts, leaves separated, cores discarded",
        "4 5-to 6-ounce barramundi fillets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Roast",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Sweet Potato/Yam",
        "Fall",
        "Healthy",
        "Brussel Sprout",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Barramundi Fillets With Roasted Sweet Potatoes and Brussels Sprout Chips",
    "url": "http://www.epicurious.com/recipes/food/views/barramundi-fillets-with-roasted-sweet-potatoes-and-brussels-sprout-chips-355232"
}
