{
    "directions": [
        "Pour 1/3 cup warm water into large bowl. Sprinkle yeast and sugar over; let stand until mixture is foamy, about 10 minutes.",
        "Mix 2/3 cup flour and 1/3 cup room-temperature water into yeast mixture. Cover and let stand 20 minutes.",
        "Stir olive oil and salt into yeast mixture. Mix in 1 1/2 cups flour, 1/2 cup at a time, until slightly sticky dough forms. Add basil. Knead on floured surface until smooth and elastic, adding more flour by tablespoonfuls if dough is too sticky, about 10 minutes. Oil large bowl. Add dough; turn to coat. Cover with plastic. Let rise in warm area until doubled, about 45 minutes.",
        "Punch dough down. Turn out onto floured surface. Divide in half; knead each piece just until smooth. Cover with towel; let rise until almost doubled, 20 minutes.",
        "Prepare barbecue (medium-high heat). Roll out each dough piece on floured surface to 12-inch round. Transfer each to separate baking sheet. Brush top side with Basil Oil. Place bread, oiled side down, on barbecue. Grill until bottom is golden brown, about 1 1/2 minutes. Brush top of bread with Basil Oil. Using tongs, turn bread over; grill until golden, about 1 1/2 minutes. (Can be made 4 hours ahead. Cover loosely with foil; let stand at room temperature. Before continuing, prepare barbecue; use medium-high heat.)",
        "Brush breads with some Basil Oil. Arrange Roasted Tomatoes on breads. Loosely cover breads with foil; grill until heated through, watching closely, about 4 minutes. Drizzle with more Basil Oil. Cut each bread into 6 pieces."
    ],
    "ingredients": [
        "1/3 cup warm water (105°F to 115°F)",
        "1 teaspoon dry yeast",
        "Pinch of sugar",
        "2/3 cup plus 1 1/2 cups (or more) all purpose flour",
        "2/3 cup water, room temperature",
        "2 teaspoons olive oil",
        "1 teaspoon salt",
        "3 tablespoons thinly sliced fresh basil",
        "Basil Oil",
        "Roasted Tomatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Tomato",
        "Fourth of July",
        "Backyard BBQ",
        "Basil",
        "Summer",
        "Grill",
        "Grill/Barbecue"
    ],
    "title": "Basil Flatbread with Roasted Tomatoes and Basil Oil",
    "url": "http://www.epicurious.com/recipes/food/views/basil-flatbread-with-roasted-tomatoes-and-basil-oil-5710"
}
