{
    "directions": [
        "Place basil, spinach, and pine nuts in the bowl of a food processor and pulse to chop. Add 2 tablespoons olive oil in a steady stream until pesto is creamy, stopping to scrape down sides. Stir in 1 tablespoon Parmesan cheese and black pepper with a spoon.",
        "Heat chicken stock and water in separate saucepans over medium heat until simmering, about 5 minutes; reduce heat, cover, and keep warm.",
        "Melt 2 tablespoons butter in a large saucepan over medium heat until foamy. Add shallots; cook and stir until soft, about 5 minutes. Add rice and saffron; stir until coated with butter. Pour in wine and simmer until absorbed, about 5 minutes.",
        "Pour enough warm stock into the saucepan to barely cover the rice; cook and stir until absorbed. Continue adding stock, and then water, stirring constantly, until each addition is absorbed and rice is tender yet firm to the bite and risotto is thick and creamy, about 20 minutes.",
        "Spoon pesto into risotto. Remove saucepan from heat; stir in 1/3 cup Parmesan cheese.",
        "Pat scallops dry with paper towels and season with salt and pepper.",
        "Melt 2 tablespoons butter with 1 tablespoon olive oil in a skillet over medium heat. Arrange scallops in the hot skillet and cook, without touching, until deep golden brown underneath, about 2 minutes. Flip each scallop and sear on the second side until golden brown, about 2 minutes more.",
        "Serve scallops over risotto."
    ],
    "ingredients": [
        "Pesto:",
        "1 cup fresh basil leaves",
        "1 cup fresh spinach",
        "1/4 cup pine nuts",
        "2 tablespoons olive oil, or to taste",
        "1 tablespoon grated fresh Parmesan cheese, or to taste",
        "ground black pepper to taste",
        "Risotto:",
        "2 cups chicken stock",
        "1 cup water",
        "2 tablespoons butter",
        "2 tablespoons chopped shallots",
        "1 cup Arborio rice",
        "1 pinch saffron (optional)",
        "1/3 cup white wine",
        "1/3 cup grated fresh Parmesan cheese",
        "Scallops:",
        "4 sea scallops",
        "kosher salt and ground black pepper to taste",
        "2 tablespoons butter",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Basil Pesto Risotto with Pan-Roasted Scallops",
    "url": "http://allrecipes.com/recipe/245484/basil-pesto-risotto-with-pan-roasted/"
}
