{
    "directions": [
        "For the relish: Heat a charcoal or gas grill to medium-high for direct and indirect grilling.",
        "Whisk together the vinegar, anchovy paste, oregano, garlic and some salt and pepper in a small bowl. Slowly whisk in the olive oil and season with more salt and pepper if needed.",
        "Brush the tomatoes, jalapeno and onion with canola oil and season with salt and pepper. Grill the tomatoes until charred on both sides. Remove, let cool slightly and dice. Grill the onion until charred on both sides and slightly soft. Remove, let cool and dice. Grill the jalapeno until charred. Remove, let cool slightly and chop (do not seed or peel).",
        "Add the tomatoes, onions, jalapeno, olives, capers, basil and parsley to the vinaigrette.",
        "For the halibut: Combine the canola oil, 1/2 cup of the basil and some salt and pepper in a blender and blend until smooth, about 1 minute. Strain into a bowl. Take about 1/4 cup of the basil oil and reserve in another bowl for the cooked fish.",
        "Heat a charcoal or gas grill to high for direct grilling. Brush the halibut on both sides with the larger quantity of basil oil and sprinkle with salt and pepper. Grill the fish on both sides until slightly charred and just cooked through, about 4 minutes per side.",
        "Remove and immediately drizzle over some of the reserved basil oil. Top with some of the puttanesca relish. Garnish with the basil sprigs."
    ],
    "ingredients": [
        "2 tablespoons red wine vinegar",
        "2 teaspoons anchovy paste",
        "1 teaspoon finely chopped fresh oregano",
        "2 cloves garlic, finely chopped",
        "Kosher salt and freshly ground black pepper",
        "1/4 tablespoon extra-virgin olive oil",
        "3 ripe beefsteak or large heirloom tomatoes, cut into thick slices",
        "1 jalapeno",
        "1 small onion, cut into thick slices",
        "Canola oil, for brushing",
        "1/4 cup chopped kalamata olives",
        "1 tablespoon capers, drained",
        "1/4 cup torn fresh basil leaves",
        "2 tablespoons roughly chopped fresh flat-leaf parsley",
        "1/2 cup canola oil",
        "1 cup loosely packed fresh basil leaves, plus sprigs for garnish",
        "Kosher salt and freshly ground black pepper",
        "4 halibut fillets (8 ounces each)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Jalapeno Recipes",
        "Vegetable",
        "Fish",
        "Halibut Recipes",
        "Tomato",
        "Onion Recipes",
        "Main Dish Recipes",
        "Lunch",
        "Summer",
        "Grilling"
    ],
    "title": "Basil Rubbed Halibut with Puttanesca Relish",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/basil-rubbed-halibut-with-puttanesca-relish"
}
