{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Line a 9-inch springform tin with parchment paper.",
        "Combine chocolate wafers and butter in a food processor; process into fine crumbs. Press crumbs evenly into the bottom of the tin. Transfer crust to the refrigerator.",
        "Combine 1 cup heavy cream and basil in a food processor; blend until smooth. Add cream cheese, eggs, 3/4 cup sugar, flour, and cornstarch. Blend until smooth. Pour over chilled crust, smoothing the top with a spatula.",
        "Bake in the preheated oven until surface is firm except for a small spot in the center that will jiggle when the tin is gently shaken, about 1 hour. Turn off oven and open the door. Leave cheesecake in the oven until completely cooled, about 1 hour.",
        "Refrigerate cheesecake until completely set, about 6 hours.",
        "Combine gelatin and water in a small bowl; let stand until softened, 3 to 5 minutes.",
        "Place strawberries in a blender; blend until smooth and frothy.",
        "Pour 1/3 of the strawberries in a saucepan over medium heat; add 1/4 cup sugar. Stir until sugar dissolves, about 3 minutes. Remove from heat and stir in gelatin mixture. Mix in remaining strawberries.",
        "Whip 3/4 cup plus 2 tablespoons heavy cream with an electric mixer until stiff peaks form. Fold in strawberry mixture to make mousse.",
        "Run a knife around the edges of the tin to remove cheesecake; place on a serving platter. Cover top and sides with mousse. Refrigerate until mousse is set, 2 to 3 hours."
    ],
    "ingredients": [
        "Cheesecake:",
        "5 1/3 ounces chocolate cookie wafers",
        "2 tablespoons butter, melted",
        "1 cup heavy whipping cream",
        "1 bunch fresh basil leaves",
        "3 (8 ounce) packages cream cheese, softened",
        "4 eggs",
        "3/4 cup white sugar",
        "1 tablespoon all-purpose flour",
        "1 tablespoon cornstarch",
        "Mousse:",
        "1 (.25 ounce) package powdered gelatin",
        "2 1/2 tablespoons cold water",
        "1 1/3 cups strawberries, hulled and sliced",
        "1/4 cup white sugar",
        "3/4 cup heavy cream",
        "2 tablespoons heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Basil Cheesecake with Strawberry Mousse",
    "url": "http://allrecipes.com/recipe/254218/basil-cheesecake-with-strawberry-mous/"
}
