{
    "directions": [
        "Char peppers over gas flame or in broiler until blackened on all sides. Enclose in paper bag 10 minutes. Peel, seed, and chop peppers. Set aside.",
        "Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add onions; sauté until golden, about 10 minutes. Add tomatoes and next 4 ingredients. Reduce heat to medium-low; cover and simmer 25 minutes to blend flavors. Stir in roasted peppers. Increase heat and boil uncovered until juices evaporate, stirring often, about 5 minutes. Discard bay leaf and thyme sprigs.",
        "Preheat oven to 400°F. Whisk eggs, salt and pepper in bowl to blend. Heat 1 tablespoon oil in large deep nonstick ovenproof skillet over medium-low heat. Add half of eggs; cook without stirring until edges begin to set, about 1 minute. Spread pepper mixture over. Sprinkle tuna over; spoon tapenade over. Pour remaining eggs over. Place in oven and bake until eggs are set, about 12 minutes.",
        "Run rubber spatula around sides of tortilla to loosen. Slide out onto platter. Serve warm or at room temperature."
    ],
    "ingredients": [
        "2 medium-size red bell peppers",
        "2 medium-size green bell peppers",
        "3 tablespoons olive oil",
        "2 medium onions, chopped",
        "1 pound tomatoes, chopped",
        "4 ounces 1/4-inch-thick slices Black Forest ham, cut into matchstick-size strips",
        "3 garlic cloves, chopped",
        "3 large fresh thyme sprigs",
        "1 bay leaf",
        "8 large eggs",
        "3/4 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 6-ounce can water-packed albacore tuna, drained, flaked",
        "1/2 cup tapenade (olive paste)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Tomato",
        "Ham",
        "Tuna",
        "Bell Pepper",
        "Summer"
    ],
    "title": "Basque-Style Tortilla with Tuna and Tapenade",
    "url": "http://www.epicurious.com/recipes/food/views/basque-style-tortilla-with-tuna-and-tapenade-105071"
}
