{
    "directions": [
        "Heat oil in heavy large pot over medium heat. Add next 6 ingredients. Cover and cook until onion is soft, stirring occasionally, about 4 minutes. Add coconut milk and next 4 ingredients and bring to boil. Reduce heat to low and simmer uncovered 1 hour. Strain into large saucepan, pressing on solids in strainer. If necessary, simmer broth until reduced to 4 cups.",
        "Meanwhile, cook yam cubes in large saucepan of boiling salted water until just tender, 6 to 8 minutes. Using skimmer, transfer yam to bowl. Add Yukon Gold potatoes to same saucepan and cook until just tender, about 10 minutes. Drain; add to bowl with yam. DO AHEAD: Broth and potatoes can be made 1 day ahead. Cool, cover separately, and chill.",
        "Bring coconut-carrot broth to simmer over medium heat. Add all cooked potatoes, sugar snap peas, red bell pepper, and carrot. Simmer until all vegetables are tender, 5 to 6 minutes.",
        "Place flour in shallow bowl. Combine 1/2 cup water and egg in another shallow bowl; whisk to blend. Place panko in third shallow bowl. Sprinkle fish pieces with salt and pepper. Coat in flour, then egg mixture, then panko.",
        "Pour enough oil into large nonstick skillet to coat bottom. Heat oil over medium-high heat. Add fish to skillet. Cook until golden and crisp and just opaque in center, about 3 minutes per side."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "3/4 cup chopped onion",
        "3 kaffir lime leaves",
        "3 large fresh basil leaves",
        "1 tablespoon minced peeled fresh ginger",
        "1 tablespoon chopped jalapeño chile with seeds",
        "1 garlic clove, crushed",
        "3 cups canned unsweetened coconut milk",
        "2 cups vegetable broth",
        "1 15.2-ounce bottle fresh carrot juice",
        "1/4 cup finely chopped palm sugar",
        "or (packed) dark brown sugar",
        "2 tablespoons fish sauce",
        "2 1/2 cups 1/2-inch cubes peeled redskinned sweet potato (yam; from 1 pound)",
        "2 cups baby Yukon Gold or baby Dutch yellow potatoes (about 9 ounces), scrubbed, halved lengthwise, then crosswise",
        "2 cups stringless sugar snap peas, cut into 1/2-inch pieces",
        "1 red bell pepper, cut into 1/2-inch cubes",
        "1 large carrot, peeled, cut into matchstick-size strips",
        "1 cup all purpose flour",
        "1/2 cup water",
        "1 large egg",
        "2 cups panko (Japanese breadcrumbs)",
        "6 4 x 2 x 1/2-inch pieces striped bass or halibut fillets",
        "Vegetable oil (for frying)",
        "Herbed Rice, warm",
        "Fresh basil sprigs and/or arugula (for garnish)",
        "Lime wedges",
        "Ingredient info: Kaffir lime leaves are leaves of the kaffir lime tree. They are sold frozen and sometimes fresh at Asian markets. If unavailable, use 1 tablespoon fresh lime juice and 1/2 teaspoon grated lime peel for each lime leaf. Canned unsweetened coconut milk, fish sauce, and panko are available in the Asian foods section of most supermarkets, at some specialty foods stores, and at Asian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Potato",
        "Rice",
        "Low Fat",
        "High Fiber",
        "Dinner",
        "Sweet Potato/Yam",
        "Breadcrumbs",
        "Pescatarian"
    ],
    "title": "Bass with Herbed Rice and Coconut-Vegetable Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/bass-with-herbed-rice-and-coconut-vegetable-chowder-361332"
}
