{
    "directions": [
        "Preheat oven to 350°F. Toss breadcrumbs with olive oil and parsley in medium bowl to blend. Spread onto rimmed baking sheet. Bake until golden and crunchy, stirring occasionally, about 15 minutes. (Can be made 1 day ahead. Cool completely. Store in airtight container at room temperature.)",
        "Melt 4 tablespoons butter in heavy large skillet over medium-high heat. Add mushrooms and thyme. Sauté until mushrooms are tender, stirring occasionally, about 7 minutes. Add green onions; sauté 1 minute. Add Sherry; boil until slightly reduced, about 2 minutes. Add broth. Boil until reduced by half, about 3 minutes. Add cream; simmer until thickened, about 3 minutes. (Can be made 3 hours ahead. Cover and refrigerate.)",
        "Bring 4 cups water and 1 teaspoon salt to boil in heavy medium saucepan. Gradually whisk in polenta. Reduce heat to medium-low. Cook polenta until tender, adding more water as needed if too thick, and whisking frequently, about 20 minutes. Stir in 3 tablespoons butter. Season with salt and pepper. Cover to keep warm.",
        "Reheat mushroom mixture. Melt 2 tablespoons butter in another large skillet over high heat. Add scallops and sauté until just translucent in center, about 1 minute. Stir scallops and juices into mushrooms. Season with salt and pepper.",
        "Divide polenta among 6 plates. Spoon scallop mixture over polenta, sprinkle breadcrumbs over, and serve."
    ],
    "ingredients": [
        "1 cup fresh breadcrumbs from French bread with crust",
        "2 tablespoons extra-virgin olive oil",
        "2 tablespoons chopped fresh parsley",
        "9 tablespoons unsalted butter, divided",
        "12 ounces fresh chanterelle mushrooms or other fresh wild mushrooms (such as oyster, stemmed shiitake, or crimini, quartered if large)",
        "2 1/2 teaspoons chopped fresh thyme",
        "1 cup chopped green onions",
        "1/2 cup amontillado Sherry",
        "1/4 cup low-salt chicken broth",
        "1/4 cup whipping cream",
        "4 cups (or more) water",
        "1 teaspoon salt",
        "1 cup polenta",
        "1 pound bay scallops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Appetizer",
        "Sauté",
        "Valentine's Day",
        "Winter"
    ],
    "title": "Bay Scallops with Polenta, Wild Mushrooms, Sherry, and Parsley Bread Crumbs",
    "url": "http://www.epicurious.com/recipes/food/views/bay-scallops-with-polenta-wild-mushrooms-sherry-and-parsley-bread-crumbs-109147"
}
