{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Season pork loin with salt, black pepper, paprika, and caraway seeds; spread mustard over pork.",
        "Heat vegetable oil in a large skillet over medium-high heat; fry pork until browned on all sides, about 15 minutes. Transfer pork to a large roasting pan. Add onion, carrots, celeriac, and spring onion to the same skillet used to fry pork; cook and stir until vegetables are tender, about 10 minutes. Spread vegetable mixture around pork in roasting pan.",
        "Pour 1 cup hot water into the skillet used to cook the pork and vegetables; simmer and scrape up any browned bits from the bottom with a spatula. Pour water over pork.",
        "Bake in preheated oven until pork is slightly pink in the center, 2 1/2 to 3 hours, basting often. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). If vegetables become dry, add 1 cup hot water, or as needed.",
        "Transfer pork roast to a large platter and keep warm. Strain remaining liquid through a sieve into a saucepan; reserve vegetables.",
        "Bring liquid to a boil and add butter and cornstarch; simmer until sauce is thickened, about 5 minutes. Slice pork and serve with sauce and vegetables."
    ],
    "ingredients": [
        "2 1/4 pounds boneless pork loin roast",
        "1 teaspoon salt, or more to taste",
        "1 teaspoon ground black pepper, or more to taste",
        "1 teaspoon sweet paprika",
        "1/2 teaspoon caraway seeds",
        "2 teaspoons grainy mustard",
        "1 tablespoon vegetable oil",
        "1 large onion, quartered",
        "2 carrots",
        "1/8 celeriac (celery root), chopped",
        "1 spring onion, chopped",
        "2 cups water, or as needed - divided",
        "2 tablespoons butter, or to taste",
        "2 tablespoons cornstarch"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bayrischer Schweinebraten (Bavarian Roast Pork)",
    "url": "http://allrecipes.com/recipe/231025/bayrischer-schweinebraten-bavarian-r/"
}
