{
    "directions": [
        "For the Carolina BBQ sauce:",
        "Combine the cider vinegar, ketchup, sugar, molasses, mustard, soy sauce, tomato paste, Worcestershire sauce, red pepper flakes, salt and a pinch ground black pepper in a stainless steel saucepan over medium heat. Bring the mixture to a boil, reduce the heat and simmer for 10 minutes. Remove from the heat and let cool before using. If not using immediately, pour it into a bowl or jar. Cover and refrigerate until needed.",
        "For the BBQ pulled pork:",
        "Combine 1 quart water with the soy sauce, salt, sugar, honey and molasses in a large saucepan over medium heat. Bring the mixture to a boil, then remove from the heat and let cool. Stir in 1 gallon plus 3 quarts water. Pierce the meat with a boning knife in several places, then add the meat to the brine. Cover and refrigerate overnight.",
        "Remove the meat from the brine, coat lightly with salt and pepper, and arrange in a smoker. Load 2 boxes filled with applewood chips into the smoker. Set the smoker at 250 degrees F and smoke for 8 hours. Remove the meat from the smoker to a cutting board and shred when cool enough to handle. Arrange on a serving platter and serve with the BBQ sauce."
    ],
    "ingredients": [
        "2 quarts cider vinegar",
        "2 cups ketchup",
        "1/2 cup sugar",
        "1/4 cup molasses",
        "1/4 cup dry mustard",
        "1/4 cup soy sauce",
        "1/4 cup tomato paste",
        "1/4 cup Worcestershire sauce",
        "1/8 cup red pepper flakes",
        "1/8 cup salt",
        "Pinch freshly ground black pepper",
        "2 cups soy sauce",
        "1 1/2 cups salt, plus more for seasoning",
        "1/2 cup sugar",
        "1/4 cup honey",
        "1/4 cup molasses",
        "2 pork butts, about 6 pounds total weight",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pulled Pork",
        "Meat",
        "Pork",
        "Tomato",
        "Vegetable",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "BBQ Pulled Pork with Carolina Sauce",
    "url": "http://www.foodnetwork.com/recipes/bbq-pulled-pork-with-carolina-sauce"
}
