{
    "directions": [
        "Prepare the grill for indirect heat using hickory and charcoal and heat to 250 degrees F.",
        "Place the ribs on a clean cutting board and pull off the membrane, the thin fatty skin that lines the underside of the ribs. Trim the ribs of excess fat and meat.",
        "For the rub: Whisk together 2 tablespoons salt, brown sugar, paprika, chile powder, cumin and pepper. Rub the beef ribs with the seasoning and place on a sheet tray, cover with plastic wrap, and if time, let marinate in the refrigerator for 8 hours or overnight.",
        "For the glaze: Add the maple syrup, apple juice, brown sugar, vinegar, mustard, chile powder, cayenne, salt and pepper to a medium saucepan and bring to a simmer. Cook until syrupy, about 8 minutes, stirring with a wooden spoon on occasion.",
        "Remove the ribs from the refrigerator. Place the ribs meatier-side-down on the grill away from the coals. Cook the beef 3 hours, adding more coals as needed. Turn and cook until the ribs \"bend\" and the meat easily separates from the bone using a fork, about 45 minutes more. Brush on the glaze to the ribs and cook for another 5 minutes. Remove and slice into individual ribs."
    ],
    "ingredients": [
        "2 slabs BBQ beef ribs",
        "2 tablespoons kosher salt",
        "1 1/2 tablespoons light brown sugar",
        "1 tablespoon paprika",
        "1 tablespoon ancho chile powder",
        "1 tablespoon ground cumin",
        "2 teaspoons freshly ground black pepper",
        "1/2 cup pure maple syrup",
        "1/4 cup apple juice",
        "3 tablespoons light brown sugar",
        "3 tablespoons apple cider vinegar",
        "3 tablespoons Dijon mustard",
        "1 teaspoon ancho chile powder",
        "Pinch of cayenne",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Grilling Recipes",
        "Grilling",
        "Ribs Recipes",
        "Beef",
        "Meat"
    ],
    "title": "BBQ Beef Ribs",
    "url": "http://www.foodnetwork.com/recipes/patrick-and-gina-neely/bbq-beef-ribs-recipe"
}
