{
    "directions": [
        "Combine coleslaw mix, pepperoncini peppers, red onion, mayonnaise, lemon juice, red wine vinegar, 1 tablespoon granulated garlic, Dijon mustard, white sugar, salt, 1/2 teaspoon granulated onion, and lemon pepper in a large bowl. Toss until well combined. Cover and refrigerate until ready to use.",
        "Preheat oven to 300 degrees F (150 degrees C).",
        "Combine kosher salt, black pepper, 2 tablespoons granulated garlic, 2 tablespoons granulated onion, 2 tablespoons brown sugar, 1 tablespoon cayenne pepper, nutmeg, allspice, and cinnamon together in a bowl.",
        "Place pork shoulder in a large roasting pan. Rub with 1/4 cup molasses on all sides and between any crevices. Sprinkle with kosher salt seasoning mixture and rub over all sides.",
        "Cover pan tightly with heavy-duty aluminum foil and roast pork in the preheated oven until tender and a thermometer inserted reaches 200 degrees F (95 degrees C), 3 to 4 hours. Transfer pork to a cutting board, reserving pan juice, and allow to cool slightly before pulling. Using two forks, shred the pork shoulder into bite-size pieces. Transfer meat to a large bowl and toss with some of the pan juices to keep it moist.",
        "Pour reserved pan juices into a large pot over medium heat. Add barbeque sauce, coffee, 1 tablespoon molasses, 1 tablespoon brown sugar, dry mustard, and a pinch of cayenne pepper. Bring to a simmer, reduce heat, and cook for 15 minutes. Add shredded pork and stir until warm, about 5 minutes.",
        "Fill each hoagie bun with pork mixture. Top with 1 to 2 cups coleslaw. Garnish with 1 tablespoon onion and 1 tablespoon jalapeno."
    ],
    "ingredients": [
        "Coleslaw:",
        "1 (16 ounce) package shredded coleslaw mix",
        "1/4 cup pickled pepperoncini peppers, chopped",
        "1/4 cup diced red onion",
        "1/3 cup mayonnaise",
        "1/2 lemon, juiced",
        "1 tablespoon red wine vinegar",
        "1 tablespoon granulated garlic",
        "1 teaspoon Dijon mustard",
        "1 teaspoon white sugar",
        "1 teaspoon salt",
        "1/2 teaspoon granulated onion",
        "1/4 teaspoon lemon pepper",
        "Pulled Pork:",
        "2 tablespoons kosher salt",
        "2 tablespoons ground black pepper",
        "2 tablespoons granulated garlic",
        "2 tablespoons granulated onion",
        "2 tablespoons brown sugar",
        "1 tablespoon cayenne pepper",
        "1 tablespoon ground nutmeg",
        "1 tablespoon ground allspice",
        "1 teaspoon ground cinnamon",
        "1 (4 pound) pork shoulder roast",
        "1/4 cup molasses",
        "Sauce:",
        "3 cups barbeque sauce",
        "1 cup strong brewed coffee",
        "1 tablespoon molasses",
        "1 tablespoon brown sugar",
        "1 teaspoon dry mustard",
        "1 pinch cayenne pepper, or more to taste",
        "4 Italian-style hoagie buns, split lengthwise and toasted",
        "1/4 cup onion, chopped (optional)",
        "1/4 cup jalapeno pepper, seeded and minced (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "BBQ Pulled Pork Sandwich",
    "url": "http://allrecipes.com/recipe/231848/bbq-pulled-pork-sandwich/"
}
