{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Soak pieces of torn bread in the milk in a bowl for 5 minutes. Gently squeeze out milk. Add beaten egg to the soaked bread and mix well.",
        "Mix garlic powder, onion powder, parsley, salt, Italian herb seasoning, sugar, and Parmesan cheese together in a small bowl. Add to bread-egg mixture.",
        "Place ground beef in a mixing bowl. Add seasoning mixture and onions; mix together with a fork. If mixture is too dry, add up to a tablespoon of milk. Roll into 25 meatballs and arrange on rimmed baking sheet.",
        "Bake in preheated oven until browned and cooked through, about 18 minutes.",
        "Drain meatballs on a paper towel. Remove grease from the baking sheet. Transfer meatballs back to the baking sheet. Drizzle 1 cup BBQ sauce over meatballs.",
        "Return sheet to oven and bake 12 more minutes.",
        "Use a small animal vegetable cutter to make animals out of green, orange, and red peppers. Cut animals out of Colby Jack and mild Cheddar cheese.",
        "Drain meatballs on a paper towel and add more BBQ sauce if desired. Add cheese animal cut-out and then animal pepper cut-out to the toothpicks.  Work quickly to add toothpick to each meatball."
    ],
    "ingredients": [
        "2 slices bread, crusts removed, torn into pieces",
        "1/2 cup whole milk",
        "1 egg, beaten",
        "1 tablespoon dried parsley",
        "1/2 teaspoon salt",
        "1/8 teaspoon garlic powder",
        "1/8 teaspoon onion powder",
        "1/2 teaspoon dried Italian herb seasoning",
        "1/4 teaspoon sugar",
        "1 tablespoon freshly grated Parmesan cheese",
        "1 pound ground beef",
        "1/4 cup grated sweet onion",
        "1 cup barbecue sauce, plus additional for serving",
        "Animal Cut-Outs:",
        "1 green bell pepper",
        "1 orange bell pepper",
        "1 red bell pepper",
        "4 (1/4-inch) slices Colby-Monterey Jack cheese",
        "4 (1/4-inch) slices mild Cheddar cheese",
        "Animal vegetable cutters",
        "25 4-inch toothpicks"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "BBQ Meatballs with Pepper and Cheese Animal Cut-Outs",
    "url": "http://allrecipes.com/recipe/254209/bbq-meatballs-with-pepper-and-cheese/"
}
