{
    "directions": [
        "Pat the brisket dry with a towel to remove any moisture. Generously rub the brisket with 1 cup of the BBQ Beef Coffee Cure , massaging all the spice into the meat; repeat with the remaining cure. The cure will soak up the liquid from the beef and form a crust. Place the meat on a large plate, cover with plastic wrap, and marinate in the refrigerator for at least 2 hours.",
        "Prepare a smoker for hot smoking. The standard cooking time for brisket is 1 hour per pound, smoked fat side up, under dry, indirect heat at a steady temperature of 225°F. Place the brisket on the center rack of the smoker and smoke for 12 hours. This is slow cooking at its easiest—there's no need to check the meat at intervals.",
        "After 12 hours, use a meat thermometer to check for an internal temperature of 185°F in the thickest side of the brisket. Once that temperature is reached, open the door of the smoker and let the meat rest for 30 minutes. This resting period allows the juices to settle. The internal temperature will continue to rise to 190°F.",
        "While the meat rests, make the tomato and molasses barbecue sauce: Combine the ketchup, tomatoes, tomato paste, vinegar, mustard, granulated garlic, salt, pepper, and brown sugar with 1 1/3 cups water in a large stockpot over medium heat. Simmer for 20 minutes, stirring, until the sauce thickens slightly. Whisk in the molasses last (it will burn if added too early) and blend with an immersion blender until smooth. Season to taste.",
        "Transfer the rested brisket to a cutting board, slice, and chop. The fully rested meat will have a distinct crust and will be tender and juicy inside. There should be a pink smoke ring beneath the crust."
    ],
    "ingredients": [
        "1 (12-pound) whole beef brisket",
        "2 cups BBQ Beef Coffee Cure",
        "2 cups ketchup",
        "2 cups diced tomatoes",
        "1 tablespoon tomato paste",
        "1 1/3 cups distilled white vinegar",
        "5 tablespoons Dijon mustard",
        "4 teaspoons granulated garlic",
        "4 teaspoons kosher salt",
        "2 teaspoons black peppercorns, crushed",
        "1/2 pound brown sugar",
        "2/3 cups molasses"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Marinate",
        "Fourth of July",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Meat",
        "Summer",
        "Smoker",
        "Grill/Barbecue",
        "Party",
        "Simmer",
        "Advance Prep Required",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "BBQ Beef Brisket",
    "url": "http://www.epicurious.com/recipes/food/views/bbq-beef-brisket-51171820"
}
