{
    "directions": [
        "To make the glaze: Place the vegetable oil in a medium skillet over medium-high heat. Add the onion, garlic, and thyme and cook until the onion and garlic begin to brown, 7 to 10 minutes. Deglaze the pan with the rum and simmer for 4 to 5 minutes to evaporate the alcohol. Stir in the honey and tamarind pulp and cook over medium heat for 5 minutes. Add the beef stock and continue cooking until the liquid is reduced by half. Strain through a sieve. Cover and refrigerate until ready to use.",
        "To brine the pork chops: In a large stockpot, bring to a boil the water, sugar, salt, cloves, and nutmegs. Stir occasionally and cook until the sugar and salt have dissolved. Remove the brine from the heat and add the pork chops. Let cool for 30 minutes, then cover and refrigerate for 24 hours.",
        "Prepare a hot grill for direct cooking, with a cool zone to one side.",
        "Remove the pork chops from the brine, rinse with cold water, and pat dry. Season to your liking with salt, cracked black pepper, granulated garlic, and dried thyme.",
        "Use long-handled tongs and a paper towel dipped in vegetable oil to lightly oil the grate, then place the pork chops over the fire, about 6 inches over the glowing coals. Cook for about 2 minutes on each side. Move the chops to the cool zone, cover the grill, and cook for 5 minutes. Turn, cover the grill, and grill until just cooked through, about 5 minutes more. The meat should register 145°F on a meat thermometer.",
        "Transfer to a serving platter and allow the chops to rest for 10 minutes. While the meat is resting, warm the glaze. Serve the pork chops whole or sliced with the glaze."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "1 medium yellow onion, chopped",
        "3 cloves garlic",
        "1 sprig fresh thyme",
        "1/2 cup rum (añejo)",
        "1 cup honey",
        "1 cup tamarind pulp",
        "3 cups beef stock",
        "4 quarts water",
        "1 cup sugar",
        "1 cup salt",
        "30 whole cloves",
        "4 whole nutmegs, cracked",
        "8 center-cut pork chops, about 21/2 inches thick",
        "Kosher salt and cracked black pepper",
        "Granulated garlic, for seasoning",
        "Dried thyme, for seasoning"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Fourth of July",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Pork Chop",
        "Grill",
        "Grill/Barbecue",
        "Honey",
        "Tamarind",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "BBQ Freaks Tamarind-Glazed Pork Chops",
    "url": "http://www.epicurious.com/recipes/food/views/bbq-freaks-tamarind-glazed-pork-chops-51166430"
}
