{
    "directions": [
        "Combine cucumbers, onions, pickling salt, and garlic in a large pot. Place enough cracked ice atop the cucumber mixture to cover by at least 2 inches.",
        "Cover the pot with a lid and refrigerate 3 to 12 hours. Drain all liquid from the mixture. Discard any remaining pieces of ice. Remove the garlic and set aside.",
        "Bring the sugar, vinegar, mustard seed, turmeric, and celery seed to a boil in a separate large saucepan, stirring frequently. Add the cucumber and onion mixture; return to a boil. Reduce heat to medium-low and cook at a simmer until cucumbers and onion are soft,  5 to 10 minutes.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the cucumber and onion mixture into the hot, sterilized jars, filling the jars to within 1/2 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place jars in a canning pot with at least an inch of water covering all of the jars and boil for 10 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). If you have a can that does not seal, just stick it in the fridge and eat that jar first. Store in a cool, dark area, and wait at least 3 hours before opening."
    ],
    "ingredients": [
        "16 cups thinly sliced cucumbers",
        "8 white onions, sliced thinly",
        "1/3 cup pickling salt",
        "3 cloves garlic, halved",
        "cracked ice, or as needed",
        "4 cups white sugar",
        "3 cups cider vinegar",
        "2 tablespoons mustard seed",
        "1 1/2 teaspoons ground turmeric",
        "1 1/2 teaspoons celery seed",
        "6 1-quart canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bea and Bill's Bread and Butter Pickles",
    "url": "http://allrecipes.com/recipe/223591/bea-and-bills-bread-and-butter-pickl/"
}
