{
    "directions": [
        "For the ceviche: Add 8 cups water to a small stockpot with half of the lime juice and 1 tablespoon salt. Bring to a boil and add the shrimp, then cover with a lid and turn off the heat. Poach the shrimp until just cooked through, about 2 minutes. Drain and cool slightly. Cut each shrimp in half lengthwise.",
        "In a large mixing bowl add the remaining lime juice, the tomatoes, cilantro, oil, agave, tomatillos, garlic, shallots, avocados and 1 teaspoon salt, and stir together. Fold in the shrimp, then cover with plastic wrap and refrigerate for up to 2 hours.",
        "For the chips: Set two racks in the middle of the oven and preheat to 375 degrees F. Place the lime zest on a microwave-safe plate and microwave on high heat in 1-minute intervals until completely dried out, stopping to stir after each interval. Reserve for a later use.",
        "Stack the tortillas and cut into sixths. Divide the cut tortillas between two large baking sheets and spray evenly with the cooking spray. Bake until crispy, about 15 minutes.",
        "Meanwhile, place the dried lime zest, garlic powder, paprika and salt in a spice grinder and blend to a fine powder.",
        "Spray the chips once more with the cooking spray then sprinkle all over with the spice powder.",
        "For the beans and chorizo: Put the black beans and bay leaf in a medium saucepan, and fill with cold water to cover by 1 inch. Bring to a boil over medium-high heat, then reduce the heat to a simmer and cook, partially covered, until the beans are tender, 30 to 40 minutes. Drain the beans and discard the bay leaf.",
        "Meanwhile, heat the olive oil in a large saute pan set over medium-high heat and add the chorizo. Cook until just cooked through, about 5 minutes. Use a slotted spoon to transfer the chorizo to a bowl. To the pan, add the onions, red bell peppers, yellow bell peppers and 1 teaspoon salt, and cook until lightly browned, 6 to 8 minutes. Add the garlic and cook until soft, about 2 minutes. Stir in the cumin, ancho powder and chipotle powder, and cook until the spices are lightly toasted, about 2 minutes. Stir in the chorizo, beans and stock. Bring to a boil, then reduce to a simmer. Cook until the stock reduces by half and the mixture thickens, 6 to 8 minutes. Season with more salt if needed.",
        "For the cheese sauce: Heat the oil in a large saucepan set over medium heat. Add the garlic and onions, and saute until tender, 5 to 7 minutes. Stir in the stock, cauliflower, squash and 1 teaspoon salt to the pot. Bring to a boil, then reduce the heat to a simmer and cook, covered, until the vegetables are tender, about 20 minutes, stirring occasionally.",
        "Place the mixture in a blender and carefully blend until completely smooth. Transfer the sauce back to the saucepan and set over low heat. Add the Cheddar, Monterey Jack, Oaxaca and chiles, and stir until the cheese melts. Taste the sauce and add more salt if needed.",
        "For the chile and cilantro sauce: Preheat a grill pan to medium-high heat. Grill the garlic, Anaheim chiles and poblanos on all sides until deeply charred, about 15 minutes. Remove the skins from the garlic, and set aside. Place the peppers in a bowl and cover with plastic wrap. Steam the peppers for at least 5 minutes, then peel the skin away from the flesh of the peppers. Halve the peppers and remove the seeds.",
        "In the pitcher of a blender, add the peppers, garlic, cilantro, sour cream, yogurt, scallions, agave, salt, lime juice and zest. Blend until smooth.",
        "For the nachos: Divide the chips between 8 small plates or bowls, and then top with 1/4 cup of the black bean and chorizo mixture, 1/4 cup of the cheese sauce, 1/3 cup of the shrimp ceviche and a drizzle of the creamy chile and cilantro sauce (about 1 tablespoon). Top each with 1 tablespoon of the queso fresco, a sprinkle of the cilantro leaves and several jalapenos to serve."
    ],
    "ingredients": [
        "Juice of 4 limes",
        "Kosher salt",
        "1 pound jumbo (21/25) shrimp, peeled and deveined",
        "3 cups heirloom cherry tomatoes, quartered",
        "1/2 cup fresh cilantro leaves and soft stems, roughly chopped",
        "2 tablespoons extra-virgin olive oil",
        "1 1/2 teaspoons light agave",
        "3 medium tomatillos, husks removed and chopped (about 1 1/2 cups)",
        "2 cloves garlic, grated",
        "2 small shallots, finely chopped (about 1/4 cup)",
        "1 avocado, peeled and diced (about 1 cup)",
        "Zest of 4 limes (about 4 tablespoons)",
        "Eighteen 6-inch corn tortillas",
        "Extra-virgin olive oil cooking spray",
        "1 1/2 teaspoons garlic powder",
        "1 teaspoon smoked paprika",
        "1 teaspoon kosher salt",
        "1 cup dried black beans, soaked overnight in cold water and drained",
        "1 bay leaf",
        "1 tablespoon extra-virgin olive oil",
        "12 ounces fresh pork chorizo",
        "1 large yellow onion, chopped (about 1 1/2 cups)",
        "1 medium red bell pepper, chopped (about 1 cup)",
        "1 medium yellow bell pepper, chopped (about 1 cup)",
        "Kosher salt",
        "4 cloves garlic, minced",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ancho chile powder",
        "1/2 teaspoon chipotle chile powder",
        "2 cups low-sodium chicken stock",
        "1 tablespoon extra-virgin olive oil",
        "4 cloves garlic, sliced",
        "1 large yellow onion, coarsely chopped (about 1 1/2 cups)",
        "2 cups low-sodium chicken stock or vegetable stock",
        "1/2 medium head cauliflower, cut in to large chunks, (about 1 pound or 3 cups)",
        "1/4 small kabocha squash, peeled and cut in to 1-inch chunks (about 1 pound or 2 1/2 cups)",
        "Kosher salt",
        "6 ounces sharp Cheddar, shredded (about 3 cups)",
        "6 ounces Monterey Jack cheese, shredded (about 3 cups)",
        "2 ounces Oaxaca cheese",
        "Two 4-ounce cans chopped green chiles, finely chopped",
        "4 cloves garlic, in the skin",
        "1 Anaheim chile",
        "1 poblano chile",
        "1/2 cup lightly packed fresh cilantro leaves and soft stems",
        "1/3 cup reduced-fat sour cream",
        "1/3 cup 0-percent Greek yogurt",
        "1/4 cup sliced scallions",
        "1 teaspoon light agave",
        "1/2 teaspoon kosher salt",
        "Zest and juice of 2 limes",
        "1/2 cup crumbled queso fresco cheese",
        "1/2 cup fresh cilantro leaves",
        "1/2 cup sliced pickled jalapeños"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Cheese",
        "Shellfish Recipes",
        "Shrimp",
        "Appetizer"
    ],
    "title": "Beache Ceviche",
    "url": "http://www.foodnetwork.com/recipes/beache-ceviche"
}
