{
    "directions": [
        "In a small saucepan stir together all dressing ingredients except sesame oil until cornstarch is dissolved. Bring dressing to a boil, stirring, and simmer, stirring constantly, 1 minute. Cool dressing completely and stir in sesame oil. Dressing may be made 2 days ahead and chilled, covered.",
        "Discard mushroom stems and cut caps into thin slices. In a large non-stick skillet heat vegetable oil over moderately high heat until hot but not smoking and sauté mushrooms, stirring frequently, until just tender, about 5 minutes. On a platter chill mushrooms in one layer 15 minutes, or until cool.",
        "In a saucepan bring 6 cups water to a boil and remove pan from heat. Stir in noodles and soak 15 minutes. Drain noodles well in a colander and with scissors cut into 6-inch lengths.",
        "While noodles are soaking, cut cabbage crosswise into fine shreds and snow peas diagonally into slivers. Cut bell pepper into julienne strips.",
        "In a large bowl toss together noodles, mushrooms, bell peppers, carrots, scallions, and dressing. Serve salad sprinkled with sesame seeds."
    ],
    "ingredients": [
        "1/2 cup soy sauce",
        "1/3 cup water",
        "1 tablespoon cornstarch",
        "1 tablespoon sugar",
        "3 tablespoons fresh lemon juice",
        "2 tablespoons Sherry",
        "1 tablespoon distilled vinegar",
        "1 tablespoon grated peeled fresh gingerroot",
        "2 garlic cloves, minced",
        "1 1/2 teaspoons Asian sesame oil",
        "1 pound fresh shiitake mushrooms",
        "1 tablespoon vegetable oil",
        "1/2 pound bean-thread (cellophane) noodles",
        "1 1/2 pounds Napa cabbage (about 1/2 medium head)",
        "1/4 pound snow peas, trimmed",
        "1 large red bell pepper",
        "2 cups finely shredded carrot (about 3)",
        "4 scallions, sliced thin",
        "1 teaspoon sesame seeds, toasted golden"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Mushroom",
        "Pasta",
        "Vegetable",
        "Low Fat",
        "Vegetarian",
        "Gourmet"
    ],
    "title": "Bean-Thread Noodle and Vegetable Salad",
    "url": "http://www.epicurious.com/recipes/food/views/bean-thread-noodle-and-vegetable-salad-14056"
}
