{
    "directions": [
        "Place the soaked beans in a large pot, and add enough water to cover. Bring to a boil, and cook for about 1 1/2 hours, until tender. Pour into a colander and let stand for a while so they drain very well.",
        "Heat 1 tablespoon of oil in a large skillet over medium heat. Add onions, and fry until nicely browned, stirring constantly. Remove from heat and set aside. Meanwhile, mix together the eggs and seasoned stuffing mix, and let stand 10 minutes to soften.",
        "Use a food processor to puree the beans in batches, and transfer to a mixing bowl. Puree the onions, and then the stuffing mixture, and stir them into the beans. Season with garlic powder, Worcestershire sauce, hot pepper sauce, salt and pepper. Mix until well blended. Stir in whole wheat flour a little at a time until the mixture is stiff enough to form patties.",
        "Spread the cornmeal out on a small plate. Grab a handful of the bean mixture, and pack lightly into a ball. Press into the cornmeal to form a pattie. Gently turn the pattie over, and coat the other side. Repeat with remaining bean mixture.",
        "Heat 1/2 cup of oil in a large heavy skillet over medium heat. Fry patties until browned on both sides. Remove to paper towels to drain. Serve in pitas, or on hamburger buns."
    ],
    "ingredients": [
        "1 pound dried great Northern beans, soaked overnight",
        "2 large onions, chopped",
        "2 tablespoons vegetable oil",
        "1 teaspoon garlic powder",
        "1 tablespoon vegetarian Worcestershire sauce",
        "1/2 teaspoon liquid smoke flavoring",
        "1/2 teaspoon pepper sauce (such as Frank's Red Hot®)",
        "2 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "1/2 (16 ounce) package herb seasoned stuffing mix",
        "6 eggs",
        "3/4 cup whole wheat flour, or as needed",
        "3/4 cup cornmeal",
        "1/2 cup vegetable oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bean Burgers",
    "url": "http://allrecipes.com/recipe/69842/bean-burgers/"
}
