{
    "directions": [
        "In a large heavy skillet cook the onion and the garlic in the oil over moderately low heat, stirring, until the onion is softened, add the beans, and mash about half of them coarse with the back of a wooden spoon. Add the tomato sauce, the cumin, the chilies, and salt and black pepper to taste, simmer the mixture, stirring, for 3 to 5 minutes, or until it is thickened slightly, and stir in the coriander.",
        "Working with 1 warmed tortilla at a time and keeping the others covered, spread about 3 tablespoons of the filling down the center of each tortilla and roll the tortillas, enclosing the filling but keeping the ends open. Arrange the burritos, seam sides down, in one layer in a baking dish, sprinkle them with the Monterey Jack, and bake them, covered with foil, in the middle of a preheated 350°F. oven for 10 minutes. Serve the burritos with the guacamole and the salsa."
    ],
    "ingredients": [
        "1 onion, chopped fine",
        "4 garlic cloves, minced",
        "3 tablespoons olive oil",
        "two 1-pound cans black, pinto, or pink beans, rinsed and drained",
        "1 cup tomato sauce",
        "2 teaspoons ground cumin",
        "4 fresh or pickled jalapeño chilies if desired, seeded and chopped (wear rubber gloves)",
        "1/4 cup chopped fresh coriander if desired",
        "twelve 7- to 8-inch flour tortillas warmed",
        "1 1/2 cups grated Monterey Jack (about 6 ounces)",
        "guacamole and tomato salsa as accompaniments"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Cheese",
        "Tomato",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Quick & Easy",
        "Winter",
        "Healthy",
        "Cilantro",
        "Tortillas",
        "Monterey Jack",
        "Gourmet"
    ],
    "title": "Bean Burrito Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/bean-burrito-casserole-13572"
}
