{
    "directions": [
        "Heat 1/4 cup oil in a large heavy pot over medium heat. Add sausage and cook, turning occasionally, until browned, about 5 minutes. Add onion and garlic; season with salt and pepper. Cook, stirring occasionally, until onion begins to soften, about 5 minutes.",
        "Add wine and cook, scraping up browned bits from bottom of pot and stirring occasionally, until wine is reduced by half, about 3 minutes. Add Parmesan rind, if using, chiles, thyme, bay leaf, broth, tomatoes, and beans. Bring to a boil, reduce heat, cover, and simmer gently, stirring occasionally and adding water as needed to keep beans submerged, until beans are tender, 1-1 1/2 hours. Mix in kale and lemon juice; season with salt and pepper. Serve beans drizzled with oil.",
        "DO AHEAD: Beans can be cooked 3 days ahead. Cover and chill."
    ],
    "ingredients": [
        "1/4 cup olive oil plus more for drizzling",
        "8 ounces Portuguese sausage (such as linguiça) or kielbasa sausage, sliced 1/2\" thick",
        "1/2 medium onion, sliced",
        "4 garlic cloves, smashed",
        "Kosher salt, freshly ground pepper",
        "1 cup dry white wine",
        "1 small piece Parmesan rind (optional)",
        "2 chiles de árbol or 1/4 teaspoon crushed red pepper flakes",
        "1 sprig thyme",
        "1 bay leaf",
        "4 cups low-sodium chicken broth",
        "1 15-ounce can diced tomatoes",
        "1 1/2 cups dried cranberry, navy, or cannellini (white kidney) beans (about 10 ounces), soaked overnight, drained",
        "4 cups baby kale or baby mustard greens",
        "1 tablespoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Side",
        "High Fiber",
        "Dinner",
        "Sausage",
        "Kale",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Beans with Kale and Portuguese Sausage",
    "url": "http://www.epicurious.com/recipes/food/views/beans-with-kale-and-portuguese-sausage-51175110"
}
