{
    "directions": [
        "Bring a large pot of lightly salted water to a boil, cook the penne pasta 10 to 12 minutes, until al dente, and drain.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Heat the oil in a skillet over medium heat, and saute the onion,  green bell pepper, and garlic until tender. Stir in the chicken, and cook until almost done. Mix in the peas, cilantro, dill, tomato paste, and enough water to make a thick sauce. Continue to cook and stir until chicken is no longer pink and juices run clear, and all the ingredients are heated through. Season with salt and pepper to taste.",
        "To prepare the bechamel sauce, melt the butter in a saucepan over medium heat. Dissolve the chicken bouillon cube in the melted butter. Stirring constantly, blend in the flour until smooth. Mix in the milk, season with pepper, and continue to cook and stir until the sauce is thick enough to coat the back of a spoon.",
        "In a bowl, mix the cooked pasta with 1/2 the bechamel sauce. Place 1/2 the pasta in a baking dish, layer with 1/2 the chicken mixture, and 1/2 the mozzarella cheese. Layer with the remaining pasta, remaining chicken mixture, and remaining bechamel sauce. Top with remaining mozzarella cheese.",
        "Bake 30 minutes in the preheated oven, or until bubbly."
    ],
    "ingredients": [
        "1 (16 ounce) package dried penne pasta",
        "2 tablespoons olive oil",
        "1 small onion, diced",
        "1 green bell pepper, diced",
        "3 cloves garlic, minced",
        "2 skinless, boneless chicken breast halves - cubed",
        "1/2 cup frozen peas",
        "1 bunch cilantro",
        "3 sprigs fresh dill weed, chopped",
        "1 (6 ounce) can Italian-flavored tomato paste",
        "1/2 cup water",
        "salt and pepper to taste",
        "5 tablespoons butter",
        "1 cube chicken bouillon",
        "5 tablespoons all-purpose flour",
        "3 cups milk",
        "pepper to taste",
        "2 cups shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bechamel Chicken Pasta",
    "url": "http://allrecipes.com/recipe/69688/bechamel-chicken-pasta/"
}
