{
    "directions": [
        "Combine the yeast, and the warm water; set aside to proof for 5 minutes.",
        "Cream 3/4 cup butter and sugar until light.  Beat in the eggs and yolks one at a time.  Add the vanilla, milk, sour cream, and yeast.  Beat until smooth.  Add the flour a little at a time to form a soft dough. Add all of the flour, and continue to beat until elastic, about 8 minutes. Place dough into an oiled bowl, cover and place in a warm spot until doubled in size, about 50 minutes.  Can be placed in the refrigerator overnight instead.",
        "Beat down the dough, and divide into two pieces.  Place each in a buttered 9 inch square pan.  Brush the top of each with 1 tablespoon of the melted butter.  Cover and let rise until doubled.",
        "For the glaze, place the brown sugar, 6 tablespoons butter, cream, and honey in a saucepan over medium heat.  Bring to a boil, and stir until the sugar dissolves.  Boil for 30 seconds.  Remove from heat; add the lemon juice and almonds.  Let cool slightly.  Drizzle the warm glaze, not hot, over each of the cakes.",
        "Bake at 375 degrees F (190 degrees C) for 30 minutes, or until the nuts are golden.  Cool on a rack.",
        "Split the cakes lengthwise using a serrated knife, and fill with the pastry cream.  Sandwich cakes back together and serve."
    ],
    "ingredients": [
        "2 (.25 ounce) packages active dry yeast",
        "1/4 cup warm water",
        "3/4 cup unsalted butter, softened",
        "3/4 cup white sugar",
        "2 eggs, room temperature",
        "3 egg yolks",
        "1/2 teaspoon salt",
        "1/2 cup warm milk",
        "2 teaspoons vanilla extract",
        "1/2 cup sour cream, room temperature",
        "4 cups all-purpose flour",
        "2 tablespoons unsalted butter, melted",
        "2/3 cup packed light brown sugar",
        "6 tablespoons unsalted butter",
        "3/8 cup heavy whipping cream",
        "3/8 cup honey",
        "1/4 cup lemon juice",
        "5/8 cup sliced almonds",
        "2 cups pastry cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bee Sting Cake (Bienenstich) I",
    "url": "http://allrecipes.com/recipe/7485/bee-sting-cake-bienenstich-i/"
}
