{
    "directions": [
        "Heat 2/3 cup milk in a small saucepan over medium heat until it begins to bubble, 3 to 4 minutes. Remove from heat and stir in 6 tablespoons butter. Cool to lukewarm, about 5 minutes.",
        "Combine flour, 1/3 cup sugar, and yeast in a large bowl. Pour in milk and butter mixture; add egg. Beat with an electric mixer on low speed until dough is smooth. Cover and let rise until doubled in size, about 1 hour.",
        "Punch dough down gently to deflate. Roll out to a 10-inch round on a floured work surface. Place in a 10-inch springform pan. Cover and let rise until doubled, about 30 minutes.",
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Combine almonds, 1 cup sugar, and 9 tablespoons butter in a saucepan over medium heat; cook and stir until butter is melted and sugar is dissolved, about 5 minutes. Remove from heat; add 2 tablespoons milk and cool until lukewarm, about 5 minutes. Spread over the dough in the pan.",
        "Bake in the preheated oven until golden brown, about 30 minutes. Run a knife around the edge of the pan to loosen cake; transfer to a wire rack to cool completely, 30 to 45 minutes.",
        "Combine 1 1/2 cup milk and vanilla pudding mix in a bowl; beat with a whisk until very smooth, about 2 minutes. Chill pudding until set, about 30 minutes.",
        "Slice cake in half lengthwise. Spread pudding over bottom cake layer and cover with top cake layer."
    ],
    "ingredients": [
        "Cake:",
        "2/3 cup milk",
        "6 tablespoons butter",
        "3 cups all-purpose flour",
        "1/3 cup white sugar",
        "1 (.25 ounce) package active dry yeast",
        "1 egg",
        "Topping:",
        "1 1/4 cups sliced almonds",
        "1 cup white sugar",
        "9 tablespoons butter",
        "2 tablespoons milk",
        "Filling:",
        "1 1/2 cups milk",
        "1 (3.5 ounce) package instant vanilla pudding mix"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bee Sting Cake",
    "url": "http://allrecipes.com/recipe/255738/bee-sting-cake/"
}
