{
    "directions": [
        "Combine flour, yeast, 2 tablespoons sugar, salt, 3/4 cup milk, and 3 tablespoons butter or margarine.  Turn dough out onto a lightly floured surface.  Knead until smooth and elastic, about 15 to 20 minutes.  Place in a well greased bowl, and cover.  Let rise in a warm place for 1 hour, or until doubled.",
        "Punch down the dough.  Roll out to a 1/2 inch thickness.  Spread  into a greased 8 inch square baking pan.  Cover, and let rise for 30 minutes.",
        "Melt 3 tablespoons butter or margarine and confectioner's sugar in a saucepan.  Add almonds and 1 tablespoon milk.  Remove from heat, and stir in honey.  Spread evenly and carefully onto the dough.  Allow dough to continue to rise for an additional 30 minutes.",
        "Bake at 400 degrees F (205 degrees C) for 20 to 25 minutes, or until crust turns golden brown. Cool completely on a wire rack.",
        "Dissolve cornstarch in a little milk.  Combine 1 1/2 cups milk, cornstarch, and 1 tablespoon sugar inn the top of a double boiler.  Heat while stirring until thickened, about 2 to 3 minutes.  Add in beaten egg, and keep stirring  for about 2 more minutes, or until thick.  Remove from heat, and stir in extract.  Chill, covered, in refrigerator for at least 1 hour.  Beat the whipping cream with the cream of tartar until stiff.  Fold into the chilled pudding.",
        "Cut the cooled almond crust bread into 1 1/4 x 2 inch rectangles.  Slice each horizontally into halves.   Fill with pudding mixture.  Chill, and serve cold."
    ],
    "ingredients": [
        "1 5/8 cups all-purpose flour",
        "1 tablespoon active dry yeast",
        "2 tablespoons white sugar",
        "1 pinch salt",
        "3/4 cup lukewarm milk",
        "3 tablespoons butter",
        "3 tablespoons butter",
        "1 1/2 tablespoons confectioners' sugar",
        "1 tablespoon milk",
        "5/8 cup sliced almonds",
        "1 tablespoon honey (optional)",
        "1 1/2 cups milk",
        "1/3 cup cornstarch",
        "1 tablespoon white sugar",
        "1 egg, beaten",
        "1 teaspoon almond extract",
        "1 cup heavy whipping cream",
        "1/2 tablespoon cream of tartar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bee Sting Cake (Bienenstich) II",
    "url": "http://allrecipes.com/recipe/8039/bee-sting-cake-bienenstich-ii/"
}
