{
    "directions": [
        "In a 5 1/2-quart Dutch oven over medium-high heat, warm 1 Tbs. of the olive oil. Add the mushrooms, onions, salt and pepper and cook, stirring occasionally, about 12 minutes. Transfer to a bowl.",
        "Season the beef with salt and pepper. Dredge the beef in the flour, shaking off the excess. In the Dutch oven over medium-high heat, warm 2 Tbs. of the olive oil. Add one-third of the beef and brown on all sides, about 7 minutes total. Transfer to a separate bowl. Add 1/2 cup water to the pot, stirring to scrape up the browned bits. Pour the liquid into a separate bowl. Repeat the process 2 more times, using 2 Tbs. oil to brown each batch of beef and deglazing the pot with 1/2 cup water after each batch.",
        "Return the pot to medium-high heat. Add the garlic and tomato paste and cook, stirring constantly, for 30 seconds. Add the beef, stout, broth and reserved liquid, stirring to scrape up the browned bits. Add the mushrooms, onions, carrots, potatoes and thyme and bring to a boil. Reduce the heat to medium-low, cover and simmer, stirring occasionally, until the beef and vegetables are tender, about 3 hours.",
        "Preheat an oven to 400°F.",
        "Brush the rim of the pot with water. Lay the pastry round on top, allowing it to droop onto the filling. Trim the dough, leaving a 1-inch overhang, and crimp to seal. Brush the pastry with the egg mixture, then cut 4 slits in the top of the dough. Bake for 30 minutes. Let the potpie rest for 15 minutes before serving. Serves 8 to 10."
    ],
    "ingredients": [
        "7 Tbs. olive oil",
        "1 lb. white button mushrooms, quartered",
        "2 cups frozen pearl onions, thawed",
        "Salt and freshly ground pepper, to taste",
        "3 1/2 lb. beef chuck roast, cut into 1-inch cubes",
        "1 cup all-purpose flour",
        "3 garlic cloves, minced",
        "2 Tbs. tomato paste",
        "2 1/2 cups Irish stout",
        "1 cup beef broth",
        "1 lb. carrots, cut into chunks",
        "1 lb. red potatoes, cut into chunks",
        "1 Tbs. finely chopped fresh thyme",
        "One 16-inch round Stilton Pastry",
        "1 egg, beaten with 1 tsp. water"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef and Stout Pie",
    "url": "http://www.williams-sonoma.com/recipe/beef-and-stout-pie.html"
}
