{
    "directions": [
        "Toast chiles in a dry small skillet over medium-high heat, turning occasionally and pressing down to help them make contact with the pan, until darkened in color and beginning to soften, about 3 minutes. Transfer to a bowl and cover with 2 cups boiling water; let sit 30 minutes to soften. Drain; remove seeds and stems. Purée chiles and broth in a blender until smooth, about 1 minute.",
        "Once chiles have soaked 10 minutes, heat 1 tablespoon oil in a large heavy pot over medium-high. Season beef with salt and pepper and cook, stirring occasionally, until browned all over, about 5 minutes. At this point, quite a bit of liquid will have accumulated; continue to cook until it has evaporated, about 3 minutes. Transfer beef to a plate.",
        "Add 1 tablespoon oil to pot, then white onion and garlic; season with salt and pepper. Cook, stirring often, until softened, 6–8 minutes; onion juices will help loosen anything left on bottom of pot. Add cumin and oregano and cook, stirring, 1 minute.",
        "Return beef to pot and add beer. Bring to a boil, reduce heat, and simmer, stirring occasionally, until almost completely reduced, about 4 minutes. Add chile purée, season with salt and pepper, and bring to a boil. Reduce heat and simmer until liquid is slightly thickened and meat is tender, 20–25 minutes. Add squash; cover and cook until tender, 10–15 minutes. Stir in lime juice.",
        "Meanwhile, preheat oven to 350°. Toss pumpkin seeds and remaining 1 teaspoon oil on a rimmed baking sheet; season with salt. Bake, stirring occasionally, until golden brown, 8–10 minutes. Let cool.",
        "Serve chili topped with sour cream, avocado, red onion, and toasted pumpkin seeds."
    ],
    "ingredients": [
        "1 dried ancho chile",
        "1 dried pasilla chile",
        "3 cups low-sodium chicken broth",
        "2 tablespoons plus 1 teaspoon vegetable oil",
        "1 pound boneless beef chuck roast, cut into 1/2\" pieces",
        "Kosher salt",
        "Freshly ground pepper",
        "1 large white onion, finely chopped",
        "4 garlic cloves, finely chopped",
        "2 teaspoons ground cumin",
        "1 teaspoon dried oregano",
        "1 12-ounce bottle lager",
        "1/2 acorn squash, scrubbed, sliced into thin wedges, then into 1\" pieces",
        "2 tablespoons fresh lime juice",
        "2 tablespoons raw pumpkin seeds (pepitas)",
        "Sour cream",
        "Chopped avocado",
        "Sliced red onion (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Dinner",
        "Squash",
        "Winter"
    ],
    "title": "Beef and Squash Chili",
    "url": "http://www.epicurious.com/recipes/food/views/beef-and-squash-chili-51259220"
}
