{
    "directions": [
        "Preheat the oven to 325 degrees F.",
        "On a cutting board, mash the garlic and 1/2 teaspoon of the salt together with the flat-side of a knife into a paste. Add the rosemary and continue to mash until incorporated. Put the garlic-rosemary paste in a small bowl and add 2 tablespoons of olive oil; stir to combine.",
        "Season both sides of the brisket with a fair amount of kosher salt and ground black pepper. Place a large roasting pan or Dutch oven over medium-high flame and coat with the remaining olive oil. Put the brisket in the roasting pan and sear to form a nice brown crust on both sides. Lay the vegetables all around the brisket and pour the rosemary paste over the whole thing. Add the wine and tomatoes; toss in the parsley and bay leaves. Cover the pan tightly with aluminum foil and transfer to the oven. Bake for about 3 to 4 hours, basting every 30 minutes with the pan juices, until the beef is fork tender.",
        "Remove the brisket to a cutting board and let it rest for 15 minutes. Scoop the vegetables out of the roasting pan and onto a platter, cover to keep warm. Pour out some of the excess fat, and put the roasting pan with the pan juices on the stove over medium-high heat. Boil and stir for 5 minutes until the sauce is reduced by 1/2. (If you want a thicker sauce, mix 1 tablespoon of flour with 2 tablespoons of wine or water and blend into the gravy).",
        "Slice the brisket across the grain (the muscle lines) at a slight diagonal. Serve with potato pancakes.",
        "4 medium russet potatoes, peeled",
        "2 medium onions",
        "Kosher salt and freshly ground black pepper",
        "2 egg whites, lightly beaten",
        "1/4 cup finely chopped chives",
        "Vegetable oil, for frying",
        "Serving suggestion: applesauce",
        "Using a box grater or food processor, coarsely grate the potatoes and onions. Put the grated potatoes and onions together in cheesecloth or a tea towel and twist it to squeeze out the excess liquid. Put the dry potatoes and onions in a bowl and season with salt and pepper. Fold in the egg whites and chives to bind the mixture together.",
        "Heat a large non-stick skillet over medium heat and coat with 1/4-inch of oil. For each pancake, take about 2 tablespoons of the potato mixture and drop into the hot oil; gently flatten with a spatula so they fry up thin and crispy. Fry for 3 to 4 minutes on each side, until golden. Remove to paper towels to drain; season with salt while the potato pancakes are still hot. Continue frying, adding more oil as needed, until all of the mixture is used up. Serve immediately with apple sauce, if desired.",
        "Yield: about 20 (4-inch) pancakes",
        "Prep Time: 30 minutes",
        "Cook Time: 4 minutes per/batch",
        "Ease of Preparation: Medium"
    ],
    "ingredients": [
        "4 large garlic cloves, smashed",
        "1/2 teaspoon kosher salt, plus more for seasoning",
        "4 sprigs fresh rosemary, needles striped from the stem and chopped",
        "1/4 cup extra-virgin olive oil",
        "1 (4 pound) beef brisket, first-cut",
        "Coarsely ground black pepper",
        "4 large carrots, cut in 3-inch chunks",
        "3 celery stalks, cut in 3-inch chunks",
        "4 large red onions, halved",
        "2 cups dry red wine",
        "1 (16-ounce) can whole tomatoes, hand-crushed",
        "1 handful fresh flat-leaf parsley leaves",
        "3 bay leaves",
        "1 tablespoon all-purpose flour (optional)",
        "Potato Pancakes, recipe follows"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Dutch Oven",
        "Jewish Cooking",
        "Holiday",
        "Potato",
        "Vegetable",
        "Beef",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Beef Brisket",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/beef-brisket-recipe"
}
