{
    "directions": [
        "Soak dried mushrooms in boiling-hot water in a bowl until softened, about 20 minutes. Drain in a paper-towel-lined sieve set over a bowl and reserve soaking liquid. Rinse mushrooms, pat dry, and finely chop.",
        "Bring soaked mushrooms, soaking liquid, ribs, salt, pepper, and remaining 8 cups water to a boil in a 6- to 8-quart pot, then reduce heat and simmer, partially covered, skimming foam, until meat is just tender, about 1 hour. Transfer ribs with a slotted spoon to a cutting board to cool, reserving broth.",
        "While meat simmers, cook onion, carrots, celery, and creminis in oil in a 12-inch heavy skillet over moderate heat, stirring occasionally, until well browned, 15 to 20 minutes. Stir in barley and cook, stirring, 1 minute.",
        "Discard bones, fat, and gristle from meat, then cut meat into 1/2-inch pieces and add to broth along with barley mixture. Simmer, uncovered, until barley is tender, about 40 minutes. Skim fat from surface, then stir in dill and salt to taste."
    ],
    "ingredients": [
        "1 1/2 oz dried mushrooms",
        "3 cups boiling-hot water plus 8 cups cold water",
        "1 pound cross-cut beef short ribs or flanken",
        "2 1/2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1 large onion, chopped (2 cups)",
        "2 carrots, cut into 1/4-inch dice",
        "2 celery ribs, cut into 1/4-inch dice",
        "1/2 pound fresh cremini mushrooms, trimmed and quartered",
        "2 tablespoons vegetable oil",
        "1/2 cup pearl barley",
        "1/4 cup chopped fresh dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Mushroom",
        "Onion",
        "Vegetable",
        "Barley",
        "Winter",
        "Dill",
        "Gourmet"
    ],
    "title": "Beef, Mushroom, and Barley Soup",
    "url": "http://www.epicurious.com/recipes/food/views/beef-mushroom-and-barley-soup-235755"
}
