{
    "directions": [
        "Place cherry tomatoes into a bowl and season with black pepper, salt, and sugar. Stir in rice wine vinegar. Let stand about 15 minutes to let flavors blend.",
        "Stir 2 tablespoons horseradish into creme fraiche in a small bowl; season with 1/2 teaspoon salt. Refrigerate until needed.",
        "Cut steaks in half across the grain and pound each piece to about 3/8 inch thick. Season each side generously with salt, black pepper, and a pinch of cayenne pepper. Lay steaks onto a work surface and sprinkle each piece lightly with flour. Pat the flour into the meat. Repeat on other side. Let meat rest for 10 minutes to let flour adhere.",
        "Place a heavy skillet over medium-high heat, pour in vegetable oil, and heat until small wisps of smoke are visible rising off the oil. Lay steaks into the hot oil (meat should sizzle) and sear until browned, about 2 minutes per side. When you see beef juices accumulate on the surface of the meat, flip and brown the other side, about 2 minutes more. Transfer to a plate and let rest for about 2 minutes.",
        "Pour excess oil from the skillet and pour water into the skillet. Scrape up and dissolve any browned meat juices from the bottom of the skillet; continue to cook until slightly thickened, about 30 seconds. Pour pan juices over tomatoes and stir to combine.",
        "Divide about half the tomato mixture with juice per serving into the bottom of 2 large soup plates. Top each with 2 beef medallions and a spoonful of horseradish cream. Grate about 1/2 teaspoon horseradish over each serving and top with about 1 teaspoon of chives."
    ],
    "ingredients": [
        "2 cups quartered cherry tomatoes",
        "salt and freshly ground black pepper to taste",
        "1/4 teaspoon white sugar",
        "1 tablespoon rice wine vinegar",
        "2 tablespoons freshly grated raw horseradish, or to taste",
        "1/3 cup creme fraiche",
        "1/4 teaspoon salt, or to taste",
        "2 (3 ounce) beef top sirloin steaks",
        "1 pinch cayenne pepper, or to taste",
        "2 tablespoons all-purpose flour, or as needed",
        "2 tablespoons vegetable oil",
        "3 tablespoons water",
        "1 teaspoon freshly grated raw horseradish, divided",
        "2 teaspoons chopped fresh chives, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Beef Medallions with Fresh Horseradish Sauce",
    "url": "http://allrecipes.com/recipe/234934/beef-medallions-with-fresh-horseradis/"
}
