{
    "directions": [
        "Combine onions and broth in 6- to 8-quart pressure cooker. Place ribs in large bowl. Add hoisin sauce, soy sauce, vinegar, and sesame oil; toss to coat evenly. Transfer ribs and all juices from bowl to cooker. Scatter prunes over. Lock lid in place. Bring to high pressure over high heat. Cook 35 minutes, adjusting heat as necessary to maintain high pressure. Remove from heat. Let pressure come down naturally, about 20 minutes.",
        "Slowly release lid, standing back and allowing steam to escape. If ribs are not tender, lock on lid, return cooker to high pressure, and cook 5 minutes longer. Remove from heat. Let pressure come down naturally.",
        "Using slotted spoon, transfer ribs and prunes to large shallow bowl. Tent with foil to keep warm. Tilt cooker; spoon 1 tablespoon fat into small bowl and reserve. Spoon off remaining fat and discard. Mix flour into reserved 1 tablespoon fat to form smooth paste. Bring sauce in cooker to boil; whisk in flour paste. Boil until sauce thickens, whisking often, about 1 minute. Season to taste with salt and pepper. Pour sauce over ribs; sprinkle with green onions and serve."
    ],
    "ingredients": [
        "2 cups coarsely chopped onions",
        "1 cup beef broth",
        "12 2- to 3-inch-long meaty beef short ribs (about 4 pounds)",
        "3 tablespoons hoisin sauce",
        "2 tablespoons soy sauce",
        "1 tablespoon balsamic vinegar",
        "1 tablespoon oriental sesame oil",
        "1 cup (packed) pitted large prunes",
        "2 tablespoons all purpose flour",
        "Chopped green onions",
        "Special equipment: pressure cooker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pressure Cooker",
        "Onion",
        "Dinner",
        "Vinegar",
        "Dried Fruit",
        "Prune",
        "Beef Rib",
        "Fall",
        "Sesame",
        "Soy Sauce",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Beef Short Ribs with Asian Flavors",
    "url": "http://www.epicurious.com/recipes/food/views/beef-short-ribs-with-asian-flavors-108622"
}
