{
    "directions": [
        "Preheat oven to 325 degrees. Cut the beef into slices about 2 by 4 inches across and 1/2 inch thick. Dry on paper towels. Put a 1/16-inch layer of fat or oil in the skillet and heat until almost smoking. Brown the beef slices quickly, a few at a time, and set them aside.",
        "Reduce heat to moderate. Stir the onions into the fat in the skillet, adding more fat if necessary, and brown the onions lightly for about 10 minutes, stirring frequently. Remove from heat, season with salt and pepper, and stir in the garlic.",
        "Arrange half the browned beef in the casserole and season lightly with salt and pepper. Spread half the onions over the beef. Repeat with the rest of the beef and onions.",
        "Heat the stock or bouillon in the browning skillet, scraping up coagulated cooking juices. Pour it over the meat. Add enough beer so the meat is barely covered. Stir in the brown sugar. Bury the herb bouquet among the meat slices. Bring casserole to the simmer on top of the stove. Then cover the casserole and place in lower third of preheated oven. Regulate heat so liquid remains at a very slow simmer for 2 1/2 hours at the end of which time the meat should be fork-tender.",
        "Remove herb bouquet. Drain the cooking liquid out of the casserole into a saucepan, and skim off fat. Beat the starch and wine vinegar mixture into the cooking liquid and simmer for 3 to 4 minutes. Carefully correct seasoning. You should have about 2 cups of sauce. Pour the sauce back over the meat.",
        "(*) May be prepared in advance to this point.",
        "When ready to serve, cover the casserole and simmer slowly for 4 to 5 minutes until the meat is thoroughly heated through. Either bring the casserole to the table, or arrange the meat on a hot serving platter, spoon the sauce over it, surround with potatoes or noodles, and decorate with parsley."
    ],
    "ingredients": [
        "A 3-lb. piece of lean beef from the chuck roast  or rump",
        "2 to 3 Tb rendered fresh pork fat or good  cooking oil",
        "A heavy skillet",
        "1 1/2 lbs. or 6 cups of sliced onions",
        "Salt and pepper",
        "4 cloves mashed garlic",
        "A 9- to 10-inch fireproof casserole about 3 1/2  inches deep",
        "Salt and pepper",
        "1 cup strong beef stock or canned beef bouillon",
        "2 to 3 cups light beer, Pilsner type",
        "2 Tb light brown sugar",
        "1 large herb bouquet: 6 parsley sprigs, 1 bay  leaf, and 1/2 tsp thyme tied in cheesecloth",
        "1 1/2 Tb arrowroot or cornstarch blended with  2 Tb wine vinegar",
        "Parsley potatoes or buttered noodles",
        "Parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef and Onions Braised in Beer[Carbonnades à la Flamande]",
    "url": "http://www.williams-sonoma.com/recipe/beef-and-onions-braised-in-beercarbonnades--a-la-flamande.html"
}
