{
    "directions": [
        "In a large bowl whisk together the garlic paste, the lime juice, the cumin, and the oil.",
        "Add the steak to the marinade, turning it to coat it well, and let it marinate, covered and chilled, for at least 1 hour or overnight. Grill the steak, drained, on a well-oiled rack set about 5 inches over glowing coals or in a hot well-seasoned ridged grill pan over moderately high heat for 3 to 4 minutes on each side, or until it is just springy to the touch, for medium-rare meat. (Alternatively, the steak may be broiled on the rack of a broiler pan under a preheated broiler about 4 inches from the heat for 3 to 4 minutes on each side for medium-rare meat.) Transfer the steak to a cutting board and let it stand for 10 minutes. While the steak is standing, in a large skillet heat the oil over moderately high heat until it is hot but not smoking, add the bell peppers, the onion, and the garlic, and sauté the mixture, stirring, for 5 minutes, or until the bell peppers are softened. Slice the steak thin across the grain on the diagonal and arrange the slices on a platter with the bell pepper mixture. Drizzle any steak juices over the steak and the pepper mixture and serve the steak and the pepper mixture with the tortillas, the guacamole, and the salsa.",
        "Spread some of the guacamole on a tortilla, top it with a few slices of the steak, some of the pepper mixture, and some of the salsa, and roll up the tortilla to enclose the filling.",
        "In the oven:Stack 6 tortillas at a time, wrap each stack in foil, and heat the tortillas in the middle of a preheated 325°F. oven for 5 minutes for corn tortillas and 15 minutes for flour tortillas. (If the tortillas are very dry to begin with, pat each tortillas between dampened hands before stacking them.)",
        "In the microwave:Stack 6 tortillas at time, wrap each stack in a microwave-safe plastic bag, and heat the tortillas in a microwave oven at high power (100%) for 30 seconds to 1 minute, or until they are heated through and pliable."
    ],
    "ingredients": [
        "4 garlic cloves, minced and mashed to a paste with 1 teaspoon salt",
        "1/4 cup fresh lemon juice",
        "1 1/2 teaspoons ground cumin",
        "2 tablespoons olive oil",
        "2 pounds skirt steak, trimmed and cut into large pieces to fit on a grill or broiler pan or in a ridged grill pan",
        "2 tablespoons vegetable oil",
        "3 assorted colored bell peppers, sliced thin",
        "1 large red onion, sliced thin",
        "2 garlic cloves, minced",
        "twelve 7- to 8-inch flour tortillas (recipe follows or store-bought), warmed (procedure follows)",
        "guacamole and tomato salsa as accompaniments"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Microwave",
        "Beef",
        "Onion",
        "Broil",
        "Quick & Easy",
        "Lemon",
        "Steak",
        "Bell Pepper",
        "Winter",
        "Tortillas",
        "Gourmet"
    ],
    "title": "Beef Fajitas",
    "url": "http://www.epicurious.com/recipes/food/views/beef-fajitas-13589"
}
