{
    "directions": [
        "Preheat oven to 425°F.",
        "Pat filets mignons dry and season with salt and pepper. In a shallow roasting pan roast filets in middle of oven 12 minutes, or until a meat thermometer registers 110°F for rare, and cool (filets will be baked again after being wrapped in pastry). Chill filets, covered, until cold, about 1 hour.",
        "Thinly slice mushrooms and in a heavy skillet cook in butter with shallot, garlic, and salt and pepper to taste over moderate heat, stirring, until mushrooms are lightly browned. Transfer mushroom mixture to a bowl to cool completely. In a small bowl lightly beat egg to make an egg wash.",
        "On a lightly floured surface roll out puff pastry sheet into a 14-inch square. Trim edges to form a 13-inch square and cut square into four 61/2-inch squares.",
        "Put 1 tablespoon Gorgonzola in center of 1 square and top with one fourth mushroom mixture. Top mushroom mixture with a filet mignon, pressing it down gently, and wrap 2 opposite corners of puff pastry over filet, overlapping them. Seal seam with egg wash. Wrap remaining 2 corners of pastry over filet and seal in same manner. Seal any gaps with egg wash and press pastry around filet to enclose completely. Arrange beef Wellington, seam side down, in a non-stick baking pan. Make 3 more beef Wellingtons in same manner. Chill remaining egg wash for brushing on pastry just before baking. Chill beef Wellingtons, loosely covered, at least 1 hour and up to 1 day.",
        "Preheat oven to 425°F.",
        "Brush top and sides of each beef Wellington with some remaining egg wash and bake 20 minutes, or until pastry is golden.",
        "In a saucepan boil demiglace and Madeira 1 minute and keep sauce warm.",
        "Serve beef Wellingtons with sauce."
    ],
    "ingredients": [
        "four 1 1/2-inch-thick center-cut filets mignons (about 6 ounces each)",
        "4 large mushrooms (about 1/4 pound total)",
        "1 tablespoon unsalted butter",
        "1 tablespoon finely chopped shallot",
        "1 tablespoon minced garlic",
        "1 large egg",
        "1 puff pastry sheet (from a 17 1/4-ounce package frozen puff pastry), thawed",
        "4 tablespoons Gorgonzola cheese (about 2 1/2 ounces)",
        "1 cup veal or beef demiglace",
        "2 tablespoons Sercial Madeira"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Valentine's Day",
        "Blue Cheese",
        "Beef Tenderloin",
        "Winter",
        "Phyllo/Puff Pastry Dough",
        "Gourmet"
    ],
    "title": "Beef Wellingtons with Gorgonzola",
    "url": "http://www.epicurious.com/recipes/food/views/beef-wellingtons-with-gorgonzola-14632"
}
