{
    "directions": [
        "To prepare the beef short ribs, set the Sous Vide Professional to 135°F (57°C), with the rear pump flow switch closed and the front flow switch set to fully open.",
        "Season the beef short ribs with salt and coarsely ground pepper.",
        "In a hot pan, grill or plancha, warm olive oil or butter. Add the short ribs and sear until evenly browned on all sides. Basting the ribs in foaming butter will produce an appealing color and flavor.",
        "Place the short ribs in a large vacuum bag and evenly distribute the butter, thyme sprigs, chopped peppercorns and stock.",
        "Seal the bag to the desired vacuum; for beef, 90% to 95% vacuum is desirable.",
        "Once the target temperature of 135°F (57°C) is reached, place the bag in the circulating water bath. Allow for at least a 50% food-to-water ratio to ensure optimal circulation.",
        "Cook the short ribs to the desired doneness, 48 to 72 hours (see note above).",
        "Remove the bag from the circulating water and remove the short ribs from the bag.",
        "To render the fat and achieve a browned exterior, sear the short ribs in a hot pan, place them in a 450°F oven or grill them for 10 to 15 minutes, or until browned to your liking.",
        "Let the short ribs rest for 60 seconds before serving.",
        "To prepare the cumin-butter carrots, set the Sous Vide Professional to 185°F (85°C), with the rear pump flow switch closed and the front flow switch set to fully open.",
        "Peel the carrots and trim off the green tops.",
        "In a small saucepan over low heat, combine the butter, cumin and salt. Heat until the butter melts and the ingredients are blended.",
        "Place the carrots and butter mixture in a medium vacuum bag. Seal the bag to 99.9%, full vacuum.",
        "Once the target temperature of 185°F (85°C) is reached, place the bag in the circulating water bath.",
        "Cook the carrots until tender, about 45 minutes.",
        "Remove the bag from the circulating water and remove the carrots from the bag. Serve the carrots with the short ribs. Serves 4.",
        "Adapted from a recipe by PolyScience."
    ],
    "ingredients": [
        "4 bone-in beef short ribs, each 6 to 8 inches long",
        "Kosher salt and coarsely ground pepper, to taste",
        "Olive oil or unsalted butter for searing",
        "2 Tbs. unsalted butter",
        "4 fresh thyme sprigs",
        "1 tsp. roughly chopped peppercorns",
        "2 cups beef stock or your favorite marinade",
        "1 bunch baby carrots",
        "2 Tbs. unsalted butter",
        "1/2 Tbs. freshly ground cumin",
        "Kosher salt, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Short Ribs with Cumin-Butter Carrots",
    "url": "http://www.williams-sonoma.com/recipe/beef-short-ribs-with-cumin-butter-carrots.html"
}
