{
    "directions": [
        "Place marrow bones in large bowl. Cover with ice water. Refrigerate overnight. Drain bones. Using small sharp knife, push marrow out through bones. Coarsely crumble enough marrow to equal 1 1/4 cups. Reserve bones and any remaining marrow for another use.",
        "Boil stock, wine and Port in heavy large saucepan until liquid is reduced to 1 1/4 cups, about 30 minutes.",
        "Preheat oven to 450°F. Sprinkle steaks with salt and pepper. Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Working in batches, add steaks to skillet and cook until brown, about 2 minutes per side. Transfer steaks to rimmed baking sheet. Cook steaks in oven to desired doneness, about 8 minutes for medium-rare. Tent with foil to keep warm.",
        "Meanwhile, discard excess oil in skillet. Whisk reduced stock mixture into skillet. Bring to boil, scraping up any browned bits. Strain sauce into small saucepan; discard solids. Add reserved 1 1/4 cups crumbled marrow to sauce; stir until melted. Keep sauce warm.",
        "Melt 3 tablespoons butter in another heavy large skillet over medium-high heat. Add mushrooms, shallots and garlic; sauté until mushrooms are golden brown and tender, about 10 minutes. Stir in tomatoes and parsley. Season mushroom mixture with salt and pepper.",
        "Spoon sauce onto plates. Place steaks atop sauce. Spoon mushroom mixture over steaks. Surround with Glazed Onions and serve."
    ],
    "ingredients": [
        "3 pounds 1- to 2-inch pieces beef marrow bones",
        "3 cups beef stock or canned beef broth",
        "1 1/2 cups dry red wine",
        "3/4 cup ruby Port",
        "6 8-ounce filet mignon steaks (about 1 inch thick)",
        "1 tablespoon olive oil",
        "3 tablespoons unsalted butter",
        "18 ounces assorted fresh wild mushrooms (such as crimini, oyster and stemmed shiitake), sliced",
        "3 large shallots, thinly sliced",
        "1 1/2 tablespoons minced garlic",
        "3 plum tomatoes, seeded, diced",
        "2 teaspoons chopped fresh parsley",
        "Glazed Onions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Mushroom",
        "Onion",
        "Tomato",
        "Bake",
        "Sauté",
        "Port",
        "Red Wine",
        "Winter"
    ],
    "title": "Beef with Mushrooms and Glazed Onions",
    "url": "http://www.epicurious.com/recipes/food/views/beef-with-mushrooms-and-glazed-onions-5347"
}
