{
    "directions": [
        "Preheat the oven to 170 to 180 degrees F.",
        "In a large skillet over medium heat, cook the onions until softened. Then add the ground beef and cook until the beef is cooked through. Add the cumin, chili powder, oregano and salt and stir to combine. Pour 2 cans of the Mexican tomato sauce into the meat and simmer over low heat for 5 minutes. Add a little water if the mixture gets too dry.",
        "Meanwhile, heat the refried beans in a saucepan over medium-low heat. Add the cheese, and stir it in till its melted. Remove from the heat.",
        "Heat the tortillas in the microwave for 1 minute, and then spread a small amount of beans on each tortilla. Add a small amount of the meat. Fold over the ends of the tortilla, and then roll them up. Repeat with the rest of the tortillas. Then place them in a large baking dish, cover with foil and keep warm in the oven.",
        "When ready to serve, drizzle the remaining can of tomato sauce over all of the burritos and sprinkle with more grated Cheddar. Return to the oven for a couple of minutes just to melt the cheese.",
        "Sprinkle the tops with the cilantro leaves and serve immediately to the fork-bangers in your life. They'll kiss you and hug you. Repeatedly."
    ],
    "ingredients": [
        "1 medium onion, diced",
        "2 pounds ground beef",
        "1/2 teaspoon ground cumin",
        "1/4 teaspoon chili powder",
        "1/4 teaspoon ground oregano",
        "1/4 teaspoon salt",
        "Three 7-ounce cans Mexican tomato sauce (I use El Patobrand) or enchilada sauce",
        "One 28-ounce can refried beans",
        "3/4 cup grated Cheddar, plus extra for sprinkling",
        "12 burrito-size flour tortillas",
        "1/2 cup fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Burrito",
        "Beef",
        "Meat",
        "Beans and Legumes",
        "Main Dish Recipes"
    ],
    "title": "Beef and Bean Burritos",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/beef-and-bean-burritos-recipe"
}
