{
    "directions": [
        "Blend both flours and salt in processor 5 seconds. Drop in shortening by tablespoonfuls. Cut in until coarsely diced. Add butter. Cut in until coarse meal forms. Transfer to bowl. Add 7 tablespoons ice water. Toss with fork until moist clumps form, adding more water by teaspoonfuls if dry. Gather dough into ball; divide into 4 equal pieces. Shape each into disk; wrap and chill at least 45 minutes and up to 1 day.",
        "Heat oil in heavy large skillet over medium heat. Add onions. Sauté until deep brown, reducing heat if necessary to avoid burning, about 30 minutes. Add wine and thyme. Simmer until liquid evaporates, stirring often, about 3 minutes.Season with salt and pepper. Cool. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 400°F. Roll out each dough disk between sheets of parchment paper to 9-inch round. Peel top parchment off each. Spread 1/4 of onion mixture on half of each round, leaving 1-inch plain border. Top onions with beef strips. Sprinkle 1/4 teaspoon coarse salt over beef on each, then top each with 1/4 of cheese. Sprinkle with pepper. Brush dough border with some egg white. Using bottom parchment as aid, fold plain dough half over filling. Seal edges. Fold sealed edge over again; press with fork to double-seal.",
        "Brush each pasty with egg white. Cut 3 slits in each top crust. Divide pasties (still on parchment) between 2 large rimmed baking sheets.",
        "Bake pasties until crust is golden brown and filling is cooked through, about 30 minutes. Cool 10 minutes; serve."
    ],
    "ingredients": [
        "2 cups unbleached all purpose flour",
        "1 cup white whole wheat flour or whole wheat flour",
        "1 1/8 teaspoons salt",
        "1/2 cup solid vegetable shortening (preferably nonhydrogenated), frozen",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "7 tablespoons (or more) ice water",
        "4 teaspoons olive oil",
        "2 large onions, thinly sliced",
        "1/2 cup dry white wine",
        "1/2 teaspoon dried thyme",
        "10 ounces skirt steak, cut crosswise on diagonal into 1/4-inch-wide strips",
        "1 teaspoon coarse kosher salt, divided",
        "6 ounces coarsely crumbled Stilton blue cheese (11/3 to 11/2 cups), divided",
        "1 large egg white, beaten to blend"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Onion",
        "Bake",
        "Sauté",
        "Super Bowl",
        "High Fiber",
        "Father's Day",
        "Lunch",
        "Blue Cheese",
        "Steak",
        "Poker/Game Night",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Beef Pasties with Caramelized Onions and Stilton Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/beef-pasties-with-caramelized-onions-and-stilton-cheese-351530"
}
