{
    "directions": [
        "Put oven rack in middle position and preheat oven to 450°F.",
        "While oven heats, wrap parsley, thyme, and bay leaf in cheesecloth and tie into a bundle with kitchen string to make a bouquet garni.",
        "Spread beef shanks, veal shanks, onions, and carrot in a large flameproof roasting pan, then brown well in oven, turning occasionally, about 1 hour.",
        "Transfer meat and vegetables to a 6- to 8-quart stockpot. Add 2 cups water to roasting pan, then straddle pan across 2 burners and deglaze by boiling over high heat, stirring and scraping up brown bits, 2 minutes. Add deglazing liquid to stockpot along with 4 quarts water, celery, salt, and bouquet garni. Bring to a boil and skim froth. Add remaining 1/2 cup water, then bring mixture to a simmer and skim any froth.",
        "Simmer gently, uncovered, skimming froth occasionally, until liquid is reduced to about 8 cups, 3 to 5 hours.",
        "Pour stock through a fine-mesh sieve into a bowl, pressing hard on and then discarding solids. If using stock right away, skim off and discard fat. If not, cool stock completely, uncovered, then chill, covered (it will be easier to remove fat when chilled)."
    ],
    "ingredients": [
        "4 fresh flat-leaf parsley sprigs",
        "1 fresh thyme sprig",
        "1 Turkish or 1/2 California bay leaf",
        "2 lb meaty beef shanks, sawed crosswise into 1-inch slices by butcher",
        "2 lb meaty veal shanks, sawed crosswise into 1-inch slices by butcher",
        "2 onions (left unpeeled), quartered",
        "1 carrot, quartered",
        "4 qt plus 2 1/2 cups cold water",
        "2 celery ribs, quartered",
        "1 1/2 teaspoons salt",
        "Special equipment: cheesecloth; kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Onion",
        "Vegetable",
        "Roast",
        "Beef Shank",
        "Veal",
        "Thyme",
        "Parsley",
        "Simmer",
        "Gourmet"
    ],
    "title": "Beef Stock",
    "url": "http://www.epicurious.com/recipes/food/views/beef-stock-231227"
}
