{
    "directions": [
        "Preheat oven to 350°F. Toast fennel seeds in small dry skillet over medium-low heat until slightly darker in color and very fragrant, about 3 minutes. Set aside.",
        "Heat 2 tablespoons oil in large oven-proof pot over medium heat. Add sausage. Cook until brown and cooked through, breaking up with back of spoon, about 10 minutes. Using slotted spoon, transfer sausage to large bowl.",
        "Add 1 tablespoon oil to pot. Sprinkle beef shanks with salt and pepper. Add to pot and sauté until brown, about 6 minutes per side. Transfer shanks to bowl with sausage. Add onions to pot and sauté until brown and tender, scraping up browned bits, about 10 minutes. Return shanks, sausage, and any accumulated juices to pot. Add tomatoes with juice, wine, garlic, bay leaves, oregano, crushed red pepper, and toasted fennel seeds. Bring to simmer.",
        "Cover pot and place in oven. Braise until shanks are very tender, about 2 1/2 hours. Transfer shanks to work surface. Cut meat off bones and dice. Discard bones. Tilt pot. Spoon off fat from surface of pan juices. Return diced shank meat to pot. Simmer until liquid is reduced enough to coat spoon, about 10 minutes. Season ragù to taste with salt and pepper. DO AHEAD: Can be made 2 days ahead. Cool slightly. Chill uncovered until cold, then cover and keep chilled. Rewarm over medium heat, stirring occasionally, before continuing.",
        "Cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain pasta; transfer to large bowl. Add oil and toss to coat. Add cheese and parsley; toss to coat. Season pasta with salt and pepper.",
        "Divide pasta among 12 shallow bowls. Ladle ragù over and serve."
    ],
    "ingredients": [
        "2 teaspoons fennel seeds",
        "3 tablespoons olive oil, divided",
        "2 pounds hot Italian sausages, casings removed",
        "3 1/2 to 3 3/4 pounds 1 1/2-inch-thick beef shanks with bone (about 3 pieces)",
        "5 cups chopped onions (about 3 large)",
        "2 28-ounce cans diced tomatoes in juice",
        "1 750-ml bottle dry red wine",
        "8 large garlic cloves, chopped",
        "4 fresh bay leaves",
        "2 teaspoons dried oregano",
        "1 teaspoon dried crushed red pepper",
        "1 1/2 pounds multi-grain or whole grain spaghetti",
        "3 tablespoons extra-virgin olive oil",
        "2/3 cup (packed) freshly grated Parmesan cheese (about 2 ounces)",
        "1/2 cup finely chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Sauté",
        "High Fiber",
        "Dinner",
        "Beef Shank",
        "Sausage",
        "Family Reunion",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Beef Shank and Sausage Ragù with Whole Grain Spaghetti",
    "url": "http://www.epicurious.com/recipes/food/views/beef-shank-and-sausage-ragu-with-whole-grain-spaghetti-352589"
}
