{
    "directions": [
        "Melt 2 tablespoons butter in heavy medium saucepan over medium-high heat. Add 1/2 cup shallots and sauté 4 minutes. Add wine and boil 1 minute. Add both stocks and boil until reduced to 2/3 cup, about 28 minutes. (Sauce can be prepared 1 day ahead. Cool slightly. Cover and refrigerate.)",
        "Preheat oven to 200°F. Mix potato, breadcrumbs, 1 tablespoon parsley and remaining 1 tablespoon shallots in medium bowl. Sprinkle with salt and pepper.",
        "Heat 2 tablespoons oil in large nonstick skillet over medium heat. Mound potato mixture in skillet in 2 portions, dividing evenly. Using metal spatula, press each into 5-inch oval. Cook until bottom is brown and crisp, about 10 minutes. Turn and cook until second side browns, about 5 minutes. Transfer galettes to baking sheet. Keep warm in oven.",
        "Heat 1 tablespoon oil in heavy medium skillet over medium-high heat. Sprinkle steaks with salt and pepper. Add to skillet; cook to desired doneness, about 4 minutes per side for medium-rare. Transfer steaks to plate (do not clean skillet). Add sauce to skillet and bring to boil, scraping up browned bits. Mix in mustard. Remove from heat. Add remaining 2 tablespoons butter and whisk just until melted.",
        "Place potato galettes on plates. Top each with 1 steak. Spoon sauce over. Sprinkle with remaining 1 tablespoon parsley and serve."
    ],
    "ingredients": [
        "4 tablespoons (1/2 stick) unsalted butter",
        "1/2 cup plus 1 tablespoon chopped shallots",
        "1/2 cup dry white wine",
        "2 cups chicken stock or canned low-salt chicken broth",
        "1 cup beef stock or canned beef broth",
        "1 12-ounce russet potato, peeled, grated, drained well",
        "1/2 cup fresh white breadcrumbs made from French bread",
        "2 tablespoons chopped fresh parsley",
        "3 tablespoons olive oil",
        "2 6-ounce beef tenderloin steaks (about 1 inch thick)",
        "1 tablespoon coarse-grained mustard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mustard",
        "Potato",
        "Valentine's Day",
        "Beef Tenderloin",
        "Steak",
        "Shallot"
    ],
    "title": "Beef Tenderloin Steaks on Potato Galettes with Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/beef-tenderloin-steaks-on-potato-galettes-with-mustard-sauce-102422"
}
