{
    "directions": [
        "Combine 1 cup onion, bacon and carrot in heavy medium skillet. Cook over medium heat until vegetables begin to brown, stirring occasionally, about 12 minutes. Mix in ham, then breadcrumbs. Cool filling completely.",
        "Using meat mallet or rolling pin, pound each beef slice between sheets of waxed paper to 6x4-inch rectangle. Spread 1 1/2 teaspoons mustard over each beef slice. Spoon 3 tablespoons ham mixture onto center of each slice. Gently press filling out to cover meat and adhere, leaving 1/2-inch border on all sides. Place 1 pickle wedge parallel to 1 long side on each beef slice. Fold in short sides. Roll meat over pickle jelly roll style, enclosing filling completely. Secure with toothpicks. (Can be made 4 hours ahead. Cover and chill).",
        "Melt butter in heavy large skillet over medium-high heat. Add 1 cup onion; sauté until golden, about 8 minutes. Mix in paprika. Add beef rolls; turn to coat with butter. Add broth; bring to boil. Reduce heat to medium, cover and simmer until beef is tender, turning rolls occasionally, about 40 minutes.",
        "Using tongs, transfer beef to platter. Tent with foil. Increase heat to medium-high; boil until liquid is reduced to sauce consistency, about 15 minutes.",
        "Remove toothpicks from beef. Top meat with sauce and serve."
    ],
    "ingredients": [
        "2 cups chopped onion",
        "2 bacon slices, chopped",
        "1/4 cup finely chopped carrot",
        "1/2 cup chopped smoked ham (such as Black Forest)",
        "1/4 cup dry breadcrumbs",
        "8 2-ounce slices tip steak beef round",
        "1/4 cup German-style mustard",
        "1 large dill pickle, cut lengthwise into 8 wedges",
        "6 tablespoons (3/4 stick) butter",
        "2 tablespoons Hungarian sweet paprika",
        "2 cups canned beef broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mustard",
        "Vegetable",
        "Sauté",
        "Ham",
        "Chill"
    ],
    "title": "Beef Rolls with Ham and Vegetables Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/beef-rolls-with-ham-and-vegetables-stuffing-862"
}
