{
    "directions": [
        "Put oven rack in middle position and preheat oven to 325°F.",
        "Heat oil in pot over moderately high heat until hot but not smoking.",
        "Meanwhile, pat meat dry and sprinkle with salt and pepper.",
        "Brown meat in hot oil on all sides, about 10 minutes total. (If bottom of pot begins to scorch, lower heat to moderate.) Transfer to a plate using a fork and tongs.",
        "Add pancetta to oil in pot and sauté over moderately high heat, stirring frequently, until browned and fat is rendered, about 3 minutes. Add onion, carrot, and celery and sauté, stirring occasionally, until vegetables are softened and golden brown, 10 to 12 minutes. Add garlic, thyme, and rosemary and sauté, stirring, until garlic begins to soften and turn golden, about 2 minutes. Stir in tomato paste and cook, stirring, 1 minute. Add wine and boil until liquid is reduced by about half, about 5 minutes. Add water and bring to a simmer, then return meat along with any juices accumulated on plate to pot. Cover pot with lid and transfer to oven. Braise until meat is very tender, 2 1/2 to 3 hours.",
        "Transfer meat to a cutting board. Skim fat from surface of sauce and discard along with herb stems. Boil sauce until reduced by about one third, about 5 minutes, then season with salt. Cut meat across the grain into 1/2-inch-thick slices and return to sauce."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 (3- to 3 1/2-pound) boneless beef chuck roast",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/4 pound sliced pancetta, finely chopped",
        "1 medium onion, finely chopped",
        "1 medium carrot, finely chopped",
        "2 celery ribs, finely chopped",
        "4 garlic cloves, thinly sliced",
        "4 (4- to 6-inch) sprigs fresh thyme",
        "2 (6- to 8-inch) sprigs fresh rosemary",
        "2 tablespoons tomato paste",
        "2 cups Barolo or other full-bodied red wine such as Ripasso Valpolicella, Gigondas, or Côtes du Rhône",
        "2 cups water",
        "Special equipment: a 4- to 5-qt heavy ovenproof pot with lid",
        "Accompaniment: creamy polentaepi:recipelink</epi:recipelink>"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Onion",
        "Pork",
        "Tomato",
        "Vegetable",
        "Braise",
        "Sauté",
        "Red Wine",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Beef Braised in Red Wine",
    "url": "http://www.epicurious.com/recipes/food/views/beef-braised-in-red-wine-236986"
}
