{
    "directions": [
        "In a large bowl combine the roast beef, the peas, and the potatoes. In a skillet cook the onion in the 1 tablespoon unmelted butter over moderately low heat, stirring occasionally, until it is softened, add the garlic, and cook the mixture for 3 minutes. Stir in the Worcestershire sauce, the horseradish, and the cream and cook the mixture, stirring until it is thickened. Add the sauce to the roast beef mixture, season the mixture with salt and pepper, and combine it well. Divide the mixture among the six 1 1/2 cup gratin dishes.",
        "Pour the melted butter around the edges of the gratin dishes and heat the potpies in the middle of a preheated 450°F., oven for 2 minutes. Pour 1/3 cup of the Yorkshire pudding batter around the edge of each gratin dish and bake the potpies for 15 minutes (do not open the oven door). Reduce the heat to 400°F. and bake the potpies for 10 to 15 minutes more, or until the pudding is puffed and browned.",
        "In a blender blend the eggs, the salt, the flour, and the milk for 30 seconds and chill the mixture, covered, for 30 minutes. In a small bowl beat the egg white until it forms soft peaks and fold it into the mixture."
    ],
    "ingredients": [
        "5 cups 1/2-inch pieces cooked rare roast beef (about 2 pounds)",
        "a 10-ounce package frozen peas, thawed",
        "1 pound boiling potatoes (about 4), cooked and cut into 1/2-inch pieces",
        "1 onion, sliced thin",
        "1 tablespoon unsalted butter, plus 2 tablespoons unsalted butter, melted (or 2 tablespoons roast beef drippings, heated)",
        "1 garlic clove, minced",
        "1 tablespoon Worcestershire sauce",
        "1 1/2 teaspoons bottled horseradish",
        "1/4 cup heavy cream",
        "2 large eggs",
        "1/2 teaspoon salt",
        "1 cup all-purpose flour",
        "1 cup milk",
        "1 large egg white at room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Beef",
        "Potato",
        "Bake",
        "Casserole/Gratin",
        "Horseradish",
        "Pea",
        "Winter",
        "Gourmet"
    ],
    "title": "Beef Potpies with Yorkshire Pudding Crusts",
    "url": "http://www.epicurious.com/recipes/food/views/beef-potpies-with-yorkshire-pudding-crusts-10295"
}
