{
    "directions": [
        "Preheat the oven to 425 degrees F. Oil a 2-quart baking dish.",
        "Bring a large pot of salted water to a boil. Add the noodles and cook to al dente according to the package directions. Drain and put in the prepared baking dish. Toss with the sour cream, Parmesan and 1/4 teaspoon salt.",
        "Meanwhile, heat the olive oil in a large skillet over medium-high heat. Add the ground beef and cook, stirring, until no longer pink, about 4 minutes. Add the bell peppers and scallions and cook until crisp-tender, about 3 minutes. Make a space in the pan, add the tomato paste and toast for a minute. Sprinkle with the Italian seasoning and 1/4 teaspoon salt. Add the diced tomatoes, stir and bring to a simmer. Cook until slightly thickened, about 2 minutes.",
        "Pour the beef mixture over the noodles and sprinkle with the grated Cheddar. Bake on the middle rack until the cheese is melted and the edges are bubbling, 15 to 20 minutes. Let stand for 10 minutes before serving."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil, plus more for the baking dish",
        "Kosher salt",
        "3 cups wide egg noodles (about 5 ounces)",
        "1 1/2 cups sour cream",
        "1/2 cup freshly grated Parmesan",
        "12 ounces ground beef",
        "1 red bell pepper, seeded and chopped",
        "1 bunch scallions (white and green parts), finely chopped",
        "1 tablespoon tomato paste",
        "1 teaspoon Italian seasoning",
        "One 14 1/2-ounce can petite diced tomatoes",
        "2 cups grated Cheddar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Casserole Recipes",
        "Casserole",
        "Easy Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Cheddar",
        "Cheese",
        "Beef",
        "Meat",
        "Noodles"
    ],
    "title": "Beef and Cheddar Casserole",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/beef-and-cheddar-casserole-recipe"
}
