{
    "directions": [
        "Soak 24 bamboo skewers in water for 30 minutes.",
        "In a bowl, whisk together 1/2 cup of the soy sauce, the mirin, 2 Tbs. of the sesame oil, the lime juice and honey. Stir in the ginger, 2 of the garlic cloves and the chili. Transfer the ginger dipping sauce to a small serving bowl.",
        "In a blender or food processor, combine the remaining 1/2 cup soy sauce, the remaining 3 Tbs. sesame oil, the lemongrass, lemon zest, lemon juice, the remaining 3 garlic cloves, the green onions and brown sugar and process until smooth. Pour the marinade into a large measuring cup.",
        "Using a sharp knife, score the meat on both sides in a crosshatch pattern, cutting no more than 1/4 inch deep. Slice the meat across the grain on the bias into strips 1/2 inch thick. One at a time, thread the strips lengthwise onto the skewers. Dip the skewers in the marinade, then place them in a shallow dish. Cover and refrigerate for at least 1 hour or up to overnight.",
        "Prepare a medium-hot fire in a grill. Brush and oil the grill grate.",
        "Transfer the skewers to a plate and season generously with salt and pepper. Grill the skewers directly over the heat, turning once, until nicely charred and cooked to your liking, 2 to 3 minutes per side.",
        "Arrange the skewers on a platter, garnish with toasted sesame seeds and serve immediately with the ginger dipping sauce. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "On the Grill,",
        "by Willie Cooper (Oxmoor House, 2009)."
    ],
    "ingredients": [
        "1 cup soy sauce",
        "1/4 cup mirin",
        "5 Tbs. Asian sesame oil",
        "Juice of 1 lime",
        "1 to 2 Tbs. honey",
        "2 Tbs. peeled and minced fresh ginger",
        "5 garlic cloves, minced",
        "1 Thai chili, finely sliced (optional)",
        "2 lemongrass stalks, white portion only, finely diced",
        "Zest and juice of 1 lemon",
        "2 green onions, white portion only, finely diced",
        "2 Tbs. light brown sugar, firmly packed",
        "1 flank steak, 1 1/2 to 1 3/4 lb., trimmed of excess fat",
        "Salt and freshly ground pepper, to taste",
        "Toasted sesame seeds for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Satay with Ginger Dipping Sauce",
    "url": "http://www.williams-sonoma.com/recipe/beef-satay-with-ginger-dipping-sauce.html"
}
