{
    "directions": [
        "Remove rind and cut bacon into lardons (sticks 1/4-inch thick and 1 1/2 inches long). Simmer rind and bacon for 10 minutes in 1 1/2 quarts water. Drain and dry.",
        "Preheat oven to 450 degrees.",
        "Sauté the bacon in oil over moderate heat for 2 to 3 minutes to brown lightly. Remove to a side dish with a slotted spoon. Set casserole aside. Reheat until fat is almost smoking before you sauté the beef.",
        "Dry the beef in paper towels; it will not brown if it is damp. Sauté it, a few pieces at a time, in the hot oil and bacon fat until nicely browned on all sides. Add it to the bacon.",
        "In the same fat, brown the sliced vegetables. Pour out the sautéing fat.",
        "Return the beef and bacon to the casserole and toss with salt and pepper. Then sprinkle on the flour and toss again to coat the beef lightly with the flour. Set casserole uncovered in middle position of preheated oven for 4 minutes. Toss the meat and return to oven for 4 minutes (this browns the flour and coves the meat with a light crust). Remove casserole, and turn oven down to 325 degrees.",
        "Stir in wine, and enough stock or bouillon so that the meat is barely covered. Add the tomato paste, garlic, herbs, and bacon rind. Bring to a simmer on top of the stove. Then cover casserole and set in lower third of preheated oven. Regulate heat so that liquid simmers very slowly for 2 1/2 to 3 hours. The meat is done when a fork pierces it easily.",
        "While the beef is cooking, prepare the onions and mushrooms. Set them aside until needed.",
        "When the meat is tender, pour the contents of the casserole into a sieve set over a saucepan.",
        "Wash out the casserole and return the beef and bacon to it. Distribute the cooked onions and mushrooms over the meat.",
        "Skim fat off the sauce. Simmer sauce for a minute or two, skimming off additional fat as it rises. You should have about 2 1/2 cups of sauce thick enough to coat a spoon lightly. If too thin, boil it down rapidly. If too thick, mix in a few tablespoons stock. Taste carefully for seasoning.",
        "Recipe may be completed in advance at this point.",
        "Cover the casserole and simmer for 2 to 3 minutes, basting the meat and vegetables with the sauce several times. Serve in its casserole, or arrange the stew on a platter surrounded with potatoes, noodles, or rice, and decorated with parsley.",
        "When cold, cover and refrigerate. About 15 to 20 minutes before serving, bring to the simmer, cover, and simmer very slowly for 10 minutes, occasionally basting the meat and vegetables with the sauce."
    ],
    "ingredients": [
        "One 6-ounce chunk of bacon",
        "1 tablespoon of olive oil or cooking oil",
        "3 pounds lean stewing beef, cut into 2-inch cubes",
        "1 carrot, sliced",
        "1 onion, sliced",
        "1 teaspoon salt",
        "1/4 teaspoon pepper",
        "2 tablespoons flour",
        "3 cups of a full-bodied young red wine",
        "2 to 3 cups brown beef stock or canned boullion",
        "1 tablespoon tomato paste",
        "2 cloves mashed garlic",
        "1/2 teaspoon thyme",
        "A crumbled bay leaf",
        "18 to 24 small white onions, brown-braised in stock",
        "1 pound quartered fresh mushrooms sautéed in butter",
        "9–10 inch fireproof casserole 3 inches deep"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Braise",
        "Kid-Friendly",
        "Dinner",
        "Bacon",
        "Red Wine",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Beef Bourguignon",
    "url": "http://www.epicurious.com/recipes/food/views/beef-bourguignon-56389455"
}
