{
    "directions": [
        "Make the sauce",
        "In a bowl, combine the water, oyster sauce, soy sauce, wine, sesame oil, cornstarch, sugar and white pepper. Stir to dissolve the cornstarch and sugar.",
        "Cook the broccoli and the noodles",
        "Bring a large pot of water to a boil over high heat. Add the broccoli and cook until crisp-tender, 3 to 4 minutes. Using a slotted spoon, transfer the broccoli to a colander and rinse with cold running water to stop the cooking.",
        "Return the water to a boil, add the noodles and cook, stirring occasionally, until just tender, about 1 minute. Drain the noodles and toss with 1 Tbs. of the corn oil. Transfer to a large bowl or platter and cover loosely with aluminum foil to keep warm.",
        "Stir-fry the beef and broccoli",
        "Heat a wok or large fry pan over high heat until very hot and pour in the remaining 2 Tbs. corn oil. Add the ginger and stir-fry until golden brown, about 1 minute. Using the slotted spoon, scoop out and discard the ginger. Add the beef to the seasoned oil and stir-fry until just browned, about 2 minutes. Using the slotted spoon, transfer the beef to a bowl.",
        "Return the wok to high heat, add the sauce and cook, stirring, until slightly thickened, about 30 seconds. Return the beef to the wok, add the broccoli and stir-fry until heated through, about 1 minute. Spoon over the noodles and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Asian,",
        "by Farina Wong Kingsley (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "1/3 cup water",
        "1/4 cup oyster sauce",
        "3 Tbs. soy sauce",
        "2 Tbs. rice wine or dry sherry",
        "2 tsp. Asian sesame oil",
        "1 tsp. cornstarch",
        "1/2 tsp. sugar",
        "Pinch of freshly ground white or black pepper",
        "1 bunch broccoli, about 1/2 lb., cut into florets",
        "1/2 lb. fresh Chinese egg noodles",
        "3 Tbs. corn or peanut oil",
        "3 thin slices fresh ginger",
        "1 lb. sirloin or flank steak, thinly sliced against the grain into strips"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef and Broccoli",
    "url": "http://www.williams-sonoma.com/recipe/beef-and-broccoli.html"
}
