{
    "directions": [
        "Set an electric pressure cooker to \"brown\" according to the manufacturer's instructions and warm 1 Tbs. of the oil until nearly smoking. Add half of the beef and cook, stirring occasionally, until browned, 5 to 7 minutes. Transfer to a colander placed over a bowl to drain off the fat. Repeat with 1 Tbs. of the oil and the remaining beef. Drain and set aside.",
        "Warm the remaining 3 Tbs. oil in the cooker. Add the onions and sauté, stirring occasionally, until softened, 5 to 7 minutes. Add the garlic and sauté for 1 minute. Add the jalapeño, chili powder, cumin, oregano and coriander, stir until well combined and cook for 1 minute more.",
        "Add the reserved beef, the beer, stock and tomatoes and bring to a gentle simmer. Cover, set the pressure to \"high\" and cook according to the manufacturer's instructions. Release the pressure according to the manufacturer's instructions. Add the kidney and pinto beans and the masa harina. Simmer until the chili is slightly thickened, 5 to 7 minutes. Season with salt and pepper and serve in large bowls."
    ],
    "ingredients": [
        "5 Tbs. vegetable oil",
        "3 lb. beef chuck, ground for chili",
        "3 large yellow onions, finely chopped",
        "8 garlic cloves, minced",
        "1 jalapeño chili, seeded and finely chopped",
        "1/2 cup chili powder",
        "2 Tbs. ground cumin",
        "1 Tbs. ground oregano",
        "2 tsp. ground coriander",
        "1 cup lager-style beer",
        "1 cup beef stock",
        "1 can (28 oz.) crushed tomatoes",
        "1 can (15 oz.) kidney beans, rinsed and drained",
        "1 can (15 oz.) pinto beans, rinsed and drained",
        "3 Tbs. masa harina",
        "Salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Chili with Masa Harina in an Electric Pressure Cooker",
    "url": "http://www.williams-sonoma.com/recipe/beef-chili-with-masa-harina-in-an-electric-pressure-cooker.html"
}
