{
    "directions": [
        "In a large, heavy pot over medium heat, warm the olive oil. Add the onions and bacon and sauté until the onions are soft, about 10 minutes. Using a slotted spoon, transfer the onions and bacon to a plate and set aside.",
        "Working in batches, add the beef to the pot in a single layer; do not crowd the pot. Cook, uncovered, turning occasionally, until golden brown on all sides, 7 to 10 minutes. When all the meat is browned, return it to the pot, sprinkle with the flour and cook, stirring, until the meat is evenly coated, about 1 minute. Return the onions and bacon to the pot and add the garlic. Using kitchen string, tie the parsley stems, thyme sprigs and bay leaves into a bundle and add to the pot as well.",
        "Increase the heat to high, pour in the wine and bring to a boil, stirring to scrape up any browned bits from the pot bottom. Reduce the heat to medium and simmer, stirring occasionally, until the liquid is reduced by one-fourth, 3 to 5 minutes. Add the broth and tomato paste and stir well. Increase the heat to high, bring to a boil, then reduce the heat to low, cover and simmer until the meat is tender when pierced with a knife, 1 1/2 to 2 hours.",
        "Remove the herb bundle and discard. Add the turnips, cover and cook until tender when pierced with a fork, about 15 minutes. Add the turnip greens, cover and cook until wilted, about 2 minutes. Season with salt and pepper. Ladle the stew into warmed bowls and serve immediately."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "2 yellow onions, finely chopped",
        "2 oz. bacon or pancetta, finely diced",
        "3 lb. beef stew meat such as chuck roast or  sirloin tip, cut into 1 to 1 1/2-inch cubes",
        "1/4 cup all-purpose flour",
        "4 garlic cloves, minced",
        "6 fresh flat-leaf parsley stems",
        "2 fresh thyme sprigs",
        "2 bay leaves",
        "1 1/2 cups dry red wine such as Cabernet  Sauvignon or Côtes-du-Rhône",
        "3 cups beef or veal broth",
        "1 Tbs. tomato paste",
        "4 turnips or 15 baby turnips, peeled and larger  ones cut into wedges",
        "1 bunch turnip greens, stems removed and  leaves cut crosswise into strips",
        "Salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Stew with Turnips (Beef Bourguignonne)",
    "url": "http://www.williams-sonoma.com/recipe/beef-stew-with-turnips-beef-bourguignonne.html"
}
