{
    "directions": [
        "Whisk vinegar, soy sauce, peanut butter, 1 tablespoon peanut oil, chile sauce, and sesame oil together in a bowl until smooth. Whisk water and cornstarch together in a small bowl until the cornstarch is dissolved.",
        "Heat 1 tablespoon peanut oil in a large skillet until smoking. Cook and stir beef in hot oil until browned, about 3 minutes. Remove beef with a slotted spoon to a plate lined with paper towel. Add 1 tablespoon peanut oil to the drippings remaining in the skillet and heat until near smoking. Cook and stir carrots, bell pepper, mushrooms, broccoli, green onions, garlic, and ginger in the drippings and oil mixture until the vegetables are tender, about 4 minutes.",
        "Return beef to skillet. Reduce heat to medium-low. Clear a space in the center of the beef and vegetables. Pour vinegar mixture and cornstarch mixture into the cleared space; stir together for a few seconds, then toss with vegetables and beef. Place a cover on the skillet and cook until sauce thickens and sticks to vegetables, about 5 minutes."
    ],
    "ingredients": [
        "Sauce:",
        "1/4 cup rice vinegar",
        "3 tablespoons soy sauce",
        "2 tablespoons peanut butter",
        "1 tablespoon peanut oil",
        "1 tablespoon chile-garlic sauce (such as Sriracha®)",
        "1 teaspoon sesame oil",
        "1/4 cup cold water",
        "1 tablespoon cornstarch",
        "Stir-Fry:",
        "1 tablespoon peanut oil",
        "3/4 pound beef flank steak, thinly sliced",
        "1 tablespoon peanut oil",
        "2 carrots, cut into strips",
        "1 green bell pepper, cut into strips",
        "1 cup mushrooms, sliced",
        "1 cup broccoli florets",
        "1 bunch green onions, sliced",
        "2 cloves garlic, minced",
        "1 tablespoon minced fresh ginger"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Beef Stir-Fry with Peanut Sauce",
    "url": "http://allrecipes.com/recipe/230602/beef-stir-fry-with-peanut-sauce/"
}
