{
    "directions": [
        "Preheat an oven to 500°F.",
        "Rub the beef all over with the sesame oil and sprinkle with pepper. Place on a wire rack set on a rimmed baking sheet. Transfer to the oven and roast until an instant-read thermometer inserted into the thickest part of the meat registers 115°F, about 15 minutes. The meat should be very rare. Let rest for 10 minutes.",
        "In a sealable plastic bag large enough to hold the beef, combine 1/2 cup of the soy sauce, the mirin, half of the green onions, the garlic and the 1 Tbs. ginger. Add the beef, seal the bag and refrigerate for at least 4 hours or up to overnight, turning several times.",
        "Remove the beef from the marinade and discard the marinade. Place the beef in the freezer for 15 minutes to firm it up for easier slicing.",
        "Meanwhile, in a small bowl, whisk together the remaining 1/4 cup soy sauce, the lime juice, sake, brown sugar and lime zest. Cover the sauce and set aside at room temperature.",
        "In a large bowl, combine the daikon, carrot, cucumber, the remaining green onions, the 1 tsp. ginger and the sesame seeds and toss to mix well. Remove the beef from the freezer and slice thinly on the diagonal against the grain. Lay the slices on a platter and drizzle with about one-third of the sauce. Add the remaining sauce to the slaw and toss to mix, then scatter the slaw over the meat. Or, pile the slaw on a platter and top with the meat. Serve immediately. Serves 8 to 12.",
        "Platter presentation:",
        "The dish looks beautiful on a long wooden board, such as those made for slicing baguettes. Mound the slaw in a pile along the length of the board, then drape the beef slices over the slaw. The result almost looks like sashimi.",
        "Adapted from Williams-Sonoma",
        "Good Food to Share",
        ", by Sara Kate Gillingham-Ryan (Weldon Owen, Inc., 2010)."
    ],
    "ingredients": [
        "1 beef tenderloin, about 1 1/4 lb.",
        "2 tsp. Asian sesame oil",
        "Freshly ground pepper, to taste",
        "3/4 cup soy sauce",
        "3 Tbs. mirin (Japanese rice wine)",
        "3 or 4 green onions, white and light green portions, thinly sliced (about 1 cup)",
        "2 garlic cloves, minced",
        "1 Tbs. plus 1 tsp. peeled and finely grated fresh ginger",
        "1/4 cup fresh lime juice",
        "3 Tbs. sake",
        "1 Tbs. firmly packed brown sugar",
        "1 tsp. grated lime zest",
        "1 cup peeled and julienned daikon radish",
        "1 large carrot, peeled and julienned",
        "1 cucumber, peeled, seeded and cut julienned",
        "1 Tbs. black sesame seeds"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Tataki with Vegetable Slaw and Ponzu",
    "url": "http://www.williams-sonoma.com/recipe/beef-tataki-with-vegetable-slaw-and-ponzu.html"
}
