{
    "directions": [
        "To make the dough, in a food processor, combine the flour and salt and pulse several times until well combined. Add the shortening and butter and pulse until the mixture resembles coarse meal, 10 to 12 pulses. Add the water and pulse until the dough just comes together, 5 to 10 purses. Shape the dough into a disk, cover with plastic wrap and refrigerate for at least 1 hour or up to 2 days.",
        "To make the filling, in a sauté pan over medium-high heat, warm the oil. Add the onion and ground beef and cook, breaking up the larger pieces of meat with a wooden spoon, until the onion is tender and beef is cooked through, 8 to 10 minutes. Add the garlic, cumin and red pepper flakes and cook until fragrant, about 1 minute. Add the tomatoes and reserved liquid, the stock and olives. Simmer until most of the liquid is absorbed but the mixture is still noticeably wet, 4 to 6 minutes. Season with salt and black pepper. Let the filing mixture cool completely, then stir in the hard-cooked egg and scallions.",
        "Place a Pizza-Que grill stone in the center of a grill. Prepare the grill for indirect grilling over high heat. Cover the grill and heat until the thermometer on the stone registers 375° to 400ºF, about 30 minutes.",
        "Meanwhile, assemble the empanadas: Line a baking sheet pan with parchment paper and lightly dust with cornmeal. On a lightly floured surface, roll out the dough into a large rectangle 1/8 to 1/16 inch thick. Using a 3 3/4-inch round cutter, cut out dough rounds. Place 1 1/2 Tbs. of the filling in the center of each round and lightly brush the edges with water. Gently pick up each round and fold in half, enclosing the filling by pressing the edges together to form a half-moon. Place the empanadas on the cornmeal-dusted baking sheet and brush the tops with the egg wash.",
        "Place the empanadas directly onto the preheated grill stone and cover the grill. Reduce the side burner temperature to medium-high. Cook the empanadas until the crust is cooked through and golden brown, 10 to 15 minutes. Serve immediately. Makes 10 to 12 empanadas."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "1 1/2 tsp. salt",
        "1/2 cup shortening, spread thinly on a plate, placed in the freezer for 15 minutes, then diced",
        "8 Tbs. (1 stick) cold unsalted butter, diced",
        "6 Tbs. ice cold water",
        "2 Tbs. vegetable oil",
        "1/2 yellow onion, chopped",
        "1/2 lb. ground beef",
        "3 garlic cloves, minced",
        "1/2 tsp. ground cumin",
        "1/4 tsp. red pepper flakes",
        "1/3 cup canned diced tomatoes, drained, 1/3 cup liquid reserved",
        "1/3 cup chicken stock",
        "1/4 cup roughly chopped Picholine olives",
        "Salt and freshly ground black pepper, to taste",
        "1 hard-cooked egg, diced",
        "2 green onions, thinly sliced (optional)",
        "",
        "Cornmeal for dusting",
        "All-purpose flour for dusting",
        "1 egg, lightly beaten with 1 tsp. water"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Empanadas",
    "url": "http://www.williams-sonoma.com/recipe/beef-empanadas.html"
}
