{
    "directions": [
        "In a 12-inch (30-cm) nonstick fry pan over medium-high heat, warm 1 Tbs. of the olive oil. Season the beef lightly with salt and pepper, add to the pan and cook until brown on all sides, about 6 minutes. Using tongs, transfer the meat to a plate.",
        "In the same pan over medium-high heat, warm the remaining 1 Tbs. olive oil. Add the onion and carrots and season lightly with salt and pepper. Sauté until beginning to brown, about 5 minutes. Add the cumin and paprika and sauté until fragrant, about 30 seconds. Add the flour mix and stir for 30 seconds. Gradually stir in the broth and then the tomato paste and tamari.",
        "Cover the pan and simmer until the carrots are crisp-tender, about 8 minutes. Return the beef to the pan, add the edamame and simmer until heated through, about 3 minutes. Stir in the dill and lemon zest. Season with salt and pepper and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Weeknight Gluten Free,",
        "by Kristine Kidd (Weldon Owen, 2013)."
    ],
    "ingredients": [
        "2 Tbs. olive oil",
        "1 lb. (500 g) beef tenderloin, cut into 1-inch (2.5-cm) cubes",
        "Kosher salt and freshly ground pepper, to taste",
        "1 large red onion, cut into 1-inch (2.5-cm) pieces",
        "1/2 lb. (250 g) carrots, peeled, halved lengthwise and then cut\n  crosswise into 1 1/2-inch (4-cm) pieces",
        "1 tsp. ground cumin",
        "1 tsp. sweet paprika",
        "1 Tbs. gluten-free flour mix, such as Cup4Cup",
        "2 1/2 cups (20 fl. oz./625 ml) low-sodium, gluten-free beef broth",
        "1 Tbs. tomato paste",
        "1 Tbs. gluten-free tamari",
        "3/4 cup (about 4 oz./125 g) ready-to-eat shelled edamame",
        "1/4 cup (1/2 oz./15 g) minced fresh dill",
        "1 tsp. grated lemon zest"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef, Carrot and Edamame Stew with Dill and Lemon",
    "url": "http://www.williams-sonoma.com/recipe/beef-carrot-and-edamame-stew.html"
}
