{
    "directions": [
        "Heat a large Dutch oven with a tight-fitting lid over medium-high heat. Pour in enough oil to fill the pan about 1/4-inch deep. Season the beef generously with salt and pepper, and add to the pan. Saute half the meat, uncovered, stirring only occasionally, until well-browned, about 8 minutes. Using a slotted spoon, transfer the beef to a plate. Repeat with the remaining beef. Discard the oil and wipe out the pan.",
        "Preheat the oven to 325 degrees F. Return the pot to the stove and melt the butter over medium high heat. Add the onion and cook, stirring, until lightly browned, about 5 minutes. Add the garlic and cook, stirring, until fragrant, about 1 minute. Add the tomato paste and cook, stirring, until lightly browned, about 1 minute more. Add the reserved beef and scatter the flour over the vegetable and beef mixture (enough to lightly coat) and cook stirring until lightly toasted. Add the water or broth, and bring to a simmer. Tie the parsley, thyme, and bay leaves together with a piece of kitchen twine and add the bundle to the pot. Season with 2 teaspoons salt, or to taste. Cover and transfer to the oven. Cook the meat until just tender, about 1 1/2 hours. (This can also be done on the stove at a low simmer.)",
        "Remove pot from the oven. Skim the fat from the cooking liquid with a spoon or ladle. Add the potatoes, carrots, celery, and the tomatoes, and bring to a simmer on top of the stove. Cook, uncovered, stirring occasionally, until the liquid thickens and the vegetables are tender, about 1 hour. Remove and discard the herb bundle. Stir in the vinegar and season with salt and pepper, to taste. Divide among bowls and serve immediately.",
        "Copyright 2003 Television Food Network, G.P. All rights reserved"
    ],
    "ingredients": [
        "Vegetable oil, for searing",
        "2 1/2 pounds beef chuck, cut into 2-inch cubes",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoons unsalted butter",
        "2 medium onions, cut into 6ths",
        "5 cloves garlic, crushed",
        "1 tablespoon tomato paste",
        "1/3 cup all-purpose flour, or to cover",
        "10 cups cold water, or chicken or beef broth, homemade or low-sodium canned",
        "6 sprigs parsley",
        "6 sprigs fresh thyme",
        "2 bay leaves",
        "1 1/4 pounds medium red potatoes, quartered",
        "4 medium carrots, cut into 2-inch pieces",
        "2 celery stalks, cut into 2-inch pieces",
        "7 canned whole, peeled tomatoes, lightly crushed",
        "2 to 3 teaspoons red wine vinegar, or to taste"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef Stew",
        "Beef",
        "Meat",
        "Stew Recipes",
        "Make Ahead",
        "Dutch Oven",
        "American",
        "Vegetable",
        "Carrot Recipes",
        "Tomato",
        "Red Potato Recipes",
        "Celery",
        "Main Dish Recipes",
        "Lunch",
        "Winter"
    ],
    "title": "Beef Stew",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/beef-stew-recipe3"
}
