{
    "directions": [
        "Combine beef stock and chicken stock in medium saucepan. Boil until reduced to 3/4 cup, about 20 minutes. Set aside.",
        "Cook carrots in large saucepan of boiling salted water 3 minutes. Using slotted spoon, transfer carrots to strainer and rinse under cold water. Add beans to boiling water; cook 1 minute. Transfer to strainer with carrots and rinse under cold water. Drain well. Arrange carrots, beans, bell pepper, mushrooms, asparagus and zucchini in single layer on large baking sheet. (Stock and vegetables can be prepared 4 hours ahead. Cover stock and vegetables separately and refrigerate.)",
        "Preheat broiler. Sprinkle steaks with salt and pepper. Heat 2 tablespoons olive oil in heavy large skillet over medium-high heat. Add steaks; cook to desired doneness, about 4 minutes per side for medium-rare. Transfer steaks to plate; tent with aluminum foil to keep warm. Add dry red wine to same skillet. Boil until red wine is reduced to 1 tablespoon, scraping up browned bits, about 3 minutes. Add reduced stock and bring to boil. Remove from heat. Add chilled butter a few pieces at a time and whisk just until melted. Season sauce to taste with salt and pepper.",
        "Meanwhile, brush vegetables lightly with olive oil. Broil vegetables until crisp-tender, about 3 minutes per side for carrots, green beans, bell peppers and mushrooms and about 2 minutes per side for asparagus and zucchini.",
        "Spoon Champ onto 4 plates. Place steaks atop Champ. Arrange vegetables decoratively around Champ. Arrange vegetables decoratively around Champ. Spoon sauce over vegetables and serve."
    ],
    "ingredients": [
        "2 cups beef stock or canned broth",
        "1 cup chicken stock or canned low-salt broth",
        "4 small carrots, peeled, halved lengthwise",
        "16 green beans, trimmed",
        "1 red bell pepper, cut into 8 strips",
        "4 fresh shiitake mushrooms, stemmed",
        "8 asparagus spears, trimmed",
        "1 zucchini, trimmed, cut into 1/2-inch-thick rounds",
        "4 8-ounce beef tenderloin steaks (about 1 1/4 inches thick)",
        "2 tablespoons olive oil",
        "1/2 cup dry red wine",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into pieces",
        "Olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Vegetable",
        "Broil",
        "Spring",
        "Ireland"
    ],
    "title": "Beef Tenderloin with Spring Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/beef-tenderloin-with-spring-vegetables-2071"
}
