{
    "directions": [
        "Preheat oven to 325°F. Heat oil in heavy large pot or Dutch oven over medium-high heat. Add onions and garlic and cook until beginning to brown, stirring frequently, about 15 minutes. Add 1 teaspoon paprika, allspice and crushed red pepper and stir 20 seconds. Add chicken stock, wine and bay leaves. Boil 10 minutes to blend flavors.",
        "Sprinkle brisket with paprika and rub in. Add brisket to pot, fat side up. Add dried apricots and pitted prunes. Cover and bake 1 1/2 hours.",
        "Add yams and carrots to pot. Cover and cook until brisket is very tender, about 2 1/2 hours longer. Remove from oven and let stand 20 minutes. Remove brisket from pot and slice thinly across grain. Arrange on platter. Degrease pan juices. Spoon pan juices over meat. Arrange fruit and vegetables around meat. Garnish with minced fresh parsley and serve. (Can be prepared 2 days ahead. Cover and refrigerate before slicing meat. To serve, remove meat from pot and slice thinly across grain. Remove any solid fat from sauce. Return sliced meat to pot. Place pot in 325°F oven and bake until brisket is heated through, about 30 minutes.)"
    ],
    "ingredients": [
        "3 tablespoons vegetable oil",
        "3 medium onions, chopped",
        "4 large garlic cloves, chopped",
        "1 teaspoon paprika",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon dried crushed red pepper",
        "3 1/2 cups chicken stock or canned broth",
        "1 1/2 cups dry red wine",
        "3 bay leaves",
        "1 4-pound boneless first-cut beef brisket",
        "Paprika",
        "1 6-ounce package dried apricots",
        "1 1/2 cups pitted prunes",
        "3 pounds yams, peeled, cut into 1 1/2-inch pieces",
        "6 large carrots, peeled, cut into 1 1/2-inch pieces",
        "Minced fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Braise",
        "Passover",
        "High Fiber",
        "Rosh Hashanah/Yom Kippur",
        "Dried Fruit",
        "Carrot",
        "Sweet Potato/Yam",
        "Kosher"
    ],
    "title": "Beef Brisket Braised with Dried Fruit, Yams and Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/beef-brisket-braised-with-dried-fruit-yams-and-carrots-1611"
}
