{
    "directions": [
        "Heat oil in heavy large saucepan over medium-high heat. Add shallots and mushrooms; sauté until tender, about 12 minutes. Sprinkle sugar over; sauté until mixture is deep brown, about 4 minutes longer. Add vinegar; stir until liquid evaporates, about 1 minute. Add wine; boil until reduced by half, about 20 minutes. Add both broths, thyme, peppercorns, and bay leaf; bring to boil. Reduce heat to medium; simmer uncovered 35 minutes to blend flavors, stirring occasionally.",
        "Strain sauce through fine strainer into small saucepan; discard solids. Mix butter and flour in small bowl. Bring sauce to simmer over medium-high heat; gradually whisk in flour mixture. Cook until sauce is reduced to 1 1/4 cups, about 5 minutes. (Sauce can be made 1 day ahead. Cover; chill. Rewarm over medium heat.)",
        "Preheat oven to 350°F. Place rack on rimmed baking sheet. Sprinkle beef generously with salt and pepper. Heat oil in heavy large skillet over high heat. Add beef to skillet and cook until brown on all sides, about 5 minutes. Transfer beef to rack on baking sheet. Roast in oven until thermometer inserted into center of beef registers 120°F for medium-rare, about 35 minutes. Transfer beef to cutting board and let rest 10 minutes.",
        "Boil whipping cream in heavy large pot until reduced by half, about 4 minutes. Add half of spinach to pot and toss just until spinach begins to wilt, about 1 minute. Add remaining spinach to pot; toss just until all spinach is wilted, about 2 minutes. Season to taste with salt and pepper.",
        "Cut beef tenderloin crosswise into 1/4-inch-thick slices. Divide creamed spinach among 6 plates. Top with beef slices, dividing equally. Spoon sauce over and around beef. Divide Truffled French Fries among plates and serve."
    ],
    "ingredients": [
        "2 tablespoons canola oil",
        "8 ounces shallots, sliced (about 2 cups)",
        "1 6-ounce package sliced mushrooms",
        "2 tablespoons sugar",
        "2 tablespoons red wine vinegar",
        "1 750-ml bottle Pinot Noir or other dry red wine",
        "1 14-ounce can low-salt chicken broth",
        "1 14-ounce can beef broth",
        "2 fresh thyme sprigs",
        "1 1/2 teaspoons whole black peppercorns",
        "1 Turkish bay leaf",
        "1 tablespoon butter, room temperature",
        "1 tablespoon all purpose flour",
        "1 2-pound beef tenderloin roast",
        "1 tablespoon olive oil",
        "1 cup whipping cream",
        "2 9-ounce packages fresh baby spinach leaves",
        "Truffled French Fries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Beef",
        "Mushroom",
        "Roast",
        "Sauté",
        "Father's Day",
        "Dinner",
        "Beef Tenderloin",
        "Spinach",
        "Red Wine",
        "Shallot",
        "San Francisco",
        "California",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Beef Tenderloin with Red Wine Sauce, Creamed Spinach, and Truffled French Fries",
    "url": "http://www.epicurious.com/recipes/food/views/beef-tenderloin-with-red-wine-sauce-creamed-spinach-and-truffled-french-fries-230635"
}
