{
    "directions": [
        "Place the brisket in a large, shallow dish, and rub the thyme, bay leaves, garlic, chiles, and cracked black pepper onto both sides of it, coating the meat well. Cover, and refrigerate overnight. Take the brisket out of the refrigerator 1 hour before cooking, to bring it to room temperature. After 30 minutes, season the meat with 2 tablespoons salt.",
        "Preheat the oven to 325°F.",
        "Heat a large, heavy-bottomed sauté pan over high heat for 2 minutes. Add the olive oil, and wait for 1 minute. Place the brisket in the pan (reserving the garlic and chiles). Sear the meat on both sides, about 8 minutes per side, until it's deep golden brown. You will need to sear a portion of the meat at a time, because the entire brisket probably won't fit in the pan. To do this, leave one end of the brisket hanging off the edge of the pan, and then move that end into the pan when the other part is well seared. Once both sides are well browned, transfer the brisket to a large roasting pan that has a tight-fitting lid, or a Dutch oven.",
        "Return the brisket searing pan to the stove over medium-high heat, and add the onion, carrot, and celery. Stir with a wooden spoon, scraping up all the crusty bits in the pan. Cook for 6 to 8 minutes, until the vegetables just begin to caramelize, then add the reserved garlic and chiles, and cook for a few more minutes.",
        "Turn off the heat (so that the liquids won't evaporate immediately), and add the balsamic vinegar, then the wine. Turn the heat back up to medium-high, and reduce the wine by a quarter. Add the beef stock, and bring the stock to a boil over high heat. Pour the hot stock over the meat, scraping any vegetables that have fallen on the brisket back into the liquid. The stock mixture should almost cover the brisket. Cover the pan tightly with aluminum foil and a tight-fitting lid. Braise in the oven for 5 to 6 hours.",
        "To check for doneness, carefully remove the lid and foil, watching out for the hot steam. Test the meat by inserting a paring knife into it; if the knife slides in easily, then the brisket is done.",
        "Let the brisket cool in its juices for 30 minutes. Carefully transfer it to a baking sheet, and chill completely.",
        "Strain the braising juices into a saucepan, pressing down on the vegetables with a ladle to extract all the liquid. Skim the fat from the braising juices, and chill.",
        "When you are ready to serve, preheat the oven to 400°F.",
        "Cut the cold brisket against the grain into 1/4-inch-thick slices. Lay the slices in two large roasting pans (or equivalent). Heat the braising juices, and pour some over the meat, just to cover. Cook for about 20 minutes, until the meat is hot and caramelized and crispy on top.",
        "Place the slow-roasted Romano beans at the center of six large dinner plates, and arrange the brisket on top. Drizzle some of the braising juices over the meat. Dollop a generous tablespoon of the black olive aïoli over the meat, and pass the rest at the table."
    ],
    "ingredients": [
        "6 pounds whole beef brisket, with 1/2-inch top layer of fat",
        "3 tablespoons thyme leaves",
        "2 fresh bay leaves, thinly sliced (if only dried bay leaves are available, crumble them)",
        "10 cloves garlic, smashed",
        "3 chiles de árbol, crumbled with your hands",
        "1 tablespoon plus one teaspoon cracked black pepper",
        "3 tablespoons extra-virgin olive oil",
        "1 cup diced onion",
        "1/3 cup diced carrot",
        "1/3 cup diced celery",
        "1/4 cup balsamic vinegar",
        "3 cups red wine",
        "4 cups beef stock, or more if needed",
        "1 recipe Slow-Roasted Romano Beans",
        "1 recipe Black Olive Aïoli",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Beef",
        "Braise",
        "Christmas",
        "Passover",
        "Dinner",
        "Meat",
        "Brisket",
        "Red Wine",
        "Fall",
        "Winter"
    ],
    "title": "Beef Brisket with Slow-Roasted Romano Beans and Black Olive Aïoli",
    "url": "http://www.epicurious.com/recipes/food/views/beef-brisket-with-slow-roasted-romano-beans-and-black-olive-aioli-51204420"
}
