{
    "directions": [
        "Remove the beef from the refrigerator about 30 minutes before you cook it, and preheat an oven to 400ºF.",
        "In a small bowl, stir together the green peppercorns, tarragon, chopped green onions and salt. Spread the mixture out on a plate large enough to hold the beef. Brush 1 Tbs. of the olive oil on all sides of the beef fillet. Roll the fillet in the green peppercorn mixture, pressing lightly so that it adheres to the surface.",
        "In a large, ovenproof nonstick fry pan over high heat, warm the remaining 2 Tbs. olive oil. Add the beef and sear until evenly browned on all sides, 3 to 4 minutes. Transfer to the oven and roast until an instant-read thermometer inserted into the thickest part of the fillet registers 130ºF for medium-rare, 8 to 10 minutes. Transfer the beef to a sheet of aluminum foil and let cool to room temperature. Wrap the beef in the foil and refrigerate for at least 4 hours or up to overnight.",
        "Reduce the oven temperature to 300ºF.",
        "Arrange the baguette slices in a single layer on a rimmed baking sheet. Transfer to the oven and toast, turning occasionally, until golden brown on both sides, 15 to 20 minutes total. Remove from the oven and let cool. (The toasts can be stored in an airtight container at room temperature overnight.)",
        "To make the horseradish cream, in a small bowl, whisk together the cream cheese and horseradish. (The horseradish cream can be stored in the refrigerator overnight; bring to room temperature before using.)",
        "Remove the beef from the refrigerator, unwrap and slice against the grain as thinly as possible. Spread an equal amount of the horseradish cream on each of the toasts. Place a slice or two of the beef on top of the horseradish cream. Garnish each canapé with a few slices of green onion. Arrange the canapés on a tray and serve immediately. Serves 10."
    ],
    "ingredients": [
        "1 1/2-lb. piece beef tenderloin, trimmed of fat and sinew",
        "1 Tbs. chopped brined green peppercorns",
        "1 Tbs. chopped fresh tarragon",
        "2 green onions, white and light green portions, chopped, plus sliced green onion for garnish",
        "1/2 tsp. coarse salt",
        "3 Tbs. olive oil",
        "24 baguette slices, each 1/4 inch thick",
        "1/2 cup whipped cream cheese, at room temperature",
        "2 Tbs. prepared horseradish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Tenderloin Canapés",
    "url": "http://www.williams-sonoma.com/recipe/beef-tenderloin-canapes.html"
}
