{
    "directions": [
        "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente. Drain and set aside. Meanwhile, preheat oven to 500 degrees F (260 degrees C).",
        "In an 11 x 17 inch baking dish, crumble beef or veal and toss with carrots, celery, onion and spinach. Add 1 1/4 teaspoon salt, 1 1/4 teaspoon pepper, 2 tablespoons olive oil and wine. Mix well. Place in heated oven and roast until beef or veal is brown and vegetables are soft, about 30 to 40 minutes. Note: Be careful to not burn the meat and vegetables; this is a very hot temperature. If meat begins to smoke, lower oven temperature to 400 degrees F (200 degrees C). Stir often while baking. Cool for 15 minutes.",
        "Place meat mixture in food processor and process until finely chopped. Add cream, roma tomatoes, cheese, dry herbs and basil. Stir and return to oven for approximately 20 minutes. Remove from oven and lower oven temperature to 350 degrees F (175 degrees C). Let mixture cool for 15 to 20 minutes, then stuff each cannelloni with 2 to 3 tablespoons of mixture. Place in a clean 9 x 13 inch baking dish.",
        "To Make Tomato Sauce: Place Italian style tomatoes with liquids in food processor and process until smooth. Set aside. Heat 2 tablespoons olive oil over medium heat in a large skillet. Add 2 cloves chopped garlic and 1 chopped onion; saute until soft. Add processed tomatoes, 1 teaspoon salt and 1 teaspoon pepper and saute 5 to 10 minutes or until sauce is no longer watery. Add fresh basil leaves and cook for 1 minute longer.",
        "Pour tomato sauce over cannelloni and bake for 20 minutes or until sauce is bubbly."
    ],
    "ingredients": [
        "1 (8 ounce) package cannelloni pasta",
        "8 ounces lean ground beef",
        "2 carrots, chopped",
        "1/2 stalk celery, chopped",
        "1/2 onion, chopped",
        "10 ounces fresh spinach, washed and chopped",
        "1 1/4 teaspoons salt",
        "1 1/4 teaspoons ground black pepper",
        "2 tablespoons olive oil",
        "1 cup dry white wine",
        "1 cup heavy whipping cream",
        "1 cup chopped tomatoes",
        "1/2 cup grated Parmesan cheese",
        "2 teaspoons Italian seasoning",
        "2 tablespoons chopped fresh basil",
        "1 (14.5 ounce) can stewed tomatoes",
        "2 tablespoons olive oil",
        "2 cloves garlic, chopped",
        "1 onion, chopped",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "4 leaves fresh basil, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Beef Cannelloni Bake",
    "url": "http://allrecipes.com/recipe/15189/beef-cannelloni-bake/"
}
