{
    "directions": [
        "If you purchased the ribs in racks, use a chef’s knife to cut between the bones and separate the rack into individual ribs. Do not trim the fat from the ribs; it keeps the ribs moist and flavorful during cooking.",
        "In a small bowl, stir together the paprika, chili powder, dry mustard, garlic powder, cumin, sage, salt and black pepper. Rub the ribs thoroughly with the mixture until they are evenly coated. Let the ribs stand at room temperature for 30 to 60 minutes before grilling.",
        "In a heavy saucepan over medium-low heat, stir together the tomato sauce, ketchup, horseradish mustard, brown sugar, vinegar, garlic, Worcestershire sauce and cayenne. Cook, stirring often, until the sauce has reduced slightly, about 30 minutes. Stir in the salt. Taste and adjust the seasonings with more salt or cayenne. Remove the sauce from the heat.",
        "Prepare a charcoal or gas grill with 1 or 2 areas of medium-high heat and 1 area with no heat. (If using charcoal, place a drip pan in the unheated area.) Place a platter near the grill to warm from the heat of the grill. Lightly oil the grill rack.",
        "Place the ribs over the hottest part of the grill and cook, using tongs to turn the ribs often, until well browned on all sides, 3 to 5 minutes total. Move the ribs to the unheated portion of the grill and brush them generously with the barbecue sauce. Cover the grill and cook the ribs, turning and basting with sauce about every 5 minutes, until they are crisp and tender, 12 to 15 minutes. To test for doneness, cut into a rib with a paring knife; it should slip through easily and the interior should have no trace of pink. If the ribs are not done, cover the grill and let them cook, undisturbed, for 5 to 7 minutes more and test again.",
        "Return the barbecue sauce to the stovetop over medium heat and simmer for at least 5 minutes. Pile the ribs on the warmed platter and serve immediately, passing the barbecue sauce at the table. Serves 4 to 6.",
        "Adapted from Williams-Sonoma Mastering Series,",
        "Beef & Veal",
        ", by Denis Kelly (Free Press, 2005)."
    ],
    "ingredients": [
        "6 lb. beef ribs, in racks or separated into ribs by the butcher",
        "4 Tbs. hot or sweet paprika, or a mixture",
        "2 Tbs. chili powder",
        "1 Tbs. dry mustard",
        "1 Tbs. garlic powder",
        "1 Tbs. ground cumin",
        "1 Tbs. dried sage",
        "1 Tbs. salt",
        "1 Tbs. freshly ground black pepper",
        "1 cup tomato sauce, homemade or purchased",
        "1 cup tomato ketchup",
        "1/2 cup horseradish mustard or other spicy mustard",
        "1/4 cup firmly packed light brown sugar",
        "1/4 cup cider vinegar",
        "4 garlic cloves, finely chopped",
        "1 Tbs. Worcestershire sauce",
        "1/2 tsp. cayenne pepper",
        "1 tsp. salt"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Ribs with Barbecue Sauce",
    "url": "http://www.williams-sonoma.com/recipe/beef-ribs-with-barbecue-sauce.html"
}
