{
    "directions": [
        "Place the flour in a large bowl. Season the beef with salt and pepper, add to the flour and stir to coat evenly. Transfer to a plate, shaking off the excess flour.",
        "In a large sauté pan over medium-high heat, warm the olive oil until almost smoking. Working in batches, brown the beef on all sides, 5 to 7 minutes. Transfer to a slow cooker.",
        "Add the bacon, carrots, onions and garlic to the sauté pan and cook, stirring occasionally, until just tender, about 10 minutes. Transfer to the slow cooker along with the bay leaves, thyme, parsley and mushrooms.",
        "Off the heat, pour the wine into the sauté pan and set over medium-high heat. Whisk in the demi-glace and bring to a boil, stirring to scrape up the browned bits from the pan bottom. Add to the slow cooker, cover and cook until the meat is fork tender, 6 hours on high or 8 hours on low. Discard the bay leaves.",
        "Transfer the beef bourguignonne to a platter and serve with steamed potatoes. Serves 10."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "5 lb. beef stew meat, cut into 1-inch pieces",
        "Salt and freshly ground pepper, to taste",
        "1/4 cup extra-virgin olive oil",
        "5 thick bacon slices, cut into 1-inch pieces",
        "5 large carrots, peeled and cut into 1/2-inch pieces",
        "2 yellow onions, sliced 1/4 inch thick",
        "5 garlic cloves, chopped",
        "2 bay leaves",
        "6 fresh thyme sprigs",
        "6 fresh flat-leaf parsley sprigs",
        "1 lb. white button mushrooms, halved",
        "1 bottle Pinot Noir",
        "1 Tbs. beef demi-glace",
        "Steamed baby red potatoes tossed with butter and chopped fresh flat-leaf parsley for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Slow-Cooker Beef Bourguignonne",
    "url": "http://www.williams-sonoma.com/recipe/beef-bourguignonne.html"
}
