{
    "directions": [
        "Season the beef with salt and pepper. In a Dutch oven over medium-high heat, warm the olive oil. Add the bacon and cook, stirring occasionally, until well browned but not crispy, 5 to 8 minutes. Transfer to a paper towel–lined plate.",
        "Pour off all but 1 Tbs. of the fat from the pot. Working in batches, add the beef and brown on all sides, 8 to 10 minutes per batch. Return all the beef to the pot and add the braising base and bacon. Stir in the bay leaf and thyme sprigs. Bring to a simmer, stirring to scrape up any browned bits from the pot bottom. Reduce the heat to low, cover and simmer, stirring occasionally, for 2 hours.",
        "Add the onions and carrots to the pot and continue cooking, stirring occasionally, until the meat is fork-tender, about 1 hour more.",
        "About 30 minutes before the beef is done cooking, using a steamer pot, steam the potatoes until tender when pierced with a knife, 25 to 30 minutes. Transfer the potatoes to a large bowl. Add the butter and 1 Tbs. of the parsley and toss to combine. Season with salt.",
        "Skim the fat off the sauce in the pot. Transfer the beef bourguignonne to shallow bowls and garnish with the remaining 1 Tbs. parsley and the thyme leaves. Serve immediately with the steamed potatoes. Serves 6.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "3 lb. (1.5 kg) beef chuck roast, cut into 1-inch (2.5-cm) cubes",
        "Kosher salt and freshly ground pepper, to taste",
        "1 Tbs. olive oil",
        "1/2 lb. (250 g) bacon, cut into 1/4-inch (6-mm) dice",
        "1 jar beef bourguignonne braising base",
        "1 bay leaf (optional)",
        "2 fresh thyme sprigs, plus 2 tsp. fresh thyme leaves (optional)",
        "2 cups (8 oz./250 g) pearl onions, fresh or thawed frozen",
        "1/2 lb. (250 g) baby carrots, peeled",
        "2 lb. (1 kg) small red new potatoes, scrubbed",
        "2 Tbs. unsalted butter, at room temperature",
        "2 Tbs. finely chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Bourguignonne with Steamed Potatoes",
    "url": "http://www.williams-sonoma.com/recipe/beef-bourguignonne-with-steamed-potatoes.html"
}
