{
    "directions": [
        "Put beef, wine, onion, thyme, bay leaf, parsley sprigs, and carrot in a large resealable plastic bag. Seal bag, pressing out excess air, and put in a bowl. Marinate beef, chilled, 16 to 24 hours.",
        "Drain beef in a colander set over a large bowl, reserving marinade. Wipe off any solids clinging to beef, then pat beef dry. Season with 1 teaspoon salt and 1/2 teaspoon pepper.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Heat oil in a 3 1/2- to 4-quart heavy ovenproof pot with lid over moderately high heat until hot but not smoking, then brown beef well in 2 batches, without crowding, about 8 minutes per batch, transferring as browned with a slotted spoon to a plate.",
        "Reduce heat to moderate, then add shallot and garlic and cook, stirring, until shallot begins to soften, about 2 minutes. Add flour and cook, stirring constantly, until shallot and flour are browned, 4 to 5 minutes.",
        "Add reserved marinade liquid to flour mixture, stirring and scraping up brown bits. Add beef along with any juices accumulated on plate and cover with a round of parchment paper and lid. Simmer mixture while you prepare bacon.",
        "Cut bacon slices crosswise into 1/4-inch strips and cook in an 8-inch heavy skillet over moderate heat, stirring occasionally, until fat is rendered and bacon is beginning to crisp. Transfer bacon with slotted spoon to beef (reserve fat in skillet). Re-cover beef with parchment and lid and braise in oven, 1 1/2 hours.",
        "While meat is braising, blanch pearl onions in a 3- to 4-quart pot of boiling water, 1 minute. Drain onions in a colander, then peel, leaving root ends intact. Cook onions in reserved bacon fat in skillet over moderate heat, stirring occasionally, until golden, 6 to 8 minutes.",
        "Pour off excess fat, then add 1/4 cup water and scrape up brown bits with a wooden spoon or spatula.",
        "After meat has braised 1 1/2 hours, add pearl onions (with liquid in skillet), remaining 1/2 teaspoon salt, and 1/2 teaspoon pepper to beef and continue to braise, covered with parchment and lid, until onions are tender and meat is very tender, about 1/2 hour more.",
        "Skim any fat from surface of beef and serve beef with buttered egg noodles sprinkled with chopped fresh parsley leaves."
    ],
    "ingredients": [
        "2 lb boneless beef chuck, cut into 1 1/2-inch pieces",
        "1 (750-ml) bottle dry red wine (preferably Burgundy or Côtes du Rhône)",
        "2 medium onions, halved lengthwise, then thinly sliced lengthwise (2 cups)",
        "1 teaspoon finely chopped fresh thyme",
        "1 Turkish bay leaf or 1/2 California",
        "4 sprigs fresh flat-leaf parsley plus 1/4 cup chopped fresh parsley leaves",
        "1 carrot, thinly sliced",
        "1 1/2 teaspoons salt",
        "1 teaspoon black pepper",
        "2 tablespoons vegetable oil",
        "2 large shallots, finely chopped",
        "2 large garlic cloves, finely chopped",
        "2 tablespoons all-purpose flour",
        "6 oz thick-sliced bacon (preferably from slab bacon, rind removed if necessary; not smoked)",
        "1 (10-oz) package pearl onions (2 1/2 cups)",
        "1/4 cup water",
        "Special equipment: parchment paper",
        "Accompaniment: buttered egg noodles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Beef",
        "Herb",
        "Vegetable",
        "Braise",
        "Dinner",
        "Red Wine",
        "Fall",
        "Winter",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Beef Braised in Red Wine",
    "url": "http://www.epicurious.com/recipes/food/views/beef-braised-in-red-wine-235738"
}
