{
    "directions": [
        "Cook the bacon",
        "In a large fry pan over medium heat, cook the bacon, stirring occasionally, until crisp, 5 to 7 minutes. Transfer the bacon to paper towels to drain. Pour off the drippings into a small heatproof bowl, leaving about 1 Tbs. drippings in the pan. Set the pan, reserved drippings and bacon aside.",
        "Brown the beef",
        "In a sealable plastic bag, combine the flour, the 1 tsp. salt and the 1/2 tsp. pepper. Add the beef chunks and shake to coat evenly with the flour mixture. Return the fry pan to medium-high heat. When the drippings are hot, add half of the beef chunks and cook, turning once, until well browned, about 5 minutes on each side. Transfer the beef to the slow cooker. Repeat with the remaining beef chunks, adding the reserved drippings if needed. Scatter the mushrooms, carrots, onions and garlic on top.",
        "Cook the stew",
        "Return the pan to medium-high heat and add the wine, broth and tomato paste. Mix well, bring to a boil and deglaze the pan, stirring to scrape up the browned bits on the pan bottom. Pour the contents of the pan over the vegetables and beef. Cover and cook on the high-heat setting for 4 to 5 hours or the low-heat setting for 8 to 9 hours. The beef should be very tender. Stir in the reserved bacon and the rosemary. Cook, uncovered, on the high-heat setting for 10 minutes more to thicken the sauce slightly. Season with salt and pepper and serve. Serves 6.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Slow Cooker,",
        "by Norman Kolpas (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "4 oz. thick-cut bacon, chopped",
        "3 Tbs. flour",
        "1 tsp. salt, plus more, to taste",
        "1/2 tsp. freshly ground pepper, plus more, to taste",
        "3 lb. boneless beef chuck, trimmed of excess fat and cut into chunks",
        "3/4 lb. fresh cremini mushrooms, halved if large",
        "1/2 lb. baby carrots",
        "1/2 lb. frozen pearl onions",
        "3 garlic cloves, minced",
        "1 cup dry red wine",
        "1 cup beef broth",
        "2 Tbs. tomato paste",
        "1 Tbs. minced fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Stew with Bacon",
    "url": "http://www.williams-sonoma.com/recipe/beef-stew-with-bacon.html"
}
