{
    "directions": [
        "For the filling: Add the oil to a skillet over medium-high heat. Add the onions, sofrito, and peppers, stirring occasionally until soft. Add the tomato paste, adobo, and cilantro, stirring occasionally until combined. Add the ground beef, season, and stir until the mixture reaches 160 degrees F. Remove from the heat, strain, and allow the mixture to cool.",
        "For the empanada dough: Sift the flour, sugar, and salt onto parchment paper. Place the sifted dry ingredients into a food processor. Add the remainder of the ingredients to the food processor and process until the dough looks like a ball. Remove the ball from the food processor and cover it with plastic wrap. Refrigerate for 1 hour.",
        "Transfer the pastry onto a lightly floured board and roll out until it is 1/16-inch thick. Cut into segments with a 4-inch dough cutter. Each cut will create a dough round. Put 1 tablespoon of the filling onto the upper half of each round, and then fold the bottom pastry up into a half-moon shape. Crimp the edges closed with your finger to fold the upper and bottom halves together. Repeat this step until all the edges are closed.",
        "For the guava sauce: Blend all the ingredients in a food processor until the mixture is silky and smooth. Pour the sauce in a separate dish or bowl for dipping.",
        "Put about 2 inches of oil into a heavy, deep skillet over medium heat and heat to 350 degrees F. Add the empanadas, a few at a time, and cook until golden brown on both sides, about 5 minutes per side.",
        "Serve with guava sauce."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 onion, minced",
        "1/2 cup sofrito (garlic, cilantro, sweet peppers)",
        "1 red bell pepper, minced",
        "4 tablespoons tomato paste",
        "2 tablespoons adobo (salt, freshly ground black pepper, and Dominican oregano)",
        "3 tablespoons chopped fresh cilantro",
        "2 pounds ground beef",
        "Salt and freshly ground black pepper",
        "3 cups all-purpose flour, plus more for dusting",
        "2 tablespoons sugar",
        "2 tablespoons salt",
        "4 ounces butter",
        "2 ounces white vinegar",
        "2 ounces water",
        "1 egg",
        "1 pound guava paste",
        "1/4 cup white vinegar",
        "8 ounces water",
        "1/4 cup rum",
        "Olive oil or neutral tasting oil, for frying"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Skillet Recipes",
        "Sauce Recipes",
        "Empanada Recipes",
        "Beef",
        "Meat",
        "Fruit",
        "Guava Recipes"
    ],
    "title": "Beef Empanadas",
    "url": "http://www.foodnetwork.com/recipes/beef-empanadas-recipe2"
}
