{
    "directions": [
        "Position rack in bottom third of oven and preheat to 325°F. Pat brisket dry; sprinkle all over with salt and pepper. Heat oil in heavy extra-large skillet over high heat. Add brisket and cook until deep brown, about 7 minutes per side. Transfer brisket, fat side up, to large roasting pan. Add tomatoes with juice and wine to skillet. Remove from heat, scrape up any browned bits, and pour mixture over brisket. Distribute onions, carrots, and garlic around brisket. Add prunes and thyme; drizzle with 1/2 cup prune juice and 3 tablespoons vinegar. Sprinkle lightly with salt and pepper. Place pan over 2 burners and bring to boil. Cover pan with heavy-duty foil; place in oven.",
        "Braise brisket until tender, about 3 hours 15 minutes. Uncover and cool 1 hour at room temperature. DO AHEAD: Can be made 2 days ahead. Cover with foil and chill. Bring just to simmer over 2 burners before continuing.",
        "Remove brisket from roasting pan, scraping off juices. Place on work surface;cut across grain into 1/4-inch-thick slices.Spoon off fat from top of pan juices. Place 1 cup vegetables (no prunes) and 1 cup braising liquid from pan into processor and puree. Return puree to pan. Add remaining 1 tablespoon prune juice and 1 teaspoon vinegar to pan. Heat sauce; season with salt and pepper.",
        "Overlap brisket slices in 13x9x2- inch glass baking dish. Pour sauce over brisket, separating slices to allow some sauce to flow between. DO AHEAD:Can be made 1 day ahead. Cover; chill.",
        "Rewarm brisket, covered, in 350°F oven for 30 minutes. Sprinkle brisket with parsley; serve.",
        "Use a slender metal pin, like a turkey lacer, to check whether the brisket is tender. Insert the pin into the thickest part; if it meets no resistance, the brisket is done.",
        "You used Merlot to cook the brisket, so why not pour a Merlot as well? Try the Yarden 2002 Merlot ($22), produced at a winery in Israel's Golan Heights. The kosher wine has ripe plum flavors and a spicy finish."
    ],
    "ingredients": [
        "1 4-to 4 1/2-pound flat-cut (also called first-cut) beef brisket, trimmed of most fat",
        "2 tablespoons olive oil",
        "1 14 1/2-ounce can diced tomatoes in juice (preferably fire-roasted)",
        "1 cup Merlot or other dry red wine",
        "2 pounds onions, sliced",
        "4 medium carrots, peeled, thinly sliced",
        "16 garlic cloves, peeled",
        "1 1/2 cups pitted large prunes (about 8 ounces)",
        "1 tablespoon finely chopped fresh thyme",
        "1/2 cup plus 1 tablespoon prune juice",
        "3 tablespoons plus 1 teaspoon balsamic vinegar",
        "2 tablespoons chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Braise",
        "Passover",
        "High Fiber",
        "Purim",
        "Dinner",
        "Prune",
        "Brisket",
        "Red Wine",
        "Kosher",
        "Kosher for Passover",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Beef Brisket with Merlot and Prunes",
    "url": "http://www.epicurious.com/recipes/food/views/beef-brisket-with-merlot-and-prunes-241853"
}
