{
    "directions": [
        "Put the dried mushrooms in a bowl, add the boiling water and soak for 20 minutes. Line a fine-mesh sieve with a double layer of cheesecloth, place over a bowl and drain the mushrooms, reserving the soaking liquid. Rinse the mushrooms with cold water and chop finely.",
        "Preheat an oven to 300°F (150°C).",
        "In a large, heavy pot over medium-high heat, melt the butter. Working in batches, sear the beef, turning frequently, until browned on all sides, about 10 minutes per batch. Transfer to a plate.",
        "Add the onions and garlic to the pot and sauté until softened, 5 to 7 minutes. Stir in the rehydrated mushrooms. Add the fresh mushrooms, reduce the heat to medium, and sauté until they start to brown and release their liquid, about 5 minutes. Stir in the mushroom soaking liquid and the broth. Return the beef to the pot and stir to combine. Cover, transfer to the oven and cook until the beef is tender, about 2 hours.",
        "Stir in the barley and water. Cover and cook in the oven for 1 hour. Stir in the carrots and parsnips. Cover and cook in the oven until the barley and vegetables are tender, about 30 minutes more. Season with salt and pepper. Garnish with the dill and serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "One Pot of the Day",
        ", by Kate McMillan (Weldon Owen, 2012)."
    ],
    "ingredients": [
        "1 oz. (30 g) dried mushrooms, such as porcini",
        "2 cups (16 fl. oz./500 ml) boiling water",
        "2 Tbs. unsalted butter",
        "2 lb. (1 kg) beef chuck, cut into 2-inch (5-cm) pieces",
        "2 yellow onions, finely chopped",
        "2 garlic cloves, minced",
        "1 lb. (500 g) small cremini or other fresh mushrooms, trimmed",
        "2 cups (16 fl. oz./500 ml) beef broth",
        "1/2 cup (4 oz./125 g) pearl barley",
        "1 cup (8 fl. oz./250 ml) water",
        "3 carrots, finely chopped",
        "2 parsnips, peeled and finely chopped",
        "Salt and freshly ground pepper, to taste",
        "2 Tbs. chopped fresh dill"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef with Mushrooms and Barley",
    "url": "http://www.williams-sonoma.com/recipe/beef-with-mushrooms-and-barley.html"
}
