{
    "directions": [
        "Bring 4 cups water to boil in large saucepan. Add bouillon and stir to dissolve; set aside. Heat 1 tablespoon oil in heavy large pot over high heat. Working in batches, add beef and sauté until brown, about 6 minutes per batch. Using slotted spoon, transfer beef to bowl. Add 1 tablespoon oil, onions and garlic to same pot; sauté until onions are tender, about 5 minutes. Add bouillon mixture, tomatoes with juices, lemongrass, curry powder and bay leaves. Return beef and any accumulated juices to pot. Bring to boil. Reduce heat to medium-low, cover and simmer until beef is almost tender, stirring occasionally, about 1 hour.",
        "Add carrots, potatoes and mushrooms to stew and simmer until vegetables are just tender, about 20 minutes. Uncover and simmer until potatoes are very tender and stew is slightly thickened (potato pieces will thicken liquid), about 10 minutes. Season to taste with salt and pepper. Transfer to serving bowl. Sprinkle with chopped parsley and serve."
    ],
    "ingredients": [
        "4 cups water",
        "2 extra-large beef bouillon cubes (each 1/2 ounce)",
        "2 tablespoons olive oil",
        "2 1/4 pounds trimmed boneless beef chuck, cut into 1 1/2-inch cubes",
        "2 cups coarsely chopped onions",
        "3 garlic cloves, minced",
        "1 14 1/2-ounce can diced tomatoes in juice",
        "1/3 cup finely chopped fresh lemongrass",
        "1 tablespoon curry powder",
        "2 bay leaves",
        "2 large carrots, peeled, cut into 1/2-inch pieces",
        "2 small potatoes, peeled, cut into 1/2-inch pieces",
        "8 ounces button mushrooms, trimmed",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Mushroom",
        "Tomato",
        "Vegetable",
        "Stew",
        "Curry",
        "Winter",
        "Oklahoma"
    ],
    "title": "Beef Stew with Curry and Lemongrass",
    "url": "http://www.epicurious.com/recipes/food/views/beef-stew-with-curry-and-lemongrass-5819"
}
