{
    "directions": [
        "Place the beef into a vacuum-sealable bag. Add the wine, garlic, sliced shallots, bay leaves, thyme, rosemary, peppercorns and 2 Tbs. of the olive oil. Using a vacuum sealer, vacuum and seal the bag tight according to the manufacturer’s instructions; be sure you have a smooth, airtight seal. Refrigerate for at least 8 hours or up to 24 hours.",
        "Prepare a sous vide immersion circulator for use according to the manufacturer’s instructions. Preheat the water to 120°F, 30 minutes to 1 hour.",
        "Carefully place the bag into the circulating water and cook for 1 1/2 hours. Carefully remove the bag from the circulating water and let rest for 5 minutes. Open the bag and remove the beef, wiping off any large pieces of garlic or shallots. Season the beef with kosher salt.",
        "In a large fry pan over medium-high heat, warm 1 Tbs. of the olive oil until just smoking. Add the beef and sear until browned on all sides, 1 to 2 minutes per side. Transfer to a carving board, cover loosely with aluminum foil and let rest for 5 to 10 minutes.",
        "In a small bowl, whisk together the vinegar, mustard and chopped shallots. Slowly whisk in the remaining 6 Tbs. olive oil. Season the vinaigrette with kosher salt and pepper. In a large bowl, combine the mesclun, onion and tomatoes. Add the vinaigrette and toss gently. Divide the salad among 4 plates. Top with the avocado. Slice the beef across the grain and arrange on the salads. Sprinkle with Maldon sea salt and serve immediately. Serves 4.",
        "Williams-Sonoma Kitchen."
    ],
    "ingredients": [
        "1 lb. beef tenderloin",
        "1 cup red wine",
        "2 garlic cloves, thinly sliced",
        "2 shallots, thinly sliced",
        "2 bay leaves",
        "2 fresh thyme sprigs",
        "2 fresh rosemary sprigs",
        "1 tsp. peppercorns",
        "9 Tbs. olive oil",
        "Kosher salt, to taste",
        "2 Tbs. red wine vinegar",
        "1 tsp. whole-grain mustard",
        "2 Tbs. finely chopped shallots",
        "Freshly ground pepper, to taste",
        "6 oz. mesclun greens",
        "1/2 red onion, very thinly sliced",
        "1 cup grape tomatoes, halved",
        "1 avocado, pitted, peeled and thinly sliced",
        "Maldon sea salt or coarse sea salt, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Tenderloin Salad with Tomatoes and Avocado",
    "url": "http://www.williams-sonoma.com/recipe/beef-tenderloin-salad-with-tomatoes-and-avocado.html"
}
