{
    "directions": [
        "Heat 2 tablespoons of olive oil in a large pot over medium heat, and brown the beef stew meat on all sides, about 10 minutes; set aside. Heat the remaining 1 tablespoon of olive oil, and cook the bacon just until it begins to brown; stir in the onion, carrot, mushrooms, garlic, and sugar. Cook the vegetables until soft and browned, 10 to 15 more minutes.",
        "Stir in the flour until smoothly incorporated, and gradually mix in the Irish stout beer and beef stock. Mix in the thyme, bay leaves, and the reserved cooked beef. Cover, and bring the mixture to a boil; reduce heat to a  simmer until the meat is tender, about 1 hour and 15 minutes; stir occasionally. Remove the cover, turn the heat up to medium, and let the stew boil until slightly thickened, about 15 more minutes. Mix cornstarch with water, and stir into the stew; let simmer for 30 more minutes to blend flavors. Remove from heat; discard bay leaves.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Spread the filling into a 9-inch pie dish; trim the puff pastry into a 10-inch circle, and place on top of the filling. Pinch and crimp the edges of the pastry with a fork, sealing it to the dish; cut 2 steam vents into the pastry with a sharp knife. Brush the top of the pie with beaten egg.",
        "Bake in the preheated oven until the crust is browned, 30 to 40 minutes."
    ],
    "ingredients": [
        "3 tablespoons olive oil, divided",
        "1 pound cubed beef stew meat",
        "2 slices bacon, chopped",
        "1 white onion, chopped",
        "1 carrot, sliced",
        "1/3 pound crimini mushrooms, sliced",
        "1 clove garlic, crushed",
        "1 teaspoon white sugar",
        "1 1/2 tablespoons all-purpose flour",
        "1 cup Irish stout beer (such as Guinness®)",
        "1 1/4 cups beef stock",
        "1/2 teaspoon ground thyme",
        "2 bay leaves",
        "1/2 teaspoon cornstarch, or as needed",
        "1 teaspoon water",
        "1 sheet frozen puff pastry, thawed",
        "1 egg, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Beef, Mushroom and Guinness® Pie",
    "url": "http://allrecipes.com/recipe/216928/beef-mushroom-and-guinness-pie/"
}
