{
    "directions": [
        "Put oven rack in middle position and preheat oven to 425°F.",
        "Remove any strings from beef if tied, then pat beef dry and sprinkle with kosher salt and pepper. Heat oil in a deep 12-inch heavy skillet over high heat until just smoking, then sear beef 1 piece at a time, turning with tongs, until well browned, about 5 minutes each. (If beef tenderloin pieces are too long to fit into skillet, halve each crosswise, then brown 2 pieces at a time.) Transfer beef to an 18- by 12-inch flameproof roasting pan, reserving skillet.",
        "Roast beef in oven until thermometer inserted diagonally 2 inches into center of each piece registers 120°F, 20 to 25 minutes. Transfer beef to a cutting board, reserving roasting pan, and let stand, loosely covered with foil, 25 minutes. (Beef will continue to cook as it stands, reaching 130°F for medium-rare.)",
        "While beef roasts, heat butter in skillet over moderately high heat until foam subsides, then reduce heat to moderate and cook mushrooms, stirring, until liquid they give off is evaporated and mushrooms are pale golden, 8 to 10 minutes. Remove from heat.",
        "While beef stands, straddle roasting pan across 2 burners, then add Sherry and deglaze pan by boiling over high heat, stirring and scraping up brown bits, 1 minute. Add Sherry mixture and espagnole sauce to mushrooms and cook over moderate heat, stirring, until warm. Cover skillet and remove from heat.",
        "Cut off and discard strings from beef and cut meat crosswise into 10 or 20 slices. Pour any juices on cutting board into sauce and heat over moderate heat, stirring, until hot.",
        "Serve beef with sauce."
    ],
    "ingredients": [
        "2 (2 1/2-lb) pieces trimmed center-cut beef tenderloin roast",
        "1 tablespoon kosher salt",
        "2 teaspoons black pepper",
        "3 tablespoons vegetable oil",
        "3 tablespoons unsalted butter",
        "1 1/2 lb small fresh cremini mushrooms, cut into 1/2-inch wedges",
        "1/2 cup medium-dry Sherry",
        "2 2/3 cupsespagnole sauce",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Bake",
        "Roast",
        "Sauté",
        "Christmas",
        "Beef Tenderloin",
        "Sherry",
        "Gourmet"
    ],
    "title": "Beef Tenderloin with Mushrooms and Espagnole Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/beef-tenderloin-with-mushrooms-and-espagnole-sauce-231181"
}
