{
    "directions": [
        "Preheat an oven to 500°F (260°C).",
        "Rub all sides of the beef with the oil, then rub it with the sweet soy sauce, if using. Season generously all over with pepper. Set on a rack in a roasting pan, place in the oven and cook until an instant-read thermometer inserted into the tenderloin registers 115°F (46°C), 20 to 25 minutes. Immediately transfer the rack and beef to a rimmed baking sheet to catch the juices. Set in a cool place to stop the cooking as quickly as possible.",
        "While the beef is cooling, make the marinade: In a large resealable plastic bag, combine the soy sauce, mirin, ginger, green onions, garlic and lemon zest. When the beef is cool enough to handle, place it in the bag, squeeze out some of the air, seal the bag and marinate in the refrigerator, turning the beef occasionally, for at least 6 hours or up to 24 hours.",
        "Place the bag in the freezer and freeze the beef for 20 minutes. Remove the beef from the bag and discard the marinade. Using a very sharp knife, cut the beef crosswise into even slices about 1/4 inch (6 mm) thick. Arrange the slices on a platter or individual plates, scatter with the slivered green onions and let stand for 10 minutes.",
        "To make the citrus sauce, in a bowl, whisk together the soy sauce, vinegar, sugar, lemon juice and chives. Spoon over the sliced beef and serve at once. Serves 6.",
        "Adapted from",
        "The Cook & the Butcher",
        "(Weldon Owen, 2011), by Brigit Binns"
    ],
    "ingredients": [
        "1 very cold beef tenderloin, about 2 lb. (1 kg), silverskin removed",
        "1 Tbs. canola oil",
        "1 Tbs. sweet soy sauce (optional)",
        "Freshly ground pepper, to taste",
        "1/3 cup (3 fl. oz./80 ml) reduced-sodium soy sauce",
        "1/4 cup (2 fl. oz./60 ml) mirin or medium-dry sherry",
        "1 Tbs. peeled and grated fresh ginger",
        "3 green onions, white and light green parts, thinly sliced, plus slivered green onions for garnish",
        "2 large garlic cloves, thinly sliced",
        "Zest of 1 lemon, removed in strips with a vegetable peeler",
        "1/4 cup (2 fl. oz./60 ml) reduced-sodium soy sauce",
        "2 Tbs. rice vinegar",
        "1 1/2 Tbs. turbinado or firmly packed dark brown sugar",
        "2 Tbs. fresh lemon juice",
        "2 Tbs. finely snipped fresh chives"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Tataki",
    "url": "http://www.williams-sonoma.com/recipe/beef-tataki.html"
}
