{
    "directions": [
        "Mix 2 1/2 cups flour and 1 tsp. salt in a large bowl. Cut 10 Tbsp. butter into cubes (it doesn't have to be particularly cold, just firm enough to cut into pieces). Work butter into flour with your fingertips until mixture resembles breadcrumbs. Pour 3/4 cup boiling water over and mix with a wooden spoon. Knead with your hands until dough just starts to form.",
        "Turn out onto a clean work surface and knead until dough forms, about 20 seconds; roll into a ball. Divide into 4 portions, shape into rounds, and chill until ready to use.",
        "Preheat oven to 375°F. Mix beef, potato, onion, pepper, and 1 tsp. salt in a large bowl.",
        "Roll out each round to a 9\"-diameter circle on a lightly floured work surface. Arrange a heaping 3/4 cup filling over 1 half of each circle, leaving a 1\" border between filling and edge of circle. Cut remaining 1/2 Tbsp. butter into 4 pieces; place on each mound of filling. Pull bottom half of dough over filling; crimp with your fingers to seal. (Alternately, use a fork to seal.)",
        "Beat egg and a pinch of salt in a small bowl. Using a pastry brush, brush each pasty with egg wash. Cut a couple small slits in top of pasty. Transfer to a parchment-lined rimmed baking sheet and bake until golden brown and bubbling, 45–60 minutes. Serve with butter and ketchup, if desired."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour, plus more for surface",
        "2 teaspoons kosher salt, divided, plus more",
        "10 1/2 tablespoons unsalted butter, divided, plus more for serving",
        "3/4 pound boneless chuck steak, cut into 1/2\" cubes",
        "1 medium russet potato, peeled, cut into 1/2\" cubes (about 1 1/2 cups)",
        "1/2 medium onion, finely chopped (about 1 cup)",
        "3/4 teaspoon freshly ground black pepper",
        "1 large egg",
        "Ketchup (for serving; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pastry",
        "Beef",
        "Potato",
        "Michigan",
        "Bake"
    ],
    "title": "Beef and Potato Pasties",
    "url": "http://www.epicurious.com/recipes/food/views/beef-and-potato-pasties"
}
