{
    "directions": [
        "Position rack in center of oven and preheat to 375°F. In 9-inch-diameter pie pan, toss shallots with oil to coat. Season with salt and pepper. Roast until shallots are deep brown and very tender, stirring occasionally, about 30 minutes.",
        "Boil broth and Port in large saucepan until reduced to 3 3/4 cups, about 30 minutes. Whisk in tomato paste. (Shallots and broth mixture can be made 1 day ahead. Cover separately; chill.)",
        "Pat beef dry; sprinkle with thyme, salt and pepper. In large roasting pan set over medium heat, sauté bacon until golden, about 4 minutes. Using slotted spoon, transfer bacon to paper towels. Add beef to pan; brown on all sides over medium-high heat, about 7 minutes. Transfer pan to oven; roast beef until meat thermometer inserted into center registers 125°F for medium-rare, about 45 minutes. Transfer beef to platter. Tent loosely with foil.",
        "Spoon fat off top of pan drippings in roasting pan. Place roasting pan over high heat. Add broth mixture and bring to boil, scraping up any browned bits. Transfer to medium saucepan; bring to simmer. Mix 3 tablespoons butter and flour in small bowl to form smooth paste; whisk into broth mixture and simmer until sauce thickens, about 2 minutes. Whisk in 3 tablespoons butter. Stir in roasted shallots and reserved bacon. Season sauce with salt and pepper. Cut beef into 1/2-inch-thick slices. Spoon some sauce over. Garnish with watercress. Pass remaining sauce."
    ],
    "ingredients": [
        "1 1/2 pounds large shallots (about 24), halved lengthwise, peeled",
        "3 tablespoons olive oil",
        "6 cups canned beef broth",
        "1 1/2 cups tawny Port",
        "1 tablespoon tomato paste",
        "2 3- to 3 1/4-pound beef tenderloins (large ends), trimmed",
        "2 teaspoons dried thyme",
        "7 bacon slices, chopped",
        "6 tablespoons (3/4 stick) butter",
        "1 1/2 tablespoons all purpose flour",
        "1 large bunch watercress"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Christmas",
        "Beef Tenderloin",
        "Bacon",
        "Port",
        "Winter",
        "Shallot"
    ],
    "title": "Beef Tenderloin with Roasted Shallots, Bacon and Port",
    "url": "http://www.epicurious.com/recipes/food/views/beef-tenderloin-with-roasted-shallots-bacon-and-port-4542"
}
