{
    "directions": [
        "Cook noodles according to package directions, then drain in a colander.",
        "Stir together oyster sauce, soy sauce, sugar, cornstarch, and water until smooth.",
        "Heat 1 tablespoon oil in a 10-inch nonstick skillet over medium-high heat until hot. Add noodles to skillet, pressing them with a rubber spatula to form a cake, and cook until underside is golden, 2 to 3 minutes. Flip cake over and drizzle 1 tablespoon oil around sides of cake, then cook until underside is golden, 2 to 3 minutes. Transfer noodle cake to a cutting board and cut into quarters.",
        "Heat 1/2 tablespoon oil in a wok or 12-inch heavy skillet over medium-high heat until it begins to smoke. Stir-fry snow peas with a pinch of salt until bright green, 1 to 2 minutes, then transfer to a plate. Add 2 tablespoons oil to wok and stir-fry scallions and ginger with 1/4 teaspoon salt 30 seconds. Add half of beef and cook, undisturbed, 45 seconds, then stir-fry until beef is just browned, 1 to 2 minutes more. Transfer to plate with snow peas. Add remaining tablespoon oil and cook remaining beef in same manner.",
        "Stir sauce mixture again, then add to wok and bring to a boil. Stir in beef and snow peas, then serve spooned on top of noodle cake."
    ],
    "ingredients": [
        "1 (9-ounces) package fresh Chinese-style noodles (or 8 ounces dried noodles)",
        "2 tablespoons oyster sauce",
        "1/2 tablespoon soy sauce",
        "1/2 teaspoon sugar",
        "2 teaspoons cornstarch",
        "1/2 cup water",
        "5 1/2 tablespoons vegetable oil, divided",
        "1/2 pound snow peas, trimmed",
        "3 scallions, finely chopped",
        "2 tablespoons minced peeled ginger",
        "1 pound flank steak, thinly sliced across the grain"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Stir-Fry",
        "Kid-Friendly",
        "Quick & Easy",
        "Dinner",
        "Meat",
        "Steak",
        "Pea",
        "Potluck",
        "Noodle",
        "Soy Sauce",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Beef and Snow Peas with Panfried Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/beef-and-snow-peas-with-panfried-noodles-356009"
}
