{
    "directions": [
        "Preheat an oven to 300°F.",
        "In a large fry pan over medium-high heat, warm the canola oil. Add the bacon and cook, turning frequently, until crisp, about 5 minutes. Transfer to a paper towel-lined plate. Let the bacon cool, then coarsely chop.",
        "Season the beef generously with salt and pepper. Working in batches if necessary, add the beef to the pan and cook over medium-high heat, turning frequently, until browned on all sides, 5 to 7 minutes. Transfer to a bowl.",
        "Pour off all but 2 Tbs. of the fat from the pan and return the pan to medium-high heat. Add the onions and sauté until softened, 3 to 5 minutes. Add the garlic and cook for 1 minute. Stir in the paprika, caraway seeds, oregano, tomato paste, wine and broth and bring to a boil.",
        "Transfer the beef to a large Dutch oven. Pour in the broth mixture and stir to combine. Cover the pot, transfer to the oven and cook until the beef is tender, about 2 hours. Uncover and stir in the reserved chopped bacon, bell pepper and potatoes. Cover and cook until the potatoes are tender and the sauce is thickened, about 1 hour more. Season with salt and pepper.",
        "Divide the goulash among warmed bowls. Garnish with the sour cream and serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "Essentials of Slow Cooking",
        ", by Melanie Barnard, Charles Pierce & Denis Kelly (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "1 Tbs. canola oil",
        "4 bacon slices, about 1/4 lb. total",
        "2 lb. beef chuck, cut into 2-inch pieces and patted dry",
        "Salt and freshly ground pepper, to taste",
        "2 yellow onions, chopped",
        "2 garlic cloves, minced",
        "1 Tbs. Hungarian paprika",
        "1 tsp. caraway seeds",
        "5 fresh oregano sprigs",
        "1 Tbs. tomato paste",
        "1 cup dry white wine",
        "1 cup low-sodium chicken broth",
        "1 red bell pepper, seeded and chopped",
        "6 Yukon Gold potatoes, about 2 lb. total, quartered",
        "1/2 cup sour cream"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Goulash (Hungarian Paprika)",
    "url": "http://www.williams-sonoma.com/recipe/beef-goulash.html"
}
