{
    "directions": [
        "To make the horseradish crème fraîche, in a bowl, whisk together the horseradish, crème fraîche, chives and white pepper. Cover and refrigerate for at least 30 minutes before serving.",
        "Remove the tenderloin from the refrigerator and let stand at room temperature for 2 hours.",
        "Preheat an oven to 425°F.",
        "In a small bowl, whisk together the mustard, the 1 1/2 Tbs. olive oil and the thyme. Set aside.",
        "Using kitchen string, tie the tenderloin firmly at 1 1/2-inch intervals to keep it plump and round during cooking. Pat thoroughly dry and season all sides generously with salt.",
        "Heat a large roasting pan over medium-high heat until it is very hot, about 3 minutes. Add enough oil to the pan to coat the bottom. When the oil is shimmering, add the tenderloin and sear without moving for 2 1/2 minutes. Turn the tenderloin and continue to sear until it has an even, dark brown crust on all sides. Transfer the tenderloin to a cutting board, brush with the mustard mixture and season generously with black pepper.",
        "Set a rack in the roasting pan and place the tenderloin on the rack. Transfer the pan to the oven and roast until an instant-read thermometer inserted into the center of the meat registers 125° to 130°F, 15 to 20 minutes. The temperature will range from rare to medium-rare in different parts of the tenderloin. Transfer the tenderloin to a platter, cover loosely with aluminum foil, and let rest for at least 15 minutes or up to 30 minutes.",
        "Meanwhile, prepare the mushroom ragout: In a large fry pan over medium heat, melt the butter. Add the shallots and cook until softened, about 5 minutes. Add the mushrooms and cook, stirring occasionally, until they release their liquid, about 10 minutes. Add the Madeira and simmer until almost completely evaporated. Stir in the cream, chives, salt and black pepper. Continue to cook, stirring, until the ragout is thick, creamy, and bubbling, 1 to 2 minutes more.",
        "Snip the strings and cut the tenderloin into slices about 1/2 inch thick. Arrange on plates with the ragout and serve immediately. Pass the horseradish crème fraîche alongside. Serves 6 to 8.",
        "A note from the butcher:",
        "Purchase a whole 6- to 7-lb. tenderloin; it is a better value than a center-cut roast. Ask your butcher to prepare it “chef ready,” with the gristly side muscle and the silverskin removed and the roast tied. —Michael Milazo, Alexander’s Prime Meats and Catering, San Gabriel, CA",
        "Adapted from Williams-Sonoma",
        "The Cook and The Butcher",
        ", by Brigit Binns (Weldon Owen, Inc., 2011)."
    ],
    "ingredients": [
        "3 Tbs. freshly grated horseradish",
        "1 cup crème fraîche",
        "1 Tbs. plus 2 tsp. finely snipped fresh chives",
        "1/2 tsp. freshly ground white pepper",
        "",
        "1 beef tenderloin, 3 1/2 to 4 lb., silverskin removed or snipped in several places",
        "2 Tbs. whole-grain mustard",
        "1 1/2 Tbs. olive oil, plus more for cooking",
        "1 1/2 tsp. dried thyme",
        "Kosher salt and freshly ground black pepper, to taste",
        "",
        "2 Tbs. unsalted butter",
        "2 large shallots, finely chopped",
        "1 lb. mixed mushrooms, such as oyster and cremini, brushed clean and thickly sliced",
        "1/4 cup Madeira or medium-dry sherry",
        "1/4 cup heavy cream",
        "2 tsp. finely snipped fresh chives",
        "1/4 tsp. salt",
        "Freshly ground black pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Roasted Beef Tenderloin with Mushroom Ragout",
    "url": "http://www.williams-sonoma.com/recipe/beef-tenderloin-mushroom-ragout.html"
}
