{
    "directions": [
        "Prepare a sous vide immersion circulator for use according to the manufacturer’s instructions. Preheat the water to 134°F, 30 minutes to 1 hour.",
        "In a small bowl, stir together 2 tsp. of the fine sea salt and the piment d’Espelette. Rub the mixture on both sides of the steaks. Place the steaks into a vacuum-sealable bag and pour the butter into the bag. Using a vacuum sealer, vacuum and seal the bag tight according to the manufacturer’s instructions; be sure you have a smooth, airtight seal. Place the bag into another bag and seal again to ensure that the bones do not penetrate the bag during cooking. Carefully place the bag into the circulating water and cook for 2 hours.",
        "Carefully remove the bag from the circulating water. If preparing the beef in advance, place the bag into a large bowl of ice water for 20 minutes. Remove the bag from the ice water and refrigerate overnight. To reheat the beef, preheat the water in the immersion circulator to 134°F and place the bag of beef in the water for 45 minutes. Remove the bag from the circulating water and let rest for 5 minutes. Open the bag, transfer the liquid to a bowl and place the steaks on a large plate. If finishing the beef on the grill the same day, it is not necessary to cool the beef in ice water before removing it from the bag.",
        "In a large bowl, stir together the mushrooms, asparagus, onion, the remaining 1 1/4 tsp. fine sea salt and the olive oil.",
        "Prepare a medium-hot fire in a grill. Place a la plancha cast-iron griddle and a steel grill fry pan on the grill, cover the grill and heat until the internal temperature of the grill reaches 600° to 650°F.",
        "Place the steaks on the griddle and sear, turning once, until well browned, 3 to 5 minutes per side for medium-rare; baste the steaks occasionally with the reserved sous vide cooking liquid. Transfer the steaks to a cutting board, cover loosely with aluminum foil and let rest for 10 minutes.",
        "While the steaks are resting, place the vegetable mixture in the fry pan, cover the grill and cook, tossing the vegetables every 2 minutes, until crisp-tender, about 10 minutes total. Remove the pan from the heat, toss in the lemon zest and transfer the vegetables to a serving bowl. Cut the steaks into thin slices and sprinkle lightly with Maldon sea salt. Serve immediately. Serves 6.",
        "Recipe by Chef Bryan Voltaggio."
    ],
    "ingredients": [
        "3 1/4 tsp. fine sea salt",
        "2 tsp. piment d’Espelette",
        "2 beef porterhouse steaks, each 2 to 2 1/2 lb. and 2 1/4 inches thick",
        "8 Tbs. (1 stick) unsalted butter, melted",
        "8 oz. cremini mushrooms, quartered",
        "1 lb. asparagus, trimmed, ends peeled, spears cut on the bias into 2-inch pieces",
        "1 small red onion, halved and thinly sliced",
        "2 Tbs. olive oil",
        "Zest of 1 lemon",
        "1 tsp. Maldon sea salt"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Porterhouse a la Plancha",
    "url": "http://www.williams-sonoma.com/recipe/beef-porterhouse-a-la-plancha.html"
}
