{
    "directions": [
        "In a large saucepan over medium-high heat, warm 2 Tbs. of the olive oil. Add the onion and sauté until it begins to soften, about 4 minutes. Stir in the garlic, red pepper flakes, the 2 tsp. salt and the 1 tsp. black pepper and cook for 2 minutes. Add the tomatoes and stir to combine. Bring the sauce to a boil, reduce the heat to low and simmer to allow the flavors to develop, about 20 minutes. Season with salt and pepper.",
        "Bring a large pot of salted water to a boil over high heat. Add the lasagna noodles and cook until al dente, according to the package instructions. Drain the noodles and arrange in a single layer on a baking sheet.",
        "Preheat an oven to 400°F.",
        "In a fry pan over medium-high heat, warm the remaining 1 Tbs. olive oil. Add the ground beef and cook, stirring to break it up into small pieces, until browned, about 6 minutes. Season with salt and pepper, transfer to a large bowl and let cool slightly. Add the ricotta, goat cheese, 1/2 cup of the Parmigiano-Reggiano, the egg, basil and 1/3 cup of the tomato sauce and stir to combine.",
        "Ladle 1 1/2 cups of the tomato sauce into the bottom of a 9-by-13-inch baking dish. Lay a noodle on a work surface. Put 1/3 cup of the meat mixture on one end and roll up the noodle. Place the roll, seam side down, in the dish. Repeat with the remaining noodles and meat mixture. Cover the roll-ups with the remaining tomato sauce. Sprinkle with the mozzarella and the remaining 1/2 cup Parmigiano-Reggiano.",
        "Bake until the sauce is bubbling and the cheese is melted, about 20 minutes. Serve immediately. Serves 6 to 8.",
        "Adapted from Williams-Sonoma",
        "One Pot of the Day",
        ", by Kate McMillan (Weldon Owen, 2012)."
    ],
    "ingredients": [
        "3 Tbs. olive oil",
        "1 yellow onion, chopped",
        "3 garlic cloves, minced",
        "1/4 tsp. red pepper flakes (optional)",
        "2 tsp. salt, plus more, to taste",
        "1 tsp. freshly ground black pepper, plus more, to taste",
        "1 can (28 oz.) crushed tomatoes",
        "3/4 lb. dried lasagna noodles",
        "1 lb. ground beef",
        "1/2 lb. ricotta cheese",
        "4 oz. fresh goat cheese",
        "1 cup grated Parmigiano-Reggiano cheese",
        "1 egg, lightly beaten",
        "1/3 cup chopped fresh basil",
        "1 cup shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef, Basil and Goat Cheese Lasagna Roll-Ups",
    "url": "http://www.williams-sonoma.com/recipe/beef-basil-and-goat-cheese-lasagna-roll-ups.html"
}
