{
    "directions": [
        "Place the brisket cubes into a mixing bowl, and season with salt and pepper. Sprinkle with flour, and toss until evenly coated. Heat the canola oil in a Dutch oven or large pot over high heat. Cook the meat in small batches until browned on all sides; about 5 minutes per batch. Set the meat aside as the batches are done.",
        "Once the meat has been browned and set aside, stir in the portobello mushrooms, and cook until browned, about 5 minutes. Remove the mushrooms, and set aside. Stir the pearl onions, carrot, celery root, and turnips into the pot. Cook and stir until the onions begin to turn light brown, about 5 minutes. Add the garlic, and continue cooking until the onions are golden brown, about 3 minutes more. Remove the vegetables and set aside.",
        "Return the beef to the pot, and pour in the beer. Bring to a boil, and cook until the beer has reduced to 1/3 of its original volume, about 8 minutes. Pour in the beef broth and return to a boil. Reduce heat to medium-low, cover, and simmer until the meat starts to become tender, about 1 hour. Return the browned vegetables to the pot along with the potatoes, recover, and cook 1 hour more.",
        "Stir in the reserved mushrooms, malt vinegar, thyme, and rosemary. Simmer a few minutes until heated through. Season to taste with salt and pepper before serving."
    ],
    "ingredients": [
        "2 pounds beef brisket, trimmed and cut into 2-inch pieces",
        "salt and black pepper to taste",
        "2 tablespoons all-purpose flour",
        "5 tablespoons canola oil",
        "2 cups diced portobello mushroom caps",
        "1 1/2 cups red pearl onions, peeled",
        "1 cup diced carrot",
        "1 cup diced celery root (celeriac)",
        "1 cup diced turnip",
        "2 cloves garlic, minced",
        "2 (12 fluid ounce) cans or bottles brown lager beer",
        "2 cups beef broth",
        "1 cup diced potato",
        "1 tablespoon malt vinegar",
        "4 sprigs fresh thyme, chopped",
        "2 sprigs fresh rosemary, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Beef Stew with Ale",
    "url": "http://allrecipes.com/recipe/214064/beef-stew-with-ale/"
}
