{
    "directions": [
        "Make the filling",
        "In a large, heavy fry pan over medium heat, cook the beef and pine nuts, stirring to break up the meat, until the beef is no longer pink, about 6 minutes. Using a slotted spoon, transfer to a bowl.",
        "Add the onion to the pan and cook, stirring occasionally, until softened, about 5 minutes. Add the tomato paste and wine and cook, stirring occasionally, until the mixture is thick and dry, about 3 minutes. Add the onion mixture and currants to the beef mixture, along with the 1/4 tsp. salt, 1/4 tsp. pepper, 1/2 tsp. cumin and 1/4 tsp. oregano. Mix well and adjust the seasonings if necessary.",
        "Roll out the dough",
        "Preheat an oven to 375°F. Line 2 baking sheets with parchment paper. Divide the dough disk in half, keeping one half in the refrigerator until needed.",
        "On a lightly floured surface, roll out each half into a rough round just less than 1/4 inch thick. Using a 3-inch biscuit cutter, cut out as many rounds as possible. Transfer to the prepared baking sheets. Gather the scraps, roll out and cut out additional rounds. You should have about 24 rounds.",
        "Assemble and bake the empanadas",
        "Place a generous tablespoonful of the filling in the center of each dough round. Lift the edges of each round so they meet in the center, compacting the filling. Firmly crimp the edges and transfer the empanadas to a prepared sheet. Press the top edges with a fork. Lightly brush the tops of the empanadas with the egg mixture. Bake until golden brown, about 30 minutes. Makes about 24 empanadas.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Small Plates,",
        "by Brigit L. Binns (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "6 oz. lean ground beef",
        "3 Tbs. coarsely chopped pine nuts",
        "1/2 yellow onion, finely chopped",
        "1 Tbs. tomato paste",
        "1/4 cup red wine",
        "3 Tbs. currants",
        "1/4 tsp. salt, plus more, to taste",
        "1/4 tsp. freshly ground pepper, plus more, to taste",
        "1/2 tsp. ground cumin, plus more, to taste",
        "1/4 tsp. dried oregano, plus more, to taste",
        "1 disk savory tart dough",
        "1 egg, whisked with 1 Tbs. water"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Easy Beef Empanadas",
    "url": "http://www.williams-sonoma.com/recipe/beef-empanadas-fmf.html"
}
