{
    "directions": [
        "Preheat oven to 325°F. Sauté bacon in heavy large Dutch oven over high heat until brown and crisp, about 8 minutes. Using slotted spoon, transfer bacon to paper towels. Season beef generously with salt and pepper; coat with 1/3 cup flour, using all of flour. Working in 3 batches, brown beef in same pot over high heat, about 5 minutes per batch. Transfer meat to large bowl. Add onions and carrots to same pot and sauté until light brown, about 6 minutes. Add garlic and sauté 1 minute. Transfer vegetables to bowl with beef.",
        "Add 1 cup broth and Cognac to pot; boil until reduced to glaze, scraping up browned bits, about 8 minutes. Return meat and vegetables and their juices to pot. Add wine, mushrooms, thyme, sugar, tomato paste and 2 cups broth. Bring to boil, stirring occasionally. Cover pot and place in oven. Cook until beef is tender, about 1 hour 20 minutes.",
        "Ladle liquid from stew into large saucepan. Spoon off fat. Boil liquid until reduced to 2 3/4 cups, about 40 minutes. Season with salt and pepper. Pour liquid back over beef and vegetables. (Can be prepared 1 day ahead. Cover and chill.) Rewarm over low heat before serving."
    ],
    "ingredients": [
        "8 ounces bacon, coarsely chopped",
        "3 pounds well-trimmed boneless beef chuck, cut into 1 1/2-inch cubes (from 7-bone chuck roast)",
        "1/3 cup all purpose flour",
        "1 1/4 pounds boiling onions, peeled",
        "3/4 pound large carrots, cut into 1-inch pieces",
        "12 large garlic cloves, peeled (left whole)",
        "3 cups canned beef broth",
        "1/2 cup Cognac or brandy",
        "2 750-ml bottles red Burgundy wine",
        "1 1/4 pounds mushrooms",
        "1/3 cup chopped fresh thyme or 2 tablespoons dried",
        "1 tablespoon dark brown sugar",
        "1 tablespoon tomato paste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Garlic",
        "Mushroom",
        "Onion",
        "Sauté",
        "Bacon",
        "Carrot",
        "Winter"
    ],
    "title": "Beef Bourguignon",
    "url": "http://www.epicurious.com/recipes/food/views/beef-bourguignon-1794"
}
