{
    "directions": [
        "Preheat oven's broiler and set the oven rack about 6 inches from the heat source.",
        "Place beef tenderloin filets in a broiler pan and broil until slightly browned but still very rare, about 2 minutes per side. Remove the filets and set aside to rest; reduce heat to 375 degrees F (190 degrees C).",
        "Heat olive oil in a skillet over medium heat and cook and stir shallot and garlic until the shallot is translucent, about 5 minutes.",
        "Pour in Pinot Noir, bring to a boil, and cook until sauce is reduced by half, about 10 minutes, stirring often. Stir in garlic salt and Italian seasoning. Reduce heat to low.",
        "Slowly stir cream cheese into the sauce until you get a creamy purple sauce. Remove the sauce from the heat.",
        "Place puff pastry sheets on a work surface and cut each sheet in half crosswise.",
        "Spoon a generous amount of sauce onto a puff pastry sheet half, and center a tenderloin filet onto the sauce.",
        "Fold the puff pastry sheet over the steak and sauce, and press the edges all the way around to seal. Repeat with remaining steaks. Place the pastry-covered steaks onto a baking sheet.",
        "Whisk the egg white and water in a bowl and brush the mixture over the tops of the pastry.",
        "Bake in the oven until the pastry is browned and puffed and the steaks are the desired degree of doneness, about 25 minutes. An instant-read meat thermometer inserted into the center of the meat should read at least 145 degrees F (65 degrees C)."
    ],
    "ingredients": [
        "4 (4 ounce) beef tenderloin filets",
        "2 tablespoons olive oil",
        "1 shallot, minced",
        "1 teaspoon minced garlic, or to taste",
        "1 cup Pinot Noir (or other semi-dry red wine)",
        "1 pinch garlic salt, or to taste",
        "1 pinch Italian seasoning, or to taste",
        "1 (8 ounce) package cream cheese, softened",
        "2 sheets frozen puff pastry, thawed",
        "1 egg white (optional)",
        "1/4 cup water (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Beef Vino Puff",
    "url": "http://allrecipes.com/recipe/219985/beef-vino-puff/"
}
