{
    "directions": [
        "To make the bordelaise sauce, in a 3-quart saucepan over medium heat, melt the butter. Add the shallots and sauté, stirring occasionally, until tender and lightly golden, 6 to 8 minutes. Add the pepper, bay leaf and thyme and stir to mix. Add the wine, bring to a boil and cook, stirring occasionally, until the liquid is reduced to 1/2 cup, 15 to 20 minutes. Add the stock and bring to a simmer, skimming off any excess fat, and cook for 15 minutes. Strain the sauce through a fine-mesh sieve into a clean saucepan and keep warm over very low heat.",
        "In a 10-inch fry pan over medium-high heat, melt 1 Tbs. of the butter. Season the filets with salt and pepper. When the butter is hot, add the filets and sear until golden underneath, about 2 minutes. Using a pair of tongs, turn the filets, and add the carrot, shallots, the 1/8 tsp. pepper, the thyme and bay leaf. Cover and cook for 3 minutes for medium-rare, or until done to your liking. Transfer the filets to warmed individual plates.",
        "Continue cooking the vegetables, uncovered, until just tender, 1 minute more. Add the sauce, bring to a boil and stir in the remaining 2 Tbs. butter. Cook, stirring occasionally, until the sauce thickens, 7 to 10 minutes. Remove the thyme sprig and bay leaf and discard. Stir in the parsley. Spoon the sauce and vegetables around the filets and serve immediately."
    ],
    "ingredients": [
        "1 1/2 Tbs. unsalted butter",
        "2 shallots, chopped",
        "1 Tbs. freshly cracked pepper",
        "1 bay leaf",
        "6 to 8 fresh thyme sprigs",
        "1 bottle (375ml) Cabernet Sauvignon (about 1 1/3 cups)",
        "2 cups unsalted veal or beef stock",
        "3 Tbs. unsalted butter",
        "2 beef filets (preferably prime), each 6 oz., well   trimmed",
        "Salt, to taste",
        "Freshly cracked pepper, to taste, plus 1/8 tsp.",
        "1 carrot, cut into 1/4-inch dice (about 1 cup)",
        "2 shallots, cut into 1/4-inch dice (about 1 cup)",
        "1 fresh thyme sprig",
        "1 bay leaf",
        "1 Tbs. chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Tenderloin with Bordelaise Sauce, Caramelized Carrots and Shallots",
    "url": "http://www.williams-sonoma.com/recipe/beef-tenderloin-with-bordelaise-sauce-caramelized-carrots-and-sh.html"
}
