{
    "directions": [
        "Preheat an oven to 325°F.",
        "Season the brisket on all sides with salt and pepper. In a Dutch oven or a large, wide ovenproof pan with a tight-fitting lid, warm the olive oil over medium-high heat. Add the brisket and brown well on both sides, about 6 minutes total. Transfer to a plate. Add the onion and carrot to the pan and sauté until golden, about 5 minutes. Add the garlic and sauté until softened, about 1 minute. Add the tomatoes and juices, 1 cup of the wine and the bay leaf. Mix well and bring to a boil. Return the brisket to the pan, cover and place in the oven.",
        "Cook, basting occasionally with the pan juices, until the brisket is fork tender, about 3 hours. Remove from the oven and let cool in the juices. Carefully lift the brisket from the juices and transfer it to a deep platter. Cover with aluminum foil and refrigerate until cold, at least 2 hours or up to overnight. Let the pan juices cool, then pass through a food mill or press through a sieve into a bowl. Discard the solids and refrigerate the juices until ready to use.",
        "Just before serving, preheat the oven to 350°F.",
        "Cut the brisket across the grain into thin slices. Arrange the slices, slightly overlapping, on an ovenproof serving platter. Cover with aluminum foil and place in the oven for 15 minutes to heat through.",
        "Meanwhile, cook the onions: In a large fry pan over medium-low heat, warm the olive oil. Add the onions and sauté, stirring often, until golden brown, about 20 minutes. Season with salt and pepper. While the onions are cooking, pour the remaining 1 cup wine into a saucepan over high heat. Add 1/4 cup of the dried cherries and bring to a boil. Boil until reduced by half, about 5 minutes. Stir in the pureed brisket juices and return to a boil. Season with salt and pepper.",
        "To serve, remove the brisket from the oven. Pour the sauce evenly over the top. Top with the caramelized onions and the remaining 1/4 cup dried cherries. Serve immediately."
    ],
    "ingredients": [
        "1 first or flat-cut brisket, 4 to 5 lb.",
        "Salt and freshly ground pepper, to taste",
        "2 Tbs. olive oil",
        "1 1/2 cups chopped yellow onion",
        "1/2 cup diced carrot",
        "2 garlic cloves, finely chopped",
        "1 can (28 oz.) plum tomatoes, with juices",
        "2 cups Merlot or other full-bodied red wine",
        "1 bay leaf",
        "2 Tbs. olive oil",
        "3 cups thinly sliced sweet onions such as Vidalia",
        "Salt and freshly ground pepper, to taste",
        "1/2 cup pitted dried cherries"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Brisket with Caramelized Onions and Merlot Sauce",
    "url": "http://www.williams-sonoma.com/recipe/beef-brisket-with-caramelized-onions-and-merlot-sauce.html"
}
