{
    "directions": [
        "Melt butter in heavy large saucepan over medium heat. Add onion; cover and cook until soft and translucent, stirring occasionally, about 7 minutes. Add potato cubes and cayenne pepper; sprinkle with coarse salt and pepper. Add 1 1/2 cups chicken broth; bring to boil. Reduce heat to medium and simmer until potatoes are almost tender, adding more chicken broth by tablespoonfuls if dry (mixture should be creamy with some sauce, not dry), about 8 minutes. Add cream and simmer until potatoes are tender but still hold their shape, stirring often, about 10 minutes. Stir in cheese and chives. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Rewarm over medium heat, stirring often.",
        "Sprinkle steaks with coarse salt and pepper, then chopped thyme. Heat 1 tablespoon olive oil in heavy large skillet over medium-high heat. Add steaks and cook to desired doneness, adding more oil as needed, 3 to 4 minutes per side for medium-rare.",
        "Divide potato risotto among plates. Place steaks on plates and serve."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "1 cup finely chopped onion",
        "1 pound Yukon Gold potatoes, peeled, cut into 1/8-inch-thick slices, then 1/8-inch cubes",
        "1/8 teaspoon cayenne pepper",
        "Coarse kosher salt",
        "1 1/2 cups (or more) low-salt chicken broth",
        "1/2 cup heavy whipping cream",
        "1/4 cup finely grated Parmesan cheese",
        "1/4 cup finely chopped fresh chives",
        "6 6-ounce beef tenderloin steaks (each 3/4 to 1 inch thick)",
        "1 1/2 tablespoons chopped fresh thyme",
        "1 tablespoon (or more) olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Potato",
        "Vegetable",
        "Sauté",
        "Dinner",
        "Meat",
        "Beef Tenderloin",
        "Root Vegetable",
        "Fall",
        "Winter",
        "Simmer",
        "Advance Prep Required",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Beef Tenderloin Medallions with Potato \"Risotto\"",
    "url": "http://www.epicurious.com/recipes/food/views/beef-tenderloin-medallions-with-potato-risotto-357259"
}
