{
    "directions": [
        "Melt 1 1/2 tablespoons butter in a small heavy saucepan over moderate heat and whisk in flour, then cook roux, whisking constantly, 2 minutes. Add broth in a slow stream, whisking constantly, and bring to a boil. Reduce heat and simmer, whisking occasionally, 3 minutes. Remove from heat and keep warm.",
        "Pat beef dry and season well with salt and pepper. Heat 1 tablespoon butter with 1 tablespoon oil in a 12-inch heavy skillet over moderately high heat until foam subsides. Sauté beef in two batches, turning once, until browned on both sides but still pink inside, about 1 minute. Transfer to a plate with a slotted spoon.",
        "Heat remaining tablespoon butter with remaining tablespoon oil in same skillet over moderately high heat until hot but not smoking, then sauté shallot, stirring occasionally, until golden brown, about 3 minutes. Add mushrooms and sauté, stirring occasionally, until liquid mushrooms give off is evaporated and mushrooms are browned, about 8 to 10 minutes. Return meat with its juices to skillet and stir to combine, then transfer to a platter.",
        "Reheat sauce over low heat (do not let boil), then whisk in sour cream, mustard, dill, salt, and pepper. Pour sauce over beef and serve immediately."
    ],
    "ingredients": [
        "3 1/2 tablespoons unsalted butter",
        "1 tablespoon all-purpose flour",
        "1 cup beef broth",
        "1 (1-lb) piece beef tenderloin, trimmed, sliced 1/4 inch thick, then cut into 1-inch pieces",
        "2 tablespoons olive oil",
        "1/2 cup thinly sliced shallot",
        "3/4 lb cremini mushrooms, trimmed and halved (quartered if large)",
        "3 tablespoons sour cream at room temperature",
        "1 teaspoon Dijon mustard",
        "2 tablespoons chopped fresh dill",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "Accompaniment: buttered wide egg noodles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Pasta",
        "Sauté",
        "Quick & Easy",
        "Winter",
        "Sour Cream",
        "Shallot",
        "Gourmet"
    ],
    "title": "Beef Stroganov",
    "url": "http://www.epicurious.com/recipes/food/views/beef-stroganov-105587"
}
