{
    "directions": [
        "Finely chop sun-dried tomatoes in processor. Blend in mayonnaise and mustard. Transfer to small bowl. (Can be made 1 day ahead. Cover; chill.)",
        "Finely chop andouille sausages in processor. Transfer to large bowl. Add beef, shallots, salt, pepper, and crushed fennel seeds. Stir with fork just until blended. Form mixture into six 1-inch-thick patties.",
        "Prepare barbecue (medium-high heat). Grill hamburger buns until golden, about 2 minutes. Transfer to platter. Brush onion slices with oil. Sprinkle with salt and pepper. Grill until golden, about 7 minutes per side. Grill hamburgers to desired doneness, about 5 minutes per side for medium-rare. Sprinkle cheese over top of burgers.",
        "Spread cut sides of hamburger buns with sun-dried-tomato mayonnaise. Top bottom halves of buns with hamburgers, then red peppers. Top with onion slices. Cover with top halves of buns and serve.",
        "*Smoked pork-and-beef sausages, sold at specialty foods stores and supermarkets. Kielbasa can be substituted."
    ],
    "ingredients": [
        "4 oil-packed sun-dried tomatoes, drained",
        "1/2 cup mayonnaise",
        "1 tablespoon whole-grain Dijon mustard",
        "8 ounces andouille sausages,* cut into 1-inch pieces",
        "2 1/2 pounds ground beef (15% fat)",
        "2 large shallots, minced",
        "2 teaspoons salt",
        "2 teaspoons ground black pepper",
        "1 teaspoon fennel seeds, crushed",
        "6 large sesame-seed hamburger buns",
        "6 1/3-inch-thick slices red onion",
        "Olive oil",
        "1 cup coarsely grated Asiago cheese**",
        "1 7- to 7 1/2-ounce jar roasted red peppers, drained"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Cheese",
        "Onion",
        "Pepper",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Beef and Andouille Burgers with Asiago Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/beef-and-andouille-burgers-with-asiago-cheese-105297"
}
