{
    "directions": [
        "To make the filling, in a fry pan over medium heat, melt the butter. Add the onion, carrot and celery and sauté until golden, 10 to 15 minutes. Add the beef, salt and pepper. Cook, stirring and breaking up the meat with a wooden spoon, until the meat is no longer red and its juices have evaporated, about 10 minutes. Add the wine, bring to a simmer and cook until the wine evaporates, about 2 minutes. Remove from the heat and let cool slightly.",
        "Scrape the beef mixture into a food processor and pulse until chopped. Add the eggs, the 1/2 cup cheese and the bread crumbs and pulse just until blended. Scrape the mixture into a bowl, cover and chill for at least 1 hour or up to overnight.",
        "Lightly flour a rimmed baking sheet.",
        "Make the pasta dough, then divide and roll out each piece into a sheet 1/16 inch thick. Cut each pasta sheet into strips 4 inches wide. Layer the strips on the prepared baking sheet, spacing them so they don’t touch and separating each layer with a lightly floured kitchen towel. Fill and cut the ravioli as directed in Making Ravioli (see related tip).",
        "You can cook the ravioli immediately, or cover with a kitchen towel and refrigerate until ready to cook. They will keep for up to 3 hours; turn them several times during that time so that they do not stick.",
        "To make the sauce, in a fry pan over medium-low heat, warm the olive oil. Add the garlic and cook, stirring frequently, until golden, about 1 minute. Add the tomatoes, raise the heat to medium and bring to a simmer, stirring occasionally. Reduce the heat to low, season with salt and pepper, add the basil leaves and simmer until the tomatoes thicken into a light sauce, about 7 minutes. Keep warm.",
        "Meanwhile, bring a large pot three-fourths full of water to a rolling boil. Add the 2 Tbs. salt, then add the ravioli and stir gently. Cook, stirring occasionally and adjusting the heat so the water simmers gently, until the ravioli rise to the surface and are al dente, 3 to 4 minutes.",
        "Using a large slotted spoon, divide the ravioli among warmed plates. Spoon the sauce over them, dividing it evenly, and serve immediately. Pass grated cheese at the table. Serves 6.",
        "Adapted from Williams-Sonoma",
        "Essentials of Italian",
        "by Michele Scicolone (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "2 Tbs. unsalted butter",
        "1 small yellow onion, chopped",
        "1/2 cup finely chopped carrot",
        "1/2 cup finely chopped celery",
        "3/4 lb. ground beef sirloin",
        "3/4 tsp. sea salt",
        "1/4 tsp. freshly ground pepper",
        "1/2 cup dry red wine",
        "2 eggs, beaten",
        "1/2 cup grated Parmigiano-Reggiano cheese, plus more for serving",
        "1/4 cup fine dried bread crumbs",
        "1 lb. fresh egg pasta dough",
        "2 Tbs. salt",
        "1/4 cup olive oil",
        "4 garlic cloves, minced",
        "1 1/2 lb. plum tomatoes, peeled, seeded and chopped",
        "Sea salt and freshly ground pepper, to taste",
        "Handful of fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Ravioli with Fresh Tomato Sauce",
    "url": "http://www.williams-sonoma.com/recipe/beef-ravioli-with-fresh-tomato-sauce.html"
}
