{
    "directions": [
        "Place flour in large bowl. Season with salt and pepper. Add beef to flour and toss to coat. Melt 2 tablespoons butter in heavy Dutch oven over high heat. Working in batches, add beef to pot and sauté until brown on all sides, about 5 minutes per batch. Return all meat to pot. Add brandy; boil until almost evaporated, about 2 minutes. Add wine, broth, thyme, garlic, bay leaves and oregano. Cover; simmer until beef is almost tender, about 1 hour.",
        "Meanwhile, melt 1 tablespoon butter in large nonstick skillet over medium-high heat. Add onion; sauté until brown, about 6 minutes. Using slotted spoon, transfer to large bowl Melt 1 tablespoon butter in same skillet. Add carrots and celery; sauté until golden, about 6 minutes. Using slotted spoon transfer to bowl with onions. Melt 2 tablespoons butter in same skillet. Add potatoes; sauté until brown on all sides, about 5 minutes. Using slotted spoon, transfer to bowl with other vegetables. Melt 1 tablespoon butter in same skillet. Add mushrooms; sauté until brown on all sides, about 5 minutes. Using slotted spoon, transfer to bowl.",
        "Add vegetables to pot with beef. Add nutmeg. Cover pot; simmer 45 minutes. Uncover pot and boil liquid until thickened to sauce consistency, about 7 minutes. Season with salt and pepper."
    ],
    "ingredients": [
        "1/4 cup all purpose flour",
        "2 pounds 1 1/2-inch pieces beef stew meat",
        "7 tablespoons butter",
        "1/4 cup brandy",
        "2 cups Burgundy or other dry red wine",
        "2 cups canned beef broth",
        "6 fresh thyme sprigs",
        "4 large garlic cloves, chopped",
        "3 bay leaves",
        "1/2 teaspoon dried oregano",
        "1 large onion, cut into 12 wedges",
        "4 carrots, peeled, cut into 2-inch lengths",
        "4 celery stalks, cut into 2-inch lengths",
        "1 1/2 pounds red-skinned potatoes, peeled, quartered",
        "1/2 pound mushrooms",
        "Generous pinch of ground nutmeg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Mushroom",
        "Potato",
        "Bastille Day",
        "Red Wine",
        "Winter",
        "California"
    ],
    "title": "Beef Bourguignon",
    "url": "http://www.epicurious.com/recipes/food/views/beef-bourguignon-1196"
}
