{
    "directions": [
        "In a heavy skillet (preferably cast-iron) heat oil over moderately high heat until hot but not smoking. Pat shanks and short ribs dry and season with salt and pepper. Brown shanks and short ribs in oill in batches, without crowding, transferring to a 9 1/2-to-10 quart heavy kettle. In fat remaining in skillet cook onions and bell peppers over moderate heat, stirring occasionally, until vegetables are softened.",
        "To beef in kettle add water, beef broth, and onion mixture and bring to a boil, stirring occasionally. Simmer mixture, uncovered, until shanks are very tender, about 2 1/2 hours, and stir in garlic and cayenne. With a narrow knife ease any marrow remaining in shank bones into mixture and discard shank and short rib bones. Beef mixture may be prepared up to this point 3 days ahead, cooled completely, uncovered, and chilled, covered.",
        "Skim fat from beef mixture. Reheat mixture if preciously chilled. Bring beef mixture to a bare simmer and stir in filé powder. Cook gumbo over moderately low heat , stirring occasionally, 5 minutes. (Do not let gumbo boil with filé powder; or will become stringy.)",
        "Serve gumbo ladled over rice in large soup plates."
    ],
    "ingredients": [
        "2 tablespoon vegetable oil",
        "6 pounds cross-cut sections beef shanks",
        "2 1/2 pounds beef short ribs (sometimes called flanken), cut into 1-rib pieces if necessary",
        "2 large onions, chopped",
        "3 large red bell peppers, chopped",
        "12 cups water",
        "4 cups beef broth",
        "6 garlic cloves, minces",
        "cayenne to taste",
        "3 tablespoons filé powder",
        "Accompaniment: Cajun-style White Rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Onion",
        "Bell Pepper",
        "Winter",
        "Simmer",
        "Boil",
        "Gourmet"
    ],
    "title": "Beef Filé Gumbo",
    "url": "http://www.epicurious.com/recipes/food/views/beef-file-gumbo-14278"
}
