{
    "directions": [
        "In a 9-quart kettle combine water, soy sauce, Scotch, sugar, gingerroot, scallions, cinnamon, zest, and star anise and simmer mixture 10 minutes. Add beef shanks and cook, partially covered with lid 1/2 inch ajar, at a bare simmer 2 hours, or until meat is very tender.",
        "About 15 minutes before meat is done, in a large bowl soak noodles in warm water to cover 5 minutes and bring a large saucepan of salted water to a boil. Drain noodles in a colander and boil them 5 minutes. In colander drain noodles and rinse under cold water. Drain noodles well and transfer to large bowl.",
        "Transfer meat with a slotted spoon to cutting board. With slotted spoon remove gingerroot, scallions, cinnamon sticks, zest, and star anise from broth and discard. Add carrots and turnips to broth and simmer until just tender, about 5 minutes. Transfer vegetables with slotted spoon to noodles. Boil broth until reduced to about 7 cups. While broth is reducing, discard bones and gristle and cut meat across grain into thin slices.",
        "Divide noodles, vegetables, and meat among 8 bowls and ladle broth over them. Sprinkle mixture with coriander."
    ],
    "ingredients": [
        "8 cups water",
        "1 cup soy sauce",
        "1/3 cup Scotch",
        "1/3 cup sugar",
        "6 slices fresh gingerroot, each about the size of a quarter, flattened with flat side of a heavy knife",
        "4 scallions, flattened with flat side of a heavy knife",
        "two 3-inch cinnamon sticks",
        "two 4-inch strips fresh orange zest, removed with a vegetable peeler",
        "2 tablespoons star anise*, crushed lightly with flat side of a heavy knife",
        "4 meaty cross-cut sections beef shanks (about 4 1/4 pounds total)",
        "a 7- to 8-ounce package dried rice-stick noodles",
        "(rice vermicelli)*",
        "3/4 pound carrots, cut diagonally into 1/4-inch slices",
        "3/4 pound turnips, peeled, halved, and cut into 1/4-inch slices",
        "Garnish: fresh coriander leaves",
        "*available at Asian markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Scotch",
        "Beef",
        "Pasta",
        "Braise",
        "Carrot",
        "Turnip",
        "Winter",
        "Anise",
        "Cinnamon",
        "Gourmet"
    ],
    "title": "Beef Shanks Braised in Soy Sauce with Cinnamon and Star Anise",
    "url": "http://www.epicurious.com/recipes/food/views/beef-shanks-braised-in-soy-sauce-with-cinnamon-and-star-anise-11387"
}
