{
    "directions": [
        "Position rack in center of oven; preheat to 325°F. Pat beef dry. Sprinkle with salt and pepper. Heat oil in heavy large ovenproof pot over medium-high heat. Working in batches, cook beef until brown, stirring occasionally and scraping up browned bits, about 8 minutes. Transfer meat to bowl.",
        "Add bacon to same pot. Sauté until crisp, scraping up browned bits, about 5 minutes. Add onions, garlic, thyme and bay leaf. Cover and cook until onions are tender, stirring occasionally, about 10 minutes. Return beef and any accumulated juices to pot. Add 5 cups canned beef broth and crushed tomatoes with purée. Cover and bring to simmer.",
        "Transfer pot to oven. Bake until beef is just tender, stirring occasionally, about 1 hour. Add carrots and rutabagas. Cover; bake until vegetables are crisp-tender, about 30 minutes. Uncover; bake until beef is very tender, about 25 minutes.",
        "Whisk milk and eggs in medium bowl to blend. Stir in chives and parsley. Let stand at room temperature 30 minutes. Sift flour, baking powder and salt into large bowl. Add milk mixture. Stir just until blended.",
        "Whisk remaining 1/2 cup canned beef broth and cornstarch in small bowl to blend. Bring stew to simmer over medium heat. Gradually stir cornstarch mixture into stew. Return stew to simmer, stirring until sauce thickens.",
        "Spoon dumpling batter in 12 dollops atop simmering stew. Cover tightly; simmer until dumplings are puffed and tester inserted into center of dumplings comes out clean, about 15 minutes.",
        "Serve stew with dumplings."
    ],
    "ingredients": [
        "4 pounds boneless beef chuck, cut into 1-inch cubes",
        "2 tablespoons peanut oil",
        "4 thick-sliced bacon strips, chopped",
        "3 cups finely chopped onions",
        "3 garlic cloves, finely chopped",
        "1 teaspoon dried thyme",
        "1 bay leaf",
        "5 1/2 cups canned beef broth",
        "1 14 1/2-ounce can crushed tomatoes with added purée",
        "6 medium carrots, peeled, cut diagonally into 1-inch pieces",
        "3 medium rutabagas, peeled, cut into 3/4-inch pieces",
        "2/3 cup whole milk",
        "2 large eggs",
        "3 tablespoons minced chives",
        "2 tablespoons minced fresh Italian parsley",
        "1 1/2 cups unbleached all purpose flour",
        "4 teaspoons baking powder",
        "§ teaspoon salt",
        "3 tablespoons cornstarch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Herb",
        "Tomato",
        "Braise",
        "Dinner",
        "Bacon",
        "Carrot",
        "Winter",
        "Rutabaga"
    ],
    "title": "Beef Stew with Herbed Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/beef-stew-with-herbed-dumplings-100984"
}
