{
    "directions": [
        "Place the shanks in a saucepan and add water to cover generously. Bring to a boil over high heat, skimming often to remove any foam that forms on the surface. Add about two-thirds of the chopped onions, the carrots and celery, reduce the heat to low and cook, uncovered, for about 1 hour. Add the tomato puree and barley, cover partially and continue to cook over low heat until the barley is tender, about 1 hour more.",
        "While the soup is cooking, in a large sauté pan over medium heat, melt the butter. Add the remaining chopped onions and sauté, stirring occasionally, until pale gold, 10 to 12 minutes. Raise the heat to high, add the mushrooms and sauté, stirring often, until softened, 6 to 8 minutes. Add the garlic, reduce the heat to medium and sauté until soft but not brown, about 3 minutes more. Season with salt, pepper and 2 Tbs. of the dill.",
        "Remove the shanks from the pan and, when cool enough to handle, cut the meat from the bone. Chop and reserve the meat; you should have about 1 1/3 cups.",
        "Add the mushroom mixture and the reserved meat to the pan and stir to heat through. Season with salt and pepper.",
        "Ladle into warmed bowls and sprinkle with the remaining 2 Tbs. dill and the parsley. Top each serving with a dollop of sour cream, if using."
    ],
    "ingredients": [
        "3 lb. meaty beef or veal shanks",
        "3 large yellow onions, chopped",
        "6 carrots, peeled and chopped",
        "4 celery stalks, chopped",
        "1 cup tomato puree",
        "1 cup barley",
        "6 Tbs. (3/4 stick) unsalted butter",
        "1 lb. fresh cremini mushrooms, brushed clean and sliced",
        "1/2 tsp. minced garlic",
        "Salt and freshly ground pepper, to taste",
        "4 Tbs. chopped fresh dill",
        "1/4 cup chopped fresh flat-leaf parsley",
        "6 Tbs. sour cream (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Barley Soup",
    "url": "http://www.williams-sonoma.com/recipe/beef-barley-soup.html"
}
