{
    "directions": [
        "Make 2 crêpes (procedure follows) with the herbed crêpe batter and cut them into julienne strips. In a baking pan spread the shanks, the onions, and the carrot, brown the mixture well in a preheated 450°F. oven, and transfer it to a kettle. Add 2 cups water to the baking pan, deglaze the pan over moderately high heat, scraping up the brown bits, and add the liquid to the kettle with 3 1/2 quarts cold water, the celery, the salt, and the cheesecloth bag. Bring the water to a boil, skimming the froth, and simmer the mixture, adding boiling water if necessary to keep the ingredients barely covered, for 3 hours. Add the chicken and enough water to cover the mixture and simmer the mixture, skimming it, for 2 to 3 hours, or until it is reduced to about 2 quarts. Remove the chicken and reserve it for another use. Strain the stock through a fine sieve into a bowl, pressing hard on the solids, and let it cool. Chill the stock, remove the fat,and clarify the stock.",
        "In a kettle combine the stock, the shells, the egg whites, the scallions, and, if necessary, salt and pepper to taste. Bring the liquid to a boil, stirring, simmer the stock, undisturbed, for 20 minutes, and ladle it through a fine sieve lined with a double thickness of rinsed and squeezed cheesecloth into a bowl. Makes about 6 cups clarified stock.",
        "In a large saucepan heat the consommé over moderately low heat until it is hot and serve it garnished with the chives and the julienne herbed crêpes.",
        "In a blender or food processor blend the flour, the broth, the eggs, the butter, and the salt for 5 seconds. Turn off the motor, with a rubber spatula scrape down the sides of the container, and blend the batter for 20 seconds more. Transfer the batter to a bowl, stir in the herbs, and let the batter stand, covered, for 1 hour. The batter may be made 1 day in advance and kept covered and chilled. Makes enough batter for about 16 crêpes.",
        "Heat a crêpe pan or non-stick skillet measuring 6 to 7 inches across the bottom over moderate heat until it is hot. Brush the pan lightly with the butter, heat it until it is hot but not smoking, and remove it from the heat. Stir the batter, half fill a 1/4-cup measure with it, and pour the batter into the pan. Tilt and rotate the pan quickly to cover the bottom with a layer of batter and return any excess batter to bowl. Return the pan to the heat, loosen the edge of the crêpe with a spatula, and cook the crêpe for 1 minute, or until the top appears almost dry. Turn the crêpe, cook the other side lightly, and transfer the crêpe to a plate. Make crêpe with the remaining batter in the same manner, brushing the pan lightly with butter as necessary. The crêpes may be made 3 days in advance, kept stacked, wrapped in plastic wrap, and chilled."
    ],
    "ingredients": [
        "4 pounds meaty shanks, sawed into 1-inch pieces",
        "2 onions, chopped coarse",
        "1 carrot, chopped coarse",
        "2 ribs of celery, chopped coarse",
        "1 1/2 teaspoons salt",
        "a cheesecloth bag containing 4 parsley sprigs, 1 bay leaf, and a pinch of dried thyme",
        "a 7-pound chicken, halved lengthwise and the giblets (excluding the liver) chopped",
        "10 chives, cut into 2-inch pieces, for garnish",
        "8 cups cool liquid stock, fat removed",
        "the crushed shells of 4 large eggs",
        "4 large egg whites, beaten lightly",
        "4 scallions, chopped",
        "1 cup all-purpose flour",
        "1 cup plus 2 tablespoons chicken or beef broth",
        "3 large eggs",
        "2 tablespoons unsalted butter, melted and cooled",
        "1/2 tablespoons salt",
        "1/3 cup minced fresh parsley leaves or a mixture of other minced fresh herbs, such as chives, coriander, or tarragon",
        "melted unsalted butter for brushing the pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Food Processor",
        "Beef",
        "Chicken",
        "Herb",
        "Vegetable",
        "Gourmet"
    ],
    "title": "Beef Consommé with Herbed Crepes Julienne",
    "url": "http://www.epicurious.com/recipes/food/views/beef-consomme-with-herbed-crepes-julienne-11764"
}
