{
    "directions": [
        "Brown the beef",
        "In a sealable plastic bag, combine the flour, salt and pepper. Add the beef chunks and shake to coat evenly with the flour mixture; reserve the excess flour mixture. In a large fry pan over medium-high heat, warm 4 Tbs. of the oil. Add half of the beef chunks and cook, turning as needed, until evenly browned on all sides, 10 to 12 minutes. Transfer to paper towels to drain briefly, then transfer to the slow cooker. Repeat with the remaining beef chunks, adding the remaining 2 Tbs. oil if needed. Sprinkle the oregano over the meat.",
        "Sauté the vegetables",
        "Return the pan to medium-high heat. Add the garlic and all but about 1/2 cup of the onions and sauté until fragrant, about 1 minute. Sprinkle with the reserved flour mixture and sauté for about 1 minute more. Pour in the broth and add the chipotle chilies with their sauce, breaking up the chilies coarsely with your fingers. Raise the heat to high, bring to a boil and deglaze the pan, stirring to scrape up the browned bits on the pan bottom. Pour over the beef.",
        "Cook the chili",
        "Cover and cook on the high-heat setting for 3 to 4 hours or the low-heat setting for 6 to 8 hours. The beef should be very tender. Spoon the chili into bowls, sprinkle with the remaining 1/2 cup onion and serve. Serves 6 to 8.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Slow Cooker,",
        "by Norman Kolpas (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "1/4 cup flour",
        "1 tsp. salt",
        "1/2 tsp. freshly ground pepper",
        "3 lb. boneless beef chuck, trimmed of excess fat and cut into chunks",
        "4 to 6 Tbs. olive oil",
        "1 1/2 tsp. dried oregano",
        "4 garlic cloves, minced",
        "2 red onions, finely chopped",
        "2 cups beef broth",
        "1 can (7 oz.) chipotle chilies in adobo sauce"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef-Chipotle Chili",
    "url": "http://www.williams-sonoma.com/recipe/beef-chipotle-chili.html"
}
