{
    "directions": [
        "Heat a large skillet over medium heat for 3 to 4 minutes. Raise the heat to high and heat 1 tablespoon oil. Season the beef with salt and pepper. Add the beef to the skillet, arranging it in a single layer, and saute, without stirring, until well browned and still pinkish inside, 1 to 2 minutes. (It is key to only partially cook the meat at this stage, since it will finish cooking later in the sauce.) Transfer to a large plate and set aside. Discard any excess oil.",
        "Return the skillet to medium-high heat. Add 1 tablespoon of the oil and heat. Add the mushrooms and cook, stirring occasionally, until well browned, about 7 minutes. Season with salt and pepper. Using a slotted spoon, transfer to the plate with the beef.",
        "Heat another tablespoon of oil. Add the onions, carrots and parsnips and cook, stirring, until lightly caramelized, about 5 minutes. Add the tomato paste and cook, stirring, until lightly browned, about 1 minute more. Whisk in the flour and cook, stirring, for 1 minute. Pour in the beef broth and, whisking constantly, bring to a full boil. Reduce the heat, add the greens and simmer until the greens and veggies are crisp-tender, 5 to 10 minutes. Remove from the heat.",
        "Whisk in the sour cream, mustard and lemon juice and season with pepper to taste. Add the beef and any juices, mushrooms and parsley to the sauce and reheat over medium heat just until hot. (Do not boil.)",
        "Toss the barley with the remaining 1 tablespoon olive oil and lots of freshly ground black pepper. Divide the cooked barley among 4 plates and top with the stroganoff. Serve immediately."
    ],
    "ingredients": [
        "4 tablespoons olive oil",
        "8 ounces beef sirloin, cut into 2-by-1-by-1/8-inch strips",
        "Kosher salt and freshly ground black pepper",
        "12 ounces button mushrooms, quartered",
        "1 medium yellow onion, thinly sliced",
        "1 large carrot, peeled and sliced into 1/4-inch-thick coins",
        "1 medium parsnip, peeled and cut into 1/2-inch chunks",
        "1 tablespoon tomato paste",
        "2 tablespoons all-purpose flour",
        "2 cups beef broth, homemade or low-sodium canned",
        "2 cups sliced hearty greens (like kale or mustard greens)",
        "1/4 cup sour cream",
        "2 teaspoons Dijon mustard",
        "2 teaspoons freshly squeezed lemon juice",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "2 cups cooked barley, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef Stroganoff",
        "Beef",
        "Meat",
        "Barley",
        "Grain Recipes",
        "Mushroom",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Beef Stroganoff",
    "url": "http://www.foodnetwork.com/recipes/beef-stroganoff"
}
