{
    "directions": [
        "Marinate the beef",
        "In a large bowl, combine the beef, 1 Tbs. of the soy sauce and the wine and mix to coat the beef evenly. Set aside for 10 minutes.",
        "Make the sauce",
        "In a small bowl, combine the water, the remaining 4 Tbs. soy sauce, the Worcestershire sauce, sesame oil, sugar, cornstarch and black pepper. Stir to dissolve the sugar and cornstarch.",
        "Stir-fry the vegetables",
        "Heat a wok or large fry pan over high heat until very hot and pour in 1 Tbs. of the corn oil. Add the onion and bell pepper and stir-fry until caramelized, about 10 minutes. Using a slotted spoon, transfer the onion mixture to a plate.",
        "Return the wok to high heat and pour in the remaining 1 Tbs. corn oil. Add the ginger and stir-fry until fragrant, about 10 seconds. Add the beef and stir-fry just until it begins to brown and is still rare in the center, about 1 minute. Return the onion mixture to the wok. Give the sauce a quick stir, add to the wok and stir until the sauce thickens slightly, about 10 seconds. Sprinkle with red pepper flakes and serve immediately with steamed rice. Serves 4.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Asian,",
        "by Farina Wong Kingsley (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "1 1/2 lb. beef tenderloin or sirloin, cut across the grain into thin strips",
        "5 Tbs. soy sauce",
        "2 Tbs. rice wine or dry sherry",
        "4 Tbs. water",
        "2 Tbs. Worcestershire sauce",
        "2 tsp. Asian sesame oil",
        "1/2 tsp. sugar",
        "1/2 tsp. cornstarch",
        "1 tsp. freshly ground black pepper",
        "2 Tbs. corn or peanut oil",
        "1 large yellow onion, thinly sliced",
        "1 orange or yellow bell pepper, seeded and sliced (optional)",
        "1 Tbs. grated fresh ginger",
        "Red pepper flakes, to taste (optional)",
        "Steamed rice for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef with Ginger and Caramelized Onions",
    "url": "http://www.williams-sonoma.com/recipe/beef-with-ginger-and-caramelized-onions.html"
}
