{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).  In 9 inch pie pan, toss shallots with oil to coat.  Season with salt and pepper.  Roast until shallots are deep brown and very tender, stirring occasionally, about 30 minutes.",
        "In a large saucepan, combine beef broth and port.  Bring to a boil.  Cook over high heat until the volume is reduced by half, about 30 minutes.  Whisk in tomato paste.  Set aside.",
        "Pat beef dry; sprinkle with thyme, salt and pepper.  In a large roasting pan, set over medium heat on the stove top, saute bacon until golden.  Using a slotted spoon, transfer bacon to paper towels.  Add beef to pan; brown on all sides over medium high heat, about 7 minutes.",
        "Transfer pan to oven.  Roast beef until meat thermometer inserted into center registers 125 degrees F (50 degrees C) for medium rare, about 25 minutes.  Transfer beef to platter.  Tent loosely with foil.",
        "Spoon fat off top of pan drippings in roasting pan.  Place pan over high heat on stove top.  Add broth mixture, and bring to boil; stir to scrape up any browned bits.  Transfer to a medium saucepan, and bring to simmer.  Mix 1 1/2 tablespoon butter and flour in small bowl to form smooth paste;  whisk into broth mixture, and simmer until sauce thickens. Whisk in remaining butter.  Stir in roasted shallots and reserved bacon.  Season with salt and pepper.",
        "Cut beef into 1/2 inch thick slices.  Spoon some sauce over, and garnish with watercress."
    ],
    "ingredients": [
        "3/4 pound shallots, halved lengthwise and peeled",
        "1 1/2 tablespoons olive oil",
        "salt and pepper to taste",
        "3 cups beef broth",
        "3/4 cup port wine",
        "1 1/2 teaspoons tomato paste",
        "2 pounds beef tenderloin roast, trimmed",
        "1 teaspoon dried thyme",
        "3 slices bacon, diced",
        "3 tablespoons butter",
        "1 tablespoon all-purpose flour",
        "4 sprigs watercress, for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Beef Tenderloin With Roasted Shallots",
    "url": "http://allrecipes.com/recipe/14606/beef-tenderloin-with-roasted-shallots/"
}
