{
    "directions": [
        "Toast cumin and coriander in skillet over medium heat until darker and beginning to smoke, about 4 minutes. Cool.",
        "Sauté beef in heavy large pot over medium-high heat until no longer pink, breaking up with spoon, about 8 minutes. Heat oil in large skillet over medium-high heat. Add onions, all bell peppers, and jalapeños. Sauté until vegetables begin to soften, about 15 minutes. Add mixture to pot with meat. Mix in toasted spices, chili powder, and chipotle chiles. Add crushed tomatoes, beans, and beer. Bring chili to boil, stirring occasionally. Reduce heat and simmer 20 minutes, stirring often. Season with salt and pepper. DO AHEAD Can be made ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep refrigerated up to 2 days (or freeze up to 1 month). Rewarm over medium-low heat.",
        "Ladle chili into bowls. Serve with sour cream, green onions, and cheese."
    ],
    "ingredients": [
        "1 1/2 tablespoons ground cumin",
        "1 tablespoon ground coriander",
        "5 pounds ground chuck",
        "2 tablespoons canola oil",
        "2 1/2 pounds onions, coarsely chopped",
        "1 1/2 pounds red bell peppers, seeded, cut into 1/2-inch pieces",
        "1 1/2 pounds yellow bell peppers, seeded, cut into 1/2-inch pieces",
        "2 large jalapeño chiles with seeds, chopped (about 1/3 cup)",
        "7 tablespoons chili powder",
        "2 teaspoons (packed) minced canned chipotle chiles in adobo sauce*",
        "2 28-ounce cans crushed tomatoes with added puree",
        "2 15-ounce cans kidney beans, drained",
        "1 12-ounce bottle dark beer (such as stout)",
        "Sour cream",
        "Chopped green onions",
        "Coarsely grated extra-sharp cheddar cheese",
        "*Available in the Latin foods section of some supermarkets and at specialty foods stores and Latin markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Beef",
        "Onion",
        "Pepper",
        "Tomato",
        "Sauté",
        "Super Bowl",
        "High Fiber",
        "Fall",
        "Winter",
        "Jalapeño"
    ],
    "title": "Beef and Dark Beer Chili",
    "url": "http://www.epicurious.com/recipes/food/views/beef-and-dark-beer-chili-237096"
}
