{
    "directions": [
        "Arrange beef in 1 layer on a plate and put in freezer 15 minutes to quick-chill (to facilitate cutting). Cut beef across grain into 1/8-inch-thick slices, to make 1-inch-wide strips.",
        "While beef chills, very thinly slice bottom 6 inches of lemongrass, then mince with a knife, discarding remainder. Finely grind lemongrass and shallots in mini food processor, scraping down side occasionally, until a fluffy paste forms.",
        "Stir together lemongrass paste, sugar, coriander, turmeric, salt, and cayenne in a bowl until combined well, then add beef strips and toss until coated well. Marinate, covered and chilled, 24 hours.",
        "Soak chiles in boiling-hot water to cover in a bowl until softened, 30 to 45 minutes. Drain in a sieve, discarding soaking liquid and stems, then mince with a knife (including seeds).",
        "While chiles soak, gently mash tamarind with hot water (1/3 cup) in a bowl using your fingertips until pulp is softened, then force with a rubber spatula through a medium-mesh sieve into a small bowl, discarding solids. Finely grind fennel seeds in grinder.",
        "Finely grind peanuts in a standard food processor, being careful not to grind to a butter, then transfer to a medium bowl. Very thinly slice bottom 6 inches of lemongrass, then mince with a knife, discarding remainder. Pulse lemongrass, onion, galangal, ginger, coriander, ground fennel, cayenne, and minced chiles in food processor, scraping down side occasionally, until finely ground.",
        "Heat oil (3 tablespoons) in a 4-quart wide heavy pot over moderate heat until hot but not smoking, then add onion mixture and reduce heat to moderately low. Cook, stirring occasionally, until onion mixture begins to stick, 5 to 6 minutes. Add coconut milk and bring just to a boil over moderate heat, stirring constantly. Add peanuts, tamarind purée, palm sugar, and salt and simmer gently, stirring constantly, 3 minutes. Purée peanut sauce with water (3/4 cup) in cleaned food processor until the consistency of chunky peanut butter, then cool to room temperature, about 30 minutes. Reserve half for another use. Thread and grill beef: Prepare grill for cooking over indirect heat with medium-hot charcoal (moderately high heat for gas), leaving half of bottom rack free of coals; see Grilling Procedure If using a gas grill, see cooks' note, below.",
        "Meanwhile, thread 2 or 3 pieces of beef lengthwise onto each skewer (discard marinade), bunching meat slightly to leave half of skewer empty (for holding skewer) and transferring as threaded to a large platter. Drizzle beef with oil (1/4 cup) and turn to coat well.",
        "To cook using a charcoal grill: Put half of satés on lightly oiled grill rack, arranging them with beef directly over coals and empty part of skewers over side with no coals underneath. Grill, turning over once, 2 minutes total for medium-rare. Grill remaining satés in same manner.",
        "To cook using a gas grill: If grill has 3 burners, do not turn off middle burner; turn off burner closest to you. Put beef over lit burners with empty part of skewers over side with turned-off burner. Grill, covered, turning over once, 2 minutes total for medium-rare. Grill remaining satés in same manner.",
        "Serve satés with peanut sauce."
    ],
    "ingredients": [
        "1 lb (1-inch-thick) piece beef rump roast, halved crosswise for easier cutting",
        "2 fresh lemongrass stalks (about 3/4 inch wide at base), 1 or 2 outer leaves discarded",
        "1/2 cup finely chopped shallots (from 2 large)",
        "1 tablespoon sugar",
        "2 teaspoons ground coriander",
        "1 teaspoon ground turmeric",
        "1 teaspoon salt",
        "1/2 teaspoon cayenne or Indian pure red-chile powder",
        "1/4 cup vegetable oil",
        "6 to 8 (2-inch-long) dried red chiles such as prik haeng",
        "1 rounded tablespoon tamarind froma pliable block",
        "1/3 cup hot water",
        "1 teaspoon fennel seeds",
        "2 cups unsalted shelled roasted peanuts (10 1/2 oz)",
        "1 fresh lemongrass stalk (about 3/4 inch wide at base), 1 or 2 outer leaves discarded",
        "1 medium onion, chopped",
        "2 teaspoons finely chopped peeled galangal (fresh or thawed frozen)",
        "2 teaspoons finely chopped peeled fresh ginger",
        "1 tablespoon ground coriander",
        "1 teaspoon cayenne or Indian pure red-chile powder",
        "3 tablespoons vegetable oil",
        "1 1/4 cups well-stirred canned unsweetened coconut milk (10 fl oz; not low-fat)",
        "2 1/2 to 3 tablespoons packed dark palm sugar or dark brown sugar",
        "3/4 teaspoon salt",
        "3/4 cup water",
        "Special equipment: a mini food processor; an electric coffee/spice grinder; 26 (10-inch) wooden skewers, soaked in warm water 30 minutes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Beef",
        "Appetizer",
        "Marinate",
        "Peanut",
        "Hot Pepper",
        "Summer",
        "Grill/Barbecue",
        "Shallot",
        "Lemongrass",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Beef Sates with Peanut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/beef-sates-with-peanut-sauce-234637"
}
