{
    "directions": [
        "Preheat an oven to 450°F. Place the shanks and marrowbone in a roasting pan. Roast, turning occasionally, until browned, about 1 1/2 hours. Transfer to a stockpot but do not clean the roasting pan. Add water to cover the bones by 4 inches and bring to a boil, skimming often. Reduce the heat to low and simmer, uncovered, for 1 to 2 hours, skimming occasionally.",
        "Meanwhile, brown the onions, carrots, celery and leek (if using) in the roasting pan over medium-high heat until caramelized, 15 to 20 minutes. Add to the stockpot. Pour the 2 cups water into the roasting pan and deglaze over medium-high heat, stirring to remove any browned bits from the pan bottom. Set aside.",
        "When the shanks have simmered for 1 to 2 hours, add the deglazed juices to the stockpot along with the tomatoes, garlic, parsley, bay leaves, thyme, peppercorns, cloves and mushroom stems, if using. Cover partially and simmer gently for at least 4 hours or for up to 8 hours.",
        "Remove from the heat. Scoop out and discard all the solids, then pour the contents of the pot through a fine-mesh sieve lined with damp cheesecloth into 1 or more storage containers. Refrigerate, uncovered, until well chilled and the fat has solidified on top. Lift off and discard the fat. Use the stock at this point or cover and refrigerate for up to 4 days or freeze for up to 3 months."
    ],
    "ingredients": [
        "6 lb. meaty beef shanks, cracked",
        "1 marrowbone, cracked",
        "2 yellow onions, chopped",
        "2 carrots, chopped",
        "1 celery stalk, chopped",
        "1 leek, chopped (optional)",
        "2 cups water",
        "2 tomatoes, halved",
        "6 garlic cloves",
        "5 fresh parsley sprigs",
        "2 small bay leaves",
        "3 fresh thyme sprigs",
        "8 peppercorns",
        "2 whole cloves",
        "Mushroom stems (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Stock",
    "url": "http://www.williams-sonoma.com/recipe/beef-stock.html"
}
