{
    "directions": [
        "In a large, heavy pot over medium heat, warm the olive oil. Add the onions and bacon and sauté until the onions are soft, about 10 minutes. Transfer to a plate.",
        "Working in batches, add the beef to the pot in a single layer and cook, turning occasionally, until golden brown on all sides, 7 to 10 minutes. Transfer to a bowl. Return all the meat to the pot, sprinkle with the flour and cook, stirring, until the meat is evenly coated, about 1 minute. Return the onions and bacon to the pot, and add the garlic and bouquet garni.",
        "Increase the heat to high, pour in the wine and bring to a boil, stirring to scrape up the browned bits from the pan bottom. Reduce the heat to medium and simmer, stirring occasionally, until the liquid is reduced by one-fourth, 3 to 5 minutes. Stir in the broth and tomato paste, increase the heat to high and bring to a boil. Reduce the heat to low, cover and simmer until the meat is tender, 1 1/2 to 2 hours.",
        "Remove the bouquet garni and discard. Add the turnips, cover and cook until tender, about 15 minutes. Add the turnip greens, cover and cook until wilted, about 2 minutes. Season with salt and pepper. Ladle the stew into warmed bowls and serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "Soup of the Day",
        ", by Kate McMillan (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "2 yellow onions, finely chopped",
        "2 oz. bacon or pancetta, finely diced",
        "3 lb. chuck roast or sirloin tip, cut into 1- to 1 1/2-inch cubes",
        "1/4 cup all-purpose flour",
        "4 garlic cloves, minced",
        "6 fresh flat-leaf parsley stems, 2 fresh thyme sprigs and 2 bay leaves tied together to make a bouquet garni",
        "1 1/2 cups dry red wine",
        "3 cups beef broth",
        "1 Tbs. tomato paste",
        "1 bunch turnips with greens, turnips cut into 1/2-inch chunks and leaves stemmed and cut crosswise into strips",
        "Salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Stew with Turnips and Greens",
    "url": "http://www.williams-sonoma.com/recipe/beef-stew-with-turnips-and-greens.html"
}
