{
    "directions": [
        "Rinse marrowbones and soak in warm water to cover 10 minutes. Press on 1 bone with your thumb at end of bone with smaller opening, pushing marrow out other end. Discard bone and repeat with remaining bones. Cut marrow crosswise into 1/8-inch-thick rounds. Cover marrow with cold water in a bowl and chill, changing water twice, 24 hours.",
        "Boil wine, shallot, mushrooms, carrot, thyme, bay leaf, and peppercorns in a 3-quart heavy saucepan until reduced to about 1/2 cup, about 15 minutes. Add veal stock and return to a boil. Pour through a fine sieve into a 2-quart heavy saucepan, pressing on and discarding solids. Return sauce to a boil. Stir together arrowroot and Madeira and whisk into sauce. Simmer, whisking occasionally, until slightly thickened, about 2 minutes, then stir in salt and season with pepper.",
        "Preheat oven to 350°F.",
        "Pat beef dry and sprinkle with salt and pepper. Heat oil and butter in a small flameproof roasting pan over moderately high heat until foam subsides, then brown beef well on all sides, about 10 minutes. Put roasting pan with beef in middle of oven and roast until an instant-read thermometer inserted diagonally 2 inches into center registers 130°F for medium-rare, about 30 minutes. Transfer to a cutting board and let stand 10 minutes, then cut into 1/2-inch-thick slices.",
        "Bring broth, water, and salt to a simmer in a small saucepan. Drain marrow and transfer with a slotted spoon to saucepan. Poach at a bare simmer 8 minutes.",
        "Bring sauce to a simmer and add marrow using slotted spoon.",
        "Pour some sauce over sliced beef and serve remainder on side. If desired, arrange marrow rounds between beef slices with slotted spoon."
    ],
    "ingredients": [
        "3 lb (3- to 4-inch-long) beef marrowbones (about 6 bones), both ends of marrow exposed",
        "2 cups dry red wine (preferably Bordeaux)",
        "1/3 cup finely chopped shallot",
        "1/2 cup chopped mushrooms",
        "1 small carrot, finely chopped",
        "2 large sprigs fresh thyme",
        "1 bay leaf (not California)",
        "10 black peppercorns, cracked",
        "2 cupsVeal stock",
        "4 teaspoons arrowroot",
        "1 tablespoon Madeira",
        "1/4 teaspoon salt",
        "1 (2 3/4- to 3-lb) trimmed and tied beef tenderloin",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 tablespoon vegetable oil",
        "1 tablespoon unsalted butter",
        "1 cup beef broth",
        "1 cup water",
        "1/2 teaspoon salt",
        "Garnish: watercress sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Roast",
        "Dinner",
        "Red Wine",
        "Thyme",
        "Shallot",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Beef Tenderloin with Red-Wine and Marrow Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/beef-tenderloin-with-red-wine-and-marrow-sauce-105500"
}
