{
    "directions": [
        "Preheat oven to 450°F. Sprinkle brisket with salt and pepper. Heat 2 tablespoons oil in large pot over medium-high heat. Brown brisket, about 5 minutes per side. Transfer to large roasting pan. Add chopped onions, chopped carrot, celery and garlic to pot; sauté until golden, about 10 minutes. Add wine, thyme sprigs and bay leaves; boil until liquid is reduced to 5 cups, about 10 minutes. Add stock to pot; bring to boil. Pour wine mixture over brisket to fill 2/3 of pan; reserve remaining wine mixture.",
        "Roast brisket uncovered until very tender, turning and basting occasionally and adding more wine mixture as necessary to keep pan 2/3 full, about 3 1/2 hours.",
        "Transfer meat to platter. Strain pan juices into 4-cup measuring cup, pressing on solids; add enough wine mixture to measure 3 1/2 cups. Season with salt and pepper. Thinly slice meat across grain. (Can be made 1 day ahead. Cover meat and sauce separately; chill. Arrange meat in baking dish. Cover with foil; rewarm in 350°F oven about 40 minutes. Rewarm sauce.)",
        "Heat 1 tablespoon oil in large skillet over medium heat. Add baby carrots, pearl onions and 1 tablespoon thyme; sauté until golden, about 5 minutes. Cover and cook until vegetables are crisp-tender, about 5 minutes. Season with salt and pepper.",
        "Serve meat with sauce and vegetables."
    ],
    "ingredients": [
        "1 5-pound flat-cut beef brisket, fat trimmed",
        "3 tablespoons olive oil",
        "7 cups finely chopped onions",
        "1 cup finely chopped carrot",
        "1 cup finely chopped celery",
        "2 tablespoons chopped garlic",
        "2 750-ml bottles dry red wine",
        "8 large fresh thyme sprigs plus1 tablespoon chopped fresh thyme",
        "2 bay leaves",
        "8 cups chicken stock or canned low-salt chicken broth",
        "1 pound baby carrots, peeled",
        "12 ounces pearl onions, blanched, peeled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Vegetable",
        "Braise",
        "Passover",
        "Brisket",
        "Carrot",
        "Red Wine",
        "Winter",
        "Potluck"
    ],
    "title": "Beef Brisket with Pearl Onions and Baby Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/beef-brisket-with-pearl-onions-and-baby-carrots-5691"
}
