{
    "directions": [
        "Cut steak with grain into 2-inch-wide pieces, then slice thinly across grain. Combine 3 tablespoons water, 2 tablespoons vegetable oil, 2 tablespoons soy sauce, and 2 teaspoons cornstarch in large bowl. Add steak and stir to coat. Refrigerate at least 30 minutes.",
        "Combine 6 tablespoons broth, remaining 2 tablespoons soy sauce, and 6 teaspoons cornstarch, wine, and next 3 ingredients in small bowl, stirring to dissolve cornstarch completely.",
        "Heat 2 tablespoons vegetable oil in wok or heavy large skillet over high heat. Add steak with marinade and stir-fry until no longer pink, about 2 minutes. Transfer to platter. Add 2 tablespoons vegetable oil to wok. Add ginger and stir until aromatic, about 30 seconds. Add broccoli and stir-fry 1 minute. Add 1 cup broth. Cover, reduce heat and simmer 2 1/2 minutes. Transfer broccoli to bowl. Add 1 tablespoon vegetable oil to wok. Add mushrooms; cook 2 minutes. Return steak and broccoli to wok. Stir sauce, add to wok and stir until sauce thickens, about 30 seconds. Transfer mixture to platter. Serve immediately with steamed rice."
    ],
    "ingredients": [
        "1 pound flank steak",
        "3 tablespoons water",
        "7 tablespoons vegetable oil",
        "4 tablespoons soy sauce",
        "8 teaspoons cornstarch",
        "6 tablespoons plus 1 cup canned low-salt chicken broth",
        "1/4 white wine",
        "2 tablespoons oyster sauce",
        "4 teaspoons oriental sesame oil",
        "1/2 teaspoon sugar",
        "6 quarter-size slices peeled fresh ginger, minced",
        "2 pounds broccoli, cut into florets (stems discarded)",
        "1 pound mushrooms, sliced",
        "rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Ginger",
        "Mushroom",
        "Stir-Fry",
        "Broccoli",
        "White Wine",
        "Soy Sauce"
    ],
    "title": "Beef, Mushroom, and Broccoli Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/beef-mushroom-and-broccoli-stir-fry-105590"
}
