{
    "directions": [
        "Put 1 3/4 cups flour in a large bowl, then add boiling-hot water, stirring with a wooden spoon until a shaggy dough forms. When just cool enough to handle, turn out dough (including any loose flour) onto a work surface and knead, incorporating some of remaining 1/4 cup flour if dough is sticky, until smooth, about 5 minutes.",
        "Form into a ball and wrap in plastic wrap. Let stand at room temperature at least 10 minutes and up to 30.",
        "Stir together beef, soy sauce, oils, ginger, and bean paste in a medium bowl, then stir in chives.",
        "Form dough into a log (24 inches long and about 1 inch wide), then cut dough crosswise into 24 (1-inch-wide) pieces. Put 6 pieces, cut sides down, on a lightly floured surface (keep remaining pieces loosely covered with plastic wrap) and flatten slightly with your hand. Roll out each flattened piece into a 3 1/4-inch round with lightly floured rolling pin. Put a level tablespoon of filling in center of each round, then brush or dab halfway around edge with a little water and fold in half, pressing edges together to seal and leaving a small opening at each end of semicircle. Stand each dumpling, sealed edge up, on a wax-paper-lined tray, then press dumplings slightly onto 1 side so more of dumpling touches tray. Make more dumplings in same manner.",
        "Heat oil in a 12-inch nonstick skillet over moderate heat until hot, then remove from heat and arrange dumplings in a tight circular pattern standing up in oil (they should touch one another). Cook, uncovered, over moderate heat until oil sizzles, then drizzle warm water (1/3 cup) over pot stickers and cook, covered, until bottoms are browned, 8 to 10 minutes. Add 2 tablespoons more water if skillet looks dry before bottoms are browned.",
        "Remove lid and cook, shaking skillet to loosen pot stickers, until steam dissipates, 1 to 2 minutes. Invert a large plate with a rim over skillet. Using pot holders, hold plate and skillet together and invert skillet. Remove skillet and serve pot stickers warm."
    ],
    "ingredients": [
        "1 3/4 to 2 cups all-purpose flour",
        "3/4 cup boiling-hot water",
        "1/4 lb ground beef chuck (1/2 cup)",
        "1 1/2 tablespoons soy sauce",
        "1 tablespoon Asian sesame oil",
        "1 tablespoon peanut oil",
        "1 tablespoon minced peeled fresh ginger",
        "1 teaspoon Chinese sweet bean paste",
        "2 cups finely chopped yellow or green garlic chives (6 oz)",
        "1 tablespoon peanut oil",
        "1/3 cup warm water",
        "Special equipment: a 6-inch (3/4-inch-diameter) rolling pin or dowel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Fry",
        "Cocktail Party",
        "Meat",
        "Ground Beef",
        "Pan-Fry",
        "Gourmet"
    ],
    "title": "Beef Pot Stickers",
    "url": "http://www.epicurious.com/recipes/food/views/beef-pot-stickers-232027"
}
