{
    "directions": [
        "Melt 2 tablespoons butter in heavy large deep skillet over medium heat. Add onions and bell pepper and sauté until light golden, about 10 minutes. Add mushrooms and sauté until starting to soften, about 5 minutes. Mix in flour and paprika and stir 2 minutes. Mix in stock and tomato paste. Bring to boil, stirring constantly. Boil until sauce thickens and paprika flavor mellows, stirring frequently, about 8 minutes. Mix in sour cream. Remove from heat and add dill. Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate. Bring to simmer before adding beef.)",
        "Melt 1 tablespoon butter in another heavy large skillet over medium-high heat. Working in batches, add beef, season with salt and pepper and cook until just brown on each side. Transfer to plate. Add more butter as needed. When all beef is brown, add to sauce along with any drippings on plate. Add dry white wine to skillet and bring to boil, scraping up any browned bits. Boil until syrupy, about 3 minutes. Add to beef. Sprinkle with chopped tomatoes before serving, if desired."
    ],
    "ingredients": [
        "4 tablespoons (about) (1/2 stick) unsalted butter",
        "2 large onions, chopped",
        "1 large green bell pepper, chopped",
        "1 pound mushrooms, sliced",
        "2 tablespoons all purpose flour",
        "1 1/2 tablespoons paprika (preferably Hungarian sweet)",
        "2 1/2 cups beef stock or canned unsalted beef broth",
        "1 tablespoon tomato paste",
        "3/4 cup sour cream",
        "3 tablespoons chopped fresh dill",
        "1 3/4 pounds center-cut beef tenderloin (chateaubriand), cut into 1/4- to 1/2-inch-thick slices, slices halved lengthwise",
        "1/4 cup dry white wine",
        "Chopped tomatoes (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Herb",
        "Mushroom",
        "Sour Cream"
    ],
    "title": "Beef Paprikas",
    "url": "http://www.epicurious.com/recipes/food/views/beef-paprikas-2493"
}
