{
    "directions": [
        "Preheat an oven to 350°F.",
        "In a 6 3/4-quart Dutch oven over medium-high heat, warm 2 Tbs. of the oil until just smoking. Season the beef with salt and pepper. Working in batches, brown the beef on all sides, 10 to 12 minutes per batch. Transfer to a large bowl.",
        "Add the remaining 1 Tbs. oil and the mushrooms to the pot and cook, stirring occasionally, until well browned, 6 to 8 minutes, adding 1 to 2 Tbs. water if the bottom of the pot becomes too dark. Transfer the mushrooms to the bowl with the beef.",
        "Reduce the heat to medium and add the bacon to the pot. Cook, stirring occasionally, until the bacon is browned and crisp, 6 to 8 minutes. Transfer the bacon to the bowl with the beef and mushrooms.",
        "Discard all but 1/4 cup of the fat from the pot. Add the yellow onion and cook, stirring occasionally, until softened, 6 to 8 minutes. Add the garlic, demi-glace and flour and cook, stirring constantly, until fragrant, about 1 minute. Slowly whisk in the wine and cook, stirring occasionally, for 20 minutes.",
        "Return the beef, mushrooms and bacon to the pot. Add the broth, pearl onions and bouquet garni. Season with salt and pepper and bring to a simmer. Cover the pot with aluminum foil and then with the lid. Transfer to the oven and cook until the meat is fork-tender, 2 1/2 to 3 hours.",
        "Skim the excess fat off the sauce, and remove and discard the bouquet garni. Adjust the seasonings with salt and pepper. Sprinkle with the parsley. Serve the stew immediately over boiled potatoes. Serves 8 to 10.",
        "Williams-Sonoma Kitchen."
    ],
    "ingredients": [
        "3 Tbs. canola oil",
        "4 1/2 lb. boneless chuck roast, cut into 1-inch cubes",
        "Kosher salt and freshly ground pepper, to taste",
        "1 lb. button mushrooms, quartered",
        "1/2 lb. slab bacon, cut into 1/4-inch dice",
        "1 large yellow onion, diced",
        "2 tsp. minced garlic",
        "1 1/2 Tbs. veal demi-glace",
        "1/2 cup all-purpose flour",
        "1 bottle (750ml) Pinot Noir",
        "3 cups beef broth",
        "1 lb. pearl onions, peeled",
        "1 bouquet garni (2 bay leaves, 4 thyme sprigs and 6 parsley sprigs, tied with kitchen twine)",
        "3 Tbs. chopped fresh flat-leaf parsley",
        "Boiled Potatoes with Parsley for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Bourguignonne",
    "url": "http://www.williams-sonoma.com/recipe/beef-bourguignonne-2012.html"
}
