{
    "directions": [
        "In a resealable plastic bag, combine the garlic, white onion, fish sauce, sugar, salt, a generous grinding of pepper and 2 Tbs. of the oil. Add the beef, squeeze some of the air out of the bag and seal the bag, turning to distribute the ingredients. Refrigerate for 1 1/2 to 2 hours. Bring the beef to room temperature before cooking.",
        "In a small bowl, toss together the red onion, vinegar and plenty of pepper. Let stand for 10 to 15 minutes. Add 1 Tbs. of the oil and toss. Divide the watercress and green onions among plates and arrange some of the red onion on top.",
        "Remove the beef from the bag and discard the marinade. Place a wok or large, heavy fry pan over high heat. Warm the remaining 1 Tbs. oil and swirl to coat the pan. When the oil has just begun to shimmer, add the beef, distributing it evenly, and cook without moving it until golden brown, about 2 minutes. Turn the beef over, add the butter and cook for about 1 minute more. Do not overcook.",
        "Arrange the beef and pan juices alongside the watercress. Serve immediately. Serves 4 to 6.",
        "A note from the butcher:",
        "For this recipe, use the center-cut piece of the tenderloin, called the filet mignon. The tail would be too stringy, and the tip end of the butt side has a small piece of gristle. Purchase the filet mignon from your butcher or buy a whole tenderloin and make the cut yourself. Make sure to cut off the membrane encasing the meat, called the silverskin, and remove the fat from the filet to ensure a clean piece for stir-frying.",
        "–Jim Cascone, Huntington Meats, Los Angeles, CA",
        "Adapted from Williams-Sonoma",
        "The Cook and The Butcher,",
        "by Brigit Binns (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "6 garlic cloves, minced",
        "1/2 small white onion, finely chopped",
        "1 Tbs. Thai or Vietnamese fish sauce",
        "1 tsp. sugar",
        "3/4 tsp. kosher salt",
        "Freshly ground pepper, to taste",
        "4 Tbs. (2 fl. oz./60 ml) canola oil",
        "1 1/2 lb. (750 g) filet mignon, cut into 1-inch (2.5-cm) cubes",
        "1 small red onion, very thinly sliced",
        "2 Tbs. rice vinegar",
        "About 6 oz. (185 g) watercress, tough stems removed",
        "4 green onions, white and light green portions, finely chopped",
        "1 Tbs. unsalted butter"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Caramelized Beef with Onions and Watercress",
    "url": "http://www.williams-sonoma.com/recipe/beef-with-onions-watercress.html"
}
