{
    "directions": [
        "Place flour in large bowl, and season with salt and pepper. Dredge beef  in flour to coat.",
        "Melt 2 tablespoons butter in a heavy Dutch oven over high heat.  Working in batches, saute beef until brown on all sides, about 5 minutes per batch.",
        "Return all meat to pot, and add brandy; boil until almost evaporated, about 2 minutes. Add wine, broth, thyme, garlic, bay leaves and oregano. Cover, and simmer until beef is almost tender, about 1 hour.",
        "Meanwhile, melt 1 tablespoon butter in large nonstick skillet over medium-high heat. Saute onions until brown. Using slotted spoon, transfer onion to large bowl. Melt 1 tablespoon butter in same skillet, add carrots and celery, and saute until golden. Transfer to bowl with onions. Melt 2 tablespoons butter in same skillet, add potatoes, and saute until brown on all sides. Transfer to bowl with other vegetables. Melt 1 tablespoon butter in same skillet, add mushrooms, and saute until brown on all sides, about 5 minutes. Transfer to bowl.",
        "Transfer vegetables to pot with beef, and stir in nutmeg. Cover pot and simmer 45 minutes. Uncover pot, and boil liquid until thickened to sauce consistency, about 7  minutes. Season with salt and pepper."
    ],
    "ingredients": [
        "1/4 cup all-purpose flour",
        "salt and pepper",
        "2 pounds beef stew meat, cut into 1 1/2 inch pieces",
        "7 tablespoons butter",
        "1/4 cup brandy",
        "2 cups Burgundy wine",
        "2 cups beef broth",
        "6 sprigs fresh thyme",
        "4 cloves garlic, minced",
        "3 bay leaves",
        "1/2 teaspoon dried oregano",
        "1 large onion, cut into 12 wedges",
        "4 carrots, cut into 2 inch pieces",
        "4 stalks celery, cut into 2 inch pieces",
        "1 1/2 pounds red potatoes, peeled and quartered",
        "1/2 pound fresh mushrooms",
        "1 pinch ground nutmeg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Beef Burgundy II",
    "url": "http://allrecipes.com/recipe/30883/beef-burgundy-ii/"
}
