{
    "directions": [
        "Cover work surface with plastic wrap and put steak on it with a short side of steak nearest you. Holding a sharp knife parallel to work surface and beginning on a long side, using short slicing motions, butterfly steak by cutting it horizontally almost, but not all the way, in half, then open it like a book.",
        "Cover steak with a double thickness of plastic wrap (about 2 feet long) and, using the flat side of a meat pounder (or using a rolling pin), gently pound meat 1/4 inch thick.",
        "Discard top sheets of plastic wrap and turn steak on plastic wrap so grain of meat is running left to right, then rub 1 tablespoon oil onto steak and sprinkle with 1/4 teaspoon salt and 1/4 teaspoon pepper. Arrange prosciutto in a slightly overlapping layer on steak, then cover with cheese.",
        "Beginning with side nearest you, using plastic wrap as an aid and pressing slightly on filling, roll up steak tightly, then skewer steak, crosswise, at 1-inch intervals. Using a sharp knife, cut between skewers to make 1-inch-thick pinwheels. (End pieces will be about 1 1/2 inches thick. Trim if desired. For more about how to form beef pinwheels, see Time for Steak, Rattle, and Roll.)",
        "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas). If using a charcoal grill, open vents on bottom of grill, then light charcoal. When charcoal turns grayish white (about 15 minutes from lighting), hold your hand 5 inches above grill rack to determine heat for charcoal as follows:\nHot: When you can hold your hand there for 1 to 2 seconds\nMedium-hot: 3 to 4 seconds\nLow: 5 to 6 seconds\nIf using a gas grill, preheat burners on high, covered, 10 minutes, then, if necessary, reduce to heat specified in recipe.",
        "Grill pinwheels, cut sides down, on a well-oiled rack, turning over once (use a metal spatula to loosen), until beef is well browned outside but still pink inside and cheese is beginning to melt, 6 to 8 minutes total.",
        "Toss arugula with remaining 2 tablespoons oil and 1/4 teaspoon salt in a large bowl. Serve on a platter, topped with pinwheels."
    ],
    "ingredients": [
        "1 (1 1/2-lb) piece flank steak",
        "3 tablespoons olive oil",
        "4 oz very thinly sliced prosciutto",
        "4 oz thinly sliced provolone",
        "3/4 lb arugula, stems discarded",
        "Special equipment: 8 to 10 (6-inch-long) wooden skewers, soaked in water 30 minutes",
        "Accompaniment: lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Cheese",
        "Leafy Green",
        "Quick & Easy",
        "Low/No Sugar",
        "Backyard BBQ",
        "Meat",
        "Steak",
        "Arugula",
        "Summer",
        "Grill/Barbecue",
        "Prosciutto",
        "Gourmet"
    ],
    "title": "Beef Pinwheels with Arugula Salad",
    "url": "http://www.epicurious.com/recipes/food/views/beef-pinwheels-with-arugula-salad-232303"
}
