{
    "directions": [
        "To make the avocado crema, scoop the flesh from the avocado into a small bowl and mash with a large fork until creamy and smooth. Stir in the crema and lime juice. Season with salt to taste, cover and refrigerate until ready to serve.",
        "In a fry pan over medium-high heat, warm the 1 Tbs. oil. Add the garlic and sauté just until soft, about 1 minute. Add the ground beef and cook, stirring occasionally and using your spoon to break up any clumps, until the meat is browned and cooked through, about 10 minutes. If there is a lot of fat in the pan, pour off most of it. Add the cumin and salt and cook for 1 minute to toast the cumin. Transfer to a bowl and let cool slightly. Stir in the chipotle chile, if using, and then the Monterey jack.",
        "Pour oil into a fry pan to a depth of about 1 1/2 inches (4 cm); you need enough oil to reach about halfway up the sides of the taquitos. Heat the oil to 350°F (180°C) on a deep-frying or candy thermometer. (If you don’t have a thermometer, your best test is to dip the edge of a tortilla into the oil; it should sizzle immediately and vigorously.)",
        "To assemble, lay the tortillas on a clean work surface and fill each with 2 heaping Tbs. of the meat filling. Roll up tightly and secure each with 2 toothpicks (insert the toothpicks just far enough off the seam so you can lay the seam in the hot oil to sear it closed). Working in batches to avoid crowding, add the taquitos to the hot oil, seam side down, and fry until golden brown on the first side, about 1 1/2 minutes. Using tongs, carefully turn and fry on the second side until golden brown, about 1 1/2 minutes longer. As the taquitos are finished, transfer to a plate lined with paper towels to drain and cool.",
        "To serve, remove the toothpicks and arrange on a platter or individual plates. Serve right away with the avocado crema. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "Taco Night",
        ", by Kate McMillan (Weldon Owen, 2014)"
    ],
    "ingredients": [
        "1 avocado, halved and pitted",
        "1/4 cup (2 oz./60 g) Mexican crema or sour cream",
        "1 Tbs. fresh lime juice",
        "Kosher salt",
        "1 Tbs. canola oil, plus more for frying",
        "2 garlic cloves, minced",
        "1 lb. (500 g) ground beef",
        "2 tsp. ground cumin",
        "1 tsp. kosher salt",
        "1 chipotle chile in adobo sauce, minced (optional)",
        "3 oz. (90 g) Monterey jack cheese, shredded",
        "12 flour tortillas, each about 7 inches (18 cm) in diameter"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef and Monterey Jack Taquitos with Avocado Crema",
    "url": "http://www.williams-sonoma.com/recipe/beef-and-monterey-jack-taquitos-with-avocado-crema.html"
}
