{
    "directions": [
        "Let the beef tenderloin stand at room temperature for about 1 hour before roasting.",
        "Preheat an oven to 450°F.",
        "Rub the tenderloin all over with the olive oil, then rub with the thyme, salt and pepper.",
        "Place the tenderloin on a V-shaped rack in a shallow roasting pan just large enough to accommodate it. Roast until an instant-read thermometer inserted into the thickest part of the meat registers 125°F for very rare to rare, about 20 minutes; 130°F for medium-rare, about 25 minutes; or 135°F for medium, about 30 minutes.",
        "Transfer the tenderloin to a carving board, cover loosely with aluminum foil and let rest for about 15 minutes.",
        "Meanwhile, remove the rack from the roasting pan and place the pan on the stovetop over medium heat. Add the shallots and sauté, stirring them into the pan juices, until translucent, about 2 minutes. Add the wine, a little at a time, stirring with a wooden spoon to scrape up the browned bits from the pan bottom. Cook until the wine is reduced by nearly half. Stir in the butter. When the butter has melted, remove the sauce from the heat and cover to keep warm.",
        "Cut the tenderloin across the grain into slices 1/2 inch thick. Arrange the slices on a platter, drizzle with the sauce and serve immediately. Serves 8.",
        "Adapted from Williams-Sonoma",
        "Two in the Kitchen",
        ", by Christie Dufault & Jordan Mackay (Weldon Owen, 2012)."
    ],
    "ingredients": [
        "1 beef tenderloin, 2 1/2 to 3 lb.",
        "2 Tbs. extra-virgin olive oil",
        "2 tsp. minced fresh thyme",
        "1 1/2 tsp. salt",
        "1 tsp. freshly ground pepper",
        "2 Tbs. minced shallots",
        "1 cup full-bodied red wine, such as Syrah or Cabernet Sauvignon",
        "2 1/2 Tbs. unsalted butter"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Tenderloin with Shallot and Red Wine Reduction",
    "url": "http://www.williams-sonoma.com/recipe/beef-tenderloin-with-shallot-and-red-wine-reduction.html"
}
