{
    "directions": [
        "Heat oil in heavy large pot over medium high heat. Add onions and cook until golden brown and soft, stirring often, about 25 minutes. Add garlic and marjoram; cook until garlic softens, about 3 minutes. Add tomato paste and cook until mixture begins to turn dark red, stirring often, about 3 minutes. Add both paprikas and stir to blend; remove from heat and let stand 1 minute for flavors to blend. Add vinegar; stir over medium heat until almost all liquid is absorbed, about 2 minutes. Add broth, bay leaves, and lemon peel; increase heat and bring to boil.",
        "Sprinkle beef with salt and pepper; add to pot. Simmer over medium-low heat until beef is tender, stirring occasionally, about 2 1/2 hours.",
        "Transfer beef to bowl, leaving onions in pot. Boil sauce in pot until reduced to 5 cups, about 15 minutes. Cool slightly. Working in batches, puree sauce in blender until smooth; return to pot. Season with salt and pepper. Return beef to pot. Simmer until heated through, about 5 minutes. DO AHEAD: Can be made 2 days ahead. Cool slightly. Chill uncovered until cool, then cover and chill. Rewarm before serving.",
        "In keeping with the spirit of this menu, pour an Austrian red with the gulasch. The fruity, elegant Feiler-Artinger 2007 Zweigelt ($19) is a good choice."
    ],
    "ingredients": [
        "1/2 cup canola oil",
        "1 1/2 pounds white onions, halved through core, thinly sliced crosswise (about 8 cups)",
        "2 garlic cloves, sliced",
        "1 tablespoon dried marjoram",
        "1 1/2 tablespoons tomato paste",
        "3 tablespoons Hungarian sweet paprika",
        "1 1/2 teaspoons Hungarian hot paprika",
        "1 cup white wine vinegar",
        "6 cups low-salt chicken broth",
        "2 bay leaves",
        "2 teaspoons finely grated lemon peel",
        "3 1/2 pounds beef shank meat (from about 4 1/2 pounds beef shanks) or boneless beef short ribs, cut into 3/4-inch cubes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Onion",
        "High Fiber",
        "Dinner",
        "Beef Shank",
        "Simmer",
        "Paprika",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Beef Gulasch",
    "url": "http://www.epicurious.com/recipes/food/views/beef-gulasch-356793"
}
