{
    "directions": [
        "Mix together beef, soy sauce, sugar, and salt with your hands until combined well.",
        "Heat oil in a 10-inch nonstick skillet over moderately high heat, then add beef and cook, stirring occasionally and breaking up beef into small pieces, until just browned, about 4 minutes.",
        "Drain beef in a colander set over a bowl (reserve skillet) and return beef drippings to uncleaned skillet.",
        "Heat drippings over moderately high heat until hot but not smoking, then add onion and cook, stirring occasionally, until softened, 3 to 5 minutes. Add curry powder and potatoes and cook, stirring occasionally, until potatoes are translucent, 3 to 5 minutes more. Add water and cook, stirring and scraping up any brown bits from bottom of skillet, until liquid is absorbed and potatoes are tender, about 1 minute. Return beef to skillet and stir in peas, then cool filling, stirring occasionally, about 30 minutes.",
        "Put oven racks in upper and lower thirds of oven and preheat oven to 400°F. Line 2 large baking sheets with parchment.",
        "Roll out one sheet of dough into a 12-inch square on a lightly floured surface with a lightly floured rolling pin and cut out 4 (5-inch) rounds with cutter. Mound 1/3 cup filling onto each of 2 rounds, leaving a 3/4-inch border around edges, then brush edges lightly with egg and cover with another round, gently stretching to cover filling completely. Gently press edges with tines of a fork (about 3/4 inch from edge) to seal, then transfer pies to baking sheet. Repeat with remaining sheets of dough and filling to make a total of 8 pies on 2 baking sheets (you may have some filling left over). Brush tops of pastry lightly with egg and bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until pies are deep golden brown and puffed, 25 to 30 minutes. Cool pies to warm, about 10 minutes, or room temperature."
    ],
    "ingredients": [
        "1/2 pound ground beef chuck (not lean)",
        "1 tablespoon soy sauce",
        "1/2 teaspoon sugar",
        "1/4 teaspoon salt",
        "1 teaspoon vegetable oil",
        "1 medium onion, chopped (1 cup)",
        "1 tablespoon curry powder (preferably Madras)",
        "1 large russet (baking) potato, peeled and cut into 1/4-inch pieces (1 cup)",
        "6 tablespoons water",
        "1/4 cup frozen peas, thawed",
        "2 (17 1/4-ounce) packages frozen puff pastry sheets, thawed",
        "1 large egg, lightly beaten",
        "Special equipment: parchment paper; a 5-inch round cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Vegetable",
        "Bake",
        "Dinner",
        "Ground Beef",
        "Curry",
        "Pea",
        "Fall",
        "Winter",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Beef and Curry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/beef-and-curry-pie-236403"
}
