{
    "directions": [
        "Preheat oven to 325°F. Heat 3 tablespoons oil in heavy large ovenproof pot over medium-high heat. Add onions and sauté until brown, about 20 minutes. Using slotted spoon, transfer onions to large bowl. Season short ribs with salt and pepper. Add 1 tablespoon oil to same pot. Add 8 short ribs and brown on all sides, about 10 minutes. Transfer ribs to bowl with onions. Add remaining 1 tablespoon oil to pot. Add remaining 8 ribs and brown on all sides, about 10 minutes. Transfer ribs to same bowl",
        "Whisk flour into drippings in pot. Whisk in 2 cups broth. Bring to boil, scraping up browned bits. Mix in remaining 2 cups broth, wine, prune juice, tomato paste and spices. Return ribs to pot, arranging close together on their sides in single layer if possible. Add dates and pears; add onions and any juices.",
        "Bring liquid to boil; cover pot. Place pot in oven and bake until ribs are tender, about;1 hour 45 minutes.",
        "Using tongs, transfer ribs to large bowl. Strain cooking liquid into medium bowl, pressing on contents of strainer. Freeze liquid until fat rises to top, about 30 minutes. Spoon off fat. Return liquid to pot. Add honey; boil until sauce is thick enough to coat spoon and is reduced to 3 cups, about 12 minutes. Season with salt and pepper. Return ribs to pot, spooning sauce over to coat. (Short ribs can be made 2 days ahead. Refrigerate until cold; then cover and keep chilled.)",
        "Rewarm ribs over medium-low heat, stirring occasionally. Mound ribs on platter. Top with squash; garnish with parsley."
    ],
    "ingredients": [
        "5 tablespoons olive oil",
        "1 pound onions, chopped",
        "16 3- to 4-inch pieces meaty beef chuck short ribs, any tough membrane trimmed",
        "3 tablespoons all purpose flour",
        "4 cups low-salt chicken broth",
        "1 1/2 cups dry red wine",
        "1 cup prune juice",
        "1 tablespoon tomato paste",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon ground ginger",
        "1/2 ground cinnamon",
        "2 ounces pitted dates, diced",
        "2 ounces dried pears, diced",
        "1 tablespoon honey",
        "Honey-glazed Butternut Squash"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Bake",
        "Prune",
        "Date",
        "Pear",
        "Beef Rib",
        "Butternut Squash",
        "Winter",
        "Honey"
    ],
    "title": "Beef-Short Ribs Tagine with Honey-Glazed Butternut Squash",
    "url": "http://www.epicurious.com/recipes/food/views/beef-short-ribs-tagine-with-honey-glazed-butternut-squash-4563"
}
