{
    "directions": [
        "Whisk flour, 1/4 cup Worcestershire sauce, garlic powder, and seasoned salt in a large bowl until smooth and toss the beef tips in the flour mixture to coat. Remove beef with a slotted spoon.",
        "Heat vegetable oil in a large heavy pan or Dutch oven over medium heat; cook and stir mushrooms and 1 small chopped onion in oil until the onion is translucent, about 8 minutes. Stir in seasoned beef tips and cook and stir until the beef is browned and no longer pink inside, about 10 minutes.",
        "Pour in beef broth and whisk dry brown gravy mix into the beef mixture until smooth; stir in 1/2 teaspoon Worcestershire sauce, bay leaf, parsley, and merlot. Bring to a simmer and reduce heat; simmer until gravy has thickened, about 10 minutes. Transfer to a slow cooker, cover, and cook on Low for 8 hours.",
        "About 25 minutes before serving time, melt butter in a saucepan over medium heat and cook and stir 1 small chopped onion until translucent, about 5 minutes. Stir rice into the mixture and pour in beef consomme. Bring to a boil, reduce heat to low, and cover. Simmer rice until tender and the liquid is absorbed, about 15 minutes; let rice stand for 5 minutes covered before fluffing with a fork. Serve beef tips and gravy over the rice."
    ],
    "ingredients": [
        "1/4 cup all-purpose flour",
        "1/4 cup Worcestershire sauce",
        "2 tablespoons garlic powder",
        "1/2 teaspoon seasoned salt, or to taste",
        "1 pound beef tips (preferably black angus)",
        "2 tablespoons vegetable oil, or as needed",
        "1 (16 ounce) package sliced fresh mushrooms",
        "1 small onion, chopped",
        "1 (32 fluid ounce) container beef broth",
        "2 (.75 ounce) packets dry brown gravy mix",
        "1 tablespoon browning sauce (such as Kitchen Bouquet®)",
        "1/2 teaspoon Worcestershire sauce",
        "1 bay leaf",
        "1 teaspoon dried parsley",
        "1/4 cup Merlot wine",
        "1/4 cup butter",
        "1 small onion, chopped",
        "1 cup white rice",
        "2 (10.5 ounce) cans beef consomme"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Beef Tips and Merlot Gravy with Beef and Onion Rice",
    "url": "http://allrecipes.com/recipe/223374/beef-tips-and-merlot-gravy-with-beef/"
}
