{
    "directions": [
        "Using small sharp knife, cut off peel and white pith from oranges. Working over medium bowl, cut between membranes to release sections. Cut each section crosswise into 4 pieces and add to bowl. Mix in remaining ingredients. Cover; chill at least 1 hour and up to 4 hours.",
        "Combine first 4 ingredients and lavender, if using, in mortar and coarsely crush with pestle (or place in resealable plastic bag and coarsely crush with rolling pin).",
        "Rub 1 tablespoon oil over beef, then coat beef with spice mixture. Let stand 1 hour at room temperature.",
        "Heat 3 tablespoons oil in heavy large skillet over high heat. Add beef and sear on all sides, turning every 2 minutes, about 12 minutes total (beef will be rare in center). Chill until cold, then wrap in plastic and freeze 1 hour.",
        "Slice meat as thinly as possible (sliced meat can be pounded between layers of waxed paper until paper-thin, if desired). Toss arugula with juices from salsa and mound on platter. Top with salsa. Surround with meat and cheese.",
        "*Available at natural foods stores."
    ],
    "ingredients": [
        "2 large navel oranges",
        "1/2 cup diced red onion",
        "1/2 cup pitted Kalamata olives",
        "1/4 cup chopped fresh parsley",
        "2 tablespoons olive oil",
        "1 garlic clove, minced",
        "1/2 teaspoon Hungarian sweet paprika",
        "1/2 teaspoon ground cumin",
        "1/8 teaspoon cayenne pepper",
        "2 teaspoons whole black peppercorns",
        "2 teaspoons fennel seeds",
        "1 teaspoon white peppercorns",
        "1 teaspoon coarse kosher salt",
        "1 1/2 teaspoons dried lavender blossoms (optional)*",
        "4 tablespoons olive oil",
        "1 1 1/4-pound trimmed beef tenderloin",
        "2 cups lightly packed fresh arugula",
        "1 2-ounce wedge aged Gouda cheese, shaved using vegetable peeler"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Citrus",
        "Olive",
        "Appetizer",
        "Sauté",
        "Orange",
        "Winter",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Beef Carpaccio with Orange-Olive Salsa and Shaved Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/beef-carpaccio-with-orange-olive-salsa-and-shaved-cheese-107677"
}
