{
    "directions": [
        "For the bouquet garni: Wrap the herbs in cheesecloth and secure with butcher's twine, leaving about 6 inches of excess string. Set aside.",
        "For the beef bourguignon: Cook the bacon in a large Dutch oven over medium heat until browned but not fully rendered, 5 minutes. Using a slotted spoon, remove the bacon to a paper-towel-lined plate.",
        "Place the flour in a shallow bowl. Season the beef well with salt and pepper, then toss it in the flour to coat, shaking off the excess flour. Add the oil to the Dutch oven, heat until shimmering, and then brown the beef in batches. Using a slotted spoon, transfer the browned pieces to a large bowl.",
        "Add the mushrooms to the pan. Season with salt and pepper. Cook until browned, about 4 minutes. If the pan looks dry, add more olive oil. Push the mushrooms to the sides of the pan, add the onions and cook until lightly browned, 6 to 8 minutes. Season again with a pinch of salt and pepper. Add the garlic and cook until fragrant, about 1 minute. Carefully tie the bouquet garni to the handle of the pot and drop the bouquet into the vegetables (or simply toss the whole bouquet into the pot). Add the carrots and tomato paste and cook, stirring, for 2 minutes. Add the red wine, increase the heat, and bring to a boil. Then reduce the heat and simmer for 2 minutes, stirring up the browned bits stuck to the bottom of the pan with a wooden spoon. Add the broth and 1 cup water and return the meat and bacon to the pan. Simmer, covered, for 1 hour.",
        "Add the pearl onions to the pot and cook, partially covered, until the meat is very tender when pierced with a fork, 1 hour more. Remove the bouquet garni. Season the stew to taste with salt and pepper. Garnish with parsley leaves to serve."
    ],
    "ingredients": [
        "2 bay leaves",
        "4 sprigs fresh thyme",
        "3 sprigs fresh parsley, plus extra leaves for garnish",
        "1 sprig fresh rosemary",
        "4 slices bacon, cut into 1/2-inch pieces",
        "3 tablespoons all-purpose flour",
        "3 pounds stew beef",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoon extra-virgin olive oil, plus additional as needed",
        "10 ounces cremini mushrooms, halved or quartered if large",
        "1 onion, halved and thinly sliced",
        "4 cloves garlic, roughly chopped",
        "4 carrots, cut into 1 1/2-inch pieces",
        "2 tablespoons tomato paste",
        "2 cups dry red wine",
        "One 14.5-ounce can reduced-sodium beef broth",
        "One 16-ounce bag frozen pearl onions, thawed"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef Bourguignon",
        "Beef",
        "Meat",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Beef Bourguignon",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/beef-bourguignon"
}
