{
    "directions": [
        "In a large fry pan over medium heat, melt the butter. Add the carrot, celery and onion and cook, stirring frequently, until the vegetables are tender and golden, 10 to 15 minutes. Add the beef, the 3/4 tsp. salt and a pinch of pepper. Cook, stirring and breaking up the meat with a wooden spoon until it is no longer red and its juices have evaporated, about 10 minutes. Add the wine, bring to a simmer and cook until the wine evaporates, about 2 minutes. Remove from the heat and let cool slightly.",
        "Scrape the beef mixture into a food processor and pulse until finely chopped. Add the eggs, the 1/2 cup cheese and the bread crumbs and pulse just until blended. Scrape the mixture into a bowl, cover and chill for at least 1 hour or for up to overnight.",
        "Lightly flour 3 or 4 rimmed baking sheets.",
        "Make the pasta dough according to the recipe, then divide and roll out each piece into a sheet 1/16 inch thick, as directed in the related tip at left. Lay the pasta sheet on a lightly floured work surface and, using a knife or a pastry wheel, cut it into 2-inch squares. Layer the squares on one of the prepared baking sheets, spacing them so they don’t touch and separating each layer with a lightly floured kitchen towel.",
        "To fill the tortellini, place about 1/2 tsp. of the filling in the center half of each square. Dip a pastry brush in cool water and lightly brush around the filling. Fold a corner of the dough over the filling to form a triangle. Using your fingers, mold the dough around the filling to eliminate any air pockets. Firmly press the edges together to seal. Bring the 2 opposite points of the triangle together to form a circle and pinch the points together to seal. The third point forms a peaked top; curl it back slightly. Place the filled tortellini in single layers on the prepared baking sheets, making sure they don't touch.",
        "When you have made all of the tortellini, freeze half of them in a single layer on a baking sheet, then transfer them to a resealable plastic bag and freeze for up to 3 months. You can cook the remaining tortellini immediately, or cover with a kitchen towel and refrigerate until ready to cook. They will keep for up to 3 hours; turn them several times during that time so that they do not stick.",
        "In a saucepan, heat the broth over low heat until it is barely simmering. Keep warm while you cook the tortellini.",
        "Meanwhile, bring a large pot three-fourths full of water to a rolling boil. Add the 2 Tbs. salt and then the tortellini and stir gently. Cook, stirring occasionally and adjusting the heat so the water simmers gently, until the tortellini rise to the surface and are al dente, about 2 minutes. Using a large slotted spoon, carefully transfer the tortellini to a colander to drain, then add to the broth in the saucepan and heat briefly. Divide evenly among warmed soup bowls and serve at once. Pass grated cheese at the table. Serves 6.",
        "Adapted from Williams-Sonoma",
        "Essentials of Italian",
        "by Michele Scicolone (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "2 Tbs. unsalted butter",
        "1 carrot, chopped",
        "1 large celery stalk, chopped",
        "1 small yellow onion, chopped",
        "3/4 lb. ground beef sirloin",
        "3/4 tsp. plus 2 Tbs. sea salt",
        "Freshly ground pepper, to taste",
        "1/2 cup dry red wine such as Barbera",
        "2 eggs, beaten",
        "1/2 cup firmly packed grated Parmigiano-Reggiano cheese, plus more for serving",
        "1/4 cup fine dried bread crumbs",
        "1 lb. fresh egg pasta dough",
        "8 cups beef or chicken broth"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Tortellini in Broth",
    "url": "http://www.williams-sonoma.com/recipe/beef-tortellini-in-broth.html"
}
