{
    "directions": [
        "Heat 1 1/2 tablespoons oil in a large heavy pot over medium-high heat. Season beef with kosher salt; cook, turning, until browned on all sides, about 15 minutes. Transfer beef to a plate.",
        "Add remaining 1 1/2 tablespoons oil to pot. Add onions, garlic, thyme sprig, and bay leaf. Cook, stirring often, until onions are golden brown and soft, 10-15 minutes. Remove pot from heat and add wine. Return pot to heat, bring to a boil, and simmer until wine is reduced by half, about 3 minutes.",
        "Return beef to pot; add broth. Bring to a boil; reduce heat, cover, and simmer gently until beef is fork-tender, 5-6 hours.",
        "Let beef cool in cooking liquid, then transfer to a shallow baking dish. Strain braising liquid through a fine-mesh sieve over meat in dish. Cover and chill overnight. DO AHEAD: Beef can be made 3 days ahead. Keep chilled. Discard fat from surface of braising liquid before continuing.",
        "Cut beef into 4 pieces; set aside. Transfer chilled braising liquid to a large skillet and bring to a boil; cook until thickened and reduced to 1 1/2 cups, 25-30 minutes. Taste and season sauce with salt, if needed.",
        "Add beef to skillet with sauce, cover, and cook over medium-low heat until beef is heated through, 8-10 minutes. Divide beef among plates. Spoon sauce over, top with mushrooms, and sprinkle with flaky sea salt."
    ],
    "ingredients": [
        "3 tablespoons olive oil, divided",
        "1 2-pound boneless beef chuck roast",
        "Kosher salt",
        "4 medium onions, coarsely chopped",
        "2 garlic cloves, smashed",
        "1 sprig thyme",
        "1 bay leaf",
        "1 cup dry red wine",
        "8 cups low-sodium beef broth",
        "8 ounces mixed mushrooms (such as hen of the woods, chanterelle, crimini, and stemmed shiitake), torn into large pieces",
        "Flaky sea salt (such as Maldon)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Onion",
        "Braise",
        "Dinner",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Beef and Wild Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/beef-and-wild-mushrooms-51144030"
}
