{
    "directions": [
        "Cut the steak across the grain into strips 3 inches long and 1/4 inch thick. In a bowl, stir together the cornstarch, salt, sugar, baking soda and 2 Tbs. water. Add the beef and stir until well mixed. Let stand at room temperature for 30 minutes.",
        "Meanwhile, make the sauce: In a bowl, combine the oyster sauce, dark and light soy sauces, peanut oil, cornstarch, sugar, white pepper and 2 Tbs. water. Set aside.",
        "Bring a saucepan three-fourths full of water to a boil over high heat. Add the broccoli florets and blanch until just tender, 3 to 4 minutes. Drain, rinse under running cold water until cool and drain again. Set aside.",
        "Remove the beef from the bowl and pat dry with paper towels. In a wok or large, deep sauté pan over high heat, warm 2 Tbs. of the peanut oil until very hot. Add the beef and stir-fry until it just turns opaque, 3 to 4 minutes. Using a slotted spoon, quickly transfer the beef to a sieve placed over a bowl to drain.",
        "Wipe out the pan with paper towels and reheat over high heat. Add the remaining 1 Tbs. oil and heat until very hot. Add the garlic and ginger and stir-fry just until golden brown, 15 to 20 seconds. Using the slotted spoon, remove the garlic and ginger and discard. Add the onion to the pan and stir-fry until just tender, about 5 minutes.",
        "Pour in the rice wine and deglaze the pan, stirring to scrape up the browned bits from the pan bottom. When the wine has evaporated, add the sauce, stir and bring to a boil. Immediately add the beef and broccoli and stir-fry until the sauce thickens and the beef is heated through, about 3 minutes. Transfer the beef and broccoli to a warmed bowl and serve. Serves 4 to 6."
    ],
    "ingredients": [
        "1 lb. flank steak",
        "1 Tbs. cornstarch",
        "1/4 tsp. salt",
        "1/4 tsp. sugar",
        "1/8 tsp. baking soda",
        "2 Tbs. oyster sauce",
        "1 Tbs. dark soy sauce",
        "1 Tbs. light soy sauce",
        "1 tsp. peanut oil",
        "1 tsp. cornstarch",
        "1/2 tsp. sugar",
        "1/8 tsp. freshly ground white pepper",
        "2 cups small broccoli florets",
        "3 Tbs. peanut oil",
        "2 garlic cloves",
        "2 slices fresh ginger, smashed with the side of a  knife",
        "1 small yellow onion, cut into 1-inch dice",
        "1 Tbs. Chinese rice wine"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef and Broccoli with Oyster Sauce",
    "url": "http://www.williams-sonoma.com/recipe/beef-and-broccoli-with-oyster-sauce.html"
}
