{
    "directions": [
        "Put the potatoes in a large pot. Add water to cover by 2 inches and then add the 1 tsp. salt. Bring to a boil and cook until the potatoes are tender, about 10 minutes. Meanwhile, in a large nonstick fry pan over medium heat, warm 1 Tbs. of the olive oil. Add the cabbage and season with salt and pepper. Sauté until almost tender, about 8 minutes. Set aside.",
        "Reserve 1 cup potato cooking liquid, then drain the potatoes. Return the potatoes to the pot and mash coarsely with a fork, thinning with the cooking liquid as needed. Mix in 1 Tbs. butter, the cabbage and a generous amount of pepper. Adjust the seasonings if needed. Cover to keep warm.",
        "Cut the beef across the grain into 1/4-inch slices and then cut into 2-inch lengths. In a large fry pan over medium-high heat, warm 1 Tbs. of the olive oil. Working in batches, add the beef in a single layer and cook until just colored, about 30 seconds per side. Transfer to a plate and season with salt and pepper.",
        "Add the remaining 1 Tbs. olive oil to the fry pan. Add the shallots, reduce the heat to medium, and stir until tender and golden brown, about 6 minutes. Add the flour and stir for 20 seconds. Gradually stir in the broth and vermouth. Simmer, stirring frequently, until the sauce thickens slightly, about 6 minutes. Stir in the mustard and the 1 1/2 Tbs. thyme. Remove the pan from the heat and stir in the remaining 1 Tbs. butter until melted. Adjust the seasonings if needed.",
        "Transfer the beef and potatoes to a platter or divide among 4 warmed plates. Drizzle the sauce over the beef, sprinkle with thyme and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Weeknight Fresh & Fast,",
        "by Kristine Kidd (Williams-Sonoma, 2011)."
    ],
    "ingredients": [
        "1 1/2 lb. Yukon Gold potatoes, peeled and cut into 1-inch pieces",
        "1 tsp. coarse kosher salt, plus more, to taste",
        "3 Tbs. olive oil",
        "1/2 head small savoy cabbage, cored and thinly sliced crosswise",
        "Freshly ground pepper, to taste",
        "2 Tbs. unsalted butter",
        "1 1/4 lb. beef tri-tip roast, excess fat trimmed",
        "2 large shallots, halved lengthwise and thinly sliced crosswise",
        "1 Tbs. all-purpose flour",
        "2 cups low-sodium beef broth",
        "2 Tbs. dry vermouth",
        "2 tsp. Dijon mustard",
        "1 1/2 Tbs. minced fresh thyme, plus more for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Medallions with Spring Mashed Potatoes",
    "url": "http://www.williams-sonoma.com/recipe/beef-medallions-with-spring-mashed-potatoes.html"
}
