{
    "directions": [
        "Put oven rack in middle position and preheat oven to 450°F.",
        "Spread beef shanks, veal shanks, onions, and carrot in a large flameproof roasting pan and roast, turning occasionally, until well browned, about 1 hour.",
        "While shanks roast, wrap parsley, thyme, and bay leaf in cheesecloth and tie with string to make a bouquet garni.",
        "Transfer meat and vegetables to a 6- to 8-quart stockpot. Straddle roasting pan across 2 burners, then add 2 cups water and deglaze pan by boiling over high heat, stirring and scraping up brown bits, 1 minute. Add deglazing liquid to stockpot along with 14 cups water, celery, salt, and bouquet garni. Bring to a boil and skim froth. Add remaining 1/2 cup water, then bring mixture to a simmer and skim froth. Simmer gently, uncovered, 5 hours.",
        "Pour stock through a fine-mesh sieve into a large bowl, pressing hard on solids, and discard solids. If stock measures more than 8 cups, boil until reduced to 8 cups; add water if stock measures less than 8 cups. If using stock right away, skim off and discard fat. If not, cool stock completely, uncovered, before skimming fat (it will be easier to remove when cool), then chill, covered."
    ],
    "ingredients": [
        "2 pounds meaty crosscut beef shanks (preferably 1 inch thick)",
        "2 pounds meaty crosscut veal shanks (preferably 1 inch thick)",
        "2 onions, quartered and left unpeeled",
        "1 carrot, quartered",
        "4 fresh flat-leaf parsley sprigs",
        "1 fresh thyme sprig",
        "1 Turkish or 1/2 California bay leaf",
        "16 1/2 cups cold water",
        "2 celery ribs",
        "1 1/2 teaspoons salt",
        "Special equipment: cheesecloth; kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Vegetable",
        "Roast",
        "Simmer",
        "Gourmet"
    ],
    "title": "Beef Stock",
    "url": "http://www.epicurious.com/recipes/food/views/beef-stock-108710"
}
