{
    "directions": [
        "1. Prick each sausage a half-dozen times with a needle or pin stuck in a cork. Arrange the onion slices on the bottom of a sauté pan just large enough to hold all the sausages. Place the sausages on top and add beer and water to cover (the ratio should be about 3 parts beer to 1 part water). Place the pan over medium heat and gradually bring the liquid to a simmer, not a rapid boil. Poach the sausages until half-cooked, 4 to 5 minutes. Transfer the sausages to a rack on a baking sheet to drain or drain in a colander. Separate the sausages into links.",
        "2. Set up the grill for direct grilling and preheat to medium-high.",
        "3. When ready to cook, brush and oil the grill grate. Lightly brush the sausages on all sides with oil and place on the hot grate. Grill until the casings are crisp and nicely browned and the sausages are cooked through, 4 to 6 minutes per side. You may want to rotate the sausages 90 degrees after 2 minutes on each side to create an attractive crosshatch of grill marks. Should flare-ups arise, move the sausages to a different section of the grill. Use a slender metal skewer to test for doneness. Insert it into the center of one of the sausages: It should come out hot to the touch.",
        "4. Transfer the sausages to plates or a platter and let rest for 3 minutes. Serve with plenty of mustard.",
        "Variations: Poaching is optional and not every grill jockey does it. If you omit the poaching, you'll need to grill the sausages 7 to 10 minutes per side.",
        "For absolutely foolproof sausage grilling, use the indirect method. The sausages will be fully cooked in about 30 minutes."
    ],
    "ingredients": [
        "a needle or pin and a cork",
        "1 cork",
        "3 pounds uncooked sausages, such as sweet or hot Italian sausages, bratwurst, chorizo, linguica, or any other sausages you prefer",
        "1 onion, thinly sliced",
        "3 cups beer, as needed",
        "About 1 tablespoon vegetable oil",
        "Mustard, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pork",
        "Poach",
        "Picnic",
        "Quick & Easy",
        "Dinner",
        "Sausage",
        "Summer",
        "Tailgating"
    ],
    "title": "Beer-Simmered Grilled Sausages",
    "url": "http://www.epicurious.com/recipes/food/views/beer-simmered-grilled-sausages-105455"
}
