{
    "directions": [
        "Preheat the oven to 350°F. In a kettle cook the bacon over moderate heat, stirring, until it is crisp, transfer it to paper towels to drain, and pour off all but 2 tablespoons of the fat. Heat the fat remaining in the kettle over moderately high heat until it is hot but not smoking, in it brown the brisket, patted dry and seasoned with salt and pepper, and transfer it to a platter. Add the onions to the kettle, sauté them until they are golden, and add the bacon, the brisket, and the beer. Bring the beer to a boil and braise the brisket, covered, in the oven for 2 hours. Stir in the rutabaga, the carrots, and the potatoes and braise the mixture for 45 minutes, or until vegetables are tender.",
        "Transfer the brisket and the vegetables with a slotted spoon to a plate and keep them warm, covered. Bring the braising liquid to a boil, boil it until it is reduced to about 3 cups, and bit by bit whisk in the beurre manié, whisking well after each addition. Simmer the sauce for 3 minutes and season it with salt and pepper. Slice the brisket and arrange it and the vegetables with the noodles on a platter. Spoon some of the sauce over the brisket and the vegetables, sprinkle the dish of parsley, and serve the remaining sauce separately."
    ],
    "ingredients": [
        "4 slices of bacon, chopped",
        "a 2 1/2-pound beef brisket",
        "3 onions, sliced thin",
        "four 12-ounce bottles of beer (not dark)",
        "1 large rutabaga (about 2 pounds), peeled and cut into 1/2-inch pieces",
        "6 carrots, cut crosswise into 1 1/2-inch-thick pieces",
        "6 boiling potatoes, cut into 1-inch pieces",
        "a beurre manié made by blending 2 tablespoons softened unsalted butter with 2 tablespoons all-purpose flour",
        "cooked noodles as an accompaniment",
        "1/2 cup minced fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Beef",
        "Potato",
        "Braise",
        "Sauté",
        "Bacon",
        "Carrot",
        "Fall",
        "Rutabaga",
        "Gourmet"
    ],
    "title": "Beer-Braised Brisket with Root Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/beer-braised-brisket-with-root-vegetables-13161"
}
