{
    "directions": [
        "Halve onions lengthwise, then slice lengthwise 1/4 inch thick.",
        "Pat beef dry and season all over with 2 1/2 teaspoons salt and 1 teaspoon pepper. Heat 1 tablespoon oil in a wide 5-to 6-quart heavy pot over medium-high heat until it shimmers. Brown beef on all sides, about 15 minutes, then transfer to a plate.",
        "Cook onions with bay leaves and 1/2 teaspoon salt in remaining tablespoon oil in pot, scraping up brown bits from bottom and stirring occasionally, until onions are well browned, about 25 minutes.",
        "Meanwhile, preheat oven to 350°F with rack in middle. Cut a round of parchment paper the diameter of the inside of pot (near the top). Set parchment round aside.",
        "Add beer and vinegar to onions and bring to a boil, stirring and scraping up brown bits. Add beef and meat juices from plate and return to a boil.",
        "Cover with parchment round and lid and braise in oven until meat is very tender when pierced in several places with a meat fork, about 3 1/2 hours.",
        "Transfer beef to a cutting board and let stand, loosely covered, 20 minutes. Cut off string, then slice meat. Skim off fat from sauce and discard bay leaves. Reheat if necessary.",
        "Serve braised beef with onions and sauce."
    ],
    "ingredients": [
        "3 pounds onions",
        "1 (5-pound) boneless beef chuck roast, tied",
        "2 tablespoons vegetable oil, divided",
        "2 Turkish bay leaves or 1 California",
        "2 (12-ounces) bottles pilsner-style beer such as Budweiser",
        "2 tablespoons red-wine vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Beef",
        "Onion",
        "Braise",
        "Sauté",
        "Super Bowl",
        "Father's Day",
        "Dinner",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Beer-Braised Beef and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/beer-braised-beef-and-onions-351440"
}
