{
    "directions": [
        "Prepare a grill for medium-high heat. Cut a 3x3\" square around core of cabbage at the base. Carefully remove core with knife. Using knife and a spoon, create a 3\"–deep cavity in cabbage, big enough to hold a beer can. Discard core but reserve leftover cabbage from hollowing out cavity. Using a brush, coat cabbage with oil, then season generously with salt and pepper.",
        "Pour out (or drink) half of the beer. Place beer can in cavity of cabbage so cabbage sits upright. Transfer to grill. Using brush, generously coat cabbage with 3 Tbsp. barbecue sauce. Cover grill and cook cabbage, brushing with sauce every 15 minutes, until outer leaves are crispy and dark brown and cabbage is cooked through and tender when pierced with a paring knife, 45–50 minutes total. During the last 5 minutes of cooking, grill white onion rings until charred.",
        "Meanwhile, whisk mayonnaise, vinegar, honey, and remaining 1/2 tsp. salt and 1/4 tsp. pepper in a medium bowl. Thinly slice reserved cabbage. Add to bowl with dressing along with carrot and red onion; toss to combine.",
        "Remove cabbage from grill and discard can. Let cool slightly. Cut grilled cabbage in half lengthwise, then slice each half crosswise into 3/4\" strips. Coarsely chop white onion rings and toss with cabbage in a medium bowl with remaining 1 1/4 cups barbecue sauce (you should have about 6 cups barbecued cabbage).",
        "Halve rolls and grill until toasted, about 30 seconds. Arrange 1 cup barbecued cabbage on each bottom bun. Top each with 2 slices cheese, 1/4 cup cabbage slaw, and pickled jalapeños, if using. Top with top buns.",
        "Barbecued cabbage and coleslaw can be made 3 days ahead; cover separately and chill. Reheat gently in a covered pot on the stovetop or in the microwave."
    ],
    "ingredients": [
        "1 large purple cabbage (about 3 1/2 pounds)",
        "2 tablespoons vegetable oil",
        "1/2 teaspoon kosher salt, plus more",
        "1/4 teaspoon freshly ground black pepper, plus more",
        "1 (12-ounce) can pale lager",
        "2 cups homemade or store-bought barbecue sauce (preferably Kraft Original Barbecue Sauce), divided",
        "1/2 large white onion, cut into 1/2\" rings",
        "1/4 cup mayonnaise",
        "2 tablespoons apple cider vinegar",
        "1/4 teaspoon honey",
        "1 medium carrot (about 6 ounces), coarsely grated using the grater disk on a food processor or the largest holes on a box grater",
        "1/4 cup finely chopped red onion",
        "6 seeded Kaiser rolls or sturdy hamburger buns",
        "12 slices cheddar cheese",
        "Sliced pickled jalapeños (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Grill/Barbecue",
        "Cabbage",
        "Vegan",
        "Flaming Hot Summer",
        "Vegetarian",
        "Dinner",
        "Sandwich",
        "Backyard BBQ",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Beer-Can Cabbage Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/beer-can-cabbage-sandwiches"
}
