{
    "directions": [
        "Place 1 1/4 cups warm water in large bowl. Sprinkle yeast and sugar over; stir to blend. Let stand until yeast dissolves, about 10 minutes. Mix in cornmeal, oil and salt.",
        "Add 3 cups flour to yeast mixture; stir until dough forms. Turn dough out onto floured work surface. Add remaining 1/4 cup flour; knead until dough is smooth and elastic, about 2 minutes.",
        "Lightly oil clean large bowl. Add dough; turn to coat. Cover with plastic wrap, then kitchen towel. Let dough rise in warm draft-free area until doubled in volume, about 45 minutes.",
        "Punch dough down. Turn out onto floured surface; knead briefly until smooth. Return to oiled bowl; turn to coat. Cover with plastic, then kitchen towel. Let dough rise 40 minutes. Punch dough down. Turn out onto floured surface. Divide into 4 pieces. Cover with plastic; chill at least 1 hour or overnight.",
        "Preheat oven to 450°F. Oil 11x15-inch baking sheet. Roll out 1 dough piece to 1/8-inch-thick rectangle. Transfer to prepared baking sheet. Using fingers, gently stretch dough to edges of baking sheet. Bake until golden, puffed and crisp, about 8 minutes. Remove from oven. Top with 1/2 cup mozzarella, 1/4 cup Gorgonzola, 1/4 cup Parmesan and 1 teaspoon garlic. Return cracker to oven; bake until cheese melts and bubbles, about 4 minutes. Remove from oven. Sprinkle with 1 tablespoon each of parsley and green onions. Remove cracker from baking sheet. Cool baking sheet. Repeat with remaining dough, cheeses, garlic, parsley and onions. Break warm crackers into pieces."
    ],
    "ingredients": [
        "1 1/4 cups warm water (105°F to 115°F)",
        "2 envelopes dry yeast",
        "1 teaspoon sugar",
        "1/4 cup white cornmeal",
        "1 tablespoon olive oil",
        "2 teaspoons coarse salt",
        "3 1/4 cups all purpose flour",
        "2 cups grated mozzarella cheese",
        "1 cup crumbled Gorgonzola cheese",
        "1 cup grated Parmesan cheese",
        "4 teaspoons minced garlic",
        "4 tablespoons chopped fresh parsley",
        "4 tablespoons chopped green onions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Garlic",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Blue Cheese",
        "Mozzarella",
        "Parmesan",
        "Poker/Game Night"
    ],
    "title": "Beer Crackers Topped with Garlic and Three Cheeses",
    "url": "http://www.epicurious.com/recipes/food/views/beer-crackers-topped-with-garlic-and-three-cheeses-5904"
}
