{
    "directions": [
        "Preheat oven to 325°F.",
        "In a large bowl soak sauerkraut in cold water to cover 20 minutes, changing water once halfway through soaking.",
        "While sauerkraut is soaking, in a large heavy skillet cook bacon pieces over moderate heat, stirring, until golden. Pour off all but about 2 tablespoons drippings and add onions to bacon. Cook mixture, stirring, until onions are softened.",
        "Drain sauerkraut well in a colander, pressing out excess liquid, and in a large flameproof roasting pan combine with bacon mixture, carrots, beer, broth, bay leaves, salt, and peppercorns. Bring sauerkraut mixture to a boil on top of stove and boil 1 minute. Cover pan tightly with foil and braise in middle of oven 4 hours. Sauerkraut may be prepared up to this point 1 day ahead, cooled, uncovered, and chilled, covered with plastic wrap. Reheat sauerkraut before proceeding.",
        "If desired, in a heavy skillet heat oil over moderate heat until hot but not smoking and in batches brown sausages. Add sausages and pork loin to sauerkraut, partially submerging them. Braise sausages and sauerkraut, covered tightly with foil, in middle of oven 30 minutes and transfer with a slotted spoon to a heated platter, discarding bay leaves if desired. (Do not eat bay leaves if leaving as garnish.)"
    ],
    "ingredients": [
        "9 cups drained sauerkraut (from 5 to 6 pounds packaged, not canned, sauerkraut)",
        "1/4 pound smoked bacon* (preferably slab), cut crosswise into 1/4-inch pieces",
        "2 medium-large onions, sliced thin",
        "4 medium carrots, cut crosswise into 1/4-inch -thick slices",
        "5 1/2 cups Oktoberfest lager (44 ounces) such as Paulaner",
        "1 cup chicken broth",
        "3 bay leaves",
        "1 teaspoon salt",
        "1/2 teaspoon whole black peppercorns",
        "1 tablespoon vegetable oil if desired",
        "1 3/4 pounds assorted smoked and precooked fresh sausages* (we used smoked kielbasa cut into thick slices, frankfurters, and baernwurst, and precooked fresh bratwurst, weisswurst , and chipolata)",
        "a 1-pound piece smoked boneless pork loin (Canadian bacon)*, cut into 4 slices",
        "*available at some specialty butcher shops and some supermarkets and by mail order form Schaller and Weber, tel.(800)847-4115",
        "Accompaniment: coarse-grained mustard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Onion",
        "Pork",
        "Braise",
        "New Year's Day",
        "Bacon",
        "Sausage",
        "Carrot",
        "Winter",
        "Oktoberfest",
        "Gourmet"
    ],
    "title": "Beer-Braised Sausages and Sauerkraut",
    "url": "http://www.epicurious.com/recipes/food/views/beer-braised-sausages-and-sauerkraut-11382"
}
