{
    "directions": [
        "Place pork in a large resealable plastic bag. Whisk lager, soy sauce, brown sugar, and 1 tablespoon vinegar in a small bowl; pour into bag with pork and seal. Chill, turning occasionally, for at least 4 and up to 24 hours.",
        "Preheat oven to 400°F. Heat oil in a large ovenproof skillet over medium-high heat. Remove pork from marinade, allowing any excess to drip off (reserve marinade). Cook pork, turning, until browned on all sides, 8-10 minutes.",
        "Transfer skillet to oven and roast until an instant-read thermometer inserted into thickest part of pork registers 140°F, 10-15 minutes. Transfer to a plate and let rest for at least 10 minutes. Pour reserved marinade into a small saucepan. Bring to a boil, reduce heat, and simmer until slightly thickened, 5-8 minutes.",
        "Meanwhile, melt butter in another large skillet over medium heat. Add cabbage, apple, bay leaves, and 1 cup water; season with salt and pepper. Cook, tossing occasionally, until cabbage is softened, 15-20 minutes. Add remaining 1 teaspoon vinegar and toss to combine.",
        "Slice pork and serve with cabbage mixture and sauce."
    ],
    "ingredients": [
        "2 pork tenderloins (1 1/2-1 3/4 pounds total)",
        "1/4 cup lager",
        "1/4 cup reduced-sodium soy sauce",
        "2 tablespoons (packed) brown sugar",
        "1 tablespoon plus 1 teaspoon apple cider vinegar, divided",
        "3 tablespoons olive oil",
        "2 tablespoons unsalted butter",
        "1/2 medium red cabbage, cored, cut into 1/2\" strips",
        "1 apple, peeled, cored, chopped",
        "2 bay leaves",
        "Kosher salt, freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Pork",
        "Roast",
        "Dinner",
        "Pork Tenderloin",
        "Winter",
        "Cabbage",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Beer-Marinated Pork Tenderloin with Red Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/beer-marinated-pork-tenderloin-with-red-cabbage-51149030"
}
