{
    "directions": [
        "Place steaks in single layer in glass baking dish. Whisk beer, sugar, lime juice, onion, garlic, Worcestershire sauce, mustard, oil, ginger and hot pepper sauce in large bowl to blend. Pour marinade over steaks in baking dish. Cover tightly with plastic wrap and refrigerate overnight.",
        "Bring white wine, chopped shallot and crushed peppercorns to boil in heavy medium saucepan; simmer until mixture is reduced by half, about 5 minutes. Add chicken stock and beef stock and boil until reduced to 2 cups, about 25 minutes. Add whipping cream and cook until sauce coats spoon, about 6 minutes. (Peppercorn sauce can be made up to 2 hours ahead. Set aside at room temperature.)",
        "Prepare barbecue (medium-high heat). Remove steaks from marinade and grill to desired doneness, about 4 minutes per side for medium-rare. Transfer steaks to plates. Meanwhile, bring peppercorn sauce to simmer. Drizzle sauce over steaks."
    ],
    "ingredients": [
        "6 12-ounce top loin (New York strip) steaks",
        "1 12-ounce bottle of dark beer",
        "1/2 cup (packed) dark brown sugar",
        "5 tablespoons fresh lime juice",
        "3 tablespoons minced red onion",
        "6 garlic cloves, chopped",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons whole grain mustard",
        "2 tablespoons olive oil",
        "1 tablespoon minced peeled fresh ginger",
        "1/2 teaspoon hot pepper sauce",
        "1/2 cup white wine",
        "1 shallot, finely chopped",
        "2 tablespoons coarsely crushed four-peppercorn mix*",
        "1 3/4 cups chicken stock or canned low-salt chicken broth",
        "1 3/4 cups beef stock or canned beef broth",
        "1/2 cup whipping cream",
        "*A blend of black, white, pink and green peppercorns found in the spice section of many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Beer-Marinated Steaks with Peppercorn Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/beer-marinated-steaks-with-peppercorn-sauce-103504"
}
