{
    "directions": [
        "Preheat oven to 250°. Using a very sharp knife, score pork in a tight crosshatch pattern to form 1/2\" diamonds, cutting through fat but stopping at flesh. Season with salt and pepper, massaging into cuts.",
        "Heat oil in a large heavy pot over medium-high (if belly doesn't fit, cut in half crosswise). Cook pork, skin side down, turning once, until browned all over, 5-8 minutes per side (be careful, fat will splatter). Transfer to a plate.",
        "Pour off all but 2 tablespoon drippings from pot, add star anise, cloves, and coriander and fennel seeds, and cook over low heat, stirring, until spices are fragrant, about 30 seconds. Add beer and apple juice, scraping up browned bits. Add pork along with onion and carrots, adding water if needed to cover. Bring to a simmer, cover pot, and transfer to oven. Braise pork 3 hours. Add apricots and braise until pork is very tender but not falling apart, 1-2 hours.",
        "Transfer pork, skin side up, to a rimmed baking sheet. Place vegetables and apricots in a large bowl; keep warm. Increase oven temperature to 475°; roast pork until skin is brown and very crisp, 25–35 minutes (the crispier, the better).",
        "Meanwhile, pour braising liquid into a large saucepan and skim off fat. Bring to a boil; reduce heat and simmer until reduced by two-thirds, 25–35 minutes.",
        "Heat butter in a small saucepan over medium-low, stirring often, until it foams, then browns, about 5 minutes. Add brown butter and shallot to braising sauce; season with lemon juice, salt, and pepper.",
        "Cut pork into 8 pieces; serve with sauce, vegetables, and some horseradish."
    ],
    "ingredients": [
        "3 pound skin-on, boneless center-cut pork belly",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons vegetable oil",
        "1 star anise pod",
        "2 whole cloves",
        "1 tablespoon coriander seeds",
        "1 teaspoon fennel seeds",
        "2 12-ounce bottles stout or porter",
        "2 cups unfiltered apple juice or apple cider",
        "1 large onion, thinly sliced into rings",
        "4 medium carrots, peeled, cut on a diagonal into 1\" pieces",
        "3/4 cup coarsely chopped dried apricots",
        "1/2 cup (1 stick) unsalted butter",
        "1 medium shallot, finely chopped",
        "Fresh lemon juice",
        "Finely grated peeled horseradish (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Roast",
        "Dinner",
        "Fall",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Beer-Braised Pork Belly",
    "url": "http://www.epicurious.com/recipes/food/views/beer-braised-pork-belly-51259370"
}
