{
    "directions": [
        "Prepare a kettle grill with charcoal off to one side for indirect grilling and add the soaked apple wood or mesquite wood chips over the coals. Remove the neck and giblets and pat the chicken dry with paper towels. Brush chicken all over with oil and sprinkle with salt and pepper and 3 tablespoons dry rub. Set aside.",
        "Open the beer can, pour out about 1/2 cup of the beer into a cup and drink it (or pour it over the wood chips). Make an extra hole in the top of the can with a church-key can opener. Add the remaining 1 tablespoon dry rub to the beer can (it might fizz up a little bit at the top, but don't worry, that is normal), the garlic and rosemary.",
        "Hold the chicken above the can of beer and slide the chicken over the can. Fold the wings back behind the chicken. Make sure the legs are in front of the can, supporting the chicken. Place the chicken inside a disposable pan.",
        "Place the pan on the grates of the grill on the opposite side of the charcoals, put lid on and cook the chicken until golden brown and the internal temperature registers 160 degrees F in the breast area and 175 degrees F in the thigh area on an instant-read thermometer, 1 to 1 1/2 hours. Remove from the grill (be careful not to spill the contents of the beer can as it will be very hot) and let rest for 10 minutes before carving.",
        "Use a pair of locking tongs and grab the bottom of the beer can to remove from the chicken cavity. Place on a platter or cutting board to rest and cool. Carve and serve."
    ],
    "ingredients": [
        "2 cups mesquite or apple wood chips, soaked in cold water for 1 hour",
        "1 (3 to 4-pound) roasting chicken, preferably kosher (since it has been brined)",
        "Vegetable oil",
        "Kosher salt and freshly ground black pepper",
        "1/4 cup Bobby Flay's 16 Spice Rub for Chicken, or your favorite dry spice rub recipe, divided",
        "1 (12-ounce) can beer",
        "2 cloves garlic, crushed",
        "2 sprigs fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy Grilling Recipes",
        "Grilling",
        "Healthy",
        "Grilled Chicken",
        "Chicken",
        "Poultry Recipes",
        "Beer",
        "Low Calorie",
        "Low-Fat",
        "Low-Carb",
        "Diabetes-Friendly"
    ],
    "title": "Beer Can Chicken",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/beer-can-chicken-recipe"
}
