{
    "directions": [
        "1. Remove and discard the fat just inside the body cavities of the chicken. Remove the package of giblets, and set aside for another use. Rinse the chicken, inside and out, under cold running water, then drain and blot dry, inside and out, with paper towels. Sprinkle 1 tablespoon of the rub inside the body and neck cavities, the rub another 1 tablespoon all over the skin of the bird. If you wish, rub another 1/2 tablespoon of the mixture between the flesh and the skin. Cover and refrigerate the chicken while you preheat the grill.",
        "2. Set up the grill for indirect grilling** placing a drip pan in the center. If using a charcoal grill, preheat it to medium.",
        "If using a gas grill, place all the wood chips in the smoker box and preheat the grill to high; then, when smoke appears, lower the heat to medium.",
        "3. Pop the tab on the beer can. Using a \"church key\" style can opener, make 6 or 7 holes in the top of the can. Pour out the top inch of beer, then spoon the remaining dry rub through the holes into the beer. Holding the chicken upright, with the opening of the body cavity down, insert the beer can into the cavity.",
        "4. When ready to cook, if using charcoal, toss half the wood chips on the coals. Oil the grill grate. Stand the chicken up in the center of the hot grate, over the drip pan. Spread out the legs to form a sort of tripod, to support the bird.",
        "5. Cover the grill and cook the chicken until fall-off-the-bone tender, 2 hours. If using charcoal, add 10 to 12 fresh coals per side and the remaining wood chips after 1 hour.",
        "6. Using tongs, lift the bird to a cutting board or platter, holding the metal spatula underneath the beer can for support. (Have the board or platter right next to the bird to make the move shorter. Be careful not to spill hot beer on yourself.) Let stand for 5 minutes before carving the meat off the upright carcass. (Toss the beer can out along with the carcass.)",
        "1/4 cup paprika",
        "1 tablespoon firmly packed dark brown sugar",
        "1 tablespoon granulated sugar",
        "2 teaspoons salt",
        "2 teaspoons accent (MSG; optional)",
        "1 teaspoon celery salt",
        "1 teaspoon freshly ground black pepper",
        "1 to 3 teaspoons cayenne pepper, or to taste",
        "1 teaspoon dry mustard",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "Combine all the ingredients in a jar, twist the lid on airtight, and shake to mix. Store away from heat or light for up to six months. Makes about 1/2 cup. Enough for 4 to 6 racks of ribs.",
        "To set up you grill for indirect grilling, light the coals. When they are blazing red, use tongs to transfer them to opposite sides of the grill, arranging them in two piles. Some grills have special half-moon-shaped baskets to hold the coals at the sides; others have wire fences that hook onto the bottom gate. Let the coals burn until they are covered with a thin layer of gray ash. Set the drip pan in the center of the grill, between the mounds of coals. Place the food on the grate over the drip pan, and cover the grill. You'll need to add about 10 to 12 fresh briquettes to each side after an hour of cooking.",
        "If you want to add a smoke flavor, add 1 to 2 cups of presoaked wood chips, or 2 to 4 chunks, to the coals just before you start to cook, and again whenever you replenish the coals."
    ],
    "ingredients": [
        "1 large whole chicken (4 to 5 pounds)",
        "3 tablespoons Memphis Rub* or your favorite dry barbecue rub",
        "1 can (12 ounces) beer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Chicken",
        "Poultry",
        "Picnic",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Beer Can Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/beer-can-chicken-102216"
}
