{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Heat 1 tablespoon olive oil in a skillet over medium-low heat; add the bell pepper and onion to the skillet; season with 1/2 teaspoon salt, 1/2 teaspoon garlic powder, and 1/4 teaspoon pepper and cook until soft, about 20 minutes; set aside.",
        "Pour 1 tablespoon olive oil into the skillet and raise the heat to medium; add the sliced steak to the hot oil until; season with 1/2 teaspoon salt, 1/2 teaspoon garlic powder, and 1/4 teaspoon pepper and cook until no longer pink, about 5 minutes. Remove from heat immediately.",
        "Arrange the bread cubes in the bottom of a 9x13 dish. Layer the steak on the bread and then layer the pepper and onion mixture atop the steak; set aside.",
        "Melt the butter in a saucepan. Whisk in the flour to make a paste. Pour in the beer, whisking continually until there are no lumps. Stir in the 1 1/2 teaspoons black pepper, 1 teaspoon garlic powder, parsley, onion powder, 1/2 teaspoon salt, paprika, Worcestershire sauce, soy sauce; stir. As the mixture thickens, pour in the milk. Add the Monterey Jack cheese and American cheese; stir until the cheese is melted. Pour the mixture over the assembled ingredients in the 9x13 pan. Top with provolone cheese slices.",
        "Bake in preheated oven until the provolone cheese melts, about 20 minutes."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "2 green bell peppers, sliced",
        "1 large onion, sliced thin",
        "1/2 teaspoon salt",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon ground black pepper",
        "1 tablespoon olive oil",
        "2 pounds rib-eye steak, sliced thin",
        "1/2 teaspoon salt",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon ground black pepper",
        "3/4 loaf Italian bread, cut into 1 inch cubes",
        "5 tablespoons butter",
        "1/4 cup flour",
        "1 (12 fluid ounce) can or bottle beer",
        "2 teaspoons hot pepper sauce",
        "1 1/2 teaspoons ground black pepper",
        "1 teaspoon garlic powder",
        "1 teaspoon dried parsley",
        "1 teaspoon onion powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon paprika",
        "1/2 teaspoon Worcestershire sauce",
        "1/2 teaspoon soy sauce",
        "1 1/2 cups milk",
        "1 cup shredded Monterey Jack cheese",
        "1 cup shredded American cheese",
        "8 ounces provolone cheese, sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Beer Cheese Philly Steak Casserole",
    "url": "http://allrecipes.com/recipe/135885/beer-cheese-philly-steak-casserole/"
}
