{
    "directions": [
        "Preheat oven to 425°F.",
        "Separately wrap red and golden beets tightly in double layers of foil and roast in middle of oven until tender, 1 to 1 1/2 hours. Unwrap beets.",
        "While beets are cooling slightly, whisk together shallot, lemon juice, salt, and pepper in a small bowl, then add oil in a stream, whisking.",
        "When beets are cool enough to handle, slip off and discard skins. Separately cut red and golden beets into 1/4-inch dice and put in separate bowls. Add 2 1/2 tablespoons dressing to each bowl and toss to coat.",
        "Place cookie cutter in center of 1 of 8 salad plates. Put one eighth of red beets in cutter and pack down with your fingertips. Crumble 2 teaspoons goat cheese on top, then one eighth of golden beets, packing them down. Gently lift cutter up and away from stack. Make 7 more servings in same manner. Drizzle each plate with 1 teaspoon dressing and scatter with some pistachios.",
        "Toss mâche with just enough remaining dressing to coat and gently mound on top of beets. Serve immediately."
    ],
    "ingredients": [
        "3 large red beets (1 2/3 lb without greens)",
        "2 large golden beets (1 lb without greens)",
        "1/4 cup minced shallot",
        "2 tablespoons fresh lemon juice",
        "3/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/4 cup pistachio oil",
        "4 oz soft mild goat cheese",
        "3 tablespoons salted shelled pistachios (not dyed red), coarsely chopped",
        "1 oz mâche (also called lamb's lettuce), trimmed (4 cups)",
        "Special equipment: a 2 1/2-inch round cookie cutter (without handle; at least 2 inches high)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cheese",
        "Nut",
        "Vegetable",
        "Roast",
        "Christmas",
        "Vegetarian",
        "Goat Cheese",
        "Pistachio",
        "Beet",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Beet and Goat Cheese Salad with Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/beet-and-goat-cheese-salad-with-pistachios-107426"
}
