{
    "directions": [
        "1. Bring a medium saucepan of salted water to a boil over high heat. Add beets; return to a boil then reduce heat and cook gently until tender, approximately 15 to 25 minutes. (Miniature beets will take as little as 10 minutes; large beets could take 30 minutes.) Remove pan from heat and allow beets to cool completely in the cooking liquid before draining. (This can take up to one hour, and can also be done up to 1 day in advance — just refrigerate.) Discard the water and slip the beets out of their skins using paper towels to grasp the beets. Trim curly ends, cut beets into wedges; set aside. (Some beets peel more easily than others. Do the peeling over the sink, as it's a messy job. Always slice on a cutting board so as not to stain the countertop.)",
        "2. Cut the goat cheese log into disks, about 1/2-inch thick, yielding 8 to 10 rounds. Place the flour on a small plate. Lightly beat the eggs in a shallow bowl. In another shallow bowl, combine the chopped parsley and breadcrumbs. Line up the three plates next to each other. Dip each goat cheese round first in the flour, turning to coat, then in the egg, then in the bread crumbs.",
        "3. Heat the oil in a medium skillet over medium heat. (a nonstick skillet is best for ease in clean-up.) Add the breaded goat cheese rounds and lightly brown both sides. Use tongs to carefully flip rounds. Drain on paper towels.",
        "4. Warm the butter in a medium saucepan over low heat. Add the beets and cook 3 minutes, stirring to coat. Stir in mint, then lemon juice, salt and pepper.",
        "5. To serve: Place salad greens on plates, top with several wedges of beets and 1 or 2 rounds of warm goat cheese. Drizzle with balsamic vinegar and serve immediately."
    ],
    "ingredients": [
        "2 pounds red and yellow beets (miniature preferred), trimmed",
        "1 log (10 oz) fresh goat cheese, cold (must be cold or cheese won't slice well)",
        "1/2 cup flour",
        "2 large eggs, lightly beaten",
        "2 tablespoons chopped fresh parsley leaves",
        "1/2 cup unseasoned bread crumbs",
        "2 tablespoons extra-virgin olive oil",
        "3 tablespoons butter",
        "3 tablespoons chopped fresh mint leaves",
        "1 tablespoon fresh lemon juice",
        "Salt and pepper to taste",
        "2 heaping cups mesclun salad, washed and dried",
        "2 tablespoons aged balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Vegetable",
        "Lunch",
        "Goat Cheese",
        "Mint",
        "Beet",
        "Spring",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Beet, Mint, and Goat Cheese Salad",
    "url": "http://www.epicurious.com/recipes/food/views/beet-mint-and-goat-cheese-salad-100834"
}
