{
    "directions": [
        "Process all ingredients in a food processor until as smooth as possible.",
        "You should have about 4 cups. Reserve 2 cups for the sauce, and set aside the remainder.",
        "Puree all the ingredients in a high-speed blender until smooth.",
        "Using a mandoline, slice the beets very thin (so they are pliable and not stiff, approximately 1/16 of an inch or less).",
        "Make small stacks of the larger pieces and use a sharp knife to cut into squares-the size doesn't matter much, as long as they are all roughly the same. Alternatively, use a round-, heart-or other- shaped cookie cutter to cut the slices. Cut at least 40 slices-10 per serving, with a few extra to spare.",
        "In a medium bowl, place the beet slices, oil, lemon juice, and salt and toss gently to coat evenly. Allowing the beets to sit for a half hour or more will soften them; this is optional but a good idea if your slices are on the thicker side and still a bit stiff.",
        "Lay half the beet slices on a clean work surface and top each with a rounded teaspoonful of the cheese. Top with the remaining beet slices and press down gently.",
        "Spoon the sauce onto serving plates, and arrange the ravioli on top. Garnish with a few drops of aged balsamic vinegar and a few sprigs of either microgreens or fresh herbs."
    ],
    "ingredients": [
        "4 cups pine nuts, soaked 1 hour or more",
        "1/2 cup extra-virgin olive oil",
        "2 medium shallots, peeled and diced",
        "Zest of 1 lemon",
        "1/2 cup freshly squeezed lemon juice",
        "4 teaspoons nutritional yeast",
        "2 1/2 teaspoons sea salt",
        "Freshly ground black pepper",
        "1/2 recipe Pine Nut \"Goat Cheese\"",
        "1 teaspoon minced rosemary",
        "1 tablespoon freshly squeezed lemon juice",
        "3/4 cup filtered water",
        "Pinch of sea salt",
        "1 clove garlic, peeled",
        "Freshly ground black pepper",
        "2 medium beets (2 inches in diameter or more), peeled",
        "2 tablespoons macadamia oil, or other nut oil, or extra-virgin olive oil",
        "1 tablespoon freshly squeezed lemon juice",
        "1/2 teaspoon sea salt",
        "2 tablespoons high-quality aged balsamic vinegar",
        "Microgreens or other herbs, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Food Processor",
        "Nut",
        "Valentine's Day",
        "Vegetarian",
        "Dinner",
        "Condiment",
        "Vinegar",
        "Rosemary",
        "Tree Nut",
        "Pine Nut",
        "Root Vegetable",
        "Beet",
        "Vegan",
        "Raw",
        "Engagement Party"
    ],
    "title": "Beet Ravioli with Pine Nut \"Goat Cheese\" Rosemary-Cream Sauce, Aged Balsamic Vinegar",
    "url": "http://www.epicurious.com/recipes/food/views/beet-ravioli-with-pine-nut-goat-cheese-rosemary-cream-sauce-aged-balsamic-vinegar-354390"
}
