{
    "directions": [
        "Bring broth and 5 cups water to a boil in a large pot over high heat. Reduce heat to low and gently simmer.",
        "Meanwhile, peel beets, then coarsely shred using a food processor fitted with the shredder attachment or the large holes of a box grater.",
        "Heat a large wide pot or sauté pan over medium-high. Cook butter and oil, stirring occasionally, until butter melts. Add onion and sauté until softened and translucent, about 5 minutes. Add beets, 1 tsp. salt, and 1/2 tsp. pepper and sauté until tender, about 10 minutes more.",
        "Add rice and cook, stirring constantly, about 2 minutes, then add 1 1/2 cups broth, 3 tsp. vinegar, and 1 tsp. salt. Reduce heat to medium and simmer, stirring constantly, until liquid has evaporated. Continue adding broth, 3/4 cup at a time as rice absorbs liquid, stirring constantly and simmering until rice is tender, 30–40 minutes; season with 1 tsp. salt and 1/2 tsp. pepper halfway through. About 2 minutes before rice is al dente, add cream, 2 Tbsp. parsley, remaining 1 tsp. vinegar, 1/2 tsp. salt, and 1/4 tsp. pepper.",
        "Divide among 4 plates or bowls, then top with goat cheese, if using, and remaining 2 Tbsp. parsley."
    ],
    "ingredients": [
        "4 cups low-sodium chicken or vegetable broth",
        "3 medium red or golden beets (about 1 pound)",
        "2 tablespoons unsalted butter",
        "2 tablespoons olive oil",
        "1 medium onion, finely chopped",
        "3 1/2 teaspoons kosher salt, divided",
        "1 1/4 teaspoons freshly ground black pepper, divided",
        "1 1/2 cups arborio or carnaroli rice",
        "4 teaspoons white wine or Champagne vinegar, divided, plus more",
        "3 tablespoons heavy cream",
        "4 tablespoons coarsely chopped parsley, divided",
        "2 ounces fresh goat cheese, crumbled (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Rice",
        "Kid-Friendly",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Goat Cheese",
        "Beet",
        "Healthy",
        "Low Cholesterol",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Beet Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/beet-risotto-56389492"
}
