{
    "directions": [
        "Preheat oven to 400°F. Place beets on large sheet of foil. Drizzle with 1 tablespoon olive oil; sprinkle with coarse salt. Wrap beets in foil. Roast beets until tender when pierced with fork, about 1 hour. Unwrap and cool beets. Peel, then cut each into 8 wedges.",
        "Bring 3 cups water, 1/2 cup sugar, and pinch of coarse salt to simmer in large saucepan, stirring until sugar dissolves. Add rhubarb. Simmer over medium heat until just tender but still intact, 1 to 2 minutes (do not overcook or rhubarb will be mushy). Using slotted spoon, transfer rhubarb to platter and cool completely. DO AHEAD: Beets and rhubarb can be made 1 day ahead. Cover separately and chill.",
        "Finely grate enough peel from 1 orange to measure 1/2 teaspoon; transfer to small bowl and reserve for dressing. Cut off peel and white pith from all oranges. Working over medium bowl to catch juice and using small sharp knife, cut between membranes to release orange segments into bowl; squeeze membranes to release juice into bowl. Transfer 2 tablespoons orange juice to bowl with orange peel. Whisk vinegar, lemon juice, shallot, honey, and remaining 3 tablespoons olive oil into bowl with orange peel and orange juice mixture. Season dressing with coarse salt and pepper.",
        "Arrange watercress, beets, rhubarb, and orange segments on 6 plates. Sprinkle with feta and drizzle with dressing. Garnish with chervil leaves, if desired, and serve."
    ],
    "ingredients": [
        "8 2- to 2 1/2-inch-diameter red or yellow beets, 4 of each color if available",
        "4 tablespoons extra-virgin olive oil, divided",
        "Coarse kosher salt",
        "3 cups water",
        "1/2 cup sugar",
        "1 pound trimmed rhubarb stalks, cut diagonally into 1/2-inch-thick slices",
        "3 large oranges",
        "2 tablespoons unseasoned rice vinegar",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon minced shallot",
        "1 teaspoon honey",
        "3 cups watercress sprigs",
        "1 1/4 cups coarsely crumbled feta cheese (about one 7-ounce package)",
        "Fresh chervil leaves (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Spritzer",
        "Side",
        "Roast",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Feta",
        "Orange",
        "Healthy",
        "Rhubarb",
        "Watercress",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Beet, Rhubarb, and Orange Salad",
    "url": "http://www.epicurious.com/recipes/food/views/beet-rhubarb-and-orange-salad-357916"
}
