{
    "directions": [
        "Preheat an oven to 400°F.",
        "Trim the root and stem ends from the beets and wrap them in heavy-duty aluminum foil, making a separate packet for each color, if using. Bake until the beets are easily pierced with a sharp knife, 45 minutes to 1 hour. Unwrap and let cool. Gently peel the beets with your fingers or a paring knife. Cut into quarters and put in a small bowl.",
        "Meanwhile, place the eggs in a saucepan and add water to cover by 1 inch. Bring to a boil over medium-high heat. Remove the pan from the heat, cover and let stand until the eggs are done to your liking, about 10 minutes for slightly runny yolks and up to 14 minutes for firm yolks. Drain the eggs, then transfer to a bowl of ice water to cool slightly, about 2 minutes. Peel the eggs and cut them lengthwise into quarters. Sprinkle each quarter lightly with salt and pepper.",
        "In a large bowl, whisk together the olive oil, vinegar, orange juice, orange zest and the 1/2 tsp. salt to make a dressing. Pour half of the dressing over the beets and stir to coat. In another large bowl, combine the watercress and the remaining dressing and toss to coat.",
        "Mound the watercress on individual plates or on a large platter and top with the beets. Arrange the egg quarters around the beets and drizzle with any dressing left behind in the watercress bowl. Sprinkle with a few grindings of pepper and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Good for You,",
        "by Dana Jacobi (Weldon Owen, 2013)."
    ],
    "ingredients": [
        "1 1/2 to 1 3/4 lb. baby beets",
        "6 to 8 organic eggs",
        "Sea salt, to taste, plus 1/2 tsp.",
        "Freshly ground pepper, to taste",
        "3 Tbs. extra-virgin olive oil",
        "2 Tbs. Champagne vinegar",
        "2 Tbs. fresh orange juice",
        "1 tsp. finely grated orange zest",
        "4 oz. watercress, tough stems removed, leaves torn into\n  bite-size pieces"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beet and Watercress Salad with Farm Eggs",
    "url": "http://www.williams-sonoma.com/recipe/beet-watercress-salad-farm-eggs.html"
}
