{
    "directions": [
        "In medium bowl, stir together sour cream and horseradish. Cover and refrigerate until ready to use.",
        "In 6-quart stock pot over moderate heat, heat oil until hot but not smoking. Add onions, celery, and garlic and sauté until onions are translucent, about 10 minutes. Add beets and stir until lightly coated with oil. Add 8 cups water, cover, and bring to boil. Reduce heat to low and simmer until beets are tender and easily pierced with fork but not falling apart, about 1 hour.",
        "Remove from heat and stir in lemon juice, sugar, coriander, salt, and pepper. Serve hot, topped with horseradish cream, or serve chilled.",
        ": If you plan on serving this soup at two seders and want some variety on the second night, try this twist that combines Eastern European knaidlach (matzoh balls) and Middle Eastern kibbeh (meatballs): Prepare matzoh ball dough (you can use a packaged mix) and chill at least 15 minutes. Meanwhile, in a large bowl, stir together ground beef or lamb, chopped onion, chopped celery, chopped fresh mint, a pinch of cinnamon, a pinch of nutmeg, salt, and pepper. Form the meat into mini-meatballs. Wrap matzoh ball dough around each meatball to form \"knaidlach kibbeh.\" Boil the balls according to the package directions (the meat will cook inside them). Place two balls in each bowl of hot soup."
    ],
    "ingredients": [
        "1 1/2 cups nondairy sour cream, soy yogurt, or regular sour cream",
        "3 tablespoons finely grated peeled fresh horseradish root",
        "3 tablespoons olive oil",
        "1 medium onion, finely chopped",
        "3 stalks celery, finely chopped",
        "2 garlic cloves, minced",
        "4 medium beets, peeled and cut into 1/2-inch cubes",
        "3 tablespoons fresh lemon juice",
        "1 tablespoon sugar",
        "2 teaspoons ground coriander",
        "1 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Citrus",
        "Garlic",
        "Onion",
        "Vegetable",
        "Passover",
        "Horseradish",
        "Beet"
    ],
    "title": "Beet Soup with Horseradish Cream",
    "url": "http://www.epicurious.com/recipes/food/views/beet-soup-with-horseradish-cream-237997"
}
