{
    "directions": [
        "Place beets in deep large microwave-safe bowl. Add enough water to reach depth of 1 inch. Cover with plastic wrap and microwave on high until beets are tender, about 15 minutes.",
        "Meanwhile, finely grate enough peel from tangerines to measure 2 teaspoons. Cut top and bottom off each tangerine. Cut off all peel and white pith, following contour of fruit. Cut each tangerine horizontally into 1/3-inch-thick rounds, removing any seeds. Whisk oil, cranberry juice concentrate, vinegar, and reserved tangerine peel in small bowl to blend. Season dressing to taste with salt and pepper. Mix in onion.",
        "Hold 1 beet under cold running water and rub off skin. Repeat with remaining 2 beets. Cut beets horizontally into 1/4- to 1/3-inch-thick rounds. Sprinkle beets with salt and pepper.",
        "Arrange watercress sprigs on large platter to cover. Arrange beet rounds and tangerine rounds atop watercress. Using fork, lift onion slices from dressing and arrange over salad. Drizzle with dressing."
    ],
    "ingredients": [
        "3 2 1/2-inch-diameter red beets, tops trimmed",
        "3 large tangerines (such as Murcott)",
        "3 tablespoons extra-virgin olive oil",
        "3 tablespoons frozen cranberry juice cocktail concentrate, thawed",
        "1 tablespoon raspberry vinegar or red wine vinegar",
        "1/3 cup paper-thin slices red onion",
        "1 large bunch watercress, thick stems trimmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Cranberry",
        "Beet",
        "Healthy",
        "Low Cholesterol",
        "Tangerine",
        "Christmas Eve",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Beet and Tangerine Salad with Cranberry Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/beet-and-tangerine-salad-with-cranberry-dressing-362269"
}
