{
    "directions": [
        "Preheat oven to 400°F.",
        "Tightly wrap beets in double layers of foil to make 3 packages (2 large beets or 4 medium per package) and roast on a baking sheet in middle of oven until tender, 1 1/4 to 1 1/2 hours. Cool to warm in foil packages (the steam makes beets easier to peel), about 30 minutes.",
        "While beets are roasting, cook onions in butter in a 12-inch heavy skillet, covered, over moderately low heat, stirring occasionally, until soft, about 20 minutes. Add salt, sugar, and vinegar and cook, uncovered, stirring occasionally, until onions are very tender and caramelized to deep brown, about 20 minutes more. Add wine and boil, stirring occasionally, until liquid is reduced to about 2 tablespoons, 3 to 5 minutes. Transfer mixture to a food processor and pulse to a coarse purée. Return to skillet and season with salt and pepper, then reheat onion marmalade, covered, over low heat.",
        "While marmalade is reheating, peel beets, discarding stems and root ends, and cut crosswise into 1/8-inch-thick slices with slicer.",
        "Divide warm marmalade among 6 dinner plates and spread evenly in a very thin layer to cover bottom of each plate using offset spatula. Arrange beet slices in 1 layer over onion, overlapping them only enough to cover onions. Drizzle 2 teaspoons oil over each serving and season with pepper. Shave 4 to 6 curls of Parmigiano-Reggiano with a vegetable peeler over beets on each plate. Serve immediately.",
        "Available at many cookware stores and Uwajimaya (800-899-1928)."
    ],
    "ingredients": [
        "6 large or 12 medium beets (3 lb with greens), trimmed, leaving 1 inch of stems attached",
        "3 medium onions (1 lb), halved lengthwise and thinly sliced crosswise",
        "3 tablespoons unsalted butter",
        "1/2 teaspoon salt",
        "1/2 teaspoon sugar",
        "2 teaspoons balsamic vinegar",
        "1/3 cup dry white wine",
        "1/4 cup extra-virgin olive oil",
        "1 (1/2-lb) piece Parmigiano-Reggiano",
        "Special equipment: a Japanese Benriner* or other adjustable-blade slicer; a small offset spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Vegetable",
        "Appetizer",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "Parmesan",
        "Beet",
        "White Wine",
        "Fall",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Beet Carpaccio",
    "url": "http://www.epicurious.com/recipes/food/views/beet-carpaccio-107340"
}
