{
    "directions": [
        "Salt the short ribs and, if possible, allow them to sit overnight or for several hours in the refrigerator. (If you don't have time for this step, salt the short ribs and proceed directly to the next step.)",
        "Heat one tablespoon of olive oil in a stockpot on high heat, and brown the short ribs in batches.",
        "Remove the ribs from the pot, turn the heat down to medium-high, then add the onions and garlic, which will deglaze the pan. Stir occasionally.",
        "Brown the onions and garlic.",
        "Put the meat back into pot, cover with water (approximately 8 cups), and simmer for one hour.",
        "Add the soaked lima beans, and simmer for another 30 minutes.",
        "Add the cut vegetables and enough water to generously cover them.",
        "Simmer for 45 minutes or until the vegetables are softened and their flavors are melding together.",
        "Add some of the dill now (reserve the rest for a garnish when you serve the soup).",
        "The meat should be pulling off the bone at this point, and the bones can be discarded. If the meat has not yet reached this stage of doneness, it can be cut up into chunks and put back into the soup to finish cooking."
    ],
    "ingredients": [
        "3 pounds beef short ribs",
        "Olive oil for browning meat",
        "2 onions, finely chopped",
        "4 cloves garlic, thinly sliced",
        "1 cup dried lima beans or other large dried white beans, soaked overnight",
        "4 carrots peeled and cut into 3/4-inch rounds",
        "6 beets peeled and cut into 1-inch chunks",
        "2 parsnips peeled and cut into 3/4-inch rounds",
        "1 knob celery root peeled and cut into 1/2-inch cubes",
        "1 pound green cabbage, thickly shredded",
        "1 bunch of dill, roughly chopped",
        "1 bunch scallion, finely cut",
        "Salt",
        "Freshly ground pepper",
        "Red wine vinegar",
        "Sour cream for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Vegetable",
        "Braise",
        "Sauté",
        "Beef Rib",
        "Lima Bean",
        "Beet",
        "Carrot",
        "Winter",
        "Family Reunion",
        "Kosher"
    ],
    "title": "Beet and Braised Beef Soup",
    "url": "http://www.epicurious.com/recipes/food/views/beet-and-braised-beef-soup-231229"
}
