{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Wrap beets in aluminum foil to make a packet.",
        "Place packet in the oven and roast until beets are softened but still firm, about 20 to 25 minutes. Remove from oven and set aside to cool. Raise oven temperature to 400 degrees F (200 degrees C).",
        "Wash chopped beet greens and drain well.",
        "Roll puff pastry to fit the bottom and sides of a 9-inch spring-form pan, trimming as needed. Prick bottom pastry in a few places with a fork, line the pastry with aluminum foil, and cover with pie weights or dried beans.",
        "Bake pastry for 10 minutes and remove from oven. Remove foil and weights. Reduce oven temperature to 325 degrees F (165 degrees C).",
        "Heat olive oil in a large skillet over medium heat. Add diced onion, zucchini, and jalapeno; cook and stir until onion is translucent and vegetables begin to soften, about 5 minutes. Stir in beet greens until they begin to wilt. Remove skillet from heat and mix in basil.",
        "Whisk eggs and milk together in a bowl. Season with salt and pepper.",
        "Slip the skins off the beets and cut into 1/4-inch slices.",
        "Arrange zucchini-greens mixture evenly over the bottom of the pastry. Lay beet slices over the top. Slowly pour egg-milk mixture over beets, taking care not to overflow edge of the pastry.",
        "Bake in preheated oven until tart is puffed and firm, 40 to 50 minutes. Let cool for 1/2 hour before slicing."
    ],
    "ingredients": [
        "4 beets (with greens), beets trimmed and greens chopped",
        "1 sheet frozen puff pastry, thawed",
        "1 tablespoon olive oil",
        "1 onion, diced",
        "1 large zucchini, diced",
        "1 small red jalapeno pepper, minced",
        "1/4 cup roughly chopped basil leaves",
        "5 eggs, lightly beaten",
        "1 1/2 cups milk",
        "3/4 teaspoon salt, or to taste",
        "1/4 teaspoon fresh ground black pepper, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Beet, Greens, and Zucchini Tart",
    "url": "http://allrecipes.com/recipe/253158/beet-greens-and-zucchini-tart/"
}
