{
    "directions": [
        "Peel beets with a vegetable peeler, then slice paper-thin with slicer, using stems as handles.",
        "Bring water and sugar to a boil in a 3-quart heavy saucepan, stirring until sugar is dissolved. Add beets, then remove pan from heat and let stand15 minutes. Drain beets in a colander, discarding liquid, then let stand in colander 15 minutes more.",
        "Put oven rack in middle position and preheat oven to 225°F.",
        "Line a shallow baking pan with nonstick liner, then arrange beet slices snugly in 1 layer (it's not necessary to use any partial or broken slices) and season with salt and pepper. Bake beets until dry, about 1 hour. Immediately transfer chips to a rack to cool (chips will crisp as they cool).",
        "Cook shallot in oil in a small skillet over moderate heat, stirring frequently, until golden, 3 to 4 minutes. Stir in curry powder and cook, stirring, 1 minute.",
        "Stir shallot into sour cream in a bowl along with chives, salt, and pepper. Serve curried cream with beet chips."
    ],
    "ingredients": [
        "2 medium beets with stems trimmed to 1 inch (1 lb total, including greens)",
        "1 cup water",
        "1 cup sugar",
        "2 tablespoons finely chopped shallot",
        "1 tablespoon olive oil",
        "3/4 teaspoon Madras curry powder",
        "3/4 cup sour cream",
        "11/2 tablespoons finely chopped fresh chives",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "Special equipment: a Japanese Benriner or other adjustable-blade slicer; a nonstick bakeware liner such as Silpat",
        "Garnish: fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Curry",
        "Beet",
        "Summer",
        "Chive",
        "Sour Cream",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Beet Chips with Curried Sour Cream",
    "url": "http://www.epicurious.com/recipes/food/views/beet-chips-with-curried-sour-cream-109510"
}
