{
    "directions": [
        "Preheat oven to 450°F with rack in middle.",
        "Wrap beets in foil and roast until tender, about 1 1/2 hours. Let stand until cool enough to handle, then slice crosswise into 1/4-inch-thick rounds. Cool completely.",
        "Meanwhile, finely grate ginger with a Microplane over a kitchen-towel-lined bowl. Carefully gather towel around ginger and squeeze until you have 2 tablespoons ginger juice. Whisk in orange juice, sugar, and oil. Season with salt and pepper. Divide vinaigrette evenly between 2 small bowls.",
        "Cut pears lengthwise around core into 1/4-inch-thick slices. Cut out 18 rounds from slices using cookie cutter and put in one bowl of vinaigrette.",
        "Cut out 18 rounds from beet slices and put in other bowl. Toss pears and beets with vinaigrette to coat well.",
        "To assemble napoleons, put 1 beet round on each of 6 plates (see cooks' note, below) and top with a tarragon leaf. Top with 1 pear round, then another tarragon leaf. Repeat layering 2 more times. Discard vinaigrette used for beets.",
        "Toss greens with some of remaining vinaigrette and place around each napoleon. Finely grate apple (including skin) into a bowl. Spoon a heaping teaspoon apple on top of each napoleon, then sprinkle with sea salt and poppy seeds. Drizzle with more vinaigrette if desired."
    ],
    "ingredients": [
        "2 trimmed medium red beets (about 3 1/2 inches in diameter; about 1 3/4 pounds), scrubbed",
        "1 (4-inch) piece peeled ginger",
        "1/3 cup fresh orange juice",
        "1/4 teaspoon sugar",
        "1 1/2 tablespoons extra-virgin olive oil",
        "2 large firm-ripe Anjou pears",
        "1 bunch tarragon",
        "1 cup mixed baby greens (preferably spicy)",
        "1 Granny Smith apple",
        "Equipment: a 1-inch round cookie cutter",
        "Garnish: sea salt such as Maldon; poppy seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Ginger",
        "Side",
        "Vegetarian",
        "Pear",
        "Beet",
        "Healthy",
        "Tarragon",
        "Gourmet",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Beet and Pear Napoleons with Ginger Juice Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/beet-and-pear-napoleons-with-ginger-juice-vinaigrette-355550"
}
