{
    "directions": [
        "Combine 4 tablespoons ice water and cider vinegar in small bowl. Blend flour and salt in processor. Add butter and cut in using on/off turns until mixture resembles coarse meal. With machine running, slowly add water-vinegar mixture, processing until moist clumps form. If dough seems dry, add ice water by teaspoonfuls.",
        "Gather dough into ball; flatten into disk. Wrap in plastic and refrigerate at least 2 hours. DO AHEAD: Can be made 3 days ahead. Keep refrigerated. Allow dough to soften slightly at room temperature before rolling out.",
        "Position rack in center of oven and preheat to 375°F. Roll dough out on lightly floured work surface to 12-inch round. Transfer to 9-inch-diameter tart pan with removable bottom. Press dough onto bottom and up sides. Fold in overhang and press to extend dough 1/2 inch above sides of pan. Line pan with foil and dried beans or pie weights. Bake until dough looks dry and set, about 30 minutes. Remove foil and beans and continue to bake until crust is pale golden, 20 to 25 minutes longer. Remove from oven and cool while preparing filling.",
        "Whisk milk, cream, egg, egg yolk, and salt in medium bowl to blend. Sprinkle 1/4 cup cheese over bottom of warm crust; spread leek confit over and sprinkle with remaining cheese. Pour milk mixture over. Bake until filling has puffed, is golden in spots, and center looks set, 35 to 40 minutes. Transfer to rack; cool slightly. Remove pan sides. Serve warm or at room temperature."
    ],
    "ingredients": [
        "4 tablespoons (or more) ice water",
        "3/4 teaspoon apple cider vinegar",
        "1 1/2 cups unbleached all purpose flour",
        "3/4 teaspoon salt",
        "1/2 cup (1 stick) plus 1 tablespoon chilled unsalted butter",
        "1/2 cup whole milk",
        "1/2 cup heavy whipping cream",
        "1 large egg",
        "1 large egg yolk",
        "1/4 teaspoon salt",
        "1/2 cup crumbled aged goat cheese (such as Bûcheron), rind trimmed",
        "1 1/2 cups Leek Confit"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Bake",
        "Vegetarian",
        "Mother's Day",
        "Lunch",
        "Goat Cheese",
        "Leek",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Belgian Leek Tart with Aged Goat Cheese (_Flamiche Aux Poireaux_)",
    "url": "http://www.epicurious.com/recipes/food/views/belgian-leek-tart-with-aged-goat-cheese-em-flamiche-aux-poireaux-em-350098"
}
