{
    "directions": [
        "1. Mix together the turmeric, black pepper, cayenne pepper, and caraway seeds. Add the tilapia pieces and toss to coat. Cover and let sit for 30 minutes in the refrigerator.",
        "2. In a blender, combine the yogurt and flour and set aside. Heat 3 tablespoons of the oil in a medium skillet over medium-high heat. Add the mustard seeds and cook, stirring, until sputtering and fragrant, about 1 minute. Add the onion and cook, stirring, until translucent, about 3 minutes. Add the garlic and curry powder and cook for another 2 minutes. Add the cream and the yogurt mixture and bring to a simmer. Reduce the heat to low and simmer until the sauce is thick, about 5 minutes.",
        "3. In a nonstick pan, heat the remaining 2 tablespoons oil over medium heat. Gently fry the seasoned fish until crisp on both sides, about 3 minutes per side. Add the yogurt mixture to the fried fish and simmer until fish is cooked through, about 5 minutes.",
        "4. Season with salt and serve hot, garnished with fresh cilantro."
    ],
    "ingredients": [
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon caraway seeds",
        "1 pound tilapia fillets, cut into 1- to 2-inch pieces",
        "1 cup plain, lowfat yogurt",
        "1 tablespoon all-purpose flour",
        "5 tablespoons vegetable oil",
        "1 tablespoon black mustard seeds",
        "1 medium red onion, finely chopped",
        "1 tablespoon finely chopped garlic",
        "1 tablespoon curry powder",
        "1 1/4 cups heavy cream",
        "Salt",
        "2 tablespoons finely chopped fresh cilantro, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fish",
        "Fry",
        "Marinate",
        "Yogurt",
        "Dinner",
        "Seafood",
        "Tilapia",
        "Spice",
        "Curry",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Bengali-Style Fish in Yogurt Curry",
    "url": "http://www.epicurious.com/recipes/food/views/bengali-style-fish-in-yogurt-curry-367030"
}
