{
    "directions": [
        "Combine lamb, oil, rosemary, and garlic in a large sealable heavy-duty plastic bag. Seal bag, forcing out excess air, and marinate lamb, chilled, turning bag several times, 8 to 24 hours.",
        "Preheat oven to 425°F.",
        "Stir together berbere, mustard, yolk, and bread crumbs, then stir in enough red wine to form a paste.",
        "Drain lamb, discarding marinade. Heat a dry 12-inch heavy skillet over high heat until hot, then brown lamb, 1 rack at a time, over moderately high heat, about 3 minutes per side (do not brown ends). Transfer, ribs side down, as browned to a large roasting pan.",
        "Smear berbere paste on fat sides of lamb and roast in middle of oven until an instant-read thermometer inserted 2 inches into center of a rack (without touching bone) registers 140°F for medium-rare, 25 to 30 minutes.",
        "Toast berbere in a dry small heavy saucepan over moderately low heat, stirring constantly, until very fragrant, about 1 minute. Add stock and wine and bring to a boil. Remove from heat and whisk in butter until incorporated.",
        "Transfer lamb to a cutting board and let stand 5 minutes. Cut lamb into chops and serve with sauce."
    ],
    "ingredients": [
        "2 frenched racks of lamb (1 1/2 lb each)",
        "1/2 cup olive oil",
        "1 1/2 tablespoons coarsely chopped fresh rosemary",
        "1 large garlic clove, smashed",
        "1 tablespoon berbere berbere",
        "2 teaspoons Dijon mustard",
        "2 teaspoons beaten egg yolk",
        "1/4 cup fine bread crumbs made from day-old firm sandwich bread",
        "1 to 2 tablespoons dry red wine",
        "2 tablespoonsberbere berbere",
        "1/2 cup chicken stock or broth",
        "1 tablespoon dry red wine",
        "2 tablespoons cold unsalted butter, cut into pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Marinate",
        "Roast",
        "Dinner",
        "Meat",
        "Spice",
        "Fall",
        "Winter",
        "Anniversary",
        "Birthday",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Berbere-Crusted Rack of Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/berbere-crusted-rack-of-lamb-104014"
}
