{
    "directions": [
        "Bring the fish stock to a boil in a large pot. Add the vegetables, reduce the heat, and let simmer for 5 minutes.",
        "If you are using flour, whisk it together with the cream in a small bowl, add the cream to the soup, and bring to a boil. Add the sugar and vinegar to taste; the soup should have a subtle sweet-and-sour flavor. Add the veal stock, if using, and salt to taste. Add the fish and fish dumplings, bring to a boil, reduce the heat, and simmer for 7 to 8 minutes, until the fish is just cooked.",
        "In the meantime, whisk together the egg yolks and sour cream in a small bowl. Pour the soup into bowls, dividing the fish and dumplings evenly. Gently stir 2 to 3 tablespoons of the sour cream mixture into each bowl. Sprinkle with chives, if desired, and serve."
    ],
    "ingredients": [
        "3 quarts fish stock (see Tips, below)",
        "4 carrots, cut into 1-inch by 1/4-inch sticks",
        "1 large celeriac, peeled and cut into 1-inch by 1/4-inch sticks",
        "2 small parsley roots or parsnips, peeled and cut into 1-inch by 1/4-inch sticks",
        "2 celery stalks, chopped",
        "1 to 2 tablespoons all-purpose flour for thickening (optional)",
        "1 cup heavy (whipping) cream",
        "2 tablespoons sugar",
        "1/4 cup good red wine vinegar, or to taste",
        "1/2 cup salted veal stock (optional)",
        "Fine sea salt",
        "1 1/2 pounds mixed fish fillets, such as salmon, cod, and halibut, or other firm white-fleshed fish, cut into 2-inch chunks",
        "1 recipe Fish Dumplings",
        "3 large egg yolks",
        "One 8-ounce container sour cream",
        "Chopped fresh chives for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Fish",
        "Sauté",
        "Stew",
        "Quick & Easy",
        "Cod",
        "Halibut",
        "Salmon",
        "Celery",
        "Carrot",
        "Parsnip",
        "Fall",
        "Spring",
        "Chive",
        "Sour Cream",
        "Simmer"
    ],
    "title": "Bergen Fish Soup",
    "url": "http://www.epicurious.com/recipes/food/views/bergen-fish-soup-234996"
}
