{
    "directions": [
        "1. At least 8 hours before serving the tiramisù, combine the blueberries, granulated sugar, and lemon juice in a heavy-bottomed, nonreactive medium saucepan. Bring to a boil over medium heat, stirring occasionally to dissolve the sugar. Reduce the heat to medium and simmer, uncovered, until the berries give off their juices, about 5 minutes. Add the raspberries and cook until they are heated through but still hold their shape, about 2 minutes. Remove from the heat.",
        "2. Arrange half of the ladyfingers in a 9 x 13-inch baking dish, trimming them as necessary to fit. Spoon half of the hot berry sauce evenly over the ladyfingers. Top with the remaining ladyfingers, then the remaining sauce. Let stand until cooled, about 30 minutes.",
        "3. Combine the mascarpone and confectioner's sugar in a medium bowl. Using an electric mixer on low speed, gradually beat in the heavy cream. Spread the mascarpone mixture over the ladyfingers. Cover loosely with plastic wrap and refrigerate until chilled, at least 4 hours. (The tiramisù can be made and refrigerated up to 1 day ahead.) Serve chilled."
    ],
    "ingredients": [
        "3 pints blueberries",
        "2/3 cup granulated sugar",
        "3 tablespoons fresh lemon juice",
        "3 (6-ounce) containers raspberries",
        "About 40 Italian-style ladyfingers (savoiardi)",
        "1 (16- to 17.5-ounce) container mascarpone, at room temperature",
        "2/3 cup confectioner's sugar",
        "1 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Berry",
        "Dessert",
        "Kid-Friendly",
        "Back to School",
        "Blueberry",
        "Lemon",
        "Fall",
        "Spring",
        "Birthday",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Berry Tiramisu",
    "url": "http://www.epicurious.com/recipes/food/views/berry-tiramisu-243069"
}
