{
    "directions": [
        "Preheat oven to 425°F.",
        "Unfold pastry sheet, then turn over (to prevent creases from splitting during baking). Cut 6 (4 1/2-inch) triangles from sheet with a long sharp knife and a ruler.",
        "Arrange triangles on a greased baking sheet and lightly prick centers a few times with a fork. Bake in middle of oven until puffed and golden brown, 15 to 18 minutes. Transfer to a rack and cool.",
        "Stir together cornstarch, water, and lemon juice in a small saucepan. Add berries and sugar and simmer over moderately high heat, stirring and breaking up berries, until thickened, 3 to 4 minutes. Force purée through a fine sieve into a bowl, pressing hard on solids, then cool purée at room temperature.",
        "Boil wine in another small saucepan until reduced to about 1 tablespoon, 10 to 12 minutes, then cool.",
        "Beat cream with confectioners sugar and zest in a bowl until it just holds stiff peaks. Fold wine into cream until just incorporated, then chill.",
        "Split each pastry triangle in half horizontally and make a sandwich with about 1 1/2 tablespoons cream. Spread 1 teaspoon purée on top of each pastry, leaving a 1/4-inch border (there will be purée left over). Decoratively arrange some raspberries and blackberries on top and sift some confectioners sugar over berries."
    ],
    "ingredients": [
        "1 frozen puff pastry sheet (from a 17 1/4-oz package), thawed",
        "1 1/2 teaspoons cornstarch",
        "2 tablespoons water",
        "1/2 teaspoon fresh lemon juice",
        "1/2 cup raspberries",
        "1/2 cup blackberries",
        "3 tablespoons sugar",
        "2/3 cup Essencia or other orange Muscat dessert wine",
        "6 tablespoons chilled heavy cream",
        "1 tablespoon confectioners sugar",
        "1/4 teaspoon finely grated fresh orange zest",
        "1 cup raspberries",
        "1 cup blackberries",
        "Confectioners sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dairy",
        "Dessert",
        "Bake",
        "Summer",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Berry Puffs with Orange Muscat Cream",
    "url": "http://www.epicurious.com/recipes/food/views/berry-puffs-with-orange-muscat-cream-105430"
}
