{
    "directions": [
        "Stir together yolks and 2 tablespoons water for egg wash. Put a baking sheet in freezer.",
        "Unfold 1 pastry sheet on a 12-inch square of parchment and brush all over with egg wash. Prick entire surface evenly with a fork.",
        "Unfold a second pastry sheet on a cutting board and cut out a 1 1/4-inch-wide right-angle strip along 2 adjacent edges with a sharp small knife, reserving remaining square for another use. Place right angle on 1 corner on top of 2 adjacent edges of pricked pastry to form first quadrant of tart. Transfer pastry on parchment to baking sheet in freezer and chill until firm, about 10 minutes.",
        "Transfer pastry on parchment from freezer to cutting board and trim a 1/4-inch-wide strip from all 4 edges using tip of small knife and a ruler and cutting all the way through pastry. Make 1/4-inch-long vertical cuts through double layers of edge about 1/2 inch apart (to help sides rise evenly).",
        "Return pastry on parchment to baking sheet in freezer and chill until firm but not solid, about 10 minutes more.",
        "Preheat oven to 450°F and heat another baking sheet on lowest rack in oven until hot, about 2 minutes.",
        "Remove baking sheet from oven and transfer pastry on parchment from freezer to hot sheet. Bake pastry on lowest rack of oven until puffed and deep golden brown (a little darker than usual so double edges are cooked through), 14 to 16 minutes. Transfer pastry on parchment to a rack to cool.",
        "Repeat procedure with remaining 3 packages puff pastry to make remaining 3 quadrants of tart.",
        "Blend cream cheese and granulated sugar in a food processor until sugar is dissolved and mixture is smooth. Add ginger and pulse until finely chopped and mixture is combined well.",
        "If very puffed, gently flatten inner parts of pastry (single layer) slightly with your palm. Fit quadrants together on flat board to form a giant square tart shell, trimming inside edges of each quadrant slightly with a serrated knife to help quadrants fit together smoothly. \"Glue\" inner edges together with a little ginger cream, then spread remaining ginger cream evenly over tart, leaving double edges as a border.",
        "Arrange strawberries in a decorative pattern over cream. Bring jelly to a boil with remaining 2 tablespoons water, whisking until smooth, then simmer glaze 1 minute. Toss three fourths of glaze with blueberries in a large bowl and spoon blueberries onto tart to cover cream between strawberries, mounding slightly. Brush strawberries with remaining glaze."
    ],
    "ingredients": [
        "2 large egg yolks",
        "4 tablespoons water",
        "4 (17 1/4-oz) packages frozen puff pastry sheets, thawed but kept chilled",
        "2 (8-oz) packages cream cheese",
        "1/2 cup granulated sugar",
        "1/2 cup chopped crystallized ginger (4 oz)",
        "2 pt strawberries (1 lb), hulled, then halved or quartered if large",
        "3/4 cup red currant jelly",
        "4 pt blueberries (2 1/2 lb)",
        "Garnish: confectioners sugar",
        "Special Equipment: parchment paper and a large flat board (at least 20 inches square) for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dessert",
        "Bake",
        "Summer",
        "Gourmet"
    ],
    "title": "Berry Tart with Ginger Cream",
    "url": "http://www.epicurious.com/recipes/food/views/berry-tart-with-ginger-cream-106760"
}
