{
    "directions": [
        "1. Preheat the oven to 375°F. In a large mixing bowl, gently toss the berries with 1 cup sugar.",
        "2. In a stand mixer fitted with a paddle attachment or using a wooden spoon and a large bowl, beat together the butter and the remaining 3/4 cup sugar on medium speed until light in texture, about 2 minutes. While the butter is beating, in a medium bowl, combine the flour, salt, baking soda, and baking powder, and set aside.",
        "3. Reduce the mixer speed to low and beat in the egg, stirring until smooth, about 2 minutes. Scrape the bowl as necessary to blend evenly. Add the dry ingredients and heavy cream and continue to stir on low, or gently by hand, until just combined.",
        "4. Transfer the berries to a (9- by 13-inch) baking dish, spreading them out into an even layer. Using two spoons, deposit the dough evenly over the berries, covering most of the surface of the dish. Bake the cobbler until the crust is golden brown and springs back when touched (a toothpick can be inserted into the crust; it is fully baked if the toothpick comes out clean), 25 to 35 minutes.",
        "5. Remove the cobbler from the oven and let cool on a wire rack for 10 minutes before serving."
    ],
    "ingredients": [
        "1 1/2 quarts fresh berries (any combination of blackberries, raspberries, blueberries, or strawberries), trimmed as needed",
        "1 3/4 cups sugar",
        "1/2 cup softened unsalted butter",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon salt",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1 large egg, lightly beaten",
        "1/2 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Berry",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Blackberry",
        "Blueberry",
        "Raspberry",
        "Strawberry",
        "Summer",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Berry Cobbler",
    "url": "http://www.epicurious.com/recipes/food/views/berry-cobbler-51113020"
}
