{
    "directions": [
        "Puree thawed raspberries in processor until smooth. Strain into medium bowl, pressing on solids to extract as much liquid as possible. Discard seeds in strainer. Using electric mixer, beat cream cheese and 1/2 cup sugar in large bowl until smooth. Beat chilled whipping cream in another large bowl until peaks form. Gently fold whipped cream into cream cheese mixture. Add pureed raspberries and fold just until combined.",
        "Bring remaining 1 cup sugar, 1 cup water and lemon juice to boil in small saucepan, stirring frequently. Cool slightly. Dip 1 biscuit briefly into lemon syrup, turning to coat. Place flat side up in bottom of 12-cup trifle dish. Repeat with enough biscuits to cover bottom of trifle dish, trimming biscuits to fit if necessary. Spread 1/3 of raspberry-cream cheese mixture over biscuits in trifle dish. Dip more biscuits into lemon syrup and arrange atop raspberry-cream cheese mixture in dish, covering completely and trimming to fit if necessary. Repeat layering with more raspberry-cream cheese mixture, then biscuits; top with remaining raspberry-cream cheese mixture.",
        "Cover and refrigerate until set, at least 3 hours and up to 1 day. Garnish with fresh raspberries and with fresh mint sprigs, if desired."
    ],
    "ingredients": [
        "1 12-ounce package frozen unsweetened raspberries, thawed",
        "12 ounces cream cheese, room temperature",
        "1 1/2 cups sugar",
        "2 cups chilled whipping cream",
        "1 cup water",
        "1/2 cup fresh lemon juice",
        "40 (about) Champagne biscuits (crisp ladyfinger-style cookies; from two 3.5-ounce packages)",
        "Fresh raspberries",
        "Fresh mint sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Dairy",
        "Fruit",
        "Dessert",
        "Cream Cheese",
        "Raspberry",
        "Spring",
        "Chill"
    ],
    "title": "Berrymisu",
    "url": "http://www.epicurious.com/recipes/food/views/berrymisu-104848"
}
