{
    "directions": [
        "Preheat oven to 375°F.",
        "On a floured surface with a floured rolling pin roll out dough into an 11-inch round (about 1/8 inch thick) and fit into a 9-inch tart pan with a removable fluted rim. Roll rolling pin over top of shell to trim dough flush with rim and with a fork prick bottom of shell all over. Chill shell 30 minutes, or until firm.",
        "Line shell with foil and fill with pie weights or raw rice. Bake shell in middle of oven 20 minutes and carefully remove foil and weights or rice. Bake shell until golden, about 10 minutes more, and cool completely in pan on a rack. Shell may be made 1 day ahead and kept in pan, loosely covered, at room temperature.",
        "In a bowl with a whisk or an electric mixer beat together mascarpone, cream, and sugar until mixture holds stiff peaks. Spoon mixture into shell, spreading evenly.",
        "Quarter strawberries and in a large bowl combine with remaining berries. In a small saucepan simmer marmalade and liqueur, stirring, until reduced to about 3 tablespoons and pour over berries. With a rubber spatula gently stir berries to coat evenly. Mound berries decoratively on mascarpone cream. Tart may be assembled 2 hours ahead and chilled. Bring tart to room temperature and remove side of pan before serving."
    ],
    "ingredients": [
        "sweet pastry dough",
        "pie weights or raw rice for weighting shell",
        "1 cup mascarpone cheese (about 8 ounces)",
        "1/3 cup well-chilled heavy cream",
        "1/4 cup sugar",
        "1 1/2 cups small strawberries",
        "1 cup raspberries",
        "1 cup blueberries",
        "1 cup blackberries",
        "2 tablespoons sweet orange marmalade",
        "2 tablespoons dark berry liqueur such as blueberry, blackberry, or cassis"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Cheese",
        "Dessert",
        "Bake",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Berry Tart with Mascarpone Cream",
    "url": "http://www.epicurious.com/recipes/food/views/berry-tart-with-mascarpone-cream-15182"
}
