{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10-inch Bundt or tube pan.",
        "Beat 1 cup butter, cream cheese, 1 cup sugar, and 1/2 cup dark brown sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Mix in 1 teaspoon vanilla and 1/4 cup bourbon.",
        "Sift together flour, 6 tablespoons cocoa powder, baking powder, and salt and set aside.",
        "Prepare the filling: combine 1/4 cup butter, 1/4 cup cocoa powder, 3/4 cup brown sugar in a food processor and pulse to combine. Transfer to a bowl and mix in pecan pieces and 1 tablespoon bourbon; set aside.",
        "Gradually add flour mixture to cake batter; beat on medium speed about 3 minutes. Spread half of the batter in bottom of the prepared pan and place teaspoonfuls of pecan filling around the center of batter. Cover with the remaining batter.",
        "Bake in preheated oven until a toothpick inserted in the cake comes out clean, 55 to 70 minutes. Let cool on wire rack for about 20 minutes.",
        "Invert cake onto a serving plate and allow it to cool completely before glazing.",
        "For the glaze: sift 1/4 cup cocoa powder with 1 cup confectioners' sugar. Mix in 1 teaspoon vanilla, 1 tablespoon of butter, and 4 tablespoons hot water; add 1 to 2 more tablespoons water until desired consistency is reached. Spoon glaze over top of cooled cake."
    ],
    "ingredients": [
        "Cake:",
        "1 cup butter, room temperature",
        "1 (8 ounce) package cream cheese, room temperature",
        "1 cup white sugar",
        "1/2 cup packed brown sugar",
        "4 eggs, room temperature",
        "1 teaspoon vanilla extract",
        "1/4 cup bourbon",
        "6 tablespoons unsweetened cocoa powder",
        "2 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 pinch salt",
        "Filling:",
        "1/4 cup unsalted butter, at room temperature",
        "1/4 cup unsweetened cocoa powder",
        "3/4 cup packed brown sugar",
        "1 tablespoon bourbon",
        "1 cup toasted pecan pieces",
        "Glaze:",
        "1/4 cup unsweetened cocoa powder",
        "1 cup confectioners' sugar",
        "1 teaspoon vanilla extract",
        "1 tablespoon butter, softened",
        "5 tablespoons hot water or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bertha's Big Bourbon Bundt Cake",
    "url": "http://allrecipes.com/recipe/7696/berthas-big-bourbon-bundt-cake/"
}
