{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease 24 muffin cups or line with paper liners.",
        "Beat cake mix, water, eggs, and oil together in a bowl using an electric mixer on medium speed for 2 minutes. Pour batter into the prepared muffin cups.",
        "Bake in the preheated oven until a toothpick inserted in the center comes out clean, 14 to 19 minutes. Cool cupcakes in the freezer.",
        "Melt white chocolate in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 3 minutes. Beat butter and melted white chocolate together using an electric mixer until smooth; add 3 tablespoons cream and vanilla extract and mix well. Gradually add confectioners' sugar to white chocolate mixture while continually beating until icing is thick and creamy.",
        "Place a bowl, beaters, and 1 quart cream in the freezer for 20 minutes.",
        "Pour the chilled cream into the chilled bowl and beat using the chilled beaters until thick. Add pudding mix and beat until pudding filling is really thick and somewhat stiff. Stir jam and food coloring into filling until an even color is reached.",
        "Cut an upside-down triangular shape out of the top of each cupcake, making room for the filling. Cut the point off the triangle. Spoon the filling into each cupcake and top with the triangle piece. Spread icing over the top of each cupcake."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=undefined",
    "ingredients": [
        "2 (16.25 ounce) packages moist white cake mix (such as Betty Crocker® SuperMoist®)",
        "2 ½ cups water",
        "6  eggs",
        "⅔ cup vegetable oil",
        "8 ounces baking white chocolate (such as Baker's®), chopped",
        "2 cups butter, at room temperature",
        "3 tablespoons heavy whipping cream",
        "2 teaspoons vanilla extract",
        "9 cups confectioners' sugar",
        "1 quart heavy whipping cream",
        "1 (3.4 ounce) package cheesecake-flavored pudding mix (such as Jell-O®)",
        "¼ cup strawberry (girl) or blackberry (boy) jam, or as desired",
        "1 dash red (girl) or blue (boy) food coloring"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Best Gender Reveal Cupcakes Ever!",
    "url": "http://allrecipes.com/recipe/245001/best-gender-reveal-cupcakes-ever/"
}