{
    "directions": [
        "Bring water to a boil in a large pot. Cook chow mein noodles until soft, 5 to 6 minutes. Drain and rinse with cool water.",
        "Mix flank steak, teriyaki sauce, 2 tablespoons soy sauce, cornstarch, and 2 cloves garlic together in a small bowl.",
        "Mix remaining 2 tablespoons soy sauce, 4 cloves garlic, 1 cup water, chow mein sauce mix, teriyaki glaze, and sriracha sauce in a separate bowl to make sauce.",
        "Preheat a wok over medium-high heat; add 2 tablespoons peanut oil. Add steak and onion; cook and stir until beef is brown and onion is translucent, about 3 minutes. Transfer to a plate.",
        "Pour remaining 2 tablespoons peanut oil into the wok. Add carrots, mushrooms, broccoli, and celery; cook and stir until browned, about 3 minutes.",
        "Return steak and onion mixture to the wok. Add noodles, sauce, bean sprouts, shrimp, bok choy; cook, stirring occasionally, until noodles are heated through and shrimp are opaque, about 4 minutes. Season with pepper."
    ],
    "ingredients": [
        "6 cups water",
        "14 ounces chow mein noodles (such as Golden Dragon®)",
        "1 pound flank steak, cut into thin strips",
        "6 tablespoons teriyaki sauce",
        "1/4 cup soy sauce, divided",
        "3 tablespoons cornstarch",
        "6 cloves garlic, crushed, divided",
        "1 cup water",
        "1 (1.5 ounce) package chow mein sauce mix (such as Su Wong®)",
        "2 tablespoons teriyaki glaze",
        "1 tablespoon sriracha sauce, or more to taste",
        "1/4 cup peanut oil, divided",
        "1 onion, chopped",
        "2 carrots, sliced",
        "1 cup sliced fresh mushrooms",
        "1 cup broccoli florets",
        "2 stalks celery, sliced",
        "8 ounces bean sprouts",
        "12 fresh shrimp (optional)",
        "1 1/2 cups chopped bok choy",
        "ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Best Beef Chow Mein",
    "url": "http://allrecipes.com/recipe/255938/best-beef-chow-mein/"
}
