{
    "directions": [
        "Preheat oven to 350°F. Combine first 5 ingredients in a small bowl. Place each rack of ribs on a double layer of foil; sprinkle rub all over ribs. Wrap racks individually and divide between 2 baking sheets.",
        "Bake ribs until very tender but not falling apart, about 2 hours for baby backs and 3 hours for spareribs. Carefully unwrap ribs; pour any juices from foil into a 4-cup heatproof measuring cup; reserve juices. Let ribs cool completely. DO AHEAD: Ribs can be baked up to 3 days ahead (the flavor will be more developed, and the cold ribs will hold together better on the grill as they heat through). Cover and chill juices. Rewrap ribs in foil and chill.",
        "Build a medium-hot fire in a charcoal grill, or heat a gas grill to high. Add broth or water to rib juices, if needed, to measure 1 1/2 cups. Whisk in barbecue sauce to blend.",
        "Grill ribs, basting with barbecue sauce mixture and turning frequently, until lacquered and charred in places and heated through, 7-10 minutes. Transfer to a cutting board; cut between ribs to separate. Transfer to a platter and serve with additional barbecue sauce."
    ],
    "ingredients": [
        "2 1/2 tablespoons kosher salt",
        "1 tablespoon dry mustard",
        "1 tablespoon paprika",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon freshly ground black pepper",
        "8 pounds baby back pork ribs (8 racks) or St. Louis-style spareribs (4 racks)",
        "Low-salt chicken broth (optional)",
        "1 1/2 cups store-bought or homemade barbecue sauce plus more"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Bake",
        "Fourth of July",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Meat",
        "Pork Rib",
        "Summer",
        "Family Reunion",
        "Grill",
        "Chill",
        "Grill/Barbecue",
        "Advance Prep Required",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Best-Ever Barbecued Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/best-ever-barbecued-ribs-51104600"
}
