{
    "directions": [
        "Fit a large pot with a steamer basket and pour in water to come to top of basket. Place over high heat. If desired, dispatch lobsters by using a sharp chef’s knife (and one fell swoop) to split the front section of each between the eyes. Place lobsters in pot, cover, and steam (the pot should be actively filled with steam) until shells are bright red and tails are curled, 6–8 minutes. Let sit until cool enough to handle, 12–15 minutes.",
        "Meanwhile, mix mayonnaise, celery, lemon zest, lemon juice, and 1 Tbsp. chives in a medium bowl to combine; season dressing with salt and pepper.",
        "Remove lobster meat from shells and cut into large pieces; discard shells. Melt butter in a large saucepan over medium heat; transfer 2 Tbsp. melted butter to a small bowl and set aside for brushing buns. Add lobster meat to remaining butter in saucepan and toss to coat. Cook, tossing occasionally, until just warmed through (it should not be hot; you don’t want it to overcook), about 4 minutes. Season with salt, then spoon lobster meat into bowl with dressing with a slotted spoon and gently toss to coat.",
        "Heat a dry large skillet over medium. Brush reserved butter over outsides of buns. Toast, buttered side down, until golden, about 3 minutes per side.",
        "Line each bun with a piece of lettuce and spoon in dressed lobster; top with more chives.",
        "Lobsters can be cooked and shelled and dressing can be made 1 day ahead. Cover and chill separately."
    ],
    "ingredients": [
        "3 (1 1/4-pound) live lobsters",
        "1/4 cup mayonnaise",
        "1/4 cup chopped celery",
        "1/2 teaspoon finely grated lemon zest",
        "1/2 tablespoon fresh lemon juice",
        "1 tablespoon sliced chives, plus more for serving",
        "Kosher salt, freshly ground pepper",
        "5 tablespoons unsalted butter",
        "4 New England–style split-top hot dog buns",
        "2 green lettuce leaves, halved lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Shellfish",
        "Lobster",
        "Boston",
        "Summer",
        "Lunch",
        "Dinner"
    ],
    "title": "Best-of-Both-Worlds Lobster Roll",
    "url": "http://www.epicurious.com/recipes/food/views/best-of-both-worlds-lobster-roll"
}
