{
    "directions": [
        "Heat olive oil in a heavy large Dutch oven or large pot over medium-high heat; cook and stir onion until translucent, about 5 minutes. Add garlic to onion; cook until garlic is fragrant, about 2 minutes.",
        "Stir 1/4 cup parsley, basil, oregano, red pepper flakes, and bay leaf into onion mixture; cook and stir until fragrant, about 1 minute. Add wine to seasoned onion mixture; bring to a boil. Cook and stir mixture until most of liquid evaporates, about 10 minutes.",
        "Pour tomatoes with juice and fish stock into seasoned onion-wine mixture; simmer until flavors blend, about 15 minutes. Season with salt and pepper.",
        "Stir mussels into tomato mixture; cover Dutch oven with a lid and simmer for about 2 minutes. Add clams to mixture; simmer about 2 more minutes. Add halibut, scallops, and crab legs to mussels-clams mixture; cover Dutch oven and simmer until mussels and clams break open and halibut and scallops are cooked through, about 2 more minutes. Add shrimp to cioppino and cook until heated through, 1 to 2 minutes. Discard any mussels or clams that didn't open.",
        "Divide cioppino among serving bowls; sprinkle with 2 tablespoons parsley."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1/2 large onion, chopped",
        "2 cloves garlic, minced",
        "1/4 cup chopped fresh flat-leaf parsley",
        "1/4 teaspoon dried basil",
        "1/4 teaspoon dried oregano",
        "1/8 teaspoon red pepper flakes",
        "1/2 bay leaf",
        "1 cup dry white wine",
        "1 (14 ounce) can diced tomatoes with juice",
        "1 cup fish stock",
        "salt and ground black pepper to taste",
        "6 mussels, scrubbed and debearded",
        "6 clams, scrubbed",
        "1 (4 ounce) fillet halibut, cut into 2-inch pieces",
        "10 small scallops",
        "3 precooked crab legs, cracked",
        "6 precooked tail-on shrimp",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Best Cioppino",
    "url": "http://allrecipes.com/recipe/235423/best-cioppino/"
}
