{
    "directions": [
        "Freeze the crust until firm, about 30 minutes. Place half the coffee ice cream into a bowl, and let it stand about 10 minutes to soften. Return remaining ice cream to the freezer. Mix softened ice cream with the mini chocolate chips. Spread the ice cream and chips in an even layer over the frozen crust. Cover with plastic wrap, and freeze for 2 hours.",
        "Heat the topping in the microwave on low until warm and easy to pour, 30 seconds to 1 minute (do not let the sauce get very hot). Pour into a bowl. Set aside 2 tablespoons cookie crumbs for garnish; stir remaining cookie crumbs into the fudge topping. Remove the pie from the freezer, and layer the cookie crumbs and fudge topping mixture over the ice cream with chips. Cover with plastic wrap, and return to freezer for 2 hours.",
        "Take the remaining frozen coffee ice cream out of the freezer, and allow to stand for about 10 minutes to soften. Layer the ice cream over the layer of cookie crumbs and fudge topping. Cover with plastic wrap, and return to freezer for 2 more hours.",
        "Remove pie, and frost the top of the pie with the whipped topping. Top with the reserved cookie crumbs. Cover with plastic wrap, and return to freezer for 2 more hours to freeze the whipped topping layer. Cut the pie into serving pieces, and drizzle each serving with about 1 tablespoon of the chocolate syrup."
    ],
    "ingredients": [
        "1 (6 ounce) chocolate sandwich cookie crumb crust (such as an OREO® crust)",
        "1 quart coffee ice cream",
        "1 (12 ounce) package miniature chocolate chips",
        "1 (12 ounce) jar hot fudge topping",
        "1/2 (18 ounce) package crushed chocolate sandwich cookies, divided",
        "1 (8 ounce) container frozen whipped topping, thawed",
        "3/4 cup chocolate syrup"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Best Mud Pie",
    "url": "http://allrecipes.com/recipe/219024/best-mud-pie/"
}
