{
    "directions": [
        "Bring a large pot of water to a rapid boil.  Boil lasagna noodles 6 to 8 minutes until al dente.  Drain and rinse with cold water.  Lay noodles flat and remove excess water with a paper towel.",
        "In a skillet, brown the ground beef over medium-high heat.  Add onion, salt, pepper, and Italian seasoning.  Cook until there is no remaining pink color in beef.  Drain any liquids and set aside.",
        "In a large bowl, mix together ricotta cheese, Romano cheese, 2 cups of the spaghetti sauce and the seasoned ground beef.  Mix until well blended.  Meanwhile, preheat oven to 375  degrees F (190 degrees C).",
        "Add a thin layer of spaghetti sauce in the bottom of a 9x13 inch baking dish.  Add a layer of noodles lengthwise and a few noodles in the opposite direction.  Pour in a generous layer of ricotta mixture on top of noodles. Top ricotta layer with several basil leaves.  Add another layer of noodles lengthwise.  Spread on 1 cup of the mozzarella cheese.  Line up the zucchini slices on top of the mozzarella cheese.  Add another thin layer of ricotta cheese.  Add the last layer of noodles lengthwise. Top the noodles with the remaining spaghetti sauce, several more basil leaves in an eye catching arrangement and top with the remaining 1/2 cup mozzarella cheese.",
        "Bake in a preheated oven for 50 to 55 minutes.  If Mozzarella cheese becomes too browned, loosely cover with a piece of foil."
    ],
    "ingredients": [
        "1 (16 ounce) package lasagna noodles",
        "1 pound ground beef",
        "1 onion, chopped",
        "salt and pepper to taste",
        "1 tablespoon Italian seasoning",
        "4 cups ricotta cheese",
        "1 cup grated Romano cheese",
        "2 1/2 cups spaghetti sauce",
        "1 1/2 cups shredded mozzarella cheese",
        "2 medium zucchini, sliced",
        "1 cup fresh basil leaves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Best Lasagna",
    "url": "http://allrecipes.com/recipe/23717/best-lasagna/"
}
