{
    "directions": [
        "Preheat the oven to 475 degrees F.",
        "Combine the onions, flour, panko and salt in a large mixing bowl and toss to combine. Coat a sheet pan with nonstick cooking spray and evenly spread the onions on the pan. Place the pan on the middle rack of the oven and bake until golden brown, approximately 30 minutes. Toss the onions 2 to 3 times during cooking. Once done, remove from the oven and set aside until ready to use. Turn the oven down to 400 degrees F.",
        "While the onions are cooking, prepare the beans. Bring a gallon of water and 2 tablespoons of salt to a boil in an 8-quart saucepan. Add the beans and blanch for 5 minutes. Drain in a colander and immediately plunge the beans into a large bowl of ice water to stop the cooking. Drain and set aside.",
        "Melt the butter in a 12-inch cast iron skillet set over medium-high heat. Add the mushrooms, 1 teaspoon salt and pepper and cook, stirring occasionally, until the mushrooms begin to give up some of their liquid, approximately 4 to 5 minutes. Add the garlic and nutmeg and continue to cook for another 1 to 2 minutes. Sprinkle the flour over the mixture and stir to combine. Cook for 1 minute. Add the broth and simmer for 1 minute. Decrease the heat to medium-low and add the half-and-half. Cook until the mixture thickens, stirring occasionally, approximately 6 to 8 minutes.",
        "Remove from the heat and stir in 1/4 of the onions and all of the green beans. Top with the remaining onions. Place into the oven and bake until bubbly, approximately 15 minutes. Remove and serve immediately."
    ],
    "ingredients": [
        "2 medium onions, thinly sliced",
        "1/4 cup all-purpose flour",
        "2 tablespoons panko bread crumbs",
        "1 teaspoon kosher salt",
        "Nonstick cooking spray",
        "2 tablespoons plus 1 teaspoon kosher salt, divided",
        "1 pound fresh green beans, rinsed, trimmed and halved",
        "2 tablespoons unsalted butter",
        "12 ounces mushrooms, trimmed and cut into 1/2-inch pieces",
        "1/2 teaspoon freshly ground black pepper",
        "2 cloves garlic, minced",
        "1/4 teaspoon freshly ground nutmeg",
        "2 tablespoons all-purpose flour",
        "1 cup chicken broth",
        "1 cup half-and-half"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Casserole Recipes",
        "Casserole",
        "Easy Recipes",
        "Easy Side Dish Recipes",
        "Green Bean Casserole",
        "Beans and Legumes",
        "Green Bean",
        "Vegetable Casserole",
        "Vegetable",
        "Thanksgiving Side Dishes",
        "Holiday",
        "Thanksgiving",
        "Comfort Food",
        "American",
        "Onion Recipes",
        "Mushroom"
    ],
    "title": "Best Ever Green Bean Casserole",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/best-ever-green-bean-casserole-recipe"
}
