{
    "directions": [
        "Stir vinegar and sugar in small bowl until sugar dissolves; set aside to use as dressing. Combine cucumber, celery, chile, and ginger in another small bowl. Mix dressing into relish by tablespoonfuls to taste.",
        "Grind cilantro stems, garlic, and ginger in mini processor to paste.",
        "Heat oil in heavy large skillet over medium-high heat. Add cilantro paste and stir 1 minute. Add curry powder; stir 30 seconds. Add squid and chile strips. Stir-fry until squid is almost tender, about 1 minute. Stir in fish sauce, oyster sauce, and sugar. Add coconut cream and chicken broth. Stir until sauce thickens slightly, about 1 minute.",
        "Arrange betel leaves on platter. Using slotted spoon, top each leaf with squid mixture. Spoon relish over."
    ],
    "ingredients": [
        "2 tablespoons distilled white vinegar",
        "2 tablespoons sugar",
        "1/2 cup finely diced unpeeled Persian cucumber",
        "1/2 cup finely diced celery",
        "1 red jalapeño chile, seeded, finely diced",
        "1 1-inch piece peeled fresh ginger, cut into matchstick-size strips",
        "10 long fresh cilantro stems, chopped",
        "2 garlic cloves, halved",
        "1 1-inch piece peeled fresh ginger, chopped",
        "2 tablespoons vegetable oil",
        "1 tablespoon Homemade Curry Powder",
        "8 ounces cleaned squid bodies, cut crosswise into 1/4-inch-thick rings",
        "1 red jalapeño chile, seeded, cut into matchstick-size strips",
        "1 tablespoon fish sauce (such as nam pla or nuoc nam)",
        "1 tablespoon oyster sauce",
        "1 teaspoon sugar",
        "1/2 cup coconut cream",
        "2 tablespoons low-salt chicken broth",
        "16 betel leaves, small Boston lettuce leaves, or small romaine lettuce leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Stir-Fry",
        "Low Cal",
        "Dinner",
        "Squid",
        "Cucumber",
        "Spring",
        "Summer",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Betel Leaf Wraps with Curried Squid and Cucumber Relish",
    "url": "http://www.epicurious.com/recipes/food/views/betel-leaf-wraps-with-curried-squid-and-cucumber-relish-241845"
}
