{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Cover two baking sheets with aluminum foil, and drizzle with olive oil. Arrange potatoes, carrots and onions on one baking sheet. Drizzle with more olive oil and sprinkle with oregano, cumin and mustard seeds. Place the garlic bulb on the baking sheet. Arrange the peppers and tomatoes on the second baking sheet, and sprinkle with olive oil.",
        "Place both pans in the oven. Cook, stirring the contents occasionally, until the potatoes, carrots and onions are tender and the peppers and tomatoes are black, about 30 to 45 minutes. The bell peppers and tomatoes may take a little longer to cook than the potatoes, carrots, onions, and garlic. Feel free to remove the baking sheet of potatoes earlier than the baking sheet of bell peppers. Reduce the oven's heat to 350 degrees F ( 175 degrees C).",
        "Transfer the tomatoes and peppers into a medium size mixing bowl with the canned tomatoes and cinnamon stick. Cover the bowl, and let it set for 30 minutes.",
        "Skin and seed the peppers and skin the tomatoes. Chop the peppers and tomatoes and place them into a medium size pot that can be placed in the oven. Squeeze the garlic from skins into the pot and stir in the potato mixture and chickpeas. Season with lemon juice, salt, and black pepper.",
        "Cover the stew, and bake it for 30 minutes."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "2 potatoes, cut into wedges",
        "3 carrots, peeled and cut into large chunks",
        "2 onions, peeled and quartered",
        "1 tablespoon cumin seeds, toasted",
        "1 tablespoon mustard seed, toasted",
        "1/2 teaspoon dried oregano",
        "1 medium head garlic",
        "4 large red bell peppers",
        "4 fresh tomatoes, cored",
        "1 cinnamon stick",
        "1 (29 ounce) can diced tomatoes",
        "1 (15 ounce) can garbanzo beans, drained",
        "1 lemon, juiced",
        "salt and pepper to taste",
        "2/3 cup cooked white rice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Better Vegetable Stew",
    "url": "http://allrecipes.com/recipe/14080/better-vegetable-stew/"
}
