{
    "directions": [
        "Melt 10 tablespoons butter in a saucepan over medium-high heat. Whisk 1 1/4 cup sugar and cocoa powder into the melted butter until dissolved. Remove saucepan from heat; add 2 eggs, 2 teaspoons vanilla extract, and 1/2 teaspoon salt. Whisk mixture continuously until the eggs are fully beaten into the mixture. Mix 1/2 cup flour into the mixture; set aside.",
        "Beat 1/2 cup butter, 3/4 cup white sugar, and the brown sugar with an electric mixer in a large bowl until smooth and creamy. Beat 1 egg and 1 1/4 teaspoon vanilla extract into the creamed butter. Mix 1 1/4 cup flour, 1/2 teaspoon salt, baking soda, and baking powder into the butter mixture until just incorporated. Fold chocolate chips into the dough.",
        "Preheat oven to 350 degrees F (175 degrees C). Line a 9-inch square baking dish with aluminum foil and spray the foil with cooking spray.",
        "Press the cookie dough into the bottom of the prepared pan in an even layer. Spread an even layer of the crushed cookies over the cookie dough. Pour brownie batter over the cookies.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 35 minutes."
    ],
    "ingredients": [
        "Brownie Layer:",
        "10 tablespoons unsalted butter",
        "1 1/4 cups white sugar",
        "3/4 cup cocoa powder",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "1/2 teaspoon salt",
        "1/2 cup all-purpose flour",
        "Cookie Dough Layer:",
        "1/2 cup unsalted butter",
        "3/4 cup white sugar",
        "1/4 cup brown sugar",
        "1 egg",
        "1 1/4 teaspoons vanilla extract",
        "1 1/4 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1 cup semisweet chocolate chips",
        "cooking spray",
        "Cookie Layer:",
        "1 (20 ounce) package chocolate sandwich cookies (such as Oreo®), crushed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Better than EVER Brownies",
    "url": "http://allrecipes.com/recipe/233165/better-than-ever-brownies/"
}
