{
    "directions": [
        "Blanch fava beans in a pot of boiling well-salted water 1 minute, then transfer with a slotted spoon to an ice bath to stop cooking. Transfer favas with slotted spoon to a small bowl.",
        "Cook Romano beans in same pot of boiling water, stirring occasionally, until just tender, about 5 minutes, then transfer to ice bath to stop cooking. Drain well and transfer to a bowl.",
        "Cook green beans in same pot until just tender, 6 to 7 minutes, then transfer to ice bath. Add to Romano beans.",
        "Gently peel skins from fava beans (it's not necessary to peel edamame, if using), then add to other beans.",
        "Cut basil into very thin shreds.",
        "Cook garlic in oil with a rounded 1/4 teaspoon each of salt and pepper in a 12-inch heavy skillet over medium heat, stirring occasionally, 1 minute. Add beans, water, and zest and cook, stirring occasionally, until heated through. Stir in basil and 2 1/2 teaspoons lemon juice and remove from heat. Season with salt and additional lemon juice if desired. Serve beans warm or at room temperature."
    ],
    "ingredients": [
        "1 pound fresh fava beans, shelled, or 1 cup shelled fresh or frozen edamame (soybeans; 3/4 pound in pods)",
        "3/4 pound young fresh Romano beans (Italian flat beans), stemmed and cut diagonally into 1 1/2-to 2-inch pieces",
        "1/2 pound green or wax beans, trimmed and halved crosswise",
        "1/4 cup packed basil leaves",
        "2 garlic cloves, finely chopped",
        "3 tablespoons extra-virgin olive oil",
        "3 tablespoons water",
        "1 1/2 teaspoons grated lemon zestepi:recipelink</epi:recipelink>",
        "2 1/2 teaspoons fresh lemon juice, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Side",
        "Vegetarian",
        "Quick & Easy",
        "Dinner",
        "Green Bean",
        "Summer",
        "Healthy",
        "Vegan",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Bevy of Beans and Basil",
    "url": "http://www.epicurious.com/recipes/food/views/bevy-of-beans-and-basil-354979"
}
