{
    "directions": [
        "Preheat the oven to 350 degrees F. Spray a 26-by-18-by-1-inch baking sheet with nonstick spray and line with parchment paper, leaving a 1-inch overhang over the sides. Spray the parchment with nonstick spray.",
        "In a large bowl, whisk to combine the flour, cocoa powder, baking powder and salt; set aside.",
        "In a stand mixer, beat the butter and sugars together on medium-high speed until light and fluffy, about 3 minutes. Reduce the speed to low and beat in the eggs 1 at a time, then the vanilla extract until completely incorporated. Add the flour mixture a cup at a time and beat until combined.",
        "Remove the bowl from the stand and use a rubber spatula to fold in the chocolate chips and cherries. Press the dough evenly into the prepared pan and bake until cooked through, about 30 minutes. Cool on a rack to room temperature, about 20 minutes.",
        "Pour the Chocolate Ganache over the brownies and let cool. Cut into 32 rectangle-shaped cookie bars.",
        "Put the chocolate chips in a medium bowl and set aside. In a small saucepan, heat the heavy cream over medium heat until small bubbles form around the edge of the pan, about 3 minutes. Pour the heavy cream over the chocolate and stir until completely melted and smooth."
    ],
    "ingredients": [
        "Nonstick cooking spray, for spraying the pan and parchment",
        "3 cups all-purpose flour",
        "1/2 cup cocoa powder",
        "2 teaspoons baking powder",
        "1 teaspoon kosher salt",
        "2 cups (4 sticks) unsalted butter, at room temperature",
        "2 cups granulated sugar",
        "1/2 cup packed light brown sugar",
        "4 large eggs",
        "2 teaspoons vanilla extract",
        "2 cups extra-dark chocolate chips",
        "1 1/2 cups chopped fresh cherries (or substitute frozen or drained jarred)",
        "Chocolate Ganache, recipe follows",
        "6 ounces dark chocolate chips",
        "2/3 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Brownie",
        "Chocolate",
        "Dessert"
    ],
    "title": "Big Slab Brownie Bars",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/big-slab-brownie-bars"
}
