{
    "directions": [
        "Toss strawberry halves and 2 tablespoons white sugar in a bowl and refrigerate while preparing remaining ingredients.",
        "Preheat oven to 350 degrees F (175 degrees C). Lightly grease and flour two 9-inch round baking pans.",
        "Mix flour, cocoa powder, baking soda, baking powder, and salt in a bowl. Beat 2 cups white sugar, butter, vegetable oil, eggs, and vanilla extract in a large bowl until creamy. Mix flour mixture into butter mixture until just combined. Stir in milk and coffee until batter is well blended; pour batter into prepared baking pans.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 35 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
        "Beat heavy whipping cream until foamy in a large bowl. Gradually add 1/4 cup confectioners' sugar and remaining 2 tablespoons white sugar, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the cream should form a sharp peak that holds its shape.",
        "Spread half the whipped cream over one completely cooled cake. Layer half the strawberries on top and place the second cake on top. Spread the remaining whipped cream over the entire cake and decorate with the remaining strawberries."
    ],
    "ingredients": [
        "1/2 pound fresh strawberries, hulled and halved",
        "2 tablespoons white sugar",
        "2 1/2 cups all-purpose flour",
        "1/2 cup unsweetened cocoa powder",
        "1 teaspoon baking soda",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "2 cups white sugar",
        "1 cup butter, softened",
        "1/3 cup vegetable oil",
        "2 eggs",
        "1/2 teaspoon vanilla extract",
        "1 1/2 cups milk",
        "3/4 cup brewed coffee",
        "1 quart heavy whipping cream",
        "1/4 cup confectioners' sugar",
        "2 tablespoons white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Big D's Chocolate Strawberry Shortcake",
    "url": "http://allrecipes.com/recipe/222772/big-ds-chocolate-strawberry-shortcak/"
}
