{
    "directions": [
        "Preheat the oven to 350 degrees F. Mix the cheddar and pepper jack in a bowl. Spread half of the tortilla chips in the bottom of a deep 12-inch cast-iron skillet or cake pan. Sprinkle with half of the cheese mixture and bake until the cheese melts, about 5 minutes. Top with the remaining chips and sprinkle with the remaining cheese mixture and the black beans. Return to the oven and bake until the cheese melts, about 5 more minutes.",
        "Remove the nachos from the oven and drizzle with the cheese sauce, then top with the chili and guacamole. Top with sour cream, pico de gallo, pickled jalapenos and scallions.",
        "Melt 3 tablespoons butter in a saucepan over medium heat. Add 1 teaspoon each minced garlic and shallot; cook 5 minutes. Stir in 3 tablespoons flour and 1/2 teaspoon salt; cook, stirring, 2 minutes. Add 1/2 cup milk; whisk until thick. Add 1 cup cheddar, season with pepper and stir until smooth.",
        "Mash 2 avocados with a fork. Add 1/4 cup diced white onion, 1/3 cup diced tomato, 4 teaspoons chopped cilantro, 1 tablespoon lime juice, 2 teaspoons minced jalapeno, and salt and pepper. Press plastic wrap directly onto the surface and refrigerate until ready to use.",
        "Photograph by Kat Teutsch"
    ],
    "ingredients": [
        "2/3 cup shredded sharp cheddar cheese",
        "2/3 cup shredded pepper jack cheese",
        "1 8-to-10-ounce bag multicolored tortilla chips",
        "1/2 cup canned black beans, drained and rinsed",
        "1 1/2 cups cheese sauce, warmed (see recipe below)",
        "1 1/2 cups prepared chili, warmed",
        "1/2 cup guacamole (see recipe below)",
        "Sour cream, pico de gallo, sliced pickled jalapenos and sliced scallions, for topping"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chips",
        "Cheddar",
        "Cheese"
    ],
    "title": "Big Dish O' Nachos",
    "url": "http://www.foodnetwork.com/recipes/big-dish-o-nachos-recipe"
}
