{
    "directions": [
        "Combine the ingredients for the snap pea salad. Allow the salad to marinate for about half an hour in the refrigerator.",
        "Purée the currants through a fine sieve. Discard solids and reserve liquids.",
        "Peel the apple and juice it in a juicer, or substitute fresh apple cider.",
        "Combine the currant purée with the apple juice, and slowly whisk in the olive oil. When the oil is incorporated, season with salt, white pepper, and a few drops of porcini oil. (Use porcini oil sparingly, as too much will dominate the other flavors.) Cover and reserve in refrigerator.",
        "Using a very sharp knife, slice the tuna against the grain into 1/8-inch-thick slices. Sprinkle with sea salt and freshly ground pepper. Drizzle with extra virgin olive oil.",
        "To serve, lay the slices of fish over some of the pea salad and brush with the red apple vinaigrette. Garnish with the most delicate white leaves of frisée and a few sprigs of micro red radish.",
        "*You can substitute 1/2 cup fresh apple cider plus 1 teaspoon lemon juice."
    ],
    "ingredients": [
        "1/4 cup sugar snap peas, julienne",
        "1 tablespoon black olive tapenade",
        "1 teaspoon shallots, minced",
        "1 teaspoon aged balsamic vinegar",
        "1 teaspoon extra virgin olive oil",
        "1 teaspoon parsley, chopped",
        "1 pint red currants",
        "1 green apple*",
        "1/4 cup good-quality extra virgin olive oil",
        "Salt and freshly ground white pepper to taste",
        "4 ounces sashimi-quality bigeye tuna",
        "Sea salt (Maldon, sel gris, or fleur de sel)",
        "1/4 ounces white frisée",
        "1/4 ounces purple micro radish (or other micro greens)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fish",
        "Leafy Green",
        "Vegetable",
        "Side",
        "Marinate",
        "No-Cook",
        "Quick & Easy",
        "Salad Dressing",
        "Tuna",
        "Summer",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Bigeye Tuna with Red Currant and Apple Vinaigrette and Snap Peas",
    "url": "http://www.epicurious.com/recipes/food/views/bigeye-tuna-with-red-currant-and-apple-vinaigrette-and-snap-peas-232417"
}
