{
    "directions": [
        "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, reserving about 1 tablespoon of the bacon grease in the skillet. Crumble the bacon and set aside.",
        "Preheat an oven to 375 degrees F (190 degrees C). Grease a casserole or pie dish with butter.",
        "Heat the reserved bacon grease and olive oil in the skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Season with oregano, salt, garlic powder, pepper, and bay leaves. Stir in the garlic, and cook until the garlic has softened, about 5 minutes more. Add the clams and the crumbled bacon; cook and stir until the clams are warmed through, 5 to 7 minutes. Pour in about 3/4 of the reserved clam juice, lemon juice, and hot pepper sauce. Increase heat to medium-high, and simmer for 3 to 5 minutes. Slowly stir in the bread crumbs until the mixture resembles coarse oatmeal. If it becomes dry, add some of the remaining reserved clam juice. Stir in half of the Parmesan cheese, then pour the clam mixture into the prepared casserole dish. Sprinkle the remaining Parmesan cheese on top.",
        "Bake in the preheated oven until golden brown and bubbly, about 30 minutes. Increase the oven temperature to 425 degrees F (220 degrees C), and continue baking until the edges are crisp, 5 to 10 minutes. Allow casserole to cool for at least 15 minutes. Serve with lemon wedges and parsley sprinkled on top."
    ],
    "ingredients": [
        "4 slices bacon",
        "1/4 cup olive oil",
        "1 large onion, chopped",
        "2 tablespoons dried oregano",
        "2 teaspoons kosher salt",
        "1 1/2 teaspoons garlic powder",
        "1 teaspoon ground black pepper",
        "2 bay leaves",
        "4 cloves garlic, thinly sliced",
        "4 (6.5 ounce) cans minced clams, drained with juice reserved",
        "1/2 lemon, juiced",
        "1 dash hot pepper sauce (such as Tabasco®)",
        "1 cup dry bread crumbs, or more as needed",
        "1/2 cup grated Parmesan cheese, divided",
        "1 lemon, cut into wedges",
        "1 tablespoon fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Billman's Clam Casserole",
    "url": "http://allrecipes.com/recipe/215480/billmans-clam-casserole/"
}
