{
    "directions": [
        "Heat 1 tablespoon oil in heavy large shallow pot over medium-high heat. Add sausages and sauté until cooked through, turning often, about 10 minutes. Transfer to large bowl. Sprinkle chicken with salt and pepper. Working in batches, add chicken, skin side down, to pot. Cover and cook until brown, about 6 minutes. Turn chicken over, cover and cook until brown and cooked through, about 8 minutes longer. Transfer chicken to bowl with sausages. Add onions and 10 chopped garlic cloves to pot; sauté until tender, about 8 minutes. Add tomatoes and bay leaves; stir 2 minutes. Stir in zucchini and bell peppers. Transfer to another large bowl.",
        "Toss shrimp with remaining 2 tablespoons oil, 1 minced garlic clove and generous pinch of saffron in medium bowl. (Chicken-sausage mixture, vegetable mixture and shrimp mixture can be prepared 6 hours ahead. Cover separately and refrigerate.)",
        "Preheat oven to 375°F. Brush one 18 x 12 x 2 1/4-inch roasting pan with olive oil. Mix rice and 1 1/2 teaspoons salt into vegetable mixture. Spread rice mixture evenly in prepared pan. Cut sausages diagonally into 1-inch slices. Using wooden spoon, push sausage and chicken pieces into rice mixture; pour any juices from bowl over. Bring 5 cups chicken broth, paprika and remaining 1/4 teaspoon saffron to boil in medium saucepan. Pour evenly over rice mixture. Cover roasting pan tightly with foil. Bake until rice is almost tender, about 40 minutes.",
        "Sprinkle shrimp mixture with salt and pepper. Arrange atop rice mixture. Cover pan with foil; bake until shrimp are opaque in center, rice is tender and most of liquid in pan is absorbed, about 20 minutes longer. Sprinkle with parsley. Spoon paella onto plates and serve."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "6 fresh Cajun or hot Italian sausages (about 1 3/4 pounds)",
        "12 chicken thighs with skin and bones (about 4 1/4 pounds), excess fat trimmed",
        "2 very large onions, chopped (about 5 cups)",
        "10 garlic cloves, chopped, plus 1 garlic clove, minced",
        "12 ounces tomatoes, chopped (about 1 1/2 cups)",
        "2 bay leaves",
        "4 medium zucchini, halved crosswise, then quartered lengthwise (about 1 1/4 pounds)",
        "3 red bell peppers, cut into 1-inch-wide strips",
        "1 1/2 pounds uncooked large shrimp, peeled, deveined",
        "Generous pinch plus 1/4 teaspoon saffron threads",
        "2 1/2 cups arborio rice or medium-grain white rice (about 17 1/2 ounces)",
        "1 1/2 teaspoons salt",
        "5 cups canned low-salt chicken broth",
        "2 teaspoons paprika",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Rice",
        "Bake",
        "Sauté",
        "Sausage",
        "Shrimp",
        "Birthday"
    ],
    "title": "Birthday Party Paella",
    "url": "http://www.epicurious.com/recipes/food/views/birthday-party-paella-101008"
}
