{
    "directions": [
        "Mix yogurt, garlic, ginger, garam masala, turmeric, and salt together in a bowl. Add chicken breast; toss to coat evenly. Cover bowl and marinate chicken in the refrigerator, at least 1 hour.",
        "Place rice in a bowl and add enough water to cover; set aside to soften. Place saffron threads in a small bowl with 1/4 cup water; set aside to bloom.",
        "Preheat oven to 400 degrees F (200 degrees C). Coat a baking dish with 2 tablespoons olive oil.",
        "Arrange onions in the prepared baking dish in a single layer. Top onions with marinated chicken breast, reserving marinade. Add 1/2 cup water to the reserved marinade; pour marinade mixture over chicken. Top with tomato slices.",
        "Bake in the preheated oven until chicken breasts are no longer pink in the center and the juices run clear, 30 to 35 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
        "Bring 6 cups water to a boil in a large pot with cloves, cardamom, cinnamon, and cumin. Drain rice and add to the pot. Bring to a boil and cook until softened but still firm, about 8 minutes.",
        "Heat remaining 2 tablespoons oil in a skillet over medium heat. Add masala curry sauce; cook and stir until fragrant, about 1 minute. Add parboiled rice and stir to combine, about 1 minute more. Stir in saffron-infused water and 3/4 cup water. Cover, reduce heat to low, and simmer until liquid is absorbed, 5 to 8 minutes. Remove from heat and let stand until rice is fluffy, 5 to 10 minutes.",
        "Spoon rice onto serving platter; top with chicken breasts, onion, and tomatoes."
    ],
    "ingredients": [
        "1 (8 ounce) container whole milk yogurt",
        "6 cloves garlic, crushed",
        "2 teaspoons finely grated ginger root",
        "1 1/2 teaspoons garam masala",
        "1/2 teaspoon ground turmeric",
        "salt to taste",
        "2 pounds skinless, boneless chicken breast halves",
        "6 cups basmati rice",
        "1 pinch saffron",
        "7 3/4 cups water, divided",
        "1/4 cup olive oil, divided",
        "3 onions, sliced, separated into rings",
        "3 tomatoes, sliced",
        "6 whole cloves",
        "5 cardamom pods",
        "3 cinnamon sticks",
        "1 tablespoon cumin seeds",
        "2 tablespoons prepared masala curry sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Biryani with Yogurt Marinated Chicken",
    "url": "http://allrecipes.com/recipe/246559/biryani-with-yogurt-marinated-chicken/"
}
