{
    "directions": [
        "Spray a waffle iron with nonstick spray; heat to medium.",
        "Gather the biscuit scraps into a ball, then press out as thin as possible on a lightly floured work surface; the thinner the biscuit, the fluffier the waffle will be. With a biscuit cutter, cut out biscuits, making sure they will fit into the waffle iron, width-wise.",
        "When the iron is hot, add the biscuits, one per square, and close the lid. Cook until golden brown, 1 to 2 minutes. Remove and repeat.",
        "Meanwhile, combine the cream cheese and sugar in a large bowl. Using an electric hand mixer, beat until smooth and well incorporated. Add the cream and lemon zest; beat until light and fluffy. Set aside.",
        "In a small bowl, combine the lemon juice and maple syrup. Set aside.",
        "To serve, place two waffles on a plate and top with lemon cream, lemon syrup and blueberries.",
        "Preheat the oven to 425 degrees F.",
        "In a large bowl, whisk together the flour, baking powder, baking soda, salt and 3 tablespoons of the sugar.",
        "In a small bowl, combine the warm water with the yeast and the remaining 2 tablespoons sugar; stir until the yeast is dissolved. Let stand until bubbles appear, 2 to 3 minutes.",
        "Using your hands, mix the 1 cup cold butter into the flour, breaking the butter into small pebbles, until the mixture resembles coarse meal. Make a well in the center and add the buttermilk and the yeast mixture. Gently fold the flour into the wet ingredients. Keep mixing until a ball starts to form, then gently knead, 12 to 15 times, to create a smooth dough. Cover with a cloth or plastic wrap and let rise in a warm place for approximately 1 hour.",
        "Transfer the dough to a lightly floured work surface and press out to 1- to 1 1/2-inches thick. Fold the dough in half, press again to 1- to 1 1/2-inches thick, and then fold again. Cut the dough using a 2- to 3-inch round biscuit cutter, depending personal preference. Brush the bottom of a cast-iron skillet with some of the melted butter. Place the biscuits in the skillet; brush the tops with melted butter.",
        "Bake until golden brown, 18 to 22 minutes, depending on size. Brush again with melted butter and serve immediately."
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "Dough scraps from Trisha Yearwood's Angel Biscuits, recipe follows",
        "8 ounces cream cheese, softened",
        "1/4 cup sugar",
        "1/2 cup heavy cream",
        "2 lemons, zested",
        "Juice of 1 lemon",
        "1/4 cup maple syrup",
        "1 cup fresh blueberries, for serving",
        "5 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon kosher salt",
        "5 tablespoons sugar",
        "1/4 cup warm (90 to 110 degrees F) water",
        "1/2 ounce (2 packages) active dry yeast",
        "1 cup (2 sticks) salted butter, cold, cut into small squares, plus 4 tablespoons, melted",
        "2 cups buttermilk"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Biscuit",
        "Waffle Recipes",
        "Blueberry",
        "Fruit",
        "Buttermilk",
        "Dairy Recipes",
        "Cheese",
        "Cream Cheese Recipes",
        "Lemon Recipes",
        "Main Dish Recipes",
        "Brunch"
    ],
    "title": "Biscuit Waffles with Lemon Cream, Lemon Syrup and Blueberries",
    "url": "http://www.foodnetwork.com/recipes/trisha-yearwood/biscuit-waffles-with-lemon-cream-lemon-syrup-and-blueberries"
}
