{
    "directions": [
        "Whisk first 4 ingredients in large bowl. Add bison; toss. Heat large pot over medium heat. Add bacon; cook until crisp. Transfer to paper towels. Add 2 tablespoons oil to pot; increase heat to medium-high. Working in batches, cook bison until browned, adding more oil by tablespoonfuls as needed. Return to same bowl. Add chopped onion, carrot, celery, and garlic to pot; cover and cook until vegetables soften, stirring occasionally, about 5 minutes. Add wine; bring to boil, scraping up any browned bits. Add broth, tomatoes, bay leaves, thyme, sage, reserved bacon, and bison. Reduce heat to low. Cover; simmer until bison is tender, stirring occasionally, about 2 hours (beef may take 1 1/2 hours).",
        "Meanwhile, cook pearl onions in large saucepan of boiling salted water 2 minutes. Transfer to bowl of ice water; trim and peel.",
        "Transfer bison to rimmed baking sheet. Cut meat off bones; cut meat into 3/4-inch cubes. Add parsnips and turnips to pot with bison sauce. Simmer until tender, stirring occasionally, 10 to 15 minutes. Add pearl onions; cook 5 minutes. Return meat to pot. Season with salt and pepper.",
        "Cook potatoes in large pot of boiling lightly salted water until tender, 18 to 20 minutes. Drain. Heat milk, butter, and cream in medium saucepan until almost boiling. Rice potatoes into large mixing bowl; add milk mixture, 1 teaspoon coarse salt, and 1/2 teaspoon pepper and whisk until smooth and slightly cooled, about 2 minutes. Whisk in egg.",
        "Preheat oven to 400°F. Spoon bison filling into 3-quart (13x9x2-inch) baking dish. Spoon mashed potatoes over; smooth top to cover completely.",
        "Beat egg and 1 tablespoon water to blend. Brush over potatoes, then sprinkle cheese all over. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Bake pie until top is browned and filling is heated through, 30 to 40 minutes (50 to 60 minutes if chilled). Let rest 10 minutes.",
        "Try a full-bodied red, like the 2007 Auguste Bessac Crozes-Hermitage (France, $20), with the shepherd's pie."
    ],
    "ingredients": [
        "1/3 cup all purpose flour",
        "1 tablespoon Hungarian sweet paprika",
        "1 1/2 teaspoons coarse kosher salt",
        "1 teaspoon freshly ground black pepper",
        "3 1/2 pounds bison or beef short ribs or 2 1/2 pounds boneless chuck, cut into 2-inch cubes",
        "1/3 pound rindless slab bacon, cut crosswise into 1/2-inch-thick slices",
        "2 tablespoons (or more) olive oil",
        "1 cup chopped onion",
        "1/2 cup peeled chopped carrot",
        "1/2 cup chopped celery",
        "3 garlic cloves, chopped",
        "2 cups dry red wine (such as Syrah)",
        "2 2/3 cups low-salt chicken broth",
        "1 cup canned crushed tomatoes",
        "2 bay leaves",
        "1 teaspoon chopped fresh thyme",
        "1 teaspoon chopped fresh sage",
        "10 ounces pearl onions",
        "1 1/2 cups 3/4-inch cubes peeled parsnips",
        "12 baby turnips, trimmed, peeled",
        "2 to 2 1/4 pounds russet potatoes, peeled, quartered",
        "3/4 cup whole milk",
        "1/2 cup (1 stick) unsalted butter",
        "1/3 cup heavy whipping cream",
        "1 teaspoon coarse kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 large egg, beaten to blend",
        "1 large egg",
        "1 tablespoon water",
        "1 cup finely grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Herb",
        "Onion",
        "Potato",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Buffalo",
        "Parsnip",
        "Turnip",
        "Red Wine",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Bison and Red Wine Shepherd's Pie",
    "url": "http://www.epicurious.com/recipes/food/views/bison-and-red-wine-shepherds-pie-357257"
}
