{
    "directions": [
        "Whisk hazelnut oil and 1 tablespoon vinegar in a small bowl; season with salt and pepper. Set vinaigrette aside.",
        "Heat vegetable oil in a large skillet over medium-high heat. Season steak with salt and pepper and cook 6–8 minutes per side for medium-rare. Let rest 10 minutes.",
        "While steak rests, cook butter and shallot in same skillet over medium heat, stirring occasionally, until shallot is softened and starting to brown, about 4 minutes. Add thyme and peppercorns. Cook, stirring occasionally, until mixture is fragrant, about 2 minutes. Add remaining 1 tablespoon vinegar and 1/2 cup water and simmer until flavors meld and sauce is thick enough to coat a spoon, about 2 minutes. Remove sauce from heat and whisk in mustard; season with salt and pepper.",
        "Fit a medium saucepan with thermometer; pour in oil to measure 3\". Heat over medium-high heat until thermometer registers 350°F.",
        "Meanwhile, mix buttermilk and vinegar in a shallow bowl. Place flour in another bowl or baking dish; season with salt and pepper. Toss onion rings in flour mixture, shaking off excess, and transfer to a wire rack. Working in batches, dip in buttermilk mixture, letting excess drip back into bowl; toss again in flour.",
        "Working in 2 or 3 batches and maintaining temperature of oil, fry onion rings until golden brown and crisp, about 3 minutes per batch. Let drain on paper towels; season with salt.",
        "Toss watercress with reserved vinaigrette. Thinly slice steak against the grain. Serve steak with sauce, watercress, and onion rings."
    ],
    "ingredients": [
        "2 tablespoons hazelnut, walnut, or olive oil",
        "2 tablespoons Sherry vinegar, divided",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons vegetable oil",
        "1 1 1/2 pound hanger steak, center membrane removed, cut into 4 equal pieces",
        "2 tablespoons unsalted butter",
        "1 medium shallot, finely chopped",
        "1 tablespoon finely chopped fresh thyme",
        "2 teaspoons black peppercorns, coarsely chopped",
        "2 teaspoons dry green peppercorns, coarsely chopped",
        "1 tablespoon Dijon mustard",
        "Vegetable oil (for frying; about 3 1/2 cups)",
        "3/4 cup buttermilk",
        "2 tablespoons apple cider vinegar",
        "1 1/2 cups all-purpose flour",
        "Kosher salt, freshly ground pepper",
        "1 large onion, sliced 1/8\" thick, rings separated",
        "6 cups watercress leaves with tender stems",
        "Special equipment: A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Fry",
        "Dinner",
        "Meat",
        "Steak",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Bistro Steak with Buttermilk Onion Rings",
    "url": "http://www.epicurious.com/recipes/food/views/bistro-steak-with-buttermilk-onion-rings-51223910"
}
