{
    "directions": [
        "Drizzle a little olive on each steak and sprinkle 1 tablespoon Aaron's Adobo on each side of the steaks. Allow to rest.",
        "Meanwhile, using a saute pan over medium heat, add 1 tablespoon olive oil, the roasted poblano and jalapeno chiles and onion. Cook for 5 minutes, until the onion is translucent. Remove and cool.",
        "Then, in a large saute pan, add the remaining 2 tablespoons olive oil and the shallots. Cook softly over medium heat until translucent, about 5 minutes. Then add the chile-onion mixture and cook for another 5 minutes. Then add the nopales. Season with 1 teaspoon of salt and 1 teaspoon of pepper and set aside.",
        "On a hot grill, cook the steak for 7 to 8 minutes on each side until medium-rare and remove from the grill. Allow to rest for 5 minutes, then slice into 1-inch pieces. Divide the chile-onion mixture onto 4 plates and top with the sliced steak. Next, top with some Epazote Butter, however much you'd like, and put the plate under a broiler just for a few seconds, long enough for the butter to melt. Good to go. Serve and enjoy!",
        "Heat a dry skillet over medium-low heat. Pour in the cumin, coriander, fennel and mustard seeds along with the pieces of ancho and pasilla chiles. Toast, stirring constantly, until it's very aromatic and just begins to smoke, about 3 minutes.",
        "Dump the mixture onto a plate and let it cool to room temperature. Grind it to a fine powder in a spice grinder or clean coffee grinder.",
        "Put the powder in a large bowl and add the oregano, paprika, garlic powder and onion powder. Stir them really well to combine.",
        "Store the adobo in an airtight container or resealable plastic bag in a cool, dark place for up to a month.",
        "In a blender, puree the epazote, cilantro, garlic, lime juice, salt and pepper with 1/2 cup water. Then take herb puree and mix well with softened butter until a green butter occurs. Once mixed, you can wrap in parchment paper and freeze. It keeps for up to a month."
    ],
    "ingredients": [
        "3 tablespoons olive oil, plus extra to drizzle on steaks",
        "Two 16-ounce New York strip steaks (1/2 a steak per serving)",
        "4 tablespoons Aaron's Adobo, recipe follows",
        "2 poblano chiles, roasted, peeled and seeded, thinly sliced",
        "1 jalapeno chile, roasted, peeled and seeded, thinly sliced",
        "1 white onion, thinly sliced",
        "1 medium shallot, thinly sliced",
        "1/2 cup nopales, grilled for 5 minutes on each side and sliced",
        "Epazote Butter, recipe follows",
        "Salt and freshly ground black pepper",
        "1/4 cup cumin seeds",
        "1/4 cup coriander seeds",
        "1/4 cup fennel seeds",
        "1/4 cup yellow mustard seeds",
        "2 ancho chiles, stemmed, seeded, deveined and torn into small pieces",
        "2 pasilla chiles, stemmed, seeded, deveined and torn into small pieces",
        "1/2 cup dried whole oregano (preferably Mexican)",
        "1/4 cup Spanish paprika (pimenton), preferably sweet or hot",
        "2 tablespoons garlic powder",
        "2 tablespoons onion powder",
        "1 bunch epazote leaves, picked (about 2 cups)",
        "1 bunch fresh cilantro, roughly chopped (about 1 cup)",
        "1 clove garlic",
        "Juice of 1 lime",
        "1 teaspoon salt",
        "1 teaspoon freshly ground black pepper",
        "1/2 pound butter, softened"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Steak",
        "Sauce Recipes",
        "Beef",
        "Meat",
        "Main Dish Recipes",
        "Sauteing Recipes"
    ],
    "title": "Bistec Con Chiles Verdes",
    "url": "http://www.foodnetwork.com/recipes/aaron-sanchez/bistec-con-chiles-verdes-recipe"
}
