{
    "directions": [
        "Combine chicken with water, half of onion, whole garlic clove, bay leaf, and 1 teaspoon salt in a medium (3- to 4- quart) saucepan. Bring to a boil, then reduce heat and cook at a bare simmer for 10 minutes. Cover and let sit until chicken is just cooked through (165°F on an instant-read thermometer), about 15 minutes. Transfer chicken to a cutting board. Strain and reserve 1 cup of broth for tinga and save remaining broth for another use.",
        "When chicken is cool enough to handle, shred it, discarding skin and bones.",
        "Cut an X in the bottom of each tomato. Blanch in a saucepan of boiling water for 1 minute. Transfer tomatoes to a bowl of ice water. Peel and core, then finely chop.",
        "Cook remaining chopped onion with 1/4 teaspoon salt in oil in a 12-inch heavy skillet over medium heat, stirring occasionally, until softened, about 5 minutes. Stir in garlic and crumble in oregano, then cook, stirring, until fragrant, 1 minute. Add tomato and continue to cook, stirring occasionally, until thickened but still saucy, 10 to 15 minutes.",
        "Preheat oven to 350°F (a toaster oven works fine, too).",
        "Add chicken, 3/4 cup of reserved cooking liquid, and chipotle to the tomato sauce and simmer, stirring occasionally, until thickened and excess liquid is almost completely evaporated, 10 to 15 minutes. Cool to warm and moisten with additional cooking liquid if mixture looks dry.",
        "Meanwhile, using cookie cutter, cut out a circle from each tortilla, stacking 12 in each of two folded sheets of foil (reserve remaining tortilla scraps for chilaquiles). Wrap each stack in foil and warm through in oven, 5 to 10 minutes.",
        "To serve, arrange warm tortillas on a heated platter and divide chicken mixture among them (about 1 rounded tablespoon per tortilla), spooning it onto center of each tortilla. Sprinkle with cheese and top each taco with a cilantro sprig."
    ],
    "ingredients": [
        "1 1/4 to 1 1/2 pounds chicken breasts with skin and bones",
        "5 cups water",
        "1 large white onion, finely chopped and divided",
        "2 large garlic cloves; 1 whole, 1 finely chopped",
        "1 Turkish bay leaf",
        "Salt",
        "1 pound plum tomatoes (about 4; see Cooks' notes)",
        "2 tablespoons canola oil",
        "1/2 teaspoon dried oregano",
        "1 to 1 1/2 tablespoons finely chopped chipotle in adobo, including some sauce",
        "24 (5- to 6-inch) soft corn tortillas",
        "1/4 cup crumbled cotija or mild goat cheese",
        "24 small sprigs cilantro",
        "Special equipment: Instant-read thermometer (optional); a 3-inch round cookie/biscuit cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Tomato",
        "Appetizer",
        "Braise",
        "Cocktail Party",
        "Cinco de Mayo",
        "New Year's Eve",
        "Party",
        "Tortillas",
        "Chile Pepper",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Bite-Size Chipotle Chicken Soft Tacos (_tinga de pollo_)",
    "url": "http://www.epicurious.com/recipes/food/views/bite-size-chipotle-chicken-soft-tacos-em-tinga-de-pollo-em-51142270"
}
