{
    "directions": [
        "Fill a bowl with ice; add enough salted water to make an ice bath. Bring a large pot of lightly salted water to a boil. Cook the bitter melon in the boiling water until tender yet firm, about 2 minutes; strain the melon. Place the melon into the ice bath; allow to sit until bitterness is extracted, about 1 hour. Drain melon.",
        "Whisk 1 teaspoon soy sauce, 1 teaspoon cornstarch, and baking soda together in a bowl. Add beef and toss to evenly coat. Marinate in the refrigerator for 1 hour.",
        "Heat wok, or a large skillet, on high until smoking. Add 1 tablespoon oil. Lay beef evenly across the bottom of the wok; cook until browned, about 2 minutes per side. Remove beef. Pour in 1 teaspoon of oil; allow to heat. Add onion, garlic, and ginger; cook and stir until fragrant, about 30 seconds. Stir in bitter melon; cook until combined, about 1 minute.",
        "Stir black bean sauce into melon mixture. Stir in remaining soy sauce, oyster sauce, and sugar. Pour in 3/4 cup water; cover and let simmer until flavors combine, 2 to 3 minutes. Uncover and mix in remaining cornstarch and 1 teaspoon water and stir until thickened."
    ],
    "ingredients": [
        "ice cubes",
        "1 bitter melon, seeded and sliced",
        "2 teaspoons soy sauce, divided",
        "2 teaspoons cornstarch, divided",
        "1/4 teaspoon baking soda",
        "6 ounces beef, sliced",
        "1 tablespoon oil",
        "1 teaspoon oil",
        "1/2 onion, sliced",
        "2 cloves garlic",
        "1 tablespoon chopped fresh ginger",
        "1 tablespoon black bean sauce",
        "1 tablespoon oyster sauce",
        "1 pinch white sugar, or to taste",
        "3/4 cup water",
        "1 teaspoon water",
        "salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bitter Melon and Black Bean Sauce Beef",
    "url": "http://allrecipes.com/recipe/254527/bitter-melon-and-black-bean-sauce-bee/"
}
