{
    "directions": [
        "Line the bottom of a buttered 8 1/2-inch springform pan with wax paper, butter the paper, and dust the pan with flour, shaking out the excess. In a metal bowl set over a saucepan of barely simmering water melt the chocolates, stirring until the mixture is smooth, remove the bowl from the pan, and let the chocolate cool until it is room temperature. In the bowl of an electric mixer cream together the butter and the sugar until the mixture is pale and fluffy, add the chocolate, and beat the mixture until it is combined well. Beat in the egg yolks, 1 at a time, beating well after each addition, and beat in the bourbon and the flour. In a large bowl beat the egg whites with a pinch of salt until they just hold stiff peaks, stir one third of them into the chocolate mixture to lighten it, and fold in the remaining whites and the chopped pecans gently but thoroughly. Turn the batter into the prepared pan and bake the cake in the middle of a preheated 350°F. oven for 35 to 40 minutes, or until a tester inserted 2 inches from the rim comes out clean. (The center of the cake will remain moist.) Transfer the cake to a rack and let it cool completely. Remove the cake from the pan, invert it onto the rack, and remove the wax paper carefully. The cake may be made 1 day in advance and kept wrapped in plastic wrap at room temperature.",
        "Put the chocolate in a small bowl, in saucepan bring the cream to a boil, and pour it over the chocolate. Stir the mixture until the chocolate is melted and the glaze is smooth.",
        "Invert the cake onto rack set on wax paper, pour the glaze over it, smoothing the glaze over the top and side with a spatula, and arrange the pecan halves in the center of the cake. Let the cake stand 2 hours, or until the glaze is set, and serve it with the whipped cream."
    ],
    "ingredients": [
        "6 ounces fine-quality bittersweet chocolate, chopped",
        "2 ounces unsweetened chocolate, chopped",
        "1 stick (1/2 cup) unsalted butter, softened",
        "3/4 cup sugar",
        "6 large eggs, separated",
        "1/4 cup bourbon",
        "1 tablespoon all-purpose flour",
        "1/2 cup pecans, toasted lightly, cooled, and chopped fine",
        "6 ounces fine-quality bittersweet chocolate, chopped",
        "1/2 cup heavy cream",
        "4 pecan halves",
        "lightly sweetened whipped cream as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Bourbon",
        "Chocolate",
        "Dessert",
        "Bake",
        "Pecan",
        "Engagement Party",
        "Gourmet"
    ],
    "title": "Bittersweet Chocolate Pecan Bourbon Cake",
    "url": "http://www.epicurious.com/recipes/food/views/bittersweet-chocolate-pecan-bourbon-cake-12146"
}
