{
    "directions": [
        "Combine first 4 ingredients in bowl. Add flour and stir just until blended; let stand 5 minutes. Press dough onto bottom and up sides of 9- to 91/2-inch-diameter tart pan with removable bottom. Chill 30 minutes.",
        "Position rack in bottom third of oven and preheat to 350°F. Bake crust until deep golden, pressing down with back of spoon if bubbles form, about 25 minutes. Cool crust in pan on rack.",
        "Combine chocolate, butter, and both peels in medium metal bowl. Place bowl in skillet of barely simmering water set over low heat. Stir just until chocolate and butter are melted and smooth. Remove bowl from water. Place fine strainer over bowl with melted chocolate. Keep skillet with water set over low heat.",
        "Whisk egg yolk in small metal bowl to blend. Gradually whisk in 1/4 cup boiling water. Place bowl in skillet of hot water; stir constantly with heatproof rubber spatula, scraping bottom of bowl to prevent egg from cooking, until instant-read thermometer inserted into egg mixture registers 160°F, about 3 minutes. Immediately pour egg mixture into strainer set over bowl of chocolate. Stir just until egg is incorporated into chocolate and mixture is smooth.",
        "Pour chocolate filling into crust; tilt slightly to spread evenly (crust will not be completely filled). Cover and chill overnight or up to 2 days. Before serving, let tart soften slightly at room temperature.",
        "Remove pan sides. Place tart on platter. Using pastry bag fitted with star tip, pipe whipped cream rosettes around edge of tart. Garnish with candied peel."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter, melted",
        "1/4 cup sugar",
        "3/4 teaspoon vanilla extract",
        "1/8 teaspoon salt",
        "1 cup all purpose flour",
        "8 ounces bittersweet or semisweet chocolate, finely chopped",
        "5 tablespoons unsalted butter, cut into 5 pieces",
        "1/2 teaspoon (lightly packed) finely grated blood orange peel or orange peel",
        "1/2 teaspoon (lightly packed) finely grated pink grapefruit peel",
        "1 large egg yolk, room temperature",
        "1/4 cup boiling water",
        "Jasmine Whipped Cream (see recipe)",
        "Candied Citrus Peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Citrus",
        "Dessert",
        "Bake",
        "Christmas",
        "Grapefruit",
        "Orange",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Bittersweet Chocolate-Citrus Tart with Jasmine Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/bittersweet-chocolate-citrus-tart-with-jasmine-whipped-cream-231326"
}
