{
    "directions": [
        "Preheat oven to 375°F. Butter a 6-cup soufflé dish and coat with additional granulated sugar, knocking out excess sugar. Butter and sugar a 6-inch-wide doubled piece of foil or wax paper long enough to fit around dish. Fit prepared dish with collar extending 2 inches above rim.",
        "In a bowl whisk together flour and 1 tablespoon granulated sugar. In a small bowl whisk together egg yolks and 1/4 cup milk and add to flour mixture, whisking until smooth.",
        "In a heavy saucepan heat remaining 1 1/4 cups milk over high heat until it just comes to a boil and whisk into yolk mixture in a slow stream. Transfer mixture to pan and cook over moderate heat, whisking, until it just comes to a boil. Cook mixture at a bare simmer, whisking constantly, until very thick, about 2 minutes. Remove pan from heat and whisk in vanilla and chocolate until custard is smooth. Transfer custard to a large bowl.",
        "In another bowl with an electric mixer beat egg whites with salt until they just hold soft peaks. Beat in remaining sugar in a slow stream, beating until meringue just holds stiff peaks. Stir one fourth of meringue into custard to lighten and fold in remaining meringue gently but thoroughly. Spoon mixture into prepared dish. Soufflé may be prepared up to this point 1 hour ahead and chilled, covered with a paper towel and plastic wrap. Do not let paper towel touch surface of soufflé. Put cold soufflé in preheated oven. Bake soufflé in middle of oven 30 to 35 minutes, or until firm and set in center.",
        "Carefully remove collar from soufflé dish and sift confectioners' sugar over soufflé. Serve soufflé immediately with whipped cream."
    ],
    "ingredients": [
        "1/3 cup granulated sugar plus additional for coating soufflé dish",
        "3 tablespoons all-purpose flour",
        "3 large egg yolks",
        "1 1/2 cups milk",
        "2 teaspoons vanilla extract",
        "6 ounces fine-quality bittersweet chocolate (not unsweetened), chopped fine",
        "6 large egg whites",
        "1/4 teaspoon salt",
        "confectioner's sugar",
        "Accompaniment: lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Bittersweet Chocolate Soufflé",
    "url": "http://www.epicurious.com/recipes/food/views/bittersweet-chocolate-souffle-10145"
}
