{
    "directions": [
        "Preheat oven to 375°F. Butter two 1 1/4-cup ramekins and coat the inside of each ramekin with granulated sugar, knocking out the excess. In a small metal bowl set over a pan of barely simmering water melt 4 ounces of the chocolate and 1 tablespoon of the butter with the espresso mixture and 1 tablespoon of the Kahlúa or rum, whisk the mixture until it is smooth, and remove the bowl from the heat. Let the chocolate mixture cool for 5 minutes and whisk in the yolks, 1 at a time. In a bowl with an electric mixer beat the whites with a pinch of salt until they just hold stiff peaks, whisk about one fourth of them into the chocolate mixture to lighten it, and fold in the remaining whites gently but thoroughly. Divide the batter between the ramekins and bake the cakes in the middle of the oven for 17 to 20 minutes, or until they are puffed and a tester comes out almost clean. Let the cakes cool in the ramekins on a rack for 3 minutes.",
        "While the cakes are baking, in another small bowl set over the pan of barely simmering water melt 2 ounces of the remaining chocolate with the remaining 1/2 tablespoon butter and the heavy cream and whisk the sauce until it is smooth. Remove the bowl from the heat and whisk in the remaining 1 tablespoon Kahlúa or rum.",
        "Pour half the sauce onto each of 2 dessert plates, run a thin knife around the edge of each ramekin, and invert a cake onto each plate. Top the cakes with the whipped cream and garnish them with the grated chocolate."
    ],
    "ingredients": [
        "6 ounces fine-quality bittersweet (not unsweetened) chocolate, chopped, plus grated bittersweet chocolate for garnish",
        "1 1/2 tablespoons unsalted butter",
        "2 teaspoons instant espresso powder dissolved in 1 tablespoon hot water",
        "2 tablespoons Kahlúa or dark rum",
        "2 large egg yolks",
        "3 large egg whites",
        "3 tablespoons heavy cream",
        "lightly sweetened whipped cream as an a accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Bittersweet Chocolate Fallen Soufflé Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/bittersweet-chocolate-fallen-souffle-cakes-10959"
}
