{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter and flour 8-inch-diameter springform pan.",
        "Boil 1/2 cup whiskey in small saucepan until reduced to 1/4 cup, about 2 minutes. Combine bittersweet chocolate, espresso powder mixture, and 1/4 cup boiled whiskey in small metal bowl. Place bowl over saucepan of simmering water; stir until mixture is smooth. Remove bowl from over water. Finely grind almonds with 2 tablespoons flour in processor.",
        "Using electric mixer, beat 1/2 cup butter and 6 tablespoons vanilla sugar in medium bowl until fluffy. Beat in egg yolks 1 at a time, then sea salt. Fold in chocolate mixture, then ground almond mixture. Using clean dry beaters, beat egg whites in another bowl until soft peaks form. Gradually add 1 tablespoon vanilla sugar, beating until stiff peaks form. Fold whites into batter alternately with remaining 4 tablespoons flour in 3 additions. Transfer batter to prepared pan.",
        "Bake cake until tester inserted into center comes out clean, about 40 minutes. Cool in pan on rack 30 minutes. Remove pan sides and cool cake completely.",
        "Combine semisweet chocolate and remaining 2 tablespoons whiskey in small metal bowl. Place bowl over saucepan of simmering water and stir until smooth. Remove bowl from over water. Add remaining 1/4 cup butter to chocolate mixture, 1 small piece at a time, whisking until each piece is melted before adding next. Place bowl over larger bowl of ice water. Using electric mixer, beat icing until thickened to spreadable consistency, about 1 minute. Spread icing over top and sides of cake. DO AHEAD Can be made 8 hours ahead. Cover with cake dome and let stand at room temperature."
    ],
    "ingredients": [
        "1/2 cup plus 2 tablespoons Irish whiskey",
        "6 ounces bittersweet (70% cocoa) chocolate (such as Scharffen Berger or Lindt), chopped",
        "2 teaspoons instant espresso powder dissolved in 6 tablespoons hot water",
        "1/3 cup blanched almonds (about 2 ounces), lightly toasted",
        "6 tablespoons all purpose flour, divided",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature, divided",
        "7 tablespoons vanilla sugar , divided",
        "3 large eggs, separated",
        "Pinch of fine sea salt",
        "2 ounces semisweet chocolate, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Chocolate",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Almond",
        "Whiskey",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Bittersweet Chocolate Irish Whiskey Cake",
    "url": "http://www.epicurious.com/recipes/food/views/bittersweet-chocolate-irish-whiskey-cake-238254"
}
