{
    "directions": [
        "Position rack in center of oven; preheat to 350°F. Line bottom of 9-inch round cake pan with 2-inch-high sides with parchment paper. Generously butter and flour sides of pan and parchment. Stir chocolate and butter in large bowl set over saucepan of simmering water until melted and smooth. Turn off heat. Let chocolate stand over water. Mix cherries and framboise in medium saucepan. Bring to simmer over medium heat. Reduce heat to low; simmer until all liquid is absorbed, stirring often, about 9 minutes. Set aside.",
        "Remove bowl with melted chocolate from over water. Whisk in sugar, vanilla and salt, then eggs 1 at a time. Add flour in 2 additions, blending well after each. Fold in cherries. Pour batter into pan.",
        "Bake cake until tester inserted into center comes out with moist crumbs attached, about 35 minutes. Cool completely in pan on rack. Cut around pan sides to loosen cake. Turn out cake onto plate; peel off parchment paper. (Can be prepared 2 days ahead. Store airtight at room temperature.) Sift powdered sugar generously over cake.",
        "*Sold at some liquor stores and specialty foods stores. If unavailable, substitute raspberry liqueur."
    ],
    "ingredients": [
        "7 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/2 cup (1 stick) unsalted butter, diced",
        "1 cup dried tart cherries (about 5 ounces), coarsely chopped",
        "1/2 cup framboise eau-de-vie (clear raspberry brandy)*",
        "1 cup sugar",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "4 large eggs",
        "2/3 cup all purpose flour",
        "Powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Dried Fruit",
        "Cherry",
        "Chambord",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Bittersweet Chocolate Cake with Dried Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/bittersweet-chocolate-cake-with-dried-cherries-104733"
}
