{
    "directions": [
        "Preheat oven to 350°F.",
        "On a work surface, stack phyllo sheets and cut out three 6-inch squares (6 total), discarding scraps. Stack phyllo squares between 2 sheets of wax paper and cover with a kitchen towel. Line each of two 1/2-cup muffin tins with 1 phyllo square, pressing gently into bottom, with edges overhanging top of tin. Repeat with remaining squares in same 2 tins, overlapping corners in different directions, but do not reposition phyllo once in tin (it may tear).",
        "Bake phyllo shells in middle of oven until edges are golden brown, 5 to 10 minutes. Carefully transfer phyllo shells to a rack and cool completely. Phyllo shells may be made 1 day ahead and kept in an airtight container at room temperature.",
        "In a saucepan, simmer raspberries and granulated sugar, stirring occasionally, 10 minutes and stir in eau-de-vie or liqueur. In a blender, purée mixture until smooth and strain through a sieve into a heatproof bowl. Chill sauce, covered, at least 30 minutes and up to 2 days.",
        "In a small saucepan whisk together granulated sugar and cornstarch and add water and egg, whisking until smooth. Bring mixture to a boil over moderate heat, whisking and simmer, whisking vigorously, 1 minute. Remove pan from heat and add chocolate and eau-de-vie or liqueur, stirring until chocolate is melted. Transfer mixture to a metal bowl set in a bowl of ice and cold water and beat until cold and lightened in color. In a bowl, beat cream until it just holds stiff peaks and fold into chocolate mixture gently, but thoroughly. Chill mousse, covered, at least 30 minutes and up to 2 days.",
        "In a small metal bowl, set over a saucepan of barely simmering water, melt chocolate and on a baking sheet (not non-stick) spread it with a metal spatula as thinly and evenly as possible. Cool chocolate until firm to the touch but not hard. (Alternatively, chill chocolate on sheet in refrigerator; if it becomes too hard let it soften slightly at room temperature.) with a pastry scraper or metal spatula held at an angle, scrape chocolate slowly from sheet, letting it curl. Transfer curls carefully as formed to another baking sheet lined with wax paper. Chocolate curls may be made 1 day ahead and chilled, covered loosely. An ounce of chocolate yields enough chocolate curls to garnish 2 to 4 Servings.",
        "In a bowl, whisk cream until it just begins to thicken. Pour some raspberry sauce onto 2 dessert plates and dot with thickened cream. Pull point of a skewer or wooden pick through cream to form hearts. With a sieve, dust phyllo shells with confectioners' sugar and cocoa powder. Arrange phyllo shells on top of sauce and spoon about 1/3 cup mousse into each shell (do not overfill). Top mousse with chocolate curls."
    ],
    "ingredients": [
        "2 phyllo sheets, thawed if frozen",
        "a 10-ounce package frozen raspberries in light syrup",
        "2 tablespoons granulated sugar",
        "1 tablespoon eau-de-vie-de framboise or raspberry liqueur",
        "2 tablespoons granulated sugar",
        "1 tablespoon cornstarch",
        "1/2 cup water",
        "1 large egg",
        "3 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "1 tablespoon eau-de-vie-de framboise or raspberry liqueur",
        "1/4 cup well-chilled heavy cream",
        "3 tablespoons well-chilled heavy cream",
        "confectioners' sugar",
        "unsweetened cocoa powder",
        "chocolate curls",
        "fine quality bittersweet chocolate (not unsweetened), chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Raspberry",
        "Eau de Vie",
        "Chambord",
        "Anniversary",
        "Chill",
        "Phyllo/Puff Pastry Dough",
        "Gourmet"
    ],
    "title": "Bittersweet Chocolate Mousse in Phyllo with Raspberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/bittersweet-chocolate-mousse-in-phyllo-with-raspberry-sauce-10076"
}
