{
    "directions": [
        "Position rack in center of oven; preheat to 350°F. Blend cookie crumbs and sugar in processor. Add melted butter; process until crumbs are evenly moistened. Press crumb mixture onto bottom and up sides (not rim) of 9-inch-diameter glass pie dish. Bake until crust begins to set and no longer looks moist, pressing gently with back of fork if crust puffs, about 12 minutes. Remove crust from oven, then sprinkle chopped chocolate over bottom of crust. Let stand until chocolate softens, 1 to 2 minutes. Using offset spatula or small rubber spatula, spread chocolate over bottom and up sides of crust to cover. Chill crust until chocolate sets, about 30 minutes.",
        "Whisk sugar, cocoa, cornstarch, and salt to blend in heavy medium saucepan. Gradually add 1/3 cup milk, whisking until smooth paste forms. Whisk in remaining milk, then 1/4 cup cream. Using flat-bottom wooden spoon or heatproof spatula, stir mixture constantly over medium heat, scraping bottom and sides of pan until pudding thickens and begins to bubble at edges, about 5 minutes. Add chocolate; stir until mixture is smooth. Remove from heat; stir in rum and vanilla. Pour hot pudding into crust and spread evenly. Cool 1 hour at room temperature. Cover with plastic wrap; chill overnight. DO AHEAD: Can be made 2 days ahead. Keep refrigerated.",
        "Using electric mixer, beat crème fraîche, whipping cream, sugar, and vanilla in medium bowl just until stiff peaks form and mixture is thick enough to spread (do not overbeat or mixture may curdle). Spread topping decoratively over top of pie, swirling to create peaks, if desired. DO AHEAD: Pie can be made 6 hours ahead. Cover with cake dome and refrigerate.",
        "Sprinkle chocolate shavings decoratively atop pie, if desired. Cut pie into wedges and serve.",
        "* Sold at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "1 cup chocolate wafer cookie crumbs (about half of one 9-ounce package; about 23 cookies, finely ground in processor)",
        "2 tablespoons sugar",
        "5 tablespoons unsalted butter, melted",
        "2 ounces bittersweet chocolate (60% cacao), finely chopped",
        "1/3 cup sugar",
        "1/3 cup unsweetened cocoa powder",
        "2 tablespoons cornstarch",
        "1/8 teaspoon salt",
        "1 3/4 cups whole milk, divided",
        "1/4 cup heavy whipping cream",
        "4 ounces bittersweet chocolate (60% cacao), finely chopped",
        "1 tablespoon dark rum",
        "1 teaspoon vanilla extract",
        "1 cup chilled crème fraîche*",
        "1 cup chilled heavy whipping cream",
        "1/4 cup sugar",
        "1 teaspoon vanilla extract",
        "Bittersweet chocolate shavings or curls (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Bittersweet Chocolate Pudding Pie with Crème Fraîche Topping",
    "url": "http://www.epicurious.com/recipes/food/views/bittersweet-chocolate-pudding-pie-with-creme-fraiche-topping-241117"
}
