{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray a 5-quart casserole with cooking spray.",
        "Combine the canned yellow corn, mixed yellow and white corn, white shoepeg corn, and diced tomatoes in a large bowl.",
        "Beat the cream cheese, mayonnaise, sour cream, chili-garlic sauce, taco seasoning, and lime juice together in a separate large mixing bowl until smooth and creamy.",
        "Transfer the corn and tomatoes into the bowl containing the cream cheese dressing. Add the red onion, green onions, cilantro, and jalapeno pepper; stir until thoroughly combined. Fold the Cheddar cheese and Mexican-style cheese blend into the corn mixture until thoroughly combined; season with kosher salt and spoon into the prepared baking dish.",
        "Bake in the preheated oven for 25 minutes, stir and continue baking until the dip is hot and bubbling and the top is lightly browned, 20 to 25 more minutes. Cool for 15 minutes before serving."
    ],
    "ingredients": [
        "cooking spray",
        "1 (14 ounce) can whole yellow corn, drained",
        "1 (14 ounce) can whole mixed yellow and white corn, drained",
        "1 (14 ounce) can white shoepeg corn, drained",
        "2 (14 ounce) cans Mexican-style diced tomatoes and green chilies with cilantro and lime juice (such as RO*TEL®), drained",
        "1 (8 ounce) package cream cheese, softened",
        "1 cup real mayonnaise",
        "1 cup sour cream",
        "2 tablespoons chile-garlic sauce (such as Sriracha®), or to taste",
        "2 (1 ounce) packages taco seasoning mix (such as Old El Paso®)",
        "1 lime, juiced",
        "1/2 cup chopped red onion, or to taste",
        "1 bunch thin green onions, chopped",
        "1/2 cup chopped fresh cilantro, or to taste",
        "1 jalapeno pepper, minced (more if you want is spicier)",
        "1 1/2 cups shredded Cheddar cheese",
        "1 1/2 cups shredded Mexican-style cheese blend",
        "1 teaspoon kosher salt (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "BJ's Hot Corn Dip",
    "url": "http://allrecipes.com/recipe/219683/bjs-hot-corn-dip/"
}
