{
    "directions": [
        "In a heavy, dry skillet over moderate heat, toast cardamom, coriander, peppercorns, cumin, allspice, and chiles, stirring often, until fragrant, about 1 to 2 minutes. Remove from pan and let cool. Using spice or coffee grinder, grind spices and chiles to semi-fine powder. In small bowl, stir together spice powder and salt.",
        "Pat lamb shanks dry. Measure 1 teaspoon spice mixture into separate small bowl and set aside. Rub remaining mixture over shanks and refrigerate at least 6 hours and up to 24 hours.",
        "Preheat oven to 350°F.",
        "In 8-quart heavy pot over moderately high heat, heat 1 tablespoon oil until hot but not smoking. Working in batches (wipe pan clean and add 1 tablespoon oil between batches), sear shanks, turning occasionally, until brown on all sides, about 5 minutes per batch. Transfer as browned to large roasting pan.",
        "Do not clean fat from pot. Lower heat to moderate and add onions, cloves, and bay leaves. Sauté until onions are soft, about 8 minutes. Stir in reserved teaspoon spice mixture and sauté until fragrant, about 30 seconds. Whisk in wine, lamb stock, tamarind paste, rosemary, thyme, brown sugar, celery root, ginger, garlic, and salt, then raise heat and bring to boil. Pour mixture over shanks, cover tightly with foil, and braise in middle of oven until meat is very tender, about 2 1/2 to 3 hours.",
        "Transfer shanks to large plate and cover loosely with foil to keep warm.",
        "Pour braising liquid through fine-mesh strainer into 6-quart heavy saucepan, pressing on solids with back of spoon. Place saucepan over moderately high heat and bring to boil, then lower heat and simmer, uncovered, until sauce is reduced by half (to about 4 cups), about 25 minutes.",
        "Remove string from shank and serve with 1/2 cup of sauce."
    ],
    "ingredients": [
        "6 whole black cardamom pods",
        "1 tablespoon coriander seeds",
        "1 tablespoon whole black peppercorns",
        "2 teaspoons cumin seeds",
        "1 teaspoon whole allspice",
        "2 whole dried Thai chiles*",
        "2 tablespoons kosher salt",
        "8 (1-pound) bone-in lamb shanks, tied**",
        "About 1/4 cup corn oil",
        "4 medium onions, coarsely chopped",
        "4 whole cloves",
        "4 Turkish bay leaves",
        "1/2 cup dry white wine",
        "9 cups lamb stock or water",
        "3 tablespoons tamarind paste***",
        "2 whole sprigs fresh rosemary",
        "2 whole sprigs fresh thyme",
        "4 tablespoons (packed) light brown sugar",
        "1 medium celery root (celeriac), peeled and cut into 1/2-inch pieces",
        "2 tablespoons fresh ginger, finely chopped",
        "5 cloves garlic, finely chopped (about 2 tablespoons)",
        "1 tablespoon kosher salt",
        "*Dried serrano chiles can be substituted.",
        "**Use kitchen string to tie each shank at the top, middle, and bottom. Alternatively, have your butcher do this.",
        "***Tamarind paste is available at Asian and Middle Eastern markets. For best results, look for it in block form.",
        "Special equipment: kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Pepper",
        "Braise",
        "Dinner",
        "Meat",
        "Lamb Shank",
        "Spice",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Black Pepper Braised Lamb Shanks",
    "url": "http://www.epicurious.com/recipes/food/views/black-pepper-braised-lamb-shanks-236818"
}
