{
    "directions": [
        "Preheat oven to 425°F. Place barley in a medium pot and add water to cover by 1 1/2\". Season with salt. Bring to a boil; reduce heat and simmer uncovered until barley is tender and water is absorbed, 40-45 minutes. Spread out barley on a large rimmed baking sheet; let cool.",
        "While barley is cooking, toss fennel slices and 2 tablespoons oil in a medium bowl to coat. Season with salt and pepper. Spread fennel slices out in a single layer on another rimmed baking sheet. Roast until fennel is crisp-tender and beginning to brown in spots, about 18 minutes. Let fennel cool on baking sheet. DO AHEAD: Barley and fennel can be prepared 1 day ahead. Cover separately and refrigerate.",
        "Whisk orange juice, lime juice, shallot, 2 tablespoons dill, and zest in a medium bowl. Gradually whisk in remaining 1/2 cup oil; season orange vinaigrette with salt and pepper.",
        "Transfer barley to a large bowl; add roasted fennel, along with any accumulated juices on baking sheet. Add half of radishes, olives, and 1/4 cup dill sprigs. Drizzle 1/2 cup orange vinaigrette over and toss to coat; season with salt and pepper. Arrange salad on a large platter.",
        "Scatter remaining radishes, reserved fennel fronds, and remaining 1/4 cup dill sprigs over salad. Pass remaining orange vinaigrette alongside for drizzling over."
    ],
    "ingredients": [
        "2 cups black or pearl barley, rinsed",
        "Kosher salt",
        "1 large fennel bulb (about 10 ounces), 2 tablespoons fronds set aside, bulb cut lengthwise into 1/4\" slices",
        "2 tablespoons plus 1/2 cup olive oil",
        "Freshly ground black pepper",
        "1/3 cup fresh orange juice",
        "1/4 cup fresh lime juice",
        "1 small shallot, minced",
        "2 tablespoons chopped fresh dill plus 1/2 cup dill sprigs, divided",
        "1 teaspoon finely grated orange zest",
        "4 large radishes, thinly sliced, divided",
        "1/4 cup oil-cured olives, pitted, halved lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Side",
        "Vegetarian",
        "High Fiber",
        "Lunch",
        "Barley",
        "Fennel",
        "Radish",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Black Barley, Fennel, and Radish Salad",
    "url": "http://www.epicurious.com/recipes/food/views/black-barley-fennel-and-radish-salad-395911"
}
