{
    "directions": [
        "Arrange oven rack in middle position and preheat oven to 375°F.",
        "Cut peel, including white pith, from 3 oranges with a small sharp knife. Working over a bowl, cut segments free from membranes. Squeeze juice from membranes into bowl. Drain off as much juice as possible from segments into a measuring cup. Squeeze enough juice from remaining orange to total 2/3 cup of juice.",
        "Heat 2 tablespoons oil with butter in a 12-inch heavy skillet over moderate heat until butter is melted, then cook onion, stirring occasionally, until softened and golden brown, 18 to 20 minutes.",
        "While onion is caramelizing, cook rhubarb, honey, 1/3 cup orange juice, and 1/4 teaspoon salt in a 2-quart heavy saucepan over moderate heat, stirring occasionally, until rhubarb is very tender, about 12 minutes. Force mixture through a medium-mesh sieve into a bowl, scraping and pressing hard on solids and discarding them.",
        "Add ginger and cinnamon to onion and cook, stirring, 1 minute. Add remaining 1/3 cup orange juice and boil until thickened, about 1 minute. Stir in rhubarb purée, tomatoes, pepper, and 1/2 teaspoon salt and briskly simmer, stirring occasionally until sauce is thickened slightly, 7 to 10 minutes. Remove from heat.",
        "While sauce simmers, grease a 17- by 12-inch glass or ceramic baking dish with remaining tablespoon oil. Pat fish dry and sprinkle with remaining 1/2 teaspoon salt. Arrange fish, skin sides up, in 1 layer in baking dish and bake until opaque and just cooked through, 12 to 14 minutes. Stir orange segments into sauce and cook until heated through, 1 to 2 minutes, and season with salt. Stir mint into sauce and serve with fish."
    ],
    "ingredients": [
        "4 navel oranges",
        "3 tablespoons olive oil",
        "1 tablespoon unsalted butter",
        "1 large onion, halved lengthwise and thinly sliced lengthwise",
        "1 lb rhubarb, cut into 1-inch pieces",
        "2 tablespoons mild honey",
        "1 1/4 teaspoons salt",
        "1 1/2 teaspoons minced peeled fresh ginger",
        "1/4 teaspoon cinnamon",
        "1 (14- to 15-oz) can diced tomatoes including juice",
        "1/4 teaspoon black pepper",
        "6 (6- to 8-oz) black sea bass fillets with skin and small bones removed",
        "1/4 cup chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Fruit",
        "Ginger",
        "Roast",
        "Sauté",
        "Orange",
        "Mint",
        "Bass",
        "Spring",
        "Rhubarb",
        "Cinnamon",
        "Simmer",
        "Gourmet"
    ],
    "title": "Black Sea Bass with Sweet-and-Sour Orange Rhubarb Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/black-sea-bass-with-sweet-and-sour-orange-rhubarb-sauce-234253"
}
