{
    "directions": [
        "Position rack in lowest third of oven and preheat to 400°F. Roll out pie crust disk on lightly floured surface to 13-inch-diameter round (about 1/8 inch thick). Roll up dough on rolling pin and transfer to 9-inch-diameter glass pie plate. Trim edges of crust, leaving 1/2-inch overhang. Fold excess dough under. Crimp edges. Freeze until crust is firm, about 15 minutes.",
        "Line pie crust with foil. Fill foil with beans or pie weights. Bake until crust is set, about 15 minutes. Remove beans and foil and continue baking until crust is golden brown, piercing with toothpick if crust bubbles, about 12 minutes. Cool completely.",
        "Stir bittersweet chocolate, whipping cream and unsalted butter in heavy small saucepan over low heat until chocolate and butter melt and mixture is smooth. Spoon 6 tablespoons ganache into prepared crust. Spread ganache with back of spoon to cover crust bottom completely. Let stand until ganache is cool but not set, about 20 minutes. Reserve remaining ganache in saucepan. Arrange 2/3-inch-thick banana slices atop ganache, pressing bananas lightly into ganache.",
        "Combine vanilla extract and dark rum in small bowl. Sprinkle unflavored gelatin over. Let stand 10 minutes to soften gelatin. Bring 1/2 cup whipping cream to simmer in heavy small saucepan. Whisk egg yolks and sugar to blend in another small bowl. Gradually whisk in hot whipping cream. Return mixture to saucepan. Stir over medium-low heat until mixture thickens and leaves path on back of spoon when finger is drawn across, about 4 minutes; do not boil. Add gelatin mixture and stir until gelatin melts. Transfer custard to large bowl. Chill until cool but not set, stirring occasionally, about 20 minutes. Whip 1/2 cup chilled whipping cream to medium peaks in medium bowl. Fold into custard in 2 additions. Spoon custard into crust. Refrigerate until set, about 2 hours.",
        "Stir reserved ganache over low heat until just warm and pourable. Carefully pour ganache onto center of filling. Tilt pie, rotating to spread ganache to within 1/4 inch of pie edge. Chill until ganache is set, about 15 minutes. (Can be prepared 8 hours ahead.)",
        "Beat 3/4 cup whipping cream with 2 tablespoons sugar to firm peaks. Spoon whipped cream into pastry bag fitted with large star tip. Pipe rosettes around inside edge of crust. Place banana slices in ring alongside rosettes. Cut pie into wedges."
    ],
    "ingredients": [
        "1 Buttermilk Pie Crust Dough disk",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/4 cup whipping cream",
        "2 tablespoons (1/4 stick) unsalted butter",
        "2 large firm ripe bananas (about 1 1/4 pounds), cut into 2/3-inch-thick slices",
        "1 1/2 teaspoons vanilla extract",
        "1 1/2 teaspoons dark rum",
        "1/2 teaspoon unflavored gelatin",
        "1/2 cup whipping cream",
        "5 large egg yolks",
        "3 tablespoons sugar",
        "1/2 cup chilled whipping cream",
        "3/4 cup chilled whipping cream",
        "2 tablespoons sugar",
        "2 firm ripe bananas, thinly sliced on diagonal"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Banana",
        "Chill",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Black Bottom Banana Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/black-bottom-banana-cream-pie-2696"
}
