{
    "directions": [
        "Heat olive oil in heavy large pot over medium heat. Add chopped onions and garlic and cook until onions are translucent, stirring often, about 8 minutes. Add chili powder and ground cumin and stir 1 minute. Add 14 cups water, black beans, dried oregano, and grated orange peel. Bring mixture to boil; reduce heat to medium-low, cover with lid slightly ajar, and simmer until black beans are tender, about 2 hours. Add chipotle chiles and season chili to taste with salt. Simmer until black beans are creamy, mashing coarsely with potato masher to desired consistency, adding more water by 1/2 cupfuls if too thick, and stirring frequently, about 30 minutes longer. Season chili to taste with more salt. DO AHEAD: Chili can be made 3 days ahead. Refrigerate uncovered until cold, then cover and keep chilled.",
        "Char poblano chiles over gas flame or in broiler until blackened on all sides. Place in large bowl, cover with plastic wrap, and let stand until cool enough to handle, about 20 minutes. Peel, seed, and chop chiles. Place chiles in medium bowl. Add onion and salsa verde. Season to taste with salt and pepper. DO AHEAD: Can be made 2 days ahead. Cover and refrigerate.",
        "Stir sour cream and minced chipotle chiles in medium bowl. Cover and refrigerate.",
        "Heat oil in heavy large skillet over high heat. Sprinkle pork ribs with salt and pepper. Working in batches, add pork ribs to skillet and cook until browned, about 7 minutes per batch. Transfer pork ribs to medium bowl. Return all pork ribs and any juices to skillet. Add chicken broth, cover, and reduce heat to low. Cook until pork is tender, stirring occasionally, about 40 minutes. Transfer to another medium bowl.",
        "Meanwhile, rewarm chili. Stir cilantro and cumin seeds into salsa.",
        "Divide chili among bowls. Top with pork, salsa, chipotle crema, and cheese.",
        "New Mexico chili powder can be found at specialty foods stores and at Latin markets. Canned chipotle chiles in adobo and fresh poblano chiles (sometimes called pasilla chiles) can be found at some supermarkets and at specialty foods stores and Latin markets."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "2 large onions, chopped (about 1 1/2 pounds Total)",
        "12 garlic cloves, chopped",
        "7 tablespoons New Mexico chili powder",
        "1 1/2 tablespoons ground cumin",
        "14 cups (or more) water",
        "1 1/2 pounds dried black beans, rinsed",
        "2 1/2 teaspoons dried oregano (preferably Mexican)",
        "1 1/2 teaspoons finely grated orange peel",
        "1 1/2 teaspoons minced canned chipotle chiles in adobo",
        "6 fresh poblano chiles",
        "1 cup finely chopped white onion",
        "1 7-ounce can salsa verde",
        "2 cups sour cream",
        "2 teaspoons minced canned chipotle chiles in adobo",
        "2 tablespoons olive oil",
        "3 pounds country-style boneless pork ribs, cut into 3/4-inch cubes",
        "1/2 cup low-salt chicken broth",
        "11/2 cups chopped fresh cilantro",
        "4 teaspoons cumin seeds, toasted",
        "Grated hot pepper Monterey Jack cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Garlic",
        "High Fiber",
        "Dinner",
        "Pork Rib",
        "Hot Pepper",
        "Winter",
        "Potluck",
        "Sour Cream",
        "Cilantro",
        "Simmer"
    ],
    "title": "Black Bean Chili with Crispy Pork and Poblano Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/black-bean-chili-with-crispy-pork-and-poblano-salsa-241620"
}
