{
    "directions": [
        "Preheat oven to 200°F.",
        "Beat egg white with a pinch of salt in a small deep bowl with an electric mixer at medium speed until it holds soft peaks. Beat in sugar 1 tablespoon at a time and continue to beat until meringue holds stiff glossy peaks, 3 to 5 minutes. Fold walnuts into meringue, then spread into a 9- by 6-inch rectangle (1/4 inch thick) on a parchment-lined baking sheet.",
        "Bake meringue in middle of oven until crisp, about 1 hour. Slide meringue (on parchment) onto a rack and cool completely. Peel off paper and break meringue into 1/2-inch pieces.",
        "Line bottom of molds with rounds of wax paper or parchment. Cut 10 (10-inch-long) strips of wax paper or parchment (wide enough to cover sides of molds) and arrange, ends overlapping, around insides of molds. Put lined molds in a baking pan (for transferring to freezer).",
        "Purée blackberries in a food processor, then force through a fine-mesh sieve into a bowl, discarding seeds. Divide purée evenly between 2 bowls. Stir 2 tablespoons sugar and 1 teaspoon lemon juice into 1 bowl (for sauce) and chill, covered. Stir remaining 2 teaspoons lemon juice into other bowl (for semifreddo).",
        "Beat eggs with a pinch of salt and remaining 1/3 cup sugar in a metal bowl with a handheld mixer at medium-high speed until doubled in volume, about 5 minutes. Set bowl over a saucepan with 1 inch of simmering water and beat until mixture registers 160°F on thermometer, 6 to 8 minutes. Remove bowl from heat and chill mixture until cool, about 10 minutes. Fold in blackberry purée (reserved for semifreddo) gently but thoroughly.",
        "Beat cream with cleaned beaters until it just holds stiff peaks and fold gently into blackberry mixture, then fold in walnut meringue pieces. Spoon into molds, smoothing tops if necessary, and cover with plastic wrap. Freeze semifreddi until firm, at least 2 hours.",
        "To serve, dip each mold in a bowl of hot water 3 seconds, then wipe dry and invert onto chilled dessert plates, using paper to help pull each semifreddo from mold. Remove paper and let desserts stand at room temperature 10 minutes to soften. Serve with blackberry sauce.",
        "*Available at some cookware shops and Bridge Kitchenware (800-274-3435 or 212-838-1901)."
    ],
    "ingredients": [
        "1 large egg white at room temperature for 30 minutes",
        "1/4 cup sugar",
        "1/2 cup walnuts (1 1/2 ounces), toasted and finely chopped",
        "1 pound fresh blackberries (3 1/2 cups)",
        "1/3 cup plus 2 tablespoons sugar",
        "3 teaspoons fresh lemon juice",
        "2 large eggs",
        "1 cup chilled heavy cream",
        "Special equipment: parchment paper; 10 (5- to 6-ounce) stainless-steel or nonstick metal baba au rhum molds* or ramekins; an instant-read thermometer",
        "Garnish: fresh blackberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Frozen Dessert",
        "Blackberry",
        "Walnut",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blackberry Semifreddi with Walnut Meringue",
    "url": "http://www.epicurious.com/recipes/food/views/blackberry-semifreddi-with-walnut-meringue-108187"
}
