{
    "directions": [
        "With a sharp knife, score the skin of each fish fillet, being careful not to cut into the flesh.",
        "Slice the garlic chives very thin and place them in a small saucepot with the cup of olive oil. Cook over a very low flame until very tender, about 40 minutes. Remove from the flame and add the balsamic vinegar, soy sauce, and sun-dried tomatoes. Set aside.",
        "Remove the razor clams and split them lengthwise. Julienne the clams and store them over ice or in the refrigerator.",
        "In a large, hot sauté pan, add enough canola oil to just coat the bottom of the pan and heat to just below smoking point. Season the fish filets with fresh pepper, Wondra flour, and sea salt. Place fish skin-side down in pan, making sure to press down with a fish spatula to prevent fish from curling. Cook until skin is crisp and golden brown, about 4 to 5 minutes. Flip fish and finish cooking on the other side until it is just cooked through, about 1 to 2 minutes.",
        "In another medium sauté pan, add a little bit of canola over low heat and sweat the shallots, sugar snap peas, and snow peas until tender, making sure to avoid any caramelization. Raise heat to medium, add the mustard greens and then the mushrooms. Season with salt and pepper and cook until mushrooms are tender, about 4 to 5 minutes. Add the fish stock and clam juice and reduce by half. Add the razor clams and immediately remove pan from heat, stirring constantly. Add extra-virgin olive oil in a slow stream, then add chopped tarragon. Season to taste.",
        "Add the chopped parsley to the tomato-garlic marinade, stirring to reincorporate oil and vinegar. Divide the garnish equally among 4 plates, top with fish, and spoon about 1 teaspoon of tomato-garlic relish over top of the fish.",
        "*Low-moisture flour, available at all supermarkets."
    ],
    "ingredients": [
        "4 fillets black sea bass, about 6 to 8 ounces each",
        "2 chives, whites only",
        "1 cup extra-virgin olive oil",
        "1/4 cup balsamic vinegar",
        "1/4 cup soy sauce",
        "1/2 cup sun-dried tomatoes, drained and thinly sliced",
        "1 dozen fresh live razor clams",
        "2 teaspoons canola oil",
        "1/2 cup Wondra flour*",
        "2 shallots, chopped",
        "1/2 cup sugar snap peas, trimmed",
        "1/2 cup snow peas, trimmed and thinly sliced",
        "1/4 cup fresh corn kernels",
        "1/2 cup mustard greens",
        "1 cluster Hon-Shimeji mushrooms, cleaned and trimmed",
        "1/4 cup fish stock",
        "1/4 cup fresh clam juice or high-quality bottled clam juice",
        "1/4 bunch flat-leaf parsley, chopped",
        "1 teaspoon tarragon, chopped",
        "Extra-virgin olive oil",
        "Sea salt",
        "Freshly ground white pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Leafy Green",
        "Mushroom",
        "Tomato",
        "Sauté",
        "Bass",
        "Clam",
        "Summer",
        "Shallot",
        "Sugar Snap Pea"
    ],
    "title": "Black Bass with Hon-Shimeji Mushrooms, Razor Clams, and Tomato-Garlic Marinade",
    "url": "http://www.epicurious.com/recipes/food/views/black-bass-with-hon-shimeji-mushrooms-razor-clams-and-tomato-garlic-marinade-232418"
}
