{
    "directions": [
        "Combine the milk, 1 tablespoon sugar, and the yeast in a large bowl; stir the egg yolks and whipping cream into the milk mixture. Allow to rest for 10 minutes.",
        "Whisk together the flour, 1/4 cup of sugar, and salt in a mixing bowl. Cut in the cold butter with a knife or pastry blender until the mixture resembles coarse crumbs. (This can also be done in a food processor: pulse the cold butter or shortening until it's the size of small peas. Turn mixture into a bowl and proceed.) Stir in yeast mixture until combined. Cover bowl with plastic wrap and refrigerate for 4 hours.",
        "Turn dough onto a lightly floured board. Divide the dough into three portions and shape them into balls. Toss blackberries with sugar.",
        "Preheat an oven to 375 degrees F (190 degrees C). Grease a baking sheet.",
        "Roll each ball out to a 9x12-inch rectangle. Spoon blackberries evenly onto the center third of each rectangle, width-wise. Using a knife, cut about 9 slanting lines along each side approximately 1 inch apart. Create a braid by folding alternating strips from each side, overlapping the berries. Place the pastry braid onto the prepared baking sheet. Repeat with the remaining two portions. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 1 hour.",
        "Bake in the preheated oven until golden brown, 25 to 30 minutes. Sprinkle with confectioners' sugar before serving."
    ],
    "ingredients": [
        "1/2 cup warm milk (110 to 115 degrees F)",
        "1 tablespoon white sugar",
        "1 (.25 ounce) package active dry yeast",
        "3 egg yolks",
        "1 cup whipping cream",
        "3 1/2 cups all-purpose flour",
        "1/4 cup white sugar",
        "1 teaspoon salt",
        "1/2 cup butter, chilled",
        "1 cup blackberries",
        "2 tablespoons white sugar, or to taste",
        "1 tablespoon confectioner's sugar, for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Blackberry Pastry Bread",
    "url": "http://allrecipes.com/recipe/180927/blackberry-pastry-bread/"
}
