{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Season pork cubes with salt, pepper, and thyme to taste and place in a cast iron skillet.",
        "Cook pork cubes in the preheated oven until cooked through, about 30 minutes. Transfer pork from skillet to a bowl, reserving drippings.",
        "Cook and stir bacon in a 9-quart Dutch oven or heavy pot over medium heat until browned, 5 to 7 minutes. Remove bacon with a slotted spoon and place on a paper towel-lined plate, reserving bacon grease.",
        "Cook and stir okra in the bacon grease over medium heat until lightly browned, about 5 minutes. Transfer okra to a bowl, reserving bacon grease. Cook and stir smoked sausage in bacon grease until browned, about 5 minutes. Add onion, bell pepper, celery, and garlic to sausage; cook and stir until softened, 5 to 10 minutes.",
        "Stir 48 fluid ounces chicken stock into sausage mixture and bring to a simmer. Stir roux into broth mixture until dissolved and slightly thickened, 2 to 3 minutes. Slowly stir 48 fluid ounces chicken stock into thickened stock; bring back to a simmer.",
        "Mix pork, pork drippings, bacon, chili powder, paprika, 2 teaspoons black pepper, file powder, rosemary, 1 teaspoon thyme, bay leaves, and Creole seasoning into thickened chicken stock; simmer, stirring often and skimming off fat, until flavors blend, about 1 hour.",
        "Stir black-eyed peas, mustard greens, okra, diced tomatoes with green chile peppers, mushrooms, and remaining chicken stock into pork-stock mixture; simmer for 1 hour more."
    ],
    "ingredients": [
        "1 (6 pound) pork butt, cut into cubes",
        "salt and ground black pepper to taste",
        "1 pinch ground thyme, or to taste",
        "8 slices bacon, cut into 1-inch pieces",
        "1 1/2 pounds okra, sliced crosswise into 1/2-inch-wide pieces",
        "3 pounds smoked sausage, sliced and halved",
        "2 cups chopped onion",
        "2 cups chopped bell pepper",
        "2 cups chopped celery",
        "2 tablespoons chopped garlic",
        "1 gallon chicken stock, divided",
        "1 (16 ounce) jar premade roux (such as Kary's®)",
        "1 tablespoon chili powder",
        "1 tablespoon paprika",
        "2 teaspoons ground black pepper",
        "1 1/2 teaspoons file powder",
        "1 teaspoon dried rosemary",
        "1 teaspoon dried thyme",
        "4 bay leaves",
        "1 pinch Creole seasoning (such as Slap Ya Mama®)",
        "5 (15 ounce) cans black-eyed peas, undrained",
        "4 (15 ounce) cans mustard greens, drained",
        "2 (10 ounce) cans diced tomatoes with green chile peppers (such as RO*TEL®)",
        "1 (16 ounce) package sliced fresh mushrooms"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Black-Eyed Pea, Pork, and Mustard Green Gumbo",
    "url": "http://allrecipes.com/recipe/240893/black-eyed-pea-pork-and-mustard-gre/"
}
