{
    "directions": [
        "Preheat the oven to 375°F. Butter generously the bottom and sides of a 9-inch square or 10-inch round tart pan with a removable bottom, line the bottom with parchment paper, and butter the paper. In a bowl toss together the coconut, the flour, and the salt. In another bowl whisk together the egg whites and the sugar until the mixture is white and foamy, stir the sugar mixture into the coconut mixture, and with a rubber spatula spread the mixture evenly on the bottom and up the sides of pan. Bake the shell in the middle of the oven for 20 to 25 minutes, or until it is firm and golden, loosen it from the sides of the pan with a small knife, and remove the sides of the pan. Let the shell cool completely on a rack, remove the bottom of the pan, peeling off the paper from the bottom of the shell, and put the shell on a platter.",
        "In a small metal bowl whisk together the egg yolks and the heavy cream, set the bowl over a saucepan of simmering water, and cook the mixture whisking constantly, until it is thickened and registers 160°F. on a candy thermometer. Remove the bowl from the pan, add the bittersweet chocolate, stirring until the chocolate is melted, and stir in the rum. In another small metal bowl set over the pan of barely simmering water melt the white chocolate, stirring, stir in the sour cream, and stir the mixture until it is just smooth. Remove the bowl from the pan and let the white and dark chocoalte mixtures cool to warm, stirring frequently.",
        "Spoon the chocolate mixtures into the macaroon shell, alternating them, shake the platter gently to settle them together. Chill the tart, covered loosely, for 8 hours, or until it is set. The tart may be made 1 day in advance and kept covered and chilled.",
        "Force the raspberries through a fine sieve into a bowl, pressing hard on the solids, scrape the pulp from the underside of the sieve into the sauce, and whisk the sauce until it is combined well. The sauce may be made 2 days in advance and kept covered and chilled.",
        "Arrange slices of the tart on each of 8 dessert plates and pour some of the raspberry sauce around them."
    ],
    "ingredients": [
        "2 cups sweetened flaked coconut",
        "2 tablespoons all-purpose flour",
        "1/2 teaspoon salt",
        "2 large egg whites",
        "1/3 cup sugar",
        "2 large egg yolks",
        "2/3 cup heavy cream",
        "6 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "2 tablespoons rum",
        "6 ounces fine-quality white chocolate, chopped",
        "1/2 cup sour cream",
        "a 10-ounce package frozen raspberries in light syrup, thawed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Raspberry",
        "Coconut",
        "Chill",
        "Gourmet"
    ],
    "title": "Black and White Chocolate Macaroon Tart with Raspberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/black-and-white-chocolate-macaroon-tart-with-raspberry-sauce-13153"
}
