{
    "directions": [
        "In a large saucepan let the beans soak in cold water to cover for 1 hour, drain them, and in the pan combine them with 2 quarts of the water. Bring the water to a boil and cook the beans at a slow boil for 1 hour, or until they are tender.",
        "While the beans are cooking, in a large heavy skillet cook the bell pepper and the onion in the oil over moderate heat, stirring, until the vegetables are softened. Drain the beans, reserving 1/2 cup of them, add the remaining beans to the bell pepper mixture with the remaining 1/4 cup water, and simmer the mixture, covered tightly, for 15 minutes, or until the beans are very tender. In a food processor blend the mixture with the vinegar and salt to taste, pulsing the motor until the mixture is combined well but not puréed smooth. Transfer the dip to a bowl and stir in the reserved 1/2 cup beans. The dip may be made 2 days in advance and kept covered and chilled. Garnish the dip with the reserved bell pepper and onion and serve it with the tortilla chips."
    ],
    "ingredients": [
        "1 1/2 cups dried black beans, picked over and rinsed",
        "2 quarts plus 1/4 cup water",
        "1 large green bell pepper, chopped fine, reserving about 1 teaspoon for garnish",
        "1 small red onion, chopped fine, reserving about 1 teaspoon for garnish",
        "3 tablespoons vegetable oil",
        "1 1/2 teaspoons ground cumin, or to taste",
        "2 tablespoons cider vinegar, or to taste",
        "tortilla chips as an accompaniment",
        "cherry peppers for garnish if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Food Processor",
        "Bean",
        "Onion",
        "Appetizer",
        "Vegetarian",
        "Bell Pepper",
        "Chill",
        "Gourmet"
    ],
    "title": "Black Bean, Green Pepper, and Red Onion Dip",
    "url": "http://www.epicurious.com/recipes/food/views/black-bean-green-pepper-and-red-onion-dip-13155"
}
