{
    "directions": [
        "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain. Run potatoes under cold water until completely chilled; drain. Remove and discard potato peels. Slice potatoes into 1/2-inch rounds.",
        "Preheat oven to 300 degrees F (150 degrees C). Lightly grease small casserole dish with oil.",
        "Arrange potatoes into the prepared casserole dish; top with rockfish. Season rockfish and potatoes with pepper.",
        "Melt butter with olive oil in a large skillet over low heat. Stir flour, Greek seasoning, paprika, and salt into the butter mixture; cook, stirring occasionally, until fragrant and you have a roux that is beige in color, 5 to 8 minutes.",
        "Whisk half-and-half into the roux; cook until thickened, 3 to 5 minutes. Stir orange juice, lemon juice, and thyme into the half-and-half mixture; whisk over heat until warmed. Remove from heat and season with salt and pepper to your taste.",
        "Pour the sauce from the skillet over the potatoes and rockfish; top with the chopped orange.",
        "Bake in preheated oven until the fish is cooked through, 15 to 20 minutes. Switch oven to Broil and continue cooking until the top is lightly browned, about 10 minutes more. Cool at room temperature for 10 minutes before serving."
    ],
    "ingredients": [
        "6 Yukon Gold potatoes",
        "6 (6 ounce) fillets rockfish, cut into 2x4-inch chunks",
        "1/4 teaspoon freshly ground black pepper, plus more to taste",
        "1/4 cup butter",
        "1 tablespoon extra-virgin olive oil",
        "3 tablespoons all-purpose flour",
        "1 teaspoon Greek seasoning",
        "1/4 teaspoon paprika",
        "1/2 teaspoon salt, plus more to taste",
        "2 cups half-and-half",
        "1 cup orange juice with pulp",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon chopped fresh thyme (optional)",
        "1 orange, peeled and chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Black Gill Rockfish in Orange Cream Sauce",
    "url": "http://allrecipes.com/recipe/236493/black-gill-rockfish-in-orange-cream-s/"
}
