{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter 9-inch-diameter springform pan. Place pan on baking sheet. Combine cherries and 1/4 cup water in small saucepan. Boil over medium-high heat until liquid almost evaporates, about 2 minutes. Add kirsch and boil 1 minute. Standing back, carefully ignite kirsch. When flames subside, mix in preserves. Cook until preserves boil and thicken, about 3 minutes. Cool.",
        "Whisk flour, cocoa, pepper, and salt in small bowl to blend. Melt butter and bittersweet chocolate in heavy medium saucepan over low heat, stirring constantly until smooth. Remove from heat; mix in 1/2 cup sugar. Using electric mixer, beat eggs, remaining 1 cup sugar, and vanilla extract in large bowl until pale and thick, about 5 minutes. Using spatula, mix in melted chocolate mixture. Fold flour mixture into batter. Fold cherry mixture and chocolate chips into batter.",
        "Transfer batter to prepared pan; smooth top. Bake until top is dry and slightly cracked and tester inserted into center of brownie comes out with some moist (not wet) batter attached, about 55 minutes. Cool brownie in pan on rack 15 minutes. Run knife around pan sides to loosen cake. Remove pan sides and cool cake completely. Replace sides of pan. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Puree cherry preserves in processor until smooth. Transfer to small resealable plastic bag.",
        "Using electric mixer, beat cream cheese, sugar, and vanilla extract in medium bowl until very smooth. Reduce speed to low. Beat in mascarpone just until smooth. Add cream and beat just until blended and still soft (do not overbeat). Immediately spread mousse evenly over brownie. Cut off enough of 1 corner of plastic bag with preserves to make 1/8-inch opening. Pipe preserves in parallel lines across mousse, spacing 1 inch apart. Starting 1 inch in from 1 side, drag tip of toothpick across lines in 1 direction. Repeat in opposite direction, 1 inch from first line. Continue, alternating direction every time to form chevron pattern. Cover and chill at least 4 hours or overnight. Cut around pan sides, then remove sides. Let torte stand 20 minutes at room temperature before serving."
    ],
    "ingredients": [
        "1 cup dried tart cherries",
        "1/4 cup water",
        "1/4 cup kirsch (clear cherry brandy)",
        "3 tablespoons cherry preserves",
        "3/4 cup all purpose flour",
        "1/4 cup unsweetened cocoa powder",
        "1 teaspoon coarsely ground black pepper",
        "1/4 teaspoon salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into chunks",
        "7 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 1/2 cups sugar, divided",
        "4 large eggs, room temperature",
        "1/4 teaspoon vanilla extract",
        "3/4 cup semisweet chocolate chips",
        "1 12-ounce jar cherry preserves",
        "3 ounces cream cheese, room temperature",
        "1/3 cup sugar",
        "1 teaspoon vanilla extract",
        "1 1/2 cups mascarpone cheese (12 ounces)",
        "3/4 cup chilled whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Cream Cheese",
        "Cherry",
        "Kirsch",
        "Winter",
        "Jam or Jelly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Black Forest Torte",
    "url": "http://www.epicurious.com/recipes/food/views/black-forest-torte-233418"
}
