{
    "directions": [
        "Fry the bacon in a microwave until crisp, or cook it in a skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, crumble, and set aside. Reserve 1 tablespoon of bacon drippings, if desired.",
        "Roughly chop the carrots, onion, and celery and transfer to a food processor. Pulse the vegetables until finely chopped.",
        "In a microwave-safe bowl, combine the reserved bacon drippings (if using), the chopped vegetables, garlic, water, bouillon cubes, and 1 can of diced tomatoes with their juice. Cook on high for 5 minutes to soften vegetables.",
        "Pour the vegetable mixture into a saucepan and add 2 cans of rinsed and drained black beans. Season with the cumin, hot sauce, and salt. Bring the mixture to a boil and then reduce the heat to low; simmer for 15 minutes.",
        "Use an immersion blender to puree the hot mixture. (If you don't have a hand-held blender, puree the mixture in batches in a food processor or standard blender.)",
        "Stir in the remaining can of diced tomatoes and can of black beans. Taste and adjust the seasonings. Add water if the consistency is too thick for your liking. Bring the soup to a simmer and heat for 5 minutes. Ladle the soup into bowls and top with sour cream, shredded cheese, and crumbled bacon."
    ],
    "ingredients": [
        "6 slices bacon",
        "2 cloves garlic, minced",
        "2 large carrots",
        "1 large onion",
        "2 stalks celery",
        "2 cups water",
        "2 cubes beef bouillon",
        "2 (16 ounce) cans diced tomatoes",
        "3 (15 ounce) cans black beans, rinsed and drained",
        "2 tablespoons ground cumin",
        "5 dashes hot pepper sauce",
        "salt to taste",
        "1/4 cup sour cream, for topping (optional)",
        "1/2 cup shredded Cheddar cheese (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Black Bean Soup with Bacon",
    "url": "http://allrecipes.com/recipe/216642/black-bean-soup-with-bacon/"
}
