{
    "directions": [
        "Preheat oven to 350°F.",
        "In a bowl with a pastry blender or in a food processor blend or pulse together flour, spices, and salt until combined well. Add butter and blend or pulse until mixture resembles coarse meal. Add ice water and blend or pulse until incorporated and mixture forms a dough.",
        "Press dough evenly onto bottom and sides of a 10-inch tart pan with a removable fluted rim and chill 15 minutes, or until firm. Line shell with foil and fill with rice. Bake shell in middle of oven until edge is set, 8 to 10 minutes. Carefully remove foil and rice and bake crust 10 minutes more, or until golden. Cool crust in pan on a rack. Crust may be made 1 day ahead and kept at room temperature, covered loosely with plastic wrap.",
        "In a bowl soak dried beans if using in water to cover by 2 inches overnight and drain. In a large saucepan combine soaked beans, bay leaf, onion, and water to cover by 2 inches and simmer, uncovered, 1 to 1 1/4 hours, or until tender, adding more water if necessary. Drain beans, discarding bay leaf, and cool.",
        "In a food processor purée 1 cup cooked or canned beans with sour cream until smooth and season with salt and pepper.",
        "In a skillet heat oil over moderately high heat until hot but not smoking and sauté corn with salt and pepper to taste, stirring, about 2 minutes. Cool corn.",
        "In a large bowl stir together corn, whole beans, bell pepper, coriander, Monterey Jack, jalapeños, and scallions and season with salt and pepper.",
        "Spread bean purée evenly onto crust and mound with remaining filling, pressing gently. Bake tart in middle of oven about 20 minutes, or until hot and cheese is melted. Let tart cool in pan on a rack 15 minutes.",
        "Remove rim of pan and serve tart warm or at room temperature with lime sour cream.",
        "In a bowl whisk sour cream and lime juice with salt and pepper to taste. Sauce may be made 1 day ahead and chilled, covered. Makes about 1 cup."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1 teaspoon ground cumin",
        "1 teaspoon chili powder",
        "1 teaspoon paprika",
        "1/2 teaspoon salt",
        "1 stick (1/2 cup) chilled unsalted butter, cut into bits",
        "2 tablespoons ice water",
        "raw rice for weighting shell",
        "1/2 pound dried black beans, picked over, or 3 cups canned black beans, rinsed and drained",
        "1 bay leaf",
        "1 medium red onion, chopped",
        "2 tablespoons sour cream",
        "1 tablespoon vegetable oil",
        "a 10-ounce package frozen corn, thawed",
        "1 red bell pepper, chopped (about 1 cup)",
        "1/2 cup fresh coriander sprigs, washed well, spun dry, and chopped",
        "1 1/2 cups coarsely grated Monterey Jack (about 6 ounces)",
        "2 fresh jalapeño chiles, seeded and chopped fine (wear rubber gloves)",
        "1/2 cup chopped scallions (about 2)",
        "1 cup sour cream",
        "2 teaspoons fresh lime juice, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Onion",
        "Bake",
        "Vegetarian",
        "Spice",
        "Corn",
        "Bell Pepper",
        "Winter",
        "Jalapeño",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Black Bean Tart with Chili Crust",
    "url": "http://www.epicurious.com/recipes/food/views/black-bean-tart-with-chili-crust-11432"
}
