{
    "directions": [
        "Melt butter in heavy large saucepan over medium heat. Remove from heat; whisk in sugar, lemon juice, lemon peel, cream, and pinch of salt. Add eggs and egg yolks; whisk to blend. Cook over medium-low heat until thick enough for mixture to leave path on back of spoon when finger is drawn across, stirring constantly, 6 to 7 minutes (do not boil). Strain into medium bowl. Cover with plastic wrap, pressing directly atop lemon curd. Chill at least 8 hours or overnight.",
        "Toss all ingredients in medium bowl to coat, lightly crushing some of berries to release juices. Cover and chill until sugar dissolves and juices form, about 3 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
        "Place cookies in large resealable plastic bag. Crush cookies with mallet or rolling pin until largest pieces are about 1/2 inch. Using electric mixer, beat cream, mascarpone, and pinch of salt in large bowl just until peaks form. Arrange six 8-ounce parfait glasses or compote cups on work surface. Spoon 4 to 5 berries and some of juices in bowl into each cup. Cover and chill remaining berries in bowl for serving. Spoon 1/4 cup mascarpone whipped cream over berries in each cup, spreading in even layer. Add generous 1 tablespoon curd, spreading to edges. Sprinkle 1 tablespoon crushed gingersnaps over. Repeat layering 1 more time with mascarpone whipped cream, lemon curd, and crushed gingersnaps. Top with remaining cream. Cover; chill desserts at least 1 hour and up to 3 hours.",
        "Uncover desserts. Spoon remaining berry mixture over and serve."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) unsalted butter",
        "2/3 cup sugar",
        "1/2 cup fresh lemon juice",
        "2 tablespoons finely grated lemon peel",
        "2 tablespoons heavy whipping cream",
        "Pinch of salt",
        "2 large eggs",
        "3 large egg yolks",
        "2 cups fresh blackberries (about 12 ounces)",
        "3 tablespoons sugar",
        "2 tablespoons limoncello",
        "1 teaspoon finely grated lemon peel",
        "4 ounces gingersnap cookies (about 16)",
        "1 1/2 cups chilled heavy whipping cream",
        "1/3 cup mascarpone cheese",
        "Pinch of salt",
        "Even easier: High-quality purchased lemon curd can be used in place of homemade.",
        "Ingredient info: Limoncello is an Italian lemon liqueur available at many supermarkets and at liquor stores. Mascarpone, an Italian cream cheese, is sold at supermarkets and Italian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Ginger",
        "Dessert",
        "Freeze/Chill",
        "High Fiber",
        "Blackberry",
        "Lemon",
        "Marscarpone",
        "Vegetarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blackberry, Lemon, and Gingersnap Cheesecake Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/blackberry-lemon-and-gingersnap-cheesecake-pudding-360229"
}
