{
    "directions": [
        "Bring honey, sugar, and 1/4 cup water to boil in heavy small saucepan over medium heat, stirring until sugar dissolves. Boil mixture 1 minute. Remove from heat. Mix in vanilla extract, then walnuts. Transfer sauce to small bowl. Cover and chill.",
        "Place frozen raspberries in small bowl. Stir 1/3 cup water, sugar and cornstarch in heavy small saucepan until cornstarch dissolves. Mix in jam. Stir over medium heat until sugar dissolves and mixture comes to boil and thickens slightly, about 1 minute. Pour hot mixture over frozen raspberries; stir in framboise. Cover and chill.",
        "Bring half and half to simmer in heavy small saucepan. Remove from heat. Add chocolate; stir until smooth. (Sauces can be made 2 days ahead; keep walnut and raspberry sauces cold. Cover chocolate sauce and chill. Before serving, rewarm chocolate sauce over low heat, stirring often.)",
        "Place 1 scoop of each ice cream in each of 6 sundae dishes. Spoon walnut sauce over chocolate ice cream, raspberry sauce over vanilla ice cream and chocolate sauce over coffee ice cream. Garnish with fresh raspberries, if desired, and serve."
    ],
    "ingredients": [
        "1/4 cup honey",
        "1/4 cup (packed) golden brown sugar",
        "1/4 cup water",
        "1/2 teaspoon vanilla extract",
        "1 cup walnuts, toasted, cut into 1/2-inch pieces",
        "1 cup frozen unsweetened raspberries, unthawed",
        "1/3 cup water",
        "2 tablespoons sugar",
        "1 teaspoon cornstarch",
        "2 tablespoons seedless raspberry jam",
        "2 tablespoons framboise eau-de-vie (clear raspberry brandy) or brandy",
        "1/2 cup half and half",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, finely chopped",
        "1 pint chocolate ice cream",
        "1 pint vanilla ice cream",
        "1 pint coffee ice cream",
        "Fresh raspberries (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Chocolate",
        "Dessert",
        "Walnut",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Black, White, and Coffee Sundaes",
    "url": "http://www.epicurious.com/recipes/food/views/black-white-and-coffee-sundaes-106345"
}
