{
    "directions": [
        "Place lemon in a small saucepan; add water just to cover. Place a small heatproof plate inside the saucepan, on top of the lemon, to keep it submerged. Bring water to a boil; reduce heat and simmer until lemon is very tender when pierced with a knife, about 30 minutes. Drain. Cut lemon in half (to help cool faster); let cool.",
        "Scoop out pulp from both lemon halves and press pulp through a coarse-mesh sieve into a small bowl; discard solids. Finely chop peel and pith and add to pulp. Set aside.",
        "Toast coriander and cumin seeds in a small skillet over medium heat, stirring often, until slightly darkened and fragrant, about 3 minutes. Set aside.",
        "Coarsely grind coriander and cumin seeds in spice mill or with mortar and pestle. Heat 1 tablespoon oil in a large nonstick skillet over medium-high heat. Season fish with spice mixture, salt, and pepper; place skin side down in skillet. Cook until browned and crisp, 5-6 minutes. Turn; cook until just opaque in the center, 2-4 minutes more.",
        "Meanwhile, heat remaining 1 tablespoon oil in a large skillet over medium heat. Add garlic and 1/4 teaspoon crushed red pepper flakes; cook, stirring, until fragrant, about 30 seconds. Add chard by the handful, tossing and allowing it to wilt slightly between additions. Season with salt and pepper. Cook, tossing occasionally, until all chard is tender, 5-7 minutes. Set aside.",
        "Mix olives and reserved lemon mixture into chard. Season with salt, pepper, and more crushed red pepper flakes, if desired. Serve fish with chard."
    ],
    "ingredients": [
        "1 lemon, stem removed",
        "1/4 teaspoon coriander seeds",
        "1/4 teaspoon cumin seeds",
        "2 tablespoons olive oil, divided",
        "4 4-ounce pieces skin-on black cod fillet",
        "Kosher salt and freshly ground black pepper",
        "1 garlic clove, chopped",
        "1/4 teaspoon (or more) crushed red pepper flakes",
        "2 large bunches Swiss chard (about 1 1/2 pounds total), ribs and stems removed, leaves torn",
        "2 tablespoons oil-cured black olives, pitted, sliced",
        "Special equipment: A spice mill (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Dinner",
        "Lemon",
        "Seafood",
        "Cod",
        "Healthy",
        "Chard",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Black Cod with Swiss Chard, Olives, and Lemon",
    "url": "http://www.epicurious.com/recipes/food/views/black-cod-with-swiss-chard-olives-and-lemon-51141000"
}
