{
    "directions": [
        "Spray 9-inch-diameter glass pie dish with nonstick spray. Blend cookie crumbs, butter, and sugar in medium bowl. Press mixture evenly over bottom and up sides (not on rim) of prepared dish. Chill crust 30 minutes.",
        "Preheat oven to 350°F. Bake crust until set, about 10 minutes, then cool.",
        "Combine sugar, cocoa, and cornstarch in heavy medium saucepan; whisk to blend well. Gradually add 1/4 cup milk, whisking until cornstarch dissolves. Whisk in remaining 2 1/4 cups milk, then egg yolks and egg. Stir over medium-high heat until pudding thickens and boils, about 8 minutes. Remove from heat. Add chocolate and butter; whisk until melted and smooth. Spread pudding in prepared crust. Press plastic wrap onto pudding to cover and chill pie overnight.",
        "Peel plastic wrap off pie. Cover chocolate layer with raspberries, pointed side up, pressing lightly into chocolate to adhere (some berries will be left over). Beat cream, sugar, and vanilla in medium bowl until peaks form; spread over berries on pie. Arrange remaining berries atop cream. Chill pie at least 1 hour and up to 4 hours."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 3/4 cups crushed chocolate wafer cookies (about 30 cookies from one 9-ounce package)",
        "1/2 cup (1 stick) unsalted butter, melted",
        "1/4 cup sugar",
        "1/2 cup sugar",
        "1/4 cup unsweetened cocoa powder (preferably Dutch-process)",
        "2 tablespoons cornstarch",
        "2 1/2 cups whole milk, divided",
        "2 large egg yolks",
        "1 large egg",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, finely chopped",
        "2 tablespoons (1/4 stick) unsalted butter",
        "3 1/2-pint containers raspberries",
        "1 cup chilled whipping cream",
        "2 tablespoons powdered sugar",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Raspberry",
        "Summer",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Black-Bottom Raspberry Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/black-bottom-raspberry-cream-pie-109725"
}
