{
    "directions": [
        "Combine plums, berries, 1/2 cup sugar and cardamom in heavy medium saucepan. Bring to boil, stirring. Reduce heat to medium; simmer until plums are soft, about 4 minutes. Add cornstarch mixture and stir until mixture thickens and boils, about 1 minute. Cool. Cover and chill until cold, at least 4 hours or overnight.",
        "Finely grind almond paste in processor. Add cream and puree until smooth.",
        "Line 2 baking sheets with parchment. Roll out 1 pastry sheet on floured surface to 12-inch square. Cut pastry into four 6-inch squares. Spread scant 2 tablespoons almond paste mixture over center 4 inches of each square. Place 1/4 cup plum mixture atop center of almond paste on each. Brush 2 sides of pastry edges with glaze. Fold pastry over filling, forming triangles and pressing edges to adhere. Press edges with fork to seal. Transfer to baking sheet. Repeat with remaining pastry, almond paste mixture and plum mixture.",
        "Cut small hole and a few slits in top of each turnover to allow steam to escape. Brush turnovers with glaze. Sprinkle with 1 tablespoon sugar. Freeze 20 minutes. (Can be prepared 1 week ahead. Cover and keep frozen. Thaw 6 hours in refrigerator.)",
        "Position 1 rack in center and 1 rack in top third of oven; preheat to 375°F. Bake turnovers until golden, switching top and bottom baking sheets halfway through baking, about 30 minutes. Cool on baking sheets. Serve at room temperature."
    ],
    "ingredients": [
        "12 ounces plums, pitted, sliced",
        "2 cups fresh blackberries",
        "1/2 cup plus 1 tablespoon sugar",
        "1/8 teaspoon ground cardamom",
        "1 1/2 tablespoons cornstarch dissolved in 1 tablespoon water",
        "1 7-ounce package almond paste",
        "1/4 cup whipping cream",
        "1 17 1/4-ounce package frozen puff pastry (2 sheets), thawed",
        "1 egg, beaten to blend (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Blackberry",
        "Plum",
        "Almond",
        "Summer",
        "Chill",
        "Boil"
    ],
    "title": "Blackberry and Plum Turnovers with Cardamom",
    "url": "http://www.epicurious.com/recipes/food/views/blackberry-and-plum-turnovers-with-cardamom-4307"
}
