{
    "directions": [
        "Preheat oven to 375  degrees F (190 degrees C).",
        "Place 2 tablespoons of olive oil into a large skillet over medium heat. Add the mushrooms and cook until reduced, 8 to 10 minutes. Season to taste with salt and pepper. Drain in a colander placed over a bowl.",
        "Place remaining 1 tablespoon of  olive oil into the same skillet. Add the onion and cook until transparent and soft, about 10 minutes. Stir in the chorizo sausage, and cook until evenly browned and cooked through. Mix in the jalapeno pepper, and cook until soft 2 to 4 minutes. Season to taste with salt and pepper. Drain, and cool slightly.",
        "Place the spinach, 1 1/2 cups black-eyed peas, Monterey Jack cheese, 1 egg, heavy cream, and cayenne pepper into the bowl of a food processor. Process until well mixed, but still chunky. Season to taste with salt and pepper.",
        "Line a 10 inch pie plate with one half of the pastry, letting excess pastry hang over the edge. Spoon the sausage mixture into the pie shell. Layer with the mushrooms, then the spinach mixture, and black-eyed peas. Cover the filling with the remaining pastry. Fold and crimp the edges to seal top and bottom pastry.",
        "Whisk the remaining egg together with the water in a small bowl, and use to brush over the top of the pie.",
        "Bake in preheated oven until top is golden brown, 45 to 60 minutes. Cool at least 15 minutes before serving."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "12 large button mushrooms, sliced",
        "salt and ground black pepper to taste",
        "1 onion, thinly sliced",
        "1/2 pound chorizo sausage, casings removed and crumbled",
        "1 jalapeno pepper, ribs and seeds removed, finely chopped",
        "12 ounces fresh spinach, washed, stems removed",
        "3 cups drained and rinsed canned black-eyed peas",
        "6 ounces Monterey Jack cheese, grated",
        "2 eggs",
        "1/2 cup heavy cream",
        "1/2 teaspoon cayenne pepper",
        "1 pastry for a 10-inch double crust pie",
        "1 teaspoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Black-Eyed Pea Pie",
    "url": "http://allrecipes.com/recipe/145494/black-eyed-pea-pie/"
}
