{
    "directions": [
        "Preheat oven to 250°F. Line 2 large baking sheets with parchment paper. Using 3 1/4-inch-diameter can as template, outline 8 circles on each sheet of parchment. Turn parchment over on baking sheet (circles should show through).",
        "Using electic mixer, beat whites in medium bowl until soft peaks form. Scrape seeds from vanilla bean. Gradually add sugar, beating until meringue is stiff and glossy, about 5 minutes. Fold in ground almonds. Spread 1 rounded tablespoon of meringue in each circle on parchment, forming disks about 1/4 inch thick.",
        "Bake meringue disks 1 hour. Reverse position of sheets and bake until meringues are pale golden and almost firm to touch, about 45 minutes longer. Cool meringues on baking sheets. Carefully peel meringues off parchment.",
        "Arrange 8 meringues on clean baking sheet; top each with second meringue. Top each stack with scoop of sorbet (don't press; disks are fragile). Cover with foil; freeze while making vanilla meringue or up to 2 days.",
        "Using electric mixer, beat whites in large bowl until soft peaks form. Scrape in seeds from vanilla bean. Gradually add sugar, beating until meringue is stiff and glossy, about 5 minutes. Transfer 1/3 meringue to pastry bag fitted with medium star tip.",
        "Place 1 dessert on work surface (keep remaining desserts in freezer). Pipe meringue over sorbet. covering completely. Return to freezer. Repeat with remaining desserts, adding more meringue to pastry bag as needed. Freeze until meringue is firm, at least 2 hours and up to 2 days.",
        "Preheat oven to 500°F. for 30 minutes. Spray large baking sheet with non-stick spary. Transfer desserts to prepared sheet. Bake until meringue is just tinged with brown, no longer than 2 minutes."
    ],
    "ingredients": [
        "3 large egg whites",
        "1/2 vanilla bean, split lengthwise",
        "1/2 cup sugar",
        "1/2 cup sliced almonds, toasted, ground",
        "Chocolate Sorbet",
        "6 large egg whites",
        "1/2 vanilla bean, split lengthwise",
        "1 cup sugar",
        "Nonstick vegetable oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Almond",
        "Vanilla"
    ],
    "title": "Black-and-White Baked Alaska",
    "url": "http://www.epicurious.com/recipes/food/views/black-and-white-baked-alaska-100167"
}
