{
    "directions": [
        "Mash blackberries with sugar using a potato masher or fork in a 3- to 4-quart heavy saucepan. Cook over moderately high heat, stirring occasionally, until slightly thickened, about 7 minutes. Stir in lemon juice, then force through a sieve into a bowl, discarding seeds. Chill jam, its surface covered with wax paper, until softly set, at least 15 minutes.",
        "Put oven racks in upper and lower thirds of oven and preheat oven to 350°F.",
        "Pulse walnuts with 1/2 cup granulated sugar in a food processor until finely ground.",
        "Generously butter cake pans and put a rounded 1/3 cup nut mixture into each pan. Tilt each pan to coat bottom and sides with nut mixture, letting excess remain in bottom of pan.",
        "Sift together flour, baking soda, and salt in a bowl. Stir together buttermilk, orange zest and juice, and vanilla in a small bowl.",
        "Beat together butter (2 sticks), brown sugar, and remaining 1/2 cup granulated sugar in bowl of mixer with paddle attachment at medium-high speed until pale and fluffy, about 5 minutes. Add eggs, 1 at a time, beating well after each addition. Reduce speed to low and add flour and buttermilk mixtures alternately in batches, beginning and ending with flour mixture and mixing just until batter is smooth. Divide batter among cake pans.",
        "Bake, switching position of pans halfway through baking, until a wooden pick or skewer inserted in centers of cakes comes out clean and edges begin to pull away from sides of pans, about 30 minutes. Cool in pans on racks 15 minutes, then run a thin knife around edge of each pan. Invert racks over pans, then flip cakes onto racks to cool completely, about 1 hour.",
        "Put egg whites and salt in cleaned bowl of mixer.",
        "Bring brown sugar and water to a boil in a 1-quart heavy saucepan over moderately high heat, stirring until sugar is dissolved, and washing down side of pan occasionally with a pastry brush dipped in water. When sugar syrup reaches a boil, start beating egg whites with whisk attachment at medium-high speed until whites just hold soft peaks. (Do not beat again until sugar syrup is ready.)",
        "Meanwhile, put thermometer into sugar syrup and continue boiling until syrup reaches 238 to 242°F (soft ball stage). Immediately remove from heat and, with mixer at high speed, slowly pour hot syrup down side of bowl into egg whites (avoid beaters), beating constantly.",
        "Continue to beat meringue, scraping down bowl once or twice with a rubber spatula, until meringue is cool to the touch, about 10 minutes. (It is important that meringue is properly cooled before proceeding.)",
        "With mixer at medium speed, gradually add butter to meringue 1 piece at a time, beating well after each addition and until incorporated. (If meringue is too warm and buttercream looks soupy after some of butter is added, briefly chill bottom of bowl in a large bowl filled with ice water for a few seconds before continuing to beat in remaining butter.) Continue beating until buttercream is smooth. (Mixture may look curdled before all of butter is added, but will come back together as beating continues.) Add vanilla and beat 1 minute more.",
        "Put 1 cake layer, nut side up, on a cake plate or platter. Spread 1 1/2 cups buttercream on top but not side, then top with another cake layer, nut side up. Spread top with 1 1/2 cups buttercream, then top with remaining layer, nut side up.",
        "Gently toss whole blackberries with jam in a large bowl. Arrange blackberries, stemmed sides down, on top of cake."
    ],
    "ingredients": [
        "1 lb blackberries (about 3 1/2 cups)",
        "1/2 cup sugar",
        "1 teaspoon fresh lemon juice",
        "2/3 cup walnuts (2 oz)",
        "1 cup granulated sugar",
        "2 sticks (1 cup) unsalted butter, softened, plus additional for greasing pans",
        "2 cups all-purpose flour",
        "1 1/4 teaspoons baking soda",
        "3/4 teaspoon salt",
        "1 cup well-shaken buttermilk",
        "1 teaspoon finely grated fresh orange zest",
        "2 tablespoons fresh orange juice",
        "1 1/2 teaspoons vanilla",
        "1 cup packed light brown sugar",
        "2 large eggs",
        "3 large egg whites at room temperature",
        "1/4 teaspoon salt",
        "3/4 cup packed dark brown sugar",
        "1/3 cup water",
        "3 sticks (1 1/2 cups) unsalted butter, cut into pieces and softened",
        "1 1/2 teaspoons vanilla",
        "1 lb blackberries (about 3 1/2 cups)",
        "Special equipment: a heavy-duty stand mixer with whisk and paddle attachments; 3 (8-inch) round cake pans; 3 cooling racks; a candy thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Berry",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Blackberry",
        "Walnut",
        "Summer",
        "Party",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blackberry Brown-Sugar Cake",
    "url": "http://www.epicurious.com/recipes/food/views/blackberry-brown-sugar-cake-235771"
}
