{
    "directions": [
        "Line a 10-inch heavy skillet (preferably cast-iron; not nonstick) with foil, then heat over moderately high heat until hot but not smoking. Add 2 whole garlic cloves and half of tomatillos, cut sides down, and roast on top of stove until well browned, 4 to 5 minutes (skillet will begin to smoke at this point). Turn over garlic and tomatillos (tomatillos may stick to foil) and roast until well browned and tomatillos are completely soft, 3 to 4 minutes. Transfer roasted garlic and tomatillos to a food processor. Discard foil, then line skillet with a fresh sheet of foil and roast remaining 2 whole garlic cloves and remaining tomatillos in same manner, transferring as done to food processor. Cool garlic and tomatillos to room temperature in bowl of processor, about 30 minutes.",
        "Add chiles, half of cilantro, and 2 tablespoons water to mixture in processor, then pulse until it forms a chunky sauce, adding 1 tablespoon more water if too thick. Transfer to a bowl and stir in onion and 1 teaspoon salt.",
        "If using avocado leaves, toast, 1 at a time, in a dry 10-inch heavy skillet (without foil lining) over moderate heat, turning every few seconds, until lightly browned and aromatic, about 1 minute, transferring to a plate as toasted. Bring beans and remaining 2 cups water to a simmer in a 3-quart heavy saucepan, stirring occasionally, then add avocado leaves and simmer, uncovered, stirring occasionally, 20 minutes. Drain beans in a sieve set over a bowl, reserving liquid. Pure beans, 1/4 cup cooking liquid (reserve remainder), avocado leaves (if using), and chopped garlic in a food processor until smooth.",
        "Heat oil in a 10-inch heavy nonstick skillet over moderate heat until hot but not smoking, then add bean purée and cook, stirring, until very thick, about 5 minutes. Stir in remaining 3/4 teaspoon salt, then remove from heat and keep warm, covered.",
        "Halve and pit avocados, then scoop out flesh in large pieces and cut into 1/2-inch cubes.",
        "If necessary, stir some of reserved bean-cooking liquid in to make bean purée soft and easily spreadable. Divide warm beans among tostadas and spread evenly. Spoon about 1 tablespoon tomatillo sauce over each tostada, then divide avocado among tostadas and top with romaine, cheese, and remaining cilantro. Serve remaining tomatillo sauce on the side."
    ],
    "ingredients": [
        "6 large garlic cloves, 4 cloves peeled and left whole and 2 cloves coarsely chopped",
        "1 pound tomatillos (8 medium), husked, rinsed, and halved",
        "4 fresh serrano chiles or 2 fresh jalapeños (including seeds), coarsely chopped",
        "3/4 cup coarsely chopped fresh cilantro sprigs",
        "2 cups plus 2 to 3 tablespoons water",
        "1/2 cup finely chopped white onion, rinsed in a sieve and patted dry",
        "1 3/4 teaspoons salt",
        "2 dried avocado leaves (optional), coarse stems discarded",
        "2 (15-ounce) cans black beans, rinsed and drained",
        "3 tablespoons vegetable oil",
        "2 (6- to 7-ounce) firm-ripe avocados",
        "12 tostadas",
        "3 cups thinly sliced romaine (from 1 head)",
        "1 cup crumbled queso fresco (Mexican fresh cheese) or mild feta (1/4 pound)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Bean",
        "Cheese",
        "Garlic",
        "Onion",
        "Vegetarian",
        "Avocado",
        "Hot Pepper",
        "Tomatillo",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Black-Bean Tostados with Roasted Tomatillo Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/black-bean-tostados-with-roasted-tomatillo-sauce-235984"
}
