{
    "directions": [
        "Heat 1 teaspoon of oil in a saucepan over medium heat. Stir in the chopped onion, and cook until the onion turns translucent and the edges begin to brown, about 7 minutes. Scrape the onion into the container of a blender, and set aside.",
        "Return the saucepan to the stove, and stir in the curry leaves and peppercorns. Cook and stir until the curry leaves wilt and turn almost dry, about 5 minutes. Stir in the coriander, and cook 1 minute more. Scrape the curry leaves into the blender, and pour in 1/2 cup of water. Blend until the mixture has turned into a coarse paste.",
        "Heat 3 tablespoons of oil in the saucepan over medium heat. Stir in the sliced onions, and cook until the onions have softened and turned translucent, about 5 minutes. Stir in the ginger and garlic, continue cooking until the garlic softens and mellows, about 3 minutes more. Stir in the cayenne pepper, salt, and turmeric; continue cooking 2 minutes.",
        "Mix in the tomato paste, goat meat, pureed peppercorn sauce, and the remaining 1/2 cup of water. Bring to a simmer, then reduce heat to medium-low, cover, and simmer until the meat is tender, about 30 minutes."
    ],
    "ingredients": [
        "1 teaspoon vegetable oil",
        "1 onion, chopped",
        "1/2 cup fresh curry leaves",
        "2 tablespoons whole black peppercorns",
        "2 tablespoons ground coriander",
        "1/2 cup water",
        "3 tablespoons vegetable oil",
        "2 onions, thinly sliced",
        "2 inch piece ginger, minced",
        "5 cloves garlic, minced",
        "2 tablespoons cayenne pepper, or amount to taste",
        "1 tablespoon salt",
        "1 tablespoon ground turmeric",
        "1/2 cup tomato paste",
        "1 pound goat stew meat, cut into 1-inch cubes",
        "1/2 cup water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Black Pepper Goat Curry",
    "url": "http://allrecipes.com/recipe/162894/black-pepper-goat-curry/"
}
