{
    "directions": [
        "To make the salsa, stir the tomatoes, green onions, cilantro, lime juice, jalapeno pepper, 1 clove minced garlic, and salt to taste, together in a bowl until well blended. Cover, and refrigerate until needed.",
        "Preheat oven to 375  degrees F (190 degrees C). Lightly grease a baking sheet.",
        "Place 1 teaspoon canola oil in a skillet, and heat over medium heat. Stir in the garlic, and cook 1 minute until light brown. Mix in the black beans, chicken broth, and chiles; simmer until beans are heated through, about 5 minutes. Turn off heat, and keep warm.",
        "Place four tortillas on the prepared baking sheet. Sprinkle the cheese evenly over the tortillas. Top with the remaining four tortillas. Cover the baking sheet with aluminum foil.",
        "Bake tortillas in preheated oven until cheese melts, about 5 minutes.",
        "Place the remaining 1 teaspoon canola oil in a skillet, and heat over medium heat. Crack eggs into skillet, and cook to desired firmness.",
        "To assemble huevos rancheros, place filled tortillas on four serving plates. Top each tortilla with black bean mixture, a layer of salsa, and an egg. Serve immediately."
    ],
    "ingredients": [
        "1 1/2 cups fresh tomatoes, seeded and finely chopped",
        "1/4 cup sliced green onions",
        "1/4 cup chopped fresh cilantro",
        "2 tablespoons fresh lime juice",
        "1 fresh jalapeno pepper, seeded and finely chopped",
        "1 clove garlic, minced",
        "salt, to taste",
        "2 teaspoons canola oil",
        "2 cloves garlic, minced",
        "1 (19 ounce) can black beans, drained and rinsed",
        "1/2 cup chicken broth",
        "1 teaspoon chopped chipotle chiles in adobo sauce",
        "8 (7 inch) corn tortillas",
        "1/2 cup shredded Monterey Jack cheese",
        "4 eggs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Black Bean Huevos Rancheros",
    "url": "http://allrecipes.com/recipe/143432/black-bean-huevos-rancheros/"
}
