{
    "directions": [
        "In a large bowl with an electric mixer cream together the butter and the sugar until the mixture is light and fluffy. Add the eggs and combine the mixture well. Into a bowl sift together 3 cups of the flour, the allspice, the cloves, the cinnamon, and the salt. In another bowl combine the buttermilk and the baking soda. Add the flour mixture to the butter mixture in batches alternately with the buttermilk mixture, beating well after each addition. In a bowl toss together the raisins, the pecans, and the remaining 1 tablespoon flour and stir the mixture into the batter with the jam, stirring until the mixture is combined well. Line the bottoms of 2 buttered 9-inch cake pans with wax paper and butter the paper. Pour the batter into the pans and bake the layers in the middle of a preheated 325°F. oven for 40 minutes, or until a tester comes out clean. Let the layers cool in the pans on a rack for 15 minutes, invert them onto the rack, and let the layers cool completely.",
        "In a saucepan combine the brown sugar, the evaporated milk, and the butter, cook the mixture over moderately low heat, stirring, until the sugar is dissolved, and cook it, undisturbed, washing down any sugar crystals clinging to the side of the pan with a brush dipped in cold water, until it registers 238°F. on a candy thermometer. Transfer the mixture to a bowl and beat it until it is of spreading consistency. If the icing gets too hard to spread, dip the icing spatula in hot water.",
        "Transfer one of the layers, bottom up, to a cake plate, frost the top with the icing, and top it with the remaining layer, bottom down. Frost the top and sides with the icing."
    ],
    "ingredients": [
        "2 sticks (1 cup) unsalted butter",
        "2 cups sugar",
        "5 large eggs, beaten",
        "3 cups plus 1 tablespoon sifted all-purpose flour",
        "1 1/2 teaspoons allspice",
        "1 1/2 teaspoons ground cloves",
        "1/2 teaspoon cinnamon",
        "1/4 teaspoon salt",
        "1 cup buttermilk",
        "1 teaspoon baking soda",
        "1 cup chopped raisins or dates",
        "1 cup chopped pecans",
        "1 cup seedless blackberry jam",
        "3 cups light brown sugar",
        "1 cup evaporated milk",
        "1 stick (1/2 cup) unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Blackberry",
        "Raisin",
        "Pecan",
        "Gourmet"
    ],
    "title": "Blackberry Jam Cake with Caramel Icing",
    "url": "http://www.epicurious.com/recipes/food/views/blackberry-jam-cake-with-caramel-icing-11032"
}
