{
    "directions": [
        "Bring 2/3 cup water and sugar to boil in small saucepan over medium-high heat, stirring until sugar dissolves. Transfer simple syrup to small bowl and chill until cold, about 1 hour.",
        "Place blackberries in processor; puree until smooth. Pour blackberry puree into strainer set over medium bowl. Using rubber spatula, press on solids to extract as much puree as possible. Discard seeds in strainer. Measure 2 cups blackberry puree and place in another medium bowl for pops (reserve any remaining puree for another use). Add chilled simple syrup, yogurt, honey, and lemon juice to puree; whisk to blend.",
        "Divide mixture among 10 molds (each about 1/3- to 1/2-cup capacity). Top with mold cover, if available, and insert stick into each. (If cover is not available, cover top of mold with plastic wrap, pulling taut; freeze until partially frozen, then insert stick into center of plastic wrap and into pop mixture in each.) Freeze pops until firm, at least 8 hours or overnight.",
        "Dip bottom of mold into hot water 10 to 15 seconds to loosen pops. Remove pops from molds and serve."
    ],
    "ingredients": [
        "2/3 cup water",
        "2/3 cup sugar",
        "3 6-ounce containers fresh blackberries (3 1/2 to 3 3/4 cups)",
        "1 cup plain nonfat yogurt (preferably organic)",
        "5 teaspoons honey",
        "4 teaspoons fresh lemon juice",
        "1 ice pop mold (preferably with cover) for 10 pops (each about 1/3- to 1/2-cup capacity)",
        "10 ice pop sticks or lollipop sticks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Low Fat",
        "Vegetarian",
        "Kid-Friendly",
        "Yogurt",
        "Low Cal",
        "Backyard BBQ",
        "Frozen Dessert",
        "Blackberry",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Honey"
    ],
    "title": "Blackberry, Honey and Yogurt Pops",
    "url": "http://www.epicurious.com/recipes/food/views/blackberry-honey-and-yogurt-pops-360253"
}
