{
    "directions": [
        "Preheat the oven to 375 degrees F (190 degrees C).",
        "Drizzle vegetable oil in a large roasting pan.",
        "Whisk lemon juice, olive oil, black pepper, salt, cayenne pepper, and cumin in large bowl.",
        "Place chicken in lemon mixture and turn it several times to coat each side. Place chicken breast side down in the marinade, and set aside for 30 minutes.",
        "Place chicken breast side up in the prepared roasting pan. Pour about 1/4 of of marinade into the chicken cavity. Brush remaining marinade on the top and sides of the chicken.",
        "Sprinkle rosemary, thyme, and salt over top of chicken.",
        "Tie chicken legs together with kitchen twine.",
        "Roast chicken uncovered in the preheated oven for 45 minutes; remove from oven and spoon juices accumulated in the pan over chicken. Pour 1 cup of chicken broth into the pan and continue roasting until chicken skin is browned and meat is no longer pink, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from the oven, spoon juices accumulated in the pan over chicken again, and cover loosely with aluminum foil for 20 minutes.",
        "Remove chicken to a platter, draining any juices from the cavity into the pan; cover chicken with aluminum foil and set aside.",
        "Set the roasting pan on the stove top over medium-high heat; add 3/4 cup chicken broth and boil, scraping any browned bits from the bottom of the pan. Simmer, stirring occasionally, until sauce is reduced by about half, about 10 minutes.",
        "Slice chicken into 8 pieces and serve over shredded lettuce in a large bowl. Pour 2 to 3 tablespoons of pan sauce over the top, tossing to slightly wilt the lettuce leaves. Serve with additional sauce on the side."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "3/4 cup lemon juice",
        "2 tablespoons olive oil",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon salt",
        "1 pinch cayenne pepper",
        "1 pinch ground cumin",
        "1 (5 pound) whole chicken",
        "1 teaspoon dried rosemary",
        "1 teaspoon dried thyme",
        "salt to taste",
        "1 3/4 cups chicken broth, divided",
        "1 head romaine lettuce, shredded"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Black Lemon Chicken Salad",
    "url": "http://allrecipes.com/recipe/221053/black-lemon-chicken-salad/"
}
