{
    "directions": [
        "Combine first 5 ingredients in processor; blend 5 seconds. Add butter and blend, using on/off turns, until mixture resembles coarse meal. Add 5 tablespoons water and vinegar. Using on/off turns, blend until moist clumps form, adding more water if dough is dry. Gather dough into ball; divide in half. Shape each half into disk. Wrap in plastic and chill at least 1 hour and up to 1 day.",
        "Preheat oven to 400°F. Spray 9-inch-diameter glass baking dish with nonstick spray. Whisk 3/4 cup sugar and cornstarch in large bowl to blend. Add berries and toss to coat. Let stand 10 minutes, tossing occasionally.",
        "Roll out 1 dough disk on lightly floured surface to 12-inch round; transfer to prepared pie dish. Spoon filling into dough-lined dish. Roll out second dough disk to 13-inch round. Drape dough over filling, and trim overhang to 1/2 inch. Press edges together to seal; fold overhang under and crimp decoratively. Cut several small slashes in top crust to vent. Sprinkle with additional sugar, if desired.",
        "Bake until crust is golden and filling is bubbling, about 50 minutes; cool 30 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "2 1/4 cups all purpose flour",
        "1 cup cake flour",
        "1 1/2 teaspoons grated lemon peel",
        "1/2 teaspoon salt",
        "1/4 teaspoon baking powder",
        "14 tablespoons (1 3/4 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "6 tablespoons (about) ice water",
        "1 tablespoon apple cider vinegar",
        "Nonstick vegetable oil spray",
        "3/4 cup sugar",
        "1/4 cup cornstarch",
        "3 cups fresh raspberries",
        "3 cups fresh blackberries",
        "Additional sugar (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Vinegar",
        "Blackberry",
        "Raspberry",
        "Lemon",
        "Summer"
    ],
    "title": "Blackberry-Raspberry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/blackberry-raspberry-pie-106610"
}
