{
    "directions": [
        "Place barley in a medium bowl and add 3 cups cold water to cover. Cover and chill at least 12 hours.",
        "Drain barley, reserving soaking liquid. Bring barley, mushroom stems, bay leaves, and 5 cups water to a boil in a large saucepan. Add 1 Tbsp. salt, then reduce heat and simmer very gently, stirring occasionally, until barley is tender and liquid is almost completely evaporated, 80–90 minutes. Drain and transfer to a rimmed baking sheet to cool. Pluck out mushroom stems and bay leaves and discard.",
        "While the barley is cooking, bring a medium saucepan of water to a boil and gently lower eggs into boiling water. Cook 6 minutes; transfer eggs to a bowl of ice water with a slotted spoon and let cool. Carefully peel; set aside.",
        "Thinly slice mushroom caps and place half in a medium saucepan with reserved barley soaking liquid. Bring to a boil, then simmer until soaking liquid has taken on mushroom flavor, 10–12 minutes. Season with salt. Strain through a fine-mesh sieve into a medium bowl.",
        "Divide barley among bowls. Top with radish and remaining sliced mushrooms. Cut eggs in half lengthwise and tuck into barley, yolk sides up. Nestle kimchi next to eggs. Pour mushroom broth over, dividing evenly. Garnish with cilantro and drizzle with oil.",
        "Barley can be soaked 1 day ahead. Keep chilled."
    ],
    "ingredients": [
        "1 cup black barley",
        "12 crimini or white button mushrooms, stems and caps separated",
        "4 bay leaves",
        "1 tablespoon kosher salt, plus more",
        "4 large eggs",
        "1 small red or watermelon radish, trimmed, thinly sliced",
        "1/4 cup kimchi, thinly sliced",
        "Small cilantro sprigs and olive oil (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Barley",
        "Mushroom",
        "Healthy",
        "Kid-Friendly",
        "Vegetarian"
    ],
    "title": "Black Barley With Mushroom Broth",
    "url": "http://www.epicurious.com/recipes/food/views/black-barley-with-mushroom-broth"
}
