{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Heat 1 tablespoon of the coconut oil in a large skillet over medium heat. Add the onion, red pepper and garlic and saute until soft, about 3 minutes. Reduce the heat to low, add 2/3 of the black-eyed peas and mash all the ingredients together with a potato masher. Remove from the heat and cool slightly.",
        "Add the flour, egg, green onion, oregano, lemon zest, cayenne, and 1/4 to 1/2 cup breadcrumbs to the pea mixture. Fold in the cheese and remaining black-eyed peas. Season with salt and pepper.",
        "Place the remaining breadcrumbs in a shallow bowl. Divide the batter into 12 portions using a 1 1/2-ounce portion scoop. Press into flat 1/2-inch-thick discs and coat in the remaining breadcrumbs.",
        "Wipe out the skillet. Heat the remaining oil and, in batches, sear the fritters until golden brown, about 2 minutes per side. Place on a baking sheet and finish cooking in the oven until cooked through, 15 to 20 minutes.",
        "Top with the onion jam and garnish with the green onions.",
        "Melt the butter in a large saute pan over medium-high heat. Add the onions, lemon zest, ginger, and 1/2 teaspoon salt and cook until the onions start to turn translucent, about 5 minutes",
        "Add the coriander, 1/4 cup of the brown sugar and half the lemon juice and turn the heat to low. Cook, stirring frequently, until the onions start to cook down and the liquid is evaporated, about 15 minutes. Add 1/3 cup water every 10 minutes and continue to cook until the onions are thick and golden brown, about 55 minutes. Stir in the remaining 1/4 cup brown sugar and the lemon juice and cook until the brown sugar melts, 3 to 5 minutes more. Season to taste."
    ],
    "ingredients": [
        "1 medium Vidalia onion, small dice (about 1 1/2 cups)",
        "1/2 red bell pepper, small dice (about 1/2 cup)",
        "1 clove garlic, minced",
        "Two 15.5-ounce cans black-eyed peas, rinsed and drained",
        "1 tablespoons all-purpose flour",
        "1 large egg",
        "1 large green onion, green part chopped, plus more for garnish",
        "1 tablespoon chopped fresh oregano",
        "1 teaspoon lemon zest",
        "1/2 teaspoon cayenne pepper",
        "1 cup fresh breadcrumbs",
        "1/3 cup coconut oil",
        "3/4 cup shredded firm aged sheep or goat cheese, such as Singing Brook from Blackberry Farm",
        "Kosher salt and freshly ground black pepper",
        "Onion Jam, recipe follows, for serving",
        "1 1/2 teaspoons unsalted butter",
        "2 Vidalia onions, julienned (if not in season, any sweet onion will do)",
        "2 lemons, zested and juiced",
        "1/4 teaspoon minced fresh ginger",
        "Kosher salt",
        "1/2 cup firmly-packed brown sugar",
        "1/4 teaspoon ground coriander",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beans and Legumes",
        "Black-Eyed Pea"
    ],
    "title": "Black-Eyed Pea Fritters",
    "url": "http://www.foodnetwork.com/recipes/finalist-damaris-phillips/black-eyed-pea-fritters"
}
