{
    "directions": [
        "Fill and boil a kettle of water and get all your ingredients together. Put a large saucepan over heat.",
        "Wash and finely slice the leek. Add to the saucepan with the coconut or olive oil and cook over medium heat for a couple of minutes, until soft and sweet. Finely slice the garlic and add to the pan with the chile powder and cook for a couple of minutes, until the garlic is beginning to brown. Add the black-eyed peas with their liquid, the stock powder, and 2/3 cup/200 ml of hot water from the kettle and bring to a simmer. Grate in the nutmeg, squeeze in the juice of the half lemon, add the squeezed lemon half to the pan, and simmer for 10 minutes or so. Meanwhile, strip the leaves from the chard stalks. Finely slice the stalks and add them to the pan, then finely shred the leaves and put to one side.",
        "Put all the ingredients for the herb smash into a food processor and purée until you have a smooth, grassy paste. Season well with salt and pepper.",
        "Once the peas are soft and flavorful and the liquid has reduced to a thick,soup-like consistency, stir in the chard leaves, season well with salt and pepper, and leave to cook for a couple of minutes. Scoop into deep bowls and spoon over the herb smash. If you’re really hungry, some rice or flatbread would go well alongside."
    ],
    "ingredients": [
        "1 leek",
        "1 tablespoon coconut oil or olive oil",
        "2 cloves garlic",
        "A good pinch of chile powder or chopped dried chile",
        "1 (14-ounce/400-g) can black-eyed peas",
        "1 teaspoon vegetable stock powder or 1/2 stock cube",
        "A good grating of nutmeg",
        "1/2 unwaxed lemon",
        "7 ounces/200 g bunch Swiss or rainbow chard",
        "Sea salt and freshly ground pepper",
        "A large bunch of cilantro",
        "2 green chiles",
        "2 cloves garlic",
        "1 ounce/30 g shelled walnuts",
        "1 tablespoon runny honey or maple syrup",
        "1 tablespoon good olive oil",
        "Juice of 1/2 a lemon",
        "Sea salt and freshly ground pepper",
        "Rice or flatbreads, to serve (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pea",
        "Stew",
        "Soup/Stew",
        "Chard",
        "Cilantro",
        "Walnut",
        "Vegan",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Dinner"
    ],
    "title": "Black-Eyed Peas With Chard and Green Herb Smash",
    "url": "http://www.epicurious.com/recipes/food/views/black-eyed-peas-with-chard-and-green-herb-smash"
}
