{
    "directions": [
        "• Remove the skins from the beans by adding them to a large bowl, filling the bowl with water, agitating the beans, and fishing out the skins that float to the top with a fine mesh strainer. Rinse beans well.",
        "• In a food processor fitted with a metal blade, combine the beans, onion, peanuts, thyme, cayenne, vinegar, water, and salt and pulse until completely smooth. Transfer to a medium bowl, cover, and refrigerate for 1 hour.",
        "• Preheat the oven to 200° F.",
        "• Remove the batter from the refrigerator, add the bell pepper and cornmeal, and beat with a wooden spoon for 2 minutes.",
        "• In a medium-size saucepan over high heat, warm the coconut oil until hot but not smoking, about 5 minutes.",
        "• Lower the oil to medium high, and in batches of 5, spoon the batter into the oil, 1 tablespoon at a time. Fry, stirring around, until golden brown, about 2 minutes. If necessary, adjust the temperature to ensure that the fritters do not cook too quickly.",
        "• Transfer the fritters to a paper towel-lined plate and allow them to drain. Transfer the drained fritters to a baking sheet and place in the oven to keep warm.",
        "• Serve hot with Hot Pepper Sauce ."
    ],
    "ingredients": [
        "1 cup dried black-eyed peas, sorted, soaked overnight, drained, and rinsed",
        "1/2 medium onion, diced",
        "1/2 cup raw peanuts",
        "1 teaspoon minced thyme",
        "1/4 teaspoon cayenne",
        "1 tablespoon apple cider vinegar",
        "1/4 cup plus 2 tablespoons water",
        "1 teaspoon coarse sea salt",
        "1/2 cup finely chopped green bell pepper",
        "1 tablespoon cornmeal",
        "5 cups coconut oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Vegetable",
        "Side",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Legume",
        "Deep-Fry",
        "Vegan",
        "New Year's Day",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Black-Eyed Pea Fritters with Hot Pepper Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/black-eyed-pea-fritters-with-hot-pepper-sauce-352350"
}
