{
    "directions": [
        "Cook blackberries, apple, semolina flour, cinnamon and 6 tablespoons sugar in a 2-quart heavy saucepan over moderate heat, stirring frequently, until mixture just boils and is thickened, about 5 minutes. Transfer to a shallow bowl to cool.",
        "Put oven racks in upper and lower thirds of oven and preheat oven to 375°F. Line baking sheets with parchment.",
        "Roll out half of dough 3/4 inch thick on a lightly floured surface with a lightly floured rolling pin into a 16- by 11-inch rectangle, then trim into a 15- by 10-inch rectangle, reserving scraps. Cut into 6 (5-inch) squares. Place a heaping tablespoon of fruit filling in center of 1 square. Moisten edges of square with milk and fold into a triangle, pressing edges to seal. Transfer to a lined baking sheet and press tines of a fork around edges of triangle. Make 5 more triangles in same manner, arranging them 1 inch apart on baking sheet. Repeat with remaining dough and filling, rerolling all of the scraps together once to make 12 triangles total.",
        "Brush triangles with milk and sprinkle with remaining 2 tablespoons sugar. Bake, switching position of pans halfway through baking, until pies are golden, about 30 minutes total. Transfer pies to racks to cool."
    ],
    "ingredients": [
        "2 cups blackberries (3/4 pound)",
        "1 large Golden Delicious apple, peeled and coarsely grated",
        "2 tablespoons plus 1 teaspoon semolina flour",
        "1/4 teaspoon cinnamon",
        "8 tablespoons sugar",
        "Pastry dough for a double-crust pie",
        "2 tablespoons milk",
        "2 large (17- by 12-inch) baking sheets; parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Blackberry",
        "Apple",
        "Semolina",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blackberry Hand Pies",
    "url": "http://www.epicurious.com/recipes/food/views/blackberry-hand-pies-235489"
}
