{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C). Lightly grease a 10-inch pie pan.",
        "In a medium bowl, mix together cookie crumbs and softened butter. Press firmly into pie pan. Bake in preheated oven for 10 minutes. Allow to cool completely.",
        "In a medium bowl, whisk together sugar, cornstarch, salt, and egg yolks. Bring milk to a simmer in top of a double boiler. Slowly whisk 1/2 cup of milk into egg yolk mixture, then gradually whisk egg yolk mixture into remaining 1 1/2 cups milk. Continue to cook over low heat, stirring constantly, until mixture is thick enough to coat back of spoon. Remove from heat.",
        "Transfer 1 1/4 cups of hot egg yolk mixture to a small bowl and add unsweetened chocolate. Stir until chocolate is melted. Allow to cool slightly, then mix in vanilla extract. Pour chocolate mixture into cooled pie crust. Place in refrigerator.",
        "Combine gelatin with cold water and set aside to soften 5 minutes. Add to remaining egg yolk mixture, stirring well. Allow to cool, then stir in rum.",
        "In a large glass or metal bowl, combine egg whites and cream of tartar. Beat until stiff peaks form. Fold into cooled gelatin mixture. Spoon over chocolate layer.",
        "In a medium bowl, whip cream until soft peaks form. Spread over top of pie. Sprinkle with grated chocolate. Chill at least 1 hour before serving."
    ],
    "ingredients": [
        "30 gingersnaps, crushed",
        "1/2 cup butter, softened",
        "3/4 cup white sugar",
        "1 3/4 teaspoons cornstarch",
        "1/8 teaspoon salt",
        "4 egg yolks, beaten",
        "2 cups milk",
        "1 1/2 (1 ounce) squares unsweetened chocolate",
        "1 teaspoon vanilla extract",
        "1 tablespoon unflavored gelatin",
        "1/4 cup cold water",
        "2 tablespoons dark rum",
        "4 egg whites",
        "1/4 teaspoon cream of tartar",
        "1 cup heavy cream",
        "1/4 cup grated semisweet chocolate"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Black Bottom Pie IV",
    "url": "http://allrecipes.com/recipe/16724/black-bottom-pie-iv/"
}
