{
    "directions": [
        "Stir together broth, rice wine, soy sauce, cornstarch, sugar, and salt in a small bowl until cornstarch is dissolved.",
        "Remove any bruised or withered outer leaves from gai lan, then trim and peel stalks, halving thick ones lengthwise. Cut crosswise into 2 1/2-inch pieces, separating leafy parts from thick stems.",
        "Cook stems in a 6- to 8-quart pot of boiling salted water, uncovered, until crisp-tender, about 3 minutes. Add leafy parts and cook until all of gai lan is just tender, 3 to 5 minutes. Drain well, then transfer to a clean kitchen towel and pat dry. Transfer to a large dish and keep warm, loosely covered with foil.",
        "Pat shrimp dry. Heat wok over high heat until a drop of water vaporizes instantly. Pour peanut oil around side of wok, then tilt wok to swirl oil, coating side. When oil just begins to smoke, add ginger and stir-fry 5 seconds. Add black beans, garlic, and jalapeño and stir-fry 1 minute. Working quickly, add shrimp, spreading in 1 layer on bottom and side of wok. Cook, undisturbed, 3 minutes, then stir-fry until shrimp are just pink on both sides, about 1 minute more. Stir broth mixture, then add to shrimp and bring to a boil. Boil, stirring, 2 minutes. Remove from heat and drizzle with sesame oil, then stir to combine.",
        "Pour shrimp and sauce over gai lan."
    ],
    "ingredients": [
        "3/4 cup homemade chicken broth (reserved from winter melon soup ) or store-bought chicken broth (reduced-sodium if canned)",
        "3 tablespoons Chinese rice wine (preferably Shaoxing) or medium-dry Sherry",
        "3 teaspoons light soy sauce (preferably Pearl River Bridge brand)",
        "2 teaspoons cornstarch",
        "1 teaspoon sugar",
        "1/4 teaspoon salt",
        "1 1/2 lb gai lan (Chinese broccoli)",
        "1 1/2 lb large shrimp in shell (21 to 25 per lb), peeled and deveined",
        "1 tablespoon peanut or vegetable oil",
        "1 (1-inch) piece fresh ginger, peeled and cut into very thin matchsticks",
        "2 tablespoons fermented black beans, rinsed and chopped",
        "2 garlic cloves, minced",
        "1/2 fresh jalapeño chile (including seeds), or to taste, cut crosswise into 1/8-inch-thick slices",
        "1 teaspoon Asian sesame oil",
        "Special equipment: a well-seasoned 14-inch flat-bottomed wok"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Shellfish",
        "Vegetable",
        "Side",
        "Stir-Fry",
        "Lunch",
        "Lunar New Year",
        "Shrimp",
        "Broccoli Rabe",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Tree Nut Free"
    ],
    "title": "Black-Bean Shrimp with Chinese Broccoli",
    "url": "http://www.epicurious.com/recipes/food/views/black-bean-shrimp-with-chinese-broccoli-233803"
}
