{
    "directions": [
        "Place the sesame seeds in a dry skillet and set over medium-low heat. Toast, swirling the pan frequently, until fragrant—90 seconds to 2 minutes. Watch and smell carefully so that they don’t burn. Transfer to a mortar and coarsely grind, then transfer to a mixing bowl. Add the oil, soy sauce, vinegar, brown sugar, wasabi, and salt, and whisk until thoroughly combined.",
        "Bring a saucepan of salted water to a gentle boil. Add the noodles and cook until tender, usually 4 to 7 minutes or according to the package instructions. Drain, rinse thoroughly under cold running water, then drain again thoroughly.",
        "Add the noodles and shallots to the bowl with the sauce and toss well, until the noodles are thoroughly coated. At this stage, the noodles can be transferred to an airtight container and kept in the fridge for up to 2 days. Bring to room temperature before serving.",
        "Quarter the avocado around the pit. Remove and peel the segments, then slice into thin strips. Peel the eggs and grate them using the large holes of a box grater. Slice the radishes into thin rounds. Stack the rounds on top of each other and slice into thin matchsticks.",
        "Divide the greens among four bowls, then top with the dressed noodles. Fan the avocado over the noodles in each bowl, then add a pile of the shredded egg, radishes, and scallions to each serving. Drizzle a bit of kecap manis over the avocado and serve."
    ],
    "ingredients": [
        "1/4 cup black sesame seeds",
        "2 tablespoons neutral-tasting oil",
        "5 teaspoons soy sauce",
        "1 tablespoon rice vinegar",
        "1 tablespoon brown sugar",
        "1/2 teaspoon wasabi powder",
        "1/4 teaspoon fine sea salt",
        "3 bundles (about 11.5 ounces) dried soba, udon, or somen noodles",
        "2 medium shallots, minced",
        "1 avocado",
        "2 large 12-minute eggs",
        "8 small-to-medium radishes",
        "4 cups tender greens, such as watercress, upland cress, baby arugula, or tatsoi",
        "2 scallions, white and green parts, thinly sliced",
        "Kecap manis (Indonesian soy sauce), for drizzling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "Black Sesame Noodle Bowl",
    "url": "http://www.epicurious.com/recipes/food/views/black-sesame-noodle-bowl"
}
