{
    "directions": [
        "Mix water, sugar, yeast, and 2 tablespoons of vegetable oil for several seconds on low speed in the work bowl of a large stand mixer fitted with a dough hook. Stop the mixer and add the flour and salt. Start the mixer on low speed and mix until the flour mixture is incorporated with the yeast mixture; turn speed to medium-low and machine-knead the dough until springy and smooth, 10 to 12 minutes. Sprinkle dough with flour occasionally if it sticks to the sides of the bowl.",
        "Form dough into a ball and place into an oiled bowl; turn the dough over in the bowl several times to oil the surface of the dough. Cover the dough with a towel, set into a warm place, and allow to rise until double, 30 minutes to 1 hour.",
        "Cook the bacon in a large, deep skillet over medium-high heat until evenly browned, about 10 minutes; drain on a paper towel-lined plate and allow to cool; chop and set aside.",
        "Melt butter in a saucepan over medium-low heat. Cook the garlic in the melted butter until fragrant, about 1 minute. Stir the cream into the butter mixture. Add the egg yolks and whisk with the butter mixture until smooth. Stir 1/2 cup of Parmesan cheese, the Romano cheese, and nutmeg into the mixture; season to taste with salt. Bring the sauce just barely to a simmer over low heat; cook and stir at a simmer until cheeses have melted and sauce has thickened, 3 to 5 minutes. Remove from heat and set aside.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Mix the paprika, cayenne pepper, cumin, thyme, 1/8 teaspoon of salt, white pepper, and onion powder together in a bowl. Rub one side of each chicken breast thoroughly with the spice mixture. Heat 1 tablespoon vegetable oil in a skillet over high heat. Sear the chicken breasts, seasoned sides first, in the hot oil until the spices turn almost black, about 1 minute per side; transfer to a baking sheet.",
        "Bake the chicken breasts in the preheated oven until no longer pink in the center and an instant-read meat thermometer inserted into the thickest part of a breast reads at least 160 degrees F (70 degrees C), 5 to 10 minutes; set aside.",
        "Punch down pizza dough and roll out onto a floured work surface. Shape pizza crust on a large pizza stone or heavy baking sheet. Poke several holes in the crust with a fork to help it release steam.",
        "Bake the crust in the oven until top is very lightly cooked, 5 to 7 minutes. Remove from oven and spread a layer of Alfredo sauce over the crust. Spread the mozzarella cheese in an even layer over the sauce. Slice the blackened chicken breasts and arrange over the mozzarella cheese. Sprinkle pizza with spinach leaves and chopped bacon. Top with 3 tablespoons of Parmesan cheese.",
        "Return pizza to oven and bake until the mozzarella cheese is melted and browned, 15 to 20 minutes. Sprinkle pizza with chopped Roma tomatoes to serve."
    ],
    "ingredients": [
        "1 cup warm water",
        "1 tablespoon white sugar",
        "1 (.25 ounce) package active dry yeast",
        "2 tablespoons vegetable oil",
        "3 cups all-purpose flour",
        "1 teaspoon salt",
        "6 slices bacon (optional)",
        "6 tablespoons butter",
        "2 cloves garlic, minced",
        "1 1/2 cups heavy cream",
        "2 egg yolks",
        "1/2 cup freshly grated Parmesan cheese",
        "1/2 cup freshly grated Romano cheese",
        "1/8 teaspoon ground nutmeg",
        "1/2 teaspoon paprika",
        "1/4 teaspoon cayenne pepper",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon crumbled dried thyme",
        "1/8 teaspoon salt",
        "1/8 teaspoon ground white pepper",
        "1/8 teaspoon onion powder",
        "2 skinless, boneless chicken breast halves",
        "1 tablespoon vegetable oil",
        "1 cup shredded mozzarella cheese, or more if desired",
        "1/2 cup baby spinach leaves",
        "3 tablespoons freshly grated Parmesan cheese",
        "1 roma (plum) tomato, diced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Blackened Chicken Alfredo Pizza",
    "url": "http://allrecipes.com/recipe/218905/blackened-chicken-alfredo-pizza/"
}
