{
    "directions": [
        "Heat 2 Tbsp. oil in a medium Dutch oven or other heavy pot over medium. Sear ham hocks, turning occasionally, until browned all over, 6–8 minutes. Add chopped onion and garlic. Cook, stirring occasionally, until very soft and beginning to brown around the edges, 8–10 minutes. Add coriander and cumin and cook, stirring, just until fragrant, about 1 minute. Add 6 cups water and bring to a boil. Reduce heat, cover pot, and simmer, stirring occasionally, until hocks begin to soften, about 1 hour.",
        "Add black-eyed peas to pot, cover, and cook, skimming foam from surface, until hocks and black-eyed peas are tender, about 1 1/2 hours. Remove hocks; let cool. Pick meat from bone and shred; discard fat and bones. Return meat to pot.",
        "Meanwhile, preheat oven to 400°F. Toss quartered onion, poblano chiles, and half of serrano chiles and tomatillos on a rimmed baking sheet with remaining 1 Tbsp. oil; season lightly with salt. Roast, tossing occasionally, until lightly browned around the edges but still vibrantly colored, 15–20 minutes. Let cool.",
        "Transfer chile mixture to a blender; add cilantro and remaining serrano chiles and tomatillos and purée until smooth.",
        "Stir purée into bean mixture; season with salt and pepper. Serve chile verde topped with sour cream and chives.",
        "Chile verde can be made 3 days ahead. Cover and chill."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil, divided",
        "2 smoked ham hocks",
        "2 large onions, 1 chopped, 1 quartered",
        "6 cloves garlic, thinly sliced",
        "3/4 teaspoon ground coriander",
        "3/4 teaspoon ground cumin",
        "2 cups black-eyed peas, soaked overnight",
        "3 poblano chiles, seeds removed",
        "4 serrano chiles, seeds removed, divided",
        "1 pound tomatillos, husks removed, rinsed, divided",
        "Kosher salt",
        "2 cups cilantro leaves",
        "Freshly ground black pepper",
        "Sour cream and sliced chives (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lunch",
        "Dinner",
        "Chile",
        "Pea",
        "Poblano",
        "Tomatillo",
        "Cilantro",
        "Wheat/Gluten-Free",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Black-Eyed Pea Chile Verde",
    "url": "http://www.epicurious.com/recipes/food/views/black-eyed-pea-chile-verde"
}
