{
    "directions": [
        "Bring water, soy sauce, mirin, sansho pepper, shallot, and one third of garlic to a boil in a 1- to 2-quart heavy saucepan, then simmer 5 minutes. Let broth stand off heat 10 minutes.",
        "Cook remaining garlic in oil in a 10-inch heavy skillet over medium heat, stirring, until just golden. Add all mushrooms and cook, stirring occasionally, until tender, about 3 minutes.",
        "Strain broth through a fine-mesh sieve into mushroom mixture, discarding solids, and simmer 1 minute.",
        "Pat fish dry and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. Heat oil in a 12-inch heavy nonstick skillet over medium-high heat until hot, then sauté fish, skin side down, turning once, until golden brown, just starting to flake, and just cooked through, about 10 minutes.",
        "Transfer fish to shallow bowls. Reheat broth and divide among bowls, then sprinkle very lightly with more sansho pepper (if using)."
    ],
    "ingredients": [
        "1 cup water",
        "6 tablespoons reduced-sodium soy sauce",
        "2 tablespoons mirin (Japanese sweet rice wine)",
        "1/8 teaspoon ground sansho pepper (sometimes labeled \"sansyo\"), plus additional for sprinkling, or 1 teaspoon whole Sichuan peppercorns",
        "1 shallot, sliced",
        "3 garlic cloves, thinly sliced, divided",
        "2 teaspoons vegetable oil",
        "7 ounces fresh enoki mushrooms, cut into 3-inch lengths and spongy base discarded",
        "5 ounces fresh shimeji mushrooms (sometimes called beech mushrooms), spongy base discarded",
        "6 (6-ounce) pieces black cod fillet with skin",
        "1 teaspoon vegetable oil",
        "thinly sliced scallion greens"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Cod",
        "Anniversary",
        "Birthday",
        "Healthy",
        "Engagement Party",
        "Entertaining",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Black Cod with Mushrooms and Sansho Pepper",
    "url": "http://www.epicurious.com/recipes/food/views/black-cod-with-mushrooms-and-sansho-pepper-242295"
}
