{
    "directions": [
        "Melt butter in large saucepan over medium-low heat. Add fennel, potato, onion, and leek. Cover and cook until vegetables are just tender but not brown, about 8 minutes. Add flour, bay leaves, and thyme; stir 1 minute. Stir in clam juice, cream, and milk. Simmer until chowder thickens slightly and flavors blend, about 10 minutes. Mix in lemon peel; season to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cool 30 minutes; cover and refrigerate.",
        "Toss celery, shallot, parsley, 1 1/2 teaspoons lemon juice, lemon peel, and smoked oysters in medium bowl. Season celery-shallot mixture to taste with salt and pepper.",
        "Combine 3 tablespoons butter, thyme, and 3 teaspoons lemon juice in small saucepan. Whisk over low heat until butter melts and sauce simmers; season with coarse salt and pepper. Remove from heat. Melt 2 tablespoons butter in large nonstick skillet over high heat. Sprinkle fish with coarse salt and pepper. Add fish, skin side down, to skillet. Cook until skin is crisp and fish is just opaque in center, drizzling lemon-butter sauce over, 6 to 7 minutes.",
        "Rewarm chowder over low heat; discard bay leaves. Divide chowder among 4 shallow bowls. Place fish, skin side down, in center of chowder. Stir panko into celery-shallot mixture; spoon over fish and serve.",
        "Available in the Asian foods section of some supermarkets and at Asian markets."
    ],
    "ingredients": [
        "3 tablespoons butter",
        "3/4 cup 1/4-inch cubes fresh fennel bulb",
        "3/4 cup 1/4- to 1/3-inch cubes peeled Yukon Gold potato",
        "1/2 cup chopped onion",
        "1/4 cup finely chopped leek (white and pale green parts only)",
        "1 tablespoon all purpose flour",
        "2 small bay leaves",
        "1 1/2 teaspoons chopped fresh thyme",
        "1 8-ounce bottle clam juice",
        "3/4 cup whipping cream",
        "3/4 cup whole milk",
        "1 teaspoon finely grated lemon peel",
        "1/4 cup finely chopped celery",
        "1/4 cup finely chopped shallot",
        "2 tablespoons chopped fresh parsley",
        "4 1/2 teaspoons fresh lemon juice, divided",
        "1/2 teaspoon finely grated lemon peel",
        "1/4 cup minced smoked canned oysters",
        "5 tablespoons unsalted butter, divided",
        "1 tablespoon chopped fresh thyme",
        "4 black cod fillets with skin",
        "Coarse kosher salt",
        "1/4 cup panko (Japanese breadcrumbs),* toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Potato",
        "High Fiber",
        "Dinner",
        "Seafood",
        "Cod",
        "Oyster",
        "Fennel",
        "Simmer",
        "Pescatarian"
    ],
    "title": "Black Cod with Fennel Chowder and Smoked Oyster Panzanella",
    "url": "http://www.epicurious.com/recipes/food/views/black-cod-with-fennel-chowder-and-smoked-oyster-panzanella-354857"
}
