{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Place a piece of aluminum foil on the bottom rack of the oven to catch any drippings.",
        "Mix 1 cup all-purpose flour, whole wheat flour, baking powder, salt, and baking soda together in a large bowl. Work 1/4 cup butter into flour mixture using your hands until about half the butter has been incorporated and the rest is in pea-sized pieces.",
        "Make a well in the center of the flour-butter mixture; add buttermilk to the well. Stir with a rubber spatula or wooden spoon until dough just comes together.",
        "Lightly dust a piece of parchment paper with 1 tablespoon all-purpose flour.",
        "Turn dough onto the prepared parchment paper. Shape dough into a ball; wrap parchment paper around dough. Store in refrigerator while preparing the blackberry filling.",
        "Mix blackberries, 1 1/4 cup sugar, and water together in a large bowl.",
        "Melt 2 tablespoons butter in a 10-inch cast iron skillet over medium heat. Pour blackberry mixture into the melted butter and bring to a simmer. Decrease heat to medium-low; cook and stir until liquid has reduced and is thick enough to coat the back of a spoon, about 15 minutes.",
        "Gently drop large spoonfuls of dough evenly into the blackberry mixture; sprinkle with 1 tablespoon sugar.",
        "Bake in the preheated oven until lightly browned, 15 to 20 minutes. Remove from oven and allow grunt to cool for 15 to 30 minutes before serving."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "1 cup whole wheat flour",
        "2 teaspoons baking powder",
        "1 teaspoon kosher salt",
        "1/4 teaspoon baking soda",
        "1/4 cup chilled butter, cut into small pieces",
        "1 cup buttermilk",
        "1 tablespoon all-purpose flour for dusting",
        "6 cups blackberries",
        "1 1/4 cups raw sugar",
        "1 cup water",
        "2 tablespoons butter",
        "1 tablespoon raw sugar, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Blackberry Grunt",
    "url": "http://allrecipes.com/recipe/229579/blackberry-grunt/"
}
