{
    "directions": [
        "Stir water and sugar in heavy medium saucepan over medium heat until sugar dissolves. Bring to boil; 1 minute. Remove from heat. Mix in instant coffee granules. Add chocolate and whisk until melted and smooth. Stir in cream, vanilla and salt. Cool slightly. Transfer to 2-cup jars. Seal tightly. (Can be prepared 1 week ahead; refrigerate.)",
        "Preheat oven to 375°F. Place pecans on cookie sheet. Toast until fragrant and just beginning to brown, stirring occasionally, about 12 minutes. Cool completely.",
        "Stir sugar and Scotch whiskey in heavy medium saucepan over low heat until sugar dissolves. Increase heat to medium-high and bring to boil. Boil without stirring until mixture is deep amber color, brushing down sides of pan with wet pastry brush and swirling pan occasionally, about 4 minutes. Remove from heat and whisk in cream (mixture will bubble up). Return to boil, whisking constantly. Remove from heat and whisk in butter, salt and pecans. Cool sauce slightly. Transfer to 2-cup jar. Seal tightly. (Can be prepared 1 week ahead; refrigerate.)"
    ],
    "ingredients": [
        "1/2 cup plus 2 tablespoons water",
        "1/2 cup plus 2 tablespoons sugar",
        "1 tablespoon instant coffee granules",
        "10 ounces bittersweet (not unsweetened) or semisweet chocolate,",
        "1/4 cup whipping cream",
        "1 1/4 teaspoons vanilla extract",
        "Pinch of salt",
        "1 cup pecan halves",
        "1 1/4 cups sugar",
        "1/4 cup plus 2 tablespoons Scotch whiskey",
        "3/4 cup whipping cream",
        "3 tablespoons unsalted butter, room temperature",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Chocolate",
        "Dairy",
        "Nut",
        "Dessert",
        "Pecan",
        "Whiskey",
        "Winter"
    ],
    "title": "Black and Tan Sauces",
    "url": "http://www.epicurious.com/recipes/food/views/black-and-tan-sauces-2872"
}
