{
    "directions": [
        "Heat oil in heavy large pot over medium-high heat. Add onions and cook until soft and beginning to brown, stirring often, about 8 minutes. Add garlic; stir 1 minute. Sprinkle chili powder and coriander over; stir 1 minute. Stir in tomatoes with juice, beans, chipotles, and oregano. Add 10 cups water. Bring to boil, reduce heat to low, cover with lid slightly ajar, and simmer until beans are tender, stirring occasionally, about 2 hours (time will vary depending on freshness of beans). Season to taste with coarse salt and freshly ground black pepper. DO AHEAD: Chili can be made up to 2 days ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep chilled. Rewarm chili before continuing.",
        "Stir squash and bulgur into chili. Simmer uncovered over medium-low heat until squash and bulgur are tender, about 30 minutes. Season to taste with salt and pepper. Divide chili among bowls. Serve with sour cream, cheese, red onion, cilantro, and pickled jalapeño rings."
    ],
    "ingredients": [
        "1 1/2 tablespoons olive oil",
        "2 onions, chopped",
        "8 garlic cloves, chopped",
        "2 1/2 chili powder",
        "1 tablespoon ground coriander",
        "2 14.5-ounce cans fire-roasted tomatoes",
        "1 pound dried black beans, rinsed",
        "2 chipotle chiles from canned chipotle chiles in adobo, minced",
        "2 teaspoons dried oregano (preferably Mexican)",
        "Coarse kosher salt",
        "1 2 1/4-pound butternut squash, peeled, seeded, cut into 1/2-inch cubes (about 3 cups)",
        "1/2 cup quick-cooking bulgur",
        "Sour cream",
        "Coarsely grated hot pepper",
        "Monterey jack cheese",
        "Diced red onion chopped",
        "Fresh cilantro",
        "Pickled jalapeño rings",
        "Ingredient info: Chipotle chiles in adobo can be found at some super markets and at Latin markets. Look for bulgur at super markets and natural foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Super Bowl",
        "Low Fat",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Butternut Squash",
        "Healthy",
        "Low Cholesterol",
        "Bulgur"
    ],
    "title": "Black Bean Chili with Butternut Squash",
    "url": "http://www.epicurious.com/recipes/food/views/black-bean-chili-with-butternut-squash-363715"
}
