{
    "directions": [
        "Preheat oven to 350°F. Whisk egg yolks and 1/3 cup sugar in large bowl to blend. Pour cream into heavy medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring cream to simmer. Remove from heat. Gradually whisk hot cream mixture into yolks. Strain custard into another large bowl. Transfer scant 2 cups custard to medium bowl. Immediately add chocolate to remaining custard in large bowl. Whisk mixture until chocolate melts and custard is smooth.",
        "Divide chocolate custard equally among eight 2/3-cup ramekins. Place ramekins in large roasting pan. Pour enough hot water into roasting pan to come halfway up sides of ramekins. Bake until custard is barely set in center, about 25 minutes. Transfer ramekins to baking sheet and refrigerate until tops of custards feel firm, about 30 minutes. Maintain oven temperature.",
        "Spoon vanilla custard evenly over chocolate custard, dividing equally among ramekins. Place ramekins in large roasting pan. Pour enough hot water into pan to come halfway up sides of ramekins. Bake until vanilla custard is barely set in center, about 35 minutes.",
        "Preheat broiler. Arrange 4 ramekins on baking sheet. Sprinkle 1 teaspoon sugar over each. Broil until sugar browns, about 1 minute. Repeat with remaining 4 custards and 4 teaspoons sugar. Refrigerate custards at least 1 hour before serving. (Can be prepared up to 6 hours ahead. Keep refrigerated.)"
    ],
    "ingredients": [
        "8 large egg yolks",
        "1/3 cup plus 8 teaspoons sugar",
        "3 cups whipping cream",
        "1 vanilla bean, split lengthwise",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, very finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Vanilla"
    ],
    "title": "Black and White Crème Brûlée",
    "url": "http://www.epicurious.com/recipes/food/views/black-and-white-creme-brulee-4532"
}
