{
    "directions": [
        "Preheat an oven to 500 degrees F (260 degrees C). Place a roasting pan filled halfway with water on the bottom rack of the oven. Grease a 10-inch pie pan.",
        "Heat 1/2 cup chocolate chips and 1/2 cup butter in a microwave in a microwave-safe bowl until melted, about 1 minute. Stir to combine. Stir in the graham cracker crumbs, brown sugar, water, and cinnamon. Press the cracker mix into the bottom and about 1 in h up the sides of the prepared pie pan. Set aside.",
        "Beat the cream cheese and white sugar with an electric mixer in a large bowl until light and fluffy. Add the eggs one at a time, allowing each egg to blend into the cream cheese mixture before adding the next. Beat in the vanilla with the last egg. Reserve 1/3 of the cream cheese mixture in a bowl. Pour the remaining 2/3 batter into the prepared crust.",
        "Melt 1/2 cup chocolate chips in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave).  Do not overheat or chocolate will scorch. Stir in the reserved cream cheese batter. Pour the chocolate mixture into the pan over the white filling. Run a knife through the filling decoratively to create a marble look. Sprinkle the chopped maraschino cherries on top. Place the pie pan on a baking sheet.",
        "Bake on the top rack of the preheated oven for 10 minutes, then reduce heat to 200 degrees F (95 degrees C). Continue baking until the edges of the cheesecake have nicely puffed  and the surface of the cheesecake is firm except for a small spot in the center that will jiggle when the pan is gently shaken, about 1 hour. Turn the oven off and allow the cheesecake to rest in the oven with the door closed for 1 1/2 hours. Run the tip of a paring knife around the edges of the pan, set the pan on a wire rack, and allow the cheesecake to cool at room temperature for 30 minutes before placing into the refrigerator, and cooling 3 hours.",
        "Heat the cornstarch and reserved maraschino cherry juice in a saucepan over medium heat. Cook and stir until the sauce has thickened, 5 to 7 minutes. Set aside to cool completely. Pour the cooked sauce over the cheesecake. Sprinkle the halved cherries on top. Melt the remaining 3 tablespoons chocolate chip in a microwave-safe bowl in 15-second intervals, stirring after each melting. Drizzle chocolate over the cheesecake. Refrigerate at least 2 more hours before serving."
    ],
    "ingredients": [
        "1/2 cup semi-sweet chocolate chips",
        "1/2 cup butter",
        "1 cup graham cracker crumbs",
        "1/3 cup brown sugar",
        "1 tablespoon water",
        "1 teaspoon ground cinnamon",
        "5 (8 ounce) packages cream cheese, softened",
        "1 1/4 cups white sugar",
        "5 eggs",
        "1 teaspoon vanilla extract",
        "1/2 cup semi-sweet chocolate chips",
        "1/2 (16 ounce) jar maraschino cherries - drained, chopped, and juices reserved",
        "2 teaspoons cornstarch",
        "1/2 (16 ounce) jar maraschino cherries, halved",
        "3 tablespoons semisweet chocolate chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Black Forest Cheesecake",
    "url": "http://allrecipes.com/recipe/218530/black-forest-cheesecake/"
}
