{
    "directions": [
        "Put peas in water to cover by 2 inches and soak 8 hours. Drain in a colander.",
        "Purée bell peppers, onion, tomatoes, chile, and salt in 2 batches in a food processor.",
        "Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then stir in purée (use caution as it will splatter). Reduce heat and simmer, stirring occasionally, until most of liquid is evaporated, 8 to 10 minutes. Cool to room temperature.",
        "Purée peas, onion, and chile in food processor until as smooth as possible, then blend in egg and salt. With motor running, add 3 tablespoons water and blend until smooth and fluffy (add remaining tablespoon water if necessary to form a batter just thin enough to drop from a spoon).",
        "Heat oil in a 4-quart heavy pot (preferably cast-iron) until thermometer registers 360°F. Working in batches of 8, gently drop tablespoons of batter into hot oil, using a small spoon to scrape batter from tablespoon. Fry, stirring constantly (to prevent fritters from browning too quickly), until golden, about 2 minutes, then transfer to paper towels to drain. Return oil to 360°F between batches."
    ],
    "ingredients": [
        "1 cup dried black-eyed peas",
        "1 medium onion, chopped",
        "1/2 teaspoon minced fresh habanero chile, including seeds",
        "1 large egg",
        "1 teaspoon salt",
        "3 to 4 tablespoons water",
        "6 cups vegetable oil",
        "4 red bell peppers (1 1/2 lb), chopped",
        "1 medium onion, chopped",
        "2 plum tomatoes, chopped",
        "1 tablespoon minced fresh habanero chile, including seeds",
        "1 1/2 teaspoons salt",
        "1/4 cup peanut or vegetable oil",
        "Special equipment: a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Pepper",
        "Appetizer",
        "Breakfast",
        "Side",
        "Fry",
        "Cocktail Party",
        "Vegetarian",
        "Pea",
        "Bell Pepper",
        "Hot Pepper",
        "Deep-Fry",
        "Party",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Black-Eyed Pea Fritters with Hot Pepper Relish",
    "url": "http://www.epicurious.com/recipes/food/views/black-eyed-pea-fritters-with-hot-pepper-relish-106044"
}
