{
    "directions": [
        "Preheat oven to 350°F. Lightly oil six 1/2-cup ramekins.",
        "Spread almonds in a shallow baking pan and toast in oven until pale golden, 7 to 8 minutes. Cool almonds completely.",
        "In a food processor process almonds with milk 2 minutes, or until mixture is very thick but not completely smooth.",
        "Rinse a thin kitchen towel in cold water and wring out as much water as possible. Spread towel in a large sieve set over a bowl or large glass measure and pour almond mixture into towel. Wrap towel around mixture and squeeze almond milk (about 1 cup) from towel into bowl or measure, discarding almonds. Stir in almond extract and a pinch salt.",
        "In a small bowl sprinkle gelatin over water and let stand 1 minute.",
        "In a small saucepan combine almond milk and sugar and cook over moderate heat, stirring, until sugar is dissolved. Add gelatin mixture and cook, stirring, until gelatin is dissolved. Transfer almond mixture to a metal bowl set in a larger bowl of ice and cold water and cool, stirring constantly, just until the consistency of raw egg white. Remove bowl from ice water.",
        "In a bowl with an electric mixer beat cream until it holds stiff peaks and whisk about one fourth into almond mixture to lighten. Fold in remaining cream gently but thoroughly and spoon mixture into ramekins. Chill blancmanges, covered loosely with plastic wrap, until set, at least 2 hours and up to 24.",
        "In a blender or food processor purée raspberries with syrup and force through a fine sieve into a bowl. Sauce may be made 1 day ahead and chilled, covered.",
        "Fill a small bowl with very hot or boiling water and dip ramekins, 1 at a time, into water 10 seconds. Unmold each blancmange onto a dessert plate and serve with sauce."
    ],
    "ingredients": [
        "1 1/2 cups blanched whole almonds (about 8 ounces)",
        "1 1/2 cups milk",
        "1/8 teaspoon almond extract",
        "2 teaspoons unflavored gelatin",
        "2 tablespoons cold water",
        "1/2 cup sugar",
        "1 cup well-chilled heavy cream",
        "two 10-ounce packages thawed frozen raspberries in syrup (do not drain)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Food Processor",
        "Dessert",
        "Bake",
        "Raspberry",
        "Almond",
        "Chill",
        "Gourmet"
    ],
    "title": "Blancmanges with Raspberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/blancmanges-with-raspberry-sauce-10874"
}
