{
    "directions": [
        "To make the aioli, combine the garlic and a big pinch of salt in a food processor. Pulse several times until the garlic is finely chopped. Add the egg and egg yolk and pulse to combine. With the machine running, slowly drip in a few drops of oil, and then follow with a slow, steady stream of oil. Add the lemon juice and zest and blend until combined. Season with salt and set aside at room temperature until you are ready to serve, or store in the refrigerator in an airtight container for up to 1 week.",
        "Prepare a medium-hot fire in a grill.",
        "In a fry pan over medium-high heat, fry the bacon, turning occasionally, until crispy, about 6 minutes. Transfer to paper towels to drain. Set aside.",
        "Form the ground beef into 4 rectangular patties. Season both sides well with salt and pepper. Coat the grill grate lightly with cooking spray. Arrange the burgers on the grate directly over the heat and grill, turning once, until medium-rare, about 4 minutes per side.",
        "Slice the baguette into 4 1/2-inch (11.5-cm) lengths and split. Slather the cut sides of the baguette with aioli. Top the bottom half of the bread with lettuce, then the burgers, then layer with tomato, avocado and bacon, dividing them evenly. Close the burgers and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Burger Night",
        ", by Kate McMillan (Weldon Owen 2015)"
    ],
    "ingredients": [
        "1 garlic clove",
        "Kosher salt",
        "1 egg plus 1 egg yolk",
        "1 cup (8 fl. oz./250 ml) canola or vegetable oil",
        "Grated zest and juice of 1 Meyer lemon",
        "6 slices thick-cut bacon, halved",
        "1 1/2 lb. (750 g) ground beef",
        "Kosher salt and freshly ground pepper",
        "1 French baguette or 8 slices toasted sourdough bread",
        "4 large pieces of green-leaf lettuce",
        "1 ripe tomato, cut into thin slices",
        "1 avocado, pitted and sliced"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "BLAT Burgers",
    "url": "http://www.williams-sonoma.com/recipe/blat-burgers.html"
}
