{
    "directions": [
        "Bring 3 quarts water to boil in large saucepan. Add tapioca and boil until tapioca is clear, stirring occasionally, about 16 minutes. Drain; rinse under cold water until cool. Transfer tapioca to medium bowl.",
        "Pour cream into heavy small saucepan. Scrape in seeds from vanilla bean; add bean. Bring to simmer. Whisk egg yolks, sugar, and salt in medium bowl 1 minute. Gradually whisk hot cream mixture into yolks. Return mixture to saucepan and stir over medium heat until mixture is thick enough to coat back of spoon, about 5 minutes; do not boil. Transfer custard to medium metal bowl. Set over bowl of ice water and stir until custard is cool. Stir 3/4 cup custard into tapioca. Do ahead Can be made 1 day ahead. Cover and chill tapioca and remaining custard separately. Stir all remaining custard into tapioca to loosen before continuing.",
        "Cook potatoes and parsnips in separate medium saucepans of boiling salted water until very tender, about 15 minutes. Drain vegetables well, then transfer to sieve set over medium bowl. Force potatoes and parsnips through sieve into bowl. Stir in milk. Whisk in flour in 3 additions. Add eggs 1 at a time, whisking to blend after each addition. Whisk sugar and salt into batter. Using electric mixer, beat egg whites until stiff but not dry. Fold egg whites into batter.",
        "Line rimmed baking sheet with foil. Heat griddle over medium heat. Brush with oil. In batches, drop batter by rounded tablespoonfuls onto griddle, spreading to form 21/2- to 3-inch rounds. Cook until brown, about 21/2 minutes per side. Transfer to sheet. Do ahead Can be made 1 day ahead. Cool, cover tightly with foil, and chill. Rewarm uncovered in 350°F oven, about 7 minutes.",
        "Divide tapioca among 8 small bowls. Place 1 bowl on each of 8 plates. Divide warm blinis among plates. Arrange dried cherry halves, candied apricot slices, and toasted pecans on plates. Place dollop of crme frache and honey and small mound of ground cinnamon on plates."
    ],
    "ingredients": [
        "3 quarts water",
        "1/2 cup small pearl tapioca*",
        "1 cup whipping cream",
        "1 3-inch piece vanilla bean, split lengthwise",
        "3 large egg yolks (reserve whites for blinis)",
        "1/3 cup sugar",
        "Pinch of salt",
        "1/2 pound Yukon Gold potatoes, peeled, cut into 1/2-inch cubes (about 1 1/2 cups)",
        "1/2 pound parsnips, peeled, cut into 1/2-inch cubes (about 1 1/2 cups)",
        "1/4 cup whole milk",
        "1/4 cup all purpose flour",
        "3 large eggs",
        "2 tablespoons sugar",
        "1 teaspoon salt",
        "3 large egg whites (reserved from tapioca)",
        "Vegetable oil",
        "1 cup candied red cherries, halved",
        "1 cup candied or dried apricots (about 8 ounces), cut in half horizontally, then sliced crosswise into 1/4-inch-wide strips",
        "1 cup pecans, toasted, coarsely broken",
        "1 cup crème fraîche",
        "1/2 cup honey",
        "1/4 cup ground cinnamon",
        "*Available at some supermarkets and specialty foods stores, and at Asian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Potato",
        "Vegetable",
        "Dessert",
        "Christmas",
        "Cocktail Party",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blinis with Tapioca Caviar, Candied Fruits, Toasted Pecans, and Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/blinis-with-tapioca-caviar-candied-fruits-toasted-pecans-and-creme-fraiche-236795"
}
