{
    "directions": [
        "Combine flour, sugar and salt in processor. Add butter and cut in, using on/off turns, until mixture resembles coarse meal. Whisk 2 tablespoons ice water and yolk in small bowl. Add to dry ingredients and blend just until moist clumps form, adding more water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic and refrigerate at least 1 hour and up to 1 day.",
        "Preheat oven to 375°F. Roll out dough on lightly floured surface to 13- to 14-inch round. Transfer dough to 11-inch-diameter tart pan with removable bottom. Press in overhang, forming double-thick sides. Pierce dough all over with fork. Freeze crust 30 minutes. Bake until golden brown, pressing with back of fork if crust bubbles or slips, about 30 minutes. Transfer to rack and cool.",
        "Bring milk and cardamom to boil in medium saucepan over medium-high heat. Remove from heat. Cover and let steep 15 minutes. Strain milk into bowl. Whisk yolks, sugar and flour in medium bowl to blend. Gradually whisk in milk. Return to saucepan and cook over medium heat until pastry cream thickens and boils, whisking constantly, about 5 minutes. Whisk in butter, then vanilla. Transfer to bowl. Press plastic wrap onto surface. Chill until cold, at least 4 hours and up to 1 day.",
        "Cut peel and white pith from oranges. Slice into 1/4-inch-thick rounds. Drain rounds on paper towels. Whisk preserves and grenadine, if desired, in small bowl to blend. Spread pastry cream evenly in tart crust. Arrange oranges in overlapping concentric circles on pastry cream. Brush apricot glaze over oranges. Chill until set, about 15 minutes. (Can be made 6 hours ahead; keep refrigerated.)"
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "2 tablespoons sugar",
        "1/8 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into 1/2-inch pieces",
        "2 tablespoons (or more) ice water",
        "1 large egg yolk",
        "2 cups whole milk",
        "1 tablespoon cardamom pods, crushed slightly",
        "5 large egg yolks",
        "1/2 cup sugar",
        "6 tablespoons all purpose flour",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 teaspoon vanilla extract",
        "6 blood oranges or small navel oranges",
        "1/2 cup apricot preserves, melted, strained",
        "2 teaspoons grenadine (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Orange",
        "Spice",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blood Orange Tart with Cardamom Pastry Cream",
    "url": "http://www.epicurious.com/recipes/food/views/blood-orange-tart-with-cardamom-pastry-cream-104613"
}
