{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Line 2, 12-cupcake tins with paper cupcake liners.",
        "Blend cake mix, 1 cup water, vegetable oil, and eggs in a large bowl.  Beat with a mixer on low speed for 2 minutes.  Divide cake batter between lined cupcake tins.",
        "Bake cupcakes in preheated oven until a toothpick inserted in the center comes out clean, 18 to 22 minutes. Cool completely.  Frost cupcakes with white frosting.",
        "Make the sugar glass.  Mix 2 cups water, 1 cup corn syrup, white sugar, and cream of tartar in a large saucepan; bring to a boil.  Use a candy thermometer and boil sugar syrup until temperature reaches 300 degrees (hard ball), stirring constantly. The mixture will thicken as water evaporates.  When sugar reaches 300 degrees, quickly pour onto a metal baking pan. Cool until completely hardened.  Break into \"shards\" using a meat mallet.",
        "Make the edible blood.  Mix together 1/2 cup corn syrup and cornstarch in a large bowl. Slowly stir in the 1/4 cup of water, adding more if necessary, until the corn syrup mixture has thickened to the consistency of blood. Stir in the red and blue food coloring.",
        "Stab each frosted cupcake with a few shards of broken sugar glass. Drizzle on drops of \"blood\" to complete the effect."
    ],
    "ingredients": [
        "1 (18.25 ounce) package white cake mix",
        "1 cup water",
        "1/3 cup vegetable oil",
        "3 eggs",
        "1 (16 ounce) can white frosting",
        "Sugar Glass:",
        "2 cups water",
        "1 cup light corn syrup",
        "3 1/2 cups white sugar",
        "1/4 teaspoon cream of tartar",
        "Edible Blood:",
        "1/2 cup light corn syrup",
        "1 tablespoon cornstarch",
        "1/4 cup water, or more as needed",
        "15 drops red food coloring",
        "3 drops blue food coloring"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bloody Broken Glass Cupcakes",
    "url": "http://allrecipes.com/recipe/216230/bloody-broken-glass-cupcakes/"
}
