{
    "directions": [
        "Make the dipping sauce: Combine mayonnaise, ketchup, horseradish, paprika, 1/4 teaspoon salt, 1 dash black pepper, and 1 dash cayenne pepper in a small bowl and refrigerate it until needed.",
        "Beat egg and combine it with milk in a bowl large enough to hold the onion.  In another bowl, combine flour, salt, cayenne pepper, black pepper, garlic powder, thyme, oregano, and cumin.",
        "Prepare the onion:  cut approximately  3/4 to 1 inch off of the top and bottom of the onion, remove skin.  Remove the 1-inch diameter core from the middle of the onion.  Using a large, sharp knife, slice down the center of the onion about 3/4 of the way down, turn 90 degrees and slice again.  Keep slicing the sections in half, being careful not to cut to the bottom, until you have 16 sections.  Spread the petals apart to make coating easier.",
        "Dip the onion in the milk, then coat well with the flour mixture.  Separate the petals again and sprinkle the flour mixture between them.  Once you have coated all of the petals well, dip it into the milk and into the flour mixture again.  Place in the refrigerator for at least 15 minutes while you preheat the oil.",
        "Pour enough oil to cover the onion into a deep fryer or deep pot. Preheat the oil to 350 degrees F (175 degrees C).",
        "Fry the onion right side up in the oil for 10 minutes or until golden brown.  Remove from oil and let drain in a rack or paper towels.  Open the center of the onion wide so that you can put the small bowl of dipping sauce in the center."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1216&h=637&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F961236.jpg",
    "ingredients": [
        "½ cup mayonnaise",
        "¾ tablespoon ketchup",
        "2 tablespoons cream-style horseradish sauce",
        "¼ teaspoon paprika",
        "¼ teaspoon salt",
        "1 pinch ground black pepper",
        "1 pinch cayenne pepper",
        "1  egg",
        "1 cup milk",
        "1 cup all-purpose flour",
        "1 ½ teaspoons salt",
        "1 ½ teaspoons cayenne pepper",
        "½ teaspoon ground black pepper",
        "½ teaspoon garlic powder",
        "¼ teaspoon dried thyme",
        "¼ teaspoon dried oregano",
        "⅛ teaspoon ground cumin",
        "1 large onion",
        "2 quarts vegetable oil for deep-frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Blooming Onion",
    "url": "http://allrecipes.com/recipe/16531/blooming-onion/"
}