{
    "directions": [
        "Position rack in center of oven; preheat to 450°F. Using vegetable peeler, remove peel (orange part only) in strips from 3 blood oranges. Place pork in large roasting pan. Rub with 2 tablespoons olive oil; sprinkle with salt and pepper. Toss onion, orange peel, and rosemary leaves with remaining 1 tablespoon oil in medium bowl; sprinkle with salt and pepper. Arrange onion mixture around pork. Roast until pork and onion are beginning to brown, about 25 minutes.",
        "Meanwhile, squeeze enough juice from oranges to measure 3/4 cup; pour juice into small saucepan. Add wine, broth, and garlic. Boil until reduced to 1 1/4 cups, about 7 minutes.",
        "Add 1/2 cup orange juice mixture to roasting pan. Baste pork with pan juices. Reduce oven temperature to 350°F; continue roasting pork until thermometer inserted into thickest part of pork registers 150°F, basting often and adding more orange juice mixture as needed, about 30 minutes longer.",
        "Place pork on platter and cover loosely with foil. Place roasting pan over medium-high heat; add remaining 3/4 cup orange juice mixture to pan. Boil until slightly thickened, about 3 minutes. Remove strings from roast. Slice pork; place on platter. Pour sauce and onion mixture over and around pork. Garnish with rosemary sprigs and orange slices."
    ],
    "ingredients": [
        "blood oranges",
        "1 3-pound boneless pork loin, rolled and tied",
        "3 tablespoons extra-virgin olive oil, divided",
        "1 large onion, cut into 8 wedges",
        "2 fresh rosemary sprigs, leaves stripped from stems, plus additional sprigs for garnish",
        "1/2 cup dry white wine",
        "1/2 cup low-salt chicken broth",
        "1 large garlic clove, pressed",
        "Blood orange slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pork",
        "Roast",
        "Low Cal",
        "Low Sodium",
        "Orange",
        "Rosemary",
        "White Wine",
        "Winter",
        "Healthy"
    ],
    "title": "Blood Orange Roast Pork Loin",
    "url": "http://www.epicurious.com/recipes/food/views/blood-orange-roast-pork-loin-240673"
}
