{
    "directions": [
        "Preheat oven to 400°. Wash beets, leaving some water on skins. Wrap individually in foil; place on a rimmed baking sheet and roast until beets are tender when pierced with a knife, about 1 hour. Let cool.",
        "Meanwhile, using a sharp knife, cut all peel and white pith from all oranges; discard. Working over a medium bowl, cut between membranes of 2 blood oranges to release segments into bowl; squeeze juice from membranes into bowl and discard membranes. Slice remaining blood orange and Cara Cara orange crosswise into thin rounds. Place sliced oranges in bowl with the segments. Add lemon juice and lime juice.",
        "Peel cooled beets. Slice 2 beets crosswise into thin rounds. Cut remaining 2 beets into wedges. Strain citrus juices; reserve. Layer beets and oranges on plates, dividing evenly. Arrange fennel and onion over beets. Spoon reserved citrus juices over, then drizzle salad generously with oil. Season to taste with coarse sea salt and pepper. Let salad stand for 5 minutes to allow flavors to meld. Garnish salad with cilantro leaves."
    ],
    "ingredients": [
        "2 medium red beets, tops trimmed",
        "2 medium golden beets, tops trimmed",
        "3 blood oranges",
        "1 medium navel orange (preferably Cara Cara)",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon fresh lime juice",
        "1/2 small fennel bulb, very thinly sliced crosswise on a mandoline",
        "1/4 red onion, very thinly sliced on a mandoline (about 1/3 cup)",
        "Good-quality extra-virgin olive, pumpkin seed, or walnut oil (for drizzling)",
        "Coarse sea salt, such as fleur de sel or Maldon sea salt",
        "freshly ground black pepper",
        "1/4 cup loosely packed fresh cilantro and/or chervil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "Blood Orange, Beet, and Fennel Salad",
    "url": "http://www.epicurious.com/recipes/food/views/blood-orange-beet-and-fennel-salad-378345"
}
