{
    "directions": [
        "Preheat oven to 350°F. Spread bread in a single layer on a rimmed baking sheet. Bake, tossing once, until dry to the touch and slightly toasted, about 10 minutes. Let cool slightly.",
        "Meanwhile, cook bacon in a large skillet over medium-high heat, stirring occasionally, until fat starts to render and bacon browns, about 15 minutes. Using a slotted spoon, transfer bacon to a small bowl, reserving 3 Tbsp. fat.",
        "Whisk eggs, stock, mayonnaise, salt, pepper, and 2 Tbsp. bacon fat in a large bowl. Add bread and gently toss to combine. Add bacon and tomatoes and stir to combine. Let sit until bread has absorbed most of the liquid, about 15 minutes.",
        "Reduce oven temperature to 325°F. Add lettuce to bread mixture and stir to combine. Transfer mixture to a 13x9\" baking dish and bake until top is golden brown, about 45 minutes. Brush surface with remaining 1 Tbsp. bacon fat, turn broiler on, and continue baking until tops of bread are glistening and well toasted, 3–5 minutes more. Garnish with chives, if using, and serve immediately.",
        "Bread can be dried out 3 days ahead; store in an airtight container at room temperature. Bacon can be cooked 3 days ahead; cover and chill."
    ],
    "ingredients": [
        "12 ounces crusty Italian or country-style bread, cut into 1\" cubes (about 8 cups)",
        "1 pound thick-cut bacon, cut crosswise into 1\" pieces",
        "3 large eggs",
        "1 1/2 cups low-sodium chicken stock or broth",
        "1/2 cup mayonnaise",
        "1 teaspoon kosher salt",
        "3/4 teaspoon freshly ground black pepper",
        "1 pint cherry or grape tomatoes, halved",
        "1 head romaine, washed, dried very well, cut into 1\" slices",
        "2 tablespoons coarsely chopped chives (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Summer",
        "Casserole/Gratin",
        "Kid-Friendly",
        "Bacon",
        "Lettuce",
        "Tomato",
        "Bread",
        "Bake",
        "Dinner"
    ],
    "title": "BLT Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/blt-casserole"
}
