{
    "directions": [
        "Preheat 350°F. Roll out tart crust dough on floured work surface to 13-inch round. Transfer to 9-inch-diameter tart pan with removable bottom, pressing into place. Trim dough overhang to 1/2 inch. Fold overhang in; press firmly, forming double-thick-sides. Freeze 15 minutes.",
        "Line crust with foil. Fill with dried beans or pie weights. Bake until sides are set, about 15 minutes. Remove foil and beans, Bake until crust is golden brown and baked through, piercing with fork if crust bubbles, about 18 minutes. Transfer pan to rack; cool crust completely.",
        "Finely chop 1/2 cup blueberries in processor. Transfer to heavy medium saucepan. Add 3 tablespoons lemon juice and sugar and stir over medium heat until mixture boils and thickens slightly, about 3 minutes. Remove from heat. Stir in remaining 2 1/2 cups blueberries. Cool.",
        "Combine 1 tablespoon water and 3 tablespoons lemon juice in heavy small saucepan. Sprinkle gelatin over. Let stand 10 minutes to soften. Stir over low heat just until gelatin dissolves. Set aside. Bring 1/4 cup cream to simmer in heavy medium saucepan. Remove from heat. Add white chocolate and stir until smooth. Whisk in gelatin mixture. Refrigerate until just cool and beginning to thicken slightly, stirring often, about 10 minutes.",
        "Beat remaining 3/4-cup cream in medium bowl until stiff peaks form. Gently fold into white chocolate mixture. Spoon mousse into curst; smooth top. Refrigerate until set, about 2 hours.",
        "Spoon blueberry mixture over white chocolate mousse, covering completely. refrigerate until cold, about 1 hour. (Can be made 1 day ahead. Keep refrigerated.)",
        "Remove tart from pan. Transfer tart to platter. Sprinkle with white chocolate shavings. Cut into wedges and serve.",
        "Mix flour, powdered sugar and salt in processor. Add butter; process until mixture resembles coarse meal. Mix egg yolks and water in small bowl. Add to flour mixture and process until moist clumps form.",
        "Gather dough into ball; flatten into disk for round tart or into square for rectangular tart. Wrap in plastic and refrigerate 1 hour. (Can be prepared 3 days ahead. Keep refrigerated. Let dough soften briefly at room temperature before rolling out.)"
    ],
    "ingredients": [
        "3 cups fresh blueberries",
        "6 tablespoons fresh lemon juice",
        "3 tablespoons sugar",
        "1 tablespoon water",
        "1 teaspoon unflavored gelatin",
        "1 cup chilled whipping cream",
        "4 ounce good-quality white chocolate (such as Lindt or Baker's), finely chopped",
        "White chocolate, shavings",
        "(Makes one 9-inch crust)",
        "1 1/4 cups all purpose flour",
        "1/3 cup powdered sugar",
        "1/2 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into pieces",
        "2 large egg yolks",
        "1 tablespoon cold water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Chocolate",
        "Citrus",
        "Dairy",
        "Dessert",
        "Bake",
        "Summer",
        "Chill",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Blueberry-White Chocolate Mousse Tart",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-white-chocolate-mousse-tart-2297"
}
