{
    "directions": [
        "Stir together water, yeast, and 1 tablespoon sugar in a small bowl until sugar is dissolved, then let stand until foamy, about 5 minutes. (If mixture doesn't foam, discard and start over with new yeast.)",
        "Stir together flour, salt, and 1 tablespoon sugar in bowl of mixer. Add yeast mixture and eggs and beat at medium speed until combined. Add butter and beat until dough is smooth and silky, 5 to 8 minutes. (Dough will be very soft and sticky.) Add figs and nuts and mix until combined. Sprinkle remaining tablespoon sugar over dough, then cover bowl with plastic wrap and a clean kitchen towel and let dough rise in a draft-free place at warm room temperature until almost doubled in bulk, about 2 hours.",
        "Butter and flour loaf pan, knocking out excess flour. Stir dough with a wooden spoon to release air, then spread evenly in loaf pan. Cover pan loosely with plastic wrap and kitchen towel and let dough rise in a draft-free place at warm room temperature until it almost fills pan (dough will not rise above top of pan), 1 to 1 1/2 hours more.",
        "Boil juice and wine in a 2- to 3-quart saucepan over moderately high heat until syrupy and reduced to about 1/2 cup, about 30 minutes. Cool to room temperature.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Bake until golden brown and a wooden pick or skewer inserted in center comes out clean, 35 to 45 minutes. Turn brioche out onto a rack, then turn right side up and cool completely, about 1 1/2 hours.",
        "Keep oven rack in middle position and preheat oven to 400°F.",
        "Brush molds with melted butter (1 tablespoon) and coat with nuts, knocking out excess.",
        "Bring milk and remaining 2 tablespoons butter to a boil in a 1-quart heavy saucepan. Whisk in flour until smooth and return to a boil over moderate heat. Remove from heat and vigorously whisk 1 minute, then whisk into yolks in a large bowl.",
        "Beat whites in another bowl with an electric mixer until they just hold stiff peaks.",
        "Stir half of cheese into yolk mixture and fold in one third of whites to lighten, then fold in remaining whites gently but thoroughly. Divide among molds and bake in a water bath until puffed and browned, about 30 minutes. Remove molds from water bath and cool on a rack 5 minutes.",
        "While soufflés are cooling, cut 3 (1/2-inch-thick) slices from brioche loaf, then halve each slice for a total of 6 (2-inch) squares. Reserve remainder of loaf for another use.",
        "Run a thin knife around edge of molds to loosen soufflés. Divide brioche squares among 6 plates and drizzle with some grape syrup, then top each with a soufflé. Sprinkle with remaining cheese and serve immediately."
    ],
    "ingredients": [
        "2 tablespoons warm water (105-115°F)",
        "1 1/2 teaspoons active dry yeast (from a 1/4-oz package)",
        "3 tablespoons sugar",
        "2 cups plus 2 tablespoons all-purpose flour",
        "1 1/2 teaspoons salt",
        "3 large eggs",
        "2 sticks (1 cup) unsalted butter, softened",
        "1/2 lb dried Mission figs, stems discarded and figs chopped (1 1/2 cups)",
        "1/2 cup walnuts (2 oz), chopped",
        "2 cups white grape juice",
        "1 cup dry fruity white wine such as Riesling",
        "2 tablespoons unsalted butter, plus 1 tablespoon melted",
        "3 tablespoons finely chopped walnuts",
        "1/2 cup whole milk",
        "2 tablespoons all-purpose flour",
        "2 large eggs, separated",
        "1/4 lb Maytag Blue cheese, crumbled (1 cup)",
        "Special equipment: a stand mixer fitted with paddle attachment; a 9- by 5- by 3-inch loaf pan; 6 (2-oz) heatproof baba au rhum molds or metal condiment cups"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Blue Cheese",
        "Fig",
        "Walnut",
        "White Wine",
        "Fall",
        "Grape",
        "Pastry",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blue Cheese Souffles with Grape Syrup on Fig and Walnut Brioche",
    "url": "http://www.epicurious.com/recipes/food/views/blue-cheese-souffles-with-grape-syrup-on-fig-and-walnut-brioche-232822"
}
