{
    "directions": [
        "Preheat oven to 350°F. Butter and flour two 9-inch-diameter cake pans with 1 1/2-inch-high sides; line bottoms with rounds of parchment paper. Sift first 3 ingredients into medium bowl. Beat butter in large bowl until fluffy. Gradually add sugar, beating until blended. Beat in concentrate, peel, and vanilla. Beat in eggs 1 at a time. Beat in flour mixture in 4 additions alternately with milk in 3 additions. Divide batter between prepared pans. Bake cakes until tester inserted into center comes out clean, about 30 minutes. Cool in pans on rack.",
        "Combine berries, sugar, and lemon juice in heavy small saucepan. Bring to boil over high heat, stirring until sugar dissolves. Boil until mixture is reduced to 3/4 cup, stirring occasionally and mashing berries coarsely with fork, about 8 minutes. Chill filling uncovered until cold, about 30 minutes.",
        "Beat cream cheese and butter in bowl to blend. Beat in powdered sugar in 4 additions, then orange concentrate, peel, and vanilla. Chill until firm but spreadable, about 30 minutes.",
        "Cut around cakes to loosen. Turn cakes out. Peel off parchment. Place 1 layer, flat side up, on platter. Spread filling to within 1/2 inch of edges. Chill 5 minutes. Top with second layer, flat side down. Spread 1/2 cup frosting thinly all over cake to seal. Spread remaining frosting over cake. Mound remaining blueberries on top. (Can be made 1 day ahead; chill. Serve at room temperature.)"
    ],
    "ingredients": [
        "2 1/2 cups cake flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 cup plus 2 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
        "1 1/2 cups sugar",
        "3 tablespoons frozen orange juice concentrate, thawed",
        "1 1/2 teaspoons grated orange peel",
        "1 teaspoon vanilla extract",
        "4 large eggs",
        "1 cup whole milk",
        "2 1/2-pint baskets blueberries",
        "2 tablespoons sugar",
        "1 teaspoon fresh lemon juice",
        "1 8-ounce package cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "3 1/4 cups powdered sugar",
        "2 tablespoons frozen orange juice concentrate, thawed",
        "1 teaspoon grated orange peel",
        "1/2 teaspoon vanilla extract",
        "2 1/2-pint baskets blueberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Blueberry",
        "Orange",
        "Summer"
    ],
    "title": "Blueberry and Orange Layer Cake with Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-and-orange-layer-cake-with-cream-cheese-frosting-105183"
}
