{
    "directions": [
        "Combine butter, both sugars, and corn syrup in large bowl of stand mixer fitted with paddle attachment. Beat on medium-high speed until fluffy and pale, occasionally scraping down sides of bowl, about 3 minutes. Add eggs; beat on medium-high speed until mixture is very pale and sugar is completely dissolved, about 10 minutes. Add flour, baking powder, baking soda, and salt; beat on low speed just until blended, occasionally scraping down sides of bowl. Add Milk Crumbs; mix on low speed just until incorporated. Remove bowl from mixer. Stir in blueberries just until evenly distributed (dough will be very sticky).",
        "Using 1/4-cup ice cream scoop for each cookie, drop dough onto 2 large rimmed baking sheets. Cover with plastic wrap and refrigerate at least 24 hours. DO AHEAD: Can be made 2 days ahead. Keep chilled until baking time.",
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 375°F. Line 2 large (18x12-inch) rimmed baking sheets with parchment. Transfer 6 chilled dough scoops to each sheet, spacing at least 4 inches apart (cookies will spread). Bake cookies, 2 sheets at a time, until golden, reversing sheets halfway through baking, 20 to 22 minutes total. Repeat with remaining chilled dough, cooling and relining sheets between batches. Transfer cookies to racks; cool completely. DO AHEAD: Can be made 3 days ahead. Store in airtight containers at room temperature."
    ],
    "ingredients": [
        "2 cups (4 sticks) unsalted butter, room temperature",
        "1 1/2 cups sugar",
        "1 1/2 cups plus 2 tablespoons (packed) golden brown sugar",
        "1/2 cup plus 2 tablespoons light corn syrup",
        "2 large eggs",
        "5 1/4 cups all purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon coarse kosher salt",
        "1 1/2 cups Milk Crumbs",
        "1 1/2 cups dried blueberries",
        "Special equipment: stand mixer with paddle attachment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Milk/Cream",
        "Mixer",
        "Dessert",
        "Bake",
        "Picnic",
        "Kid-Friendly",
        "Blueberry",
        "Dried Fruit",
        "Chill",
        "Party",
        "Potluck",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blueberry and Cream Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-and-cream-cookies-360770"
}
