{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Combine flour and salt in a bowl. Mash shortening into the flour mixture with a pastry cutter or fork until the mixture is crumbly. Gradually add cold water as needed, tossing with a fork until dough forms a ball. Wrap dough in plastic wrap and refrigerate for 30 minutes.",
        "Turn dough out onto a flat work surface dusted with flour. Divide dough in half and form each half into a ball. Roll dough ball from center to edges into a circle 2 inches larger than the pie plate and about 1/8 inch thick. Wrap dough around rolling pin, starting on one side of the circle. Unroll over pie plate and trim dough. Roll remaining dough ball into a crust to fit the top of the pie and set aside.",
        "Beat egg white and 1 tablespoon water; brush over bottom of crust and set aside.",
        "Combine 3/4 cup sugar, cornstarch, lemon peel, vanilla extract, and cinnamon in a bowl. Gently stir blueberries and raspberries into the mixture to coat; pour into the crust. Top with reserved pie crust. Brush top of pie crust with 1 tablespoon water; sprinkle 1 tablespoon sugar over the moistened top. Cut a few slits into top crust with a sharp knife.",
        "Bake in preheated oven until crust is golden brown and filling is bubbly, about 45 minutes. Set pie onto wire rack to cool completely before refrigerating."
    ],
    "ingredients": [
        "Pie Crust:",
        "2 cups all-purpose flour",
        "3/4 teaspoon salt",
        "2/3 cup shortening",
        "6 tablespoons cold water, or more as needed",
        "1 egg white",
        "1 tablespoon water",
        "Filling:",
        "3/4 cup white sugar",
        "1/4 cup cornstarch",
        "2 tablespoons grated lemon peel",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon ground cinnamon",
        "3 cups fresh blueberries",
        "1 cup fresh raspberries",
        "1 tablespoon water",
        "1 tablespoon white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Blueberry Raspberry Pie",
    "url": "http://allrecipes.com/recipe/230325/blueberry-raspberry-pie/"
}
