{
    "directions": [
        "Blend flour, cornmeal, sugar, and salt in processor. Add butter and shortening; using on/off turns, blend until mixture resembles coarse meal. Add 4 tablespoons ice water; blend just until moist clumps begin to form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball. Divide dough in half; flatten each half into disk. Wrap disks separately in plastic and chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. Soften dough 10 minutes at room temperature before rolling out.",
        "Combine blueberries, sugar, cornstarch, lemon juice, and 1 tablespoon water in large bowl; toss to blend. Let stand at room temperature until juices begin to form, about 30 minutes.",
        "Preheat oven to 400°F. Place rimmed baking sheet in bottom of oven. Roll out 1 dough disk between 2 sheets of generously floured parchment paper to 12-inch round. Peel off top parchment sheet; invert dough into 9-inch-diameter glass pie dish. Carefully peel off second parchment sheet. Gently press dough into pie dish, pressing any cracks together as needed to seal and leaving dough overhang. Spoon filling into pie crust.",
        "Roll out second dough disk between 2 sheets of generously floured parchment paper to 12-inch round. Peel off top parchment sheet. Carefully and evenly invert dough atop filling. Peel off second parchment sheet. Trim overhang of both crusts to 1 inch. Fold overhang under and press to seal. Crimp edges decoratively. Cut five 2-inch-long slits in top crust of pie to allow steam to escape during baking. Lightly brush top crust (not edges) with milk. Sprinkle with raw sugar.",
        "Bake pie 15 minutes. Reduce oven temperature to 350°F and continue baking until crust is golden brown and filling is bubbling thickly through slits, about 1 hour 15 minutes. Cool pie completely on rack. Cut into wedges and serve with Lemon Cream.",
        "*Also called turbinado or demerara sugar; available at most supermarkets and at natural foods stores."
    ],
    "ingredients": [
        "2 1/2 cups all purpose flour",
        "1/4 cup cornmeal (preferably stone-ground, medium grind)",
        "3 tablespoons sugar",
        "3/4 teaspoon salt",
        "1/2 cup plus 6 tablespoons (1 3/4 sticks total) chilled unsalted butter, cut into 1/2-inch cubes",
        "1/4 cup nonhydrogenated solid vegetable shortening, frozen, cut into 1/2-inch pieces",
        "4 tablespoons (or more) ice water",
        "5 cups fresh blueberries (about 27 ounces)",
        "3/4 cup sugar",
        "1/4 cup cornstarch",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon water",
        "Milk (for brushing)",
        "1 1/2 tablespoons raw sugar*",
        "Lemon Cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Picnic",
        "High Fiber",
        "Blueberry",
        "Lemon",
        "Cornmeal",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blueberry Pie with Cornmeal Crust and Lemon Cream",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-pie-with-cornmeal-crust-and-lemon-cream-242725"
}
