{
    "directions": [
        "In the bowl of a food processor, pulse 2 1/2 cups flour, 1 teaspoon salt, and 1 1/2 tablespoons sugar. Add half the butter and pulse until coarse, pea-sized crumbs appear. With the machine running, add 1/4 cup ice water and process until the dough just holds together. Squeeze a small amount of dough between your fingers and if it is very crumbly, add more ice water, 1 tablespoon at a time (2 tablespoons maximum). Do not over process.",
        "Turn dough out onto a lightly floured surface and push together into a rough ball. Knead a few times to combine. Flatten into a disc, cover with plastic wrap, and refrigerate at least 1 hour or overnight. Repeat the same procedure with remaining 2 1/2 cups flour, 1 teaspoon salt, 1 1/2 tablespoons sugar, and butter. Flatten into a second disc and refrigerate at least 1 hour or overnight.",
        "Preheat oven to 425°F. Position one oven rack on the bottom rung and one in the center of the oven. Completely line bottom rack with foil to catch filling drips and place one 13x18-inch rimmed baking sheet on top of foil to preheat.",
        "Grease another 13x18-inch rimmed baking sheet with butter. On a floured surface, roll out 1 disc of dough into a 14x19-inch rectangle, about 1/8-inch thick. Roll dough onto rolling pin and unfurl onto greased baking sheet. Press dough into baking sheet and over rimmed edge; trim dough at rimmed edge. Refrigerate 30 minutes. Roll out second disc of dough to the same size, transfer to a large cutting board or 2 pieces of parchment taped together, and refrigerate 30 minutes.",
        "In a small bowl, whisk together the egg and milk to create an egg wash, set aside. Bring a large pot of water to a boil and fill a large bowl with ice water. Using a paring knife, lightly score the bottom of each peach with an \"x\". Drop peaches into water for 1 to 2 minutes to loosen skins and transfer to the ice water bath. Once cool enough to handle, remove the skins. Slice into 1/2-inch thick wedges. Place sliced peaches in a large bowl with blueberries, remaining 1/2 teaspoon salt, 1 1/4 cups sugar, cornstarch, vanilla, and lemon. Toss well to combine. Fill the dough lined baking sheet with the fruit mixture.",
        "Brush the outside edge of filled dough with egg wash. Top with the second dough rectangle. Press top and bottom crusts together and trim top crust to rimmed edge of baking sheet. Tuck and fold edges into base of baking sheet and crimp or decorate as desired. Brush top crust with egg wash and sprinkle with sanding sugar. Using a paring knife, cut vents in the top crust to release steam.",
        "Slide the filled baking sheet into the preheated baking sheet and bake on bottom rack until the crust begins to turn golden, about 25 minutes. Rotate stacked sheets, move to center rack, and reduce oven to 350°F. Keep foil on bottom rack. Continue baking, rotating sheet again half way through, until the crust is golden brown and you can see the thickened juices bubbling, 60 to 70 minutes more. Cover crust with foil if it begins to darken too much before juices are bubbling. Cool on a rack at least 2 hours to allow juices to set before slicing."
    ],
    "ingredients": [
        "5 cups all-purpose flour, divided, plus more for rolling out dough",
        "2 1/2 teaspoons salt, divided",
        "1 1 1/4 cup plus 3 tablespoons granulated sugar, divided",
        "4 sticks (1 pound) unsalted butter, cut into pieces, divided into 2 bowls, and frozen 15 minutes, plus more for baking sheet",
        "1 large egg",
        "1 tablespoon whole milk",
        "3 pounds yellow peaches (6 to 8 medium peaches)",
        "4 pints blueberries (about 8 cups)",
        "1/2 cup cornstarch",
        "2 tablespoons vanilla extract",
        "3 tablespoons lemon juice",
        "1 tablespoon sanding sugar or sugar in the raw",
        "2 13x18-inch rimmed baking sheets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Blueberry",
        "Peach",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blueberry Peach Slab Pie",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-peach-slab-pie-51249610"
}
