{
    "directions": [
        "Preheat oven to 375°F. Line large rimmed baking sheet with parchment. Combine first 5 ingredients in heavy medium saucepan. Bring to boil over medium heat, stirring until butter is melted. Stir in flour; reduce heat to medium-low. Stir vigorously until mixture forms large dough clumps and film forms on bottom of saucepan, about 1 minute. Remove from heat; cool 5 minutes.",
        "Meanwhile, whisk eggs in medium bowl. Transfer 1 tablespoon beaten egg to small bowl and reserve. Add 1/3 of remaining beaten eggs to dough in saucepan; whisk until well incorporated. Add remaining eggs in 2 additions, stirring until eggs are completely absorbed after each addition (dough will be sticky). Mix in blue cheese.",
        "Drop dough by teaspoonfuls onto baking sheet, forming about 24 walnut-size mounds and spacing about 1 inch apart. Using pastry brush, brush each mound with reserved egg, flattening any pointed tops.",
        "Bake gougères until puffed, golden brown, and dry, about 30 minutes. Do AHEAD: Can be made up to 1 week ahead. Cool completely. Place in airtight containers and store in freezer. Rewarm on baking sheet in 350°F oven until heated through, about 5 minutes. Serve warm.",
        "To make it easier to drop the sticky gougère dough onto the baking sheet, lightly spray the spoon with nonstick vegetable oil spray. To be sure that the gougères are fully baked, pierce the top of one with a small sharp knife. The inside should be hollow and dry. Don't underbake the gougères, as they may collapse.",
        "A fancy party isn't complete without sparkling wine. With the appetizers, try the Cristalino Brut Rosé Cava ($9) from Spain. The pink bubbly is crisp and dry with lovely berry flavors. Plus, it's an incredible deal."
    ],
    "ingredients": [
        "1/4 cup dry white wine",
        "1/4 cup water",
        "1/4 cup (1/2 stick) unsalted butter, cubed",
        "3/4 teaspoon freshly ground pepper",
        "1/4 teaspoon salt",
        "2/3 cup all purpose flour",
        "3 large eggs, room temperature",
        "1/3 cup finely crumbled Danish blue cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Low Cal",
        "Oscars",
        "Dinner",
        "Blue Cheese",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blue Cheese Gougères",
    "url": "http://www.epicurious.com/recipes/food/views/blue-cheese-gougeres-351019"
}
