{
    "directions": [
        "Preheat the oven to 350 degrees F and spray the doughnut pans liberally with cooking spray.",
        "In the bowl of a stand mixer fitted with the paddle attachment, cream the butter, sugar, salt, and vanilla until light and fluffy.",
        "In a separate bowl, whisk together the flours, baking soda, and baking powder.",
        "Add the eggs and yolk to the mixer and cream until blended.",
        "In 4 to 6 stages, alternately add the flour mixture and the buttermilk, mixing on medium-low the whole time and constantly scraping down the sides. Once the additions are done, turn the mixer to its lowest setting and gently add the blueberries, mixing just until evenly incorporated and the batter is a nice shade of blue.",
        "Fill a large piping bag with the batter and fill each well in the pans about two-thirds full.",
        "Bake for 18 to 20 minutes or until the dough springs back when poked for regular doughnuts, or 8 to 10 minutes for mini doughnuts.",
        "When cool, dip the doughnuts into the glaze and shake off the excess. Place them on a wire rack so the glaze soaks in and gets a little crunchy on the outside.",
        "In a big bowl, combine all the ingredients and whisk together. Adjust the consistency by adding either milk (to thin) or powdered sugar (to thicken)."
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "1/3 stick butter, softened",
        "1 cup sugar",
        "Pinch of kosher salt",
        "1 teaspoon pure vanilla extract",
        "1 cup cake flour",
        "2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "2 teaspoons baking powder",
        "2 extra-large eggs, plus 1 egg yolk",
        "1 pint (2 cups) frozen blueberries, thawed",
        "1 cup buttermilk",
        "Basic Sugar Glaze, recipe follows",
        "3 cups powdered sugar",
        "1/2 cup milk",
        "Pinch of kosher salt",
        "1 tablespoon pure vanilla extract"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Doughnut Recipes",
        "Blueberry",
        "Fruit",
        "Dessert"
    ],
    "title": "Blueberry Cake Doughnuts",
    "url": "http://www.foodnetwork.com/recipes/duff-goldman/blueberry-cake-doughnuts"
}
