{
    "directions": [
        "Preheat oven to 375°F.",
        "Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté onions, stirring occasionally, until they begin to brown, about 4 minutes. Reduce heat to moderate and cook onions, stirring occasionally, until golden brown, about 12 minutes.",
        "Peel potatoes and slice paper-thin crosswise (slightly less than 1/16 inch thick) with slicer. Combine potatoes and cream in a 2-quart heavy saucepan (potatoes on top may not be completely immersed) and bring to a boil. Remove from heat and cool to warm, about 30 minutes.",
        "Transfer one third of potatoes with a slotted spoon to a lightly oiled 3-quart shallow baking dish (reserve any cream in pan), spreading them in an even layer, then sprinkle evenly with half of onions and one third of each cheese and season with 1/4 teaspoon salt and 1/4 teaspoon pepper. Make 1 more layer each of potatoes, onions, cheeses, and seasoning in same manner, then top with remaining potatoes and remaining cheeses. (Do not season top layer.) Pour reserved cream evenly over top and cover tightly with foil.",
        "Bake in middle of oven 45 minutes. Increase oven temperature to 400°F, then remove foil and bake until top is golden brown, 12 to 15 minutes more. Let stand 15 minutes before serving."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 pound onions (3 medium), halved lengthwise, then thinly sliced crosswise",
        "2 pounds russet (baking) potatoes (about 4)",
        "2 cups heavy cream",
        "1/4 pound Maytag Blue cheese, crumbled (1 cup)",
        "1/4 pound whole-milk mozzarella, coarsely grated (1 cup)",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper",
        "Special equipment: a Japanese Benriner or other adjustable-blade slicer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Potato",
        "Side",
        "Bake",
        "Casserole/Gratin",
        "Blue Cheese",
        "Mozzarella",
        "Fall",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blue Cheese Potato Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/blue-cheese-potato-gratin-107219"
}
