{
    "directions": [
        "Preheat oven to 425°F. Mix flour, baking powder, and salt in medium bowl to blend. Make well in center of dry ingredients. Whisk milk, olive oil, and melted butter in liquid measuring cup to blend. Slowly pour milk mixture into well in dry ingredients, stirring until just blended and smooth. Roll out dough on lightly floured surface to 10x13-inch rectangle. Transfer dough to rimmed baking sheet. Re-form dough into 10x13-inch rectangle (dough will shrink when moved). Pierce dough all over with fork. Let dough rest while preparing topping.",
        "Melt butter with oil in large skillet over high heat. Add onions. Cook until onions are soft and beginning to brown, stirring frequently, about 10 minutes. Add rosemary, sugar, and salt. Season onions to taste with pepper. Reduce heat to medium. Continue to cook until onions are soft and dark brown, stirring frequently, about 20 minutes; cool.",
        "Spread onion mixture evenly over dough. Sprinkle with cheese. Bake until crust is golden and cheese is bubbling, about 20 minutes. Let cool. Cut into squares and serve."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "2 teaspoons baking powder",
        "3/4 teaspoon salt",
        "3/4 cup whole milk",
        "1/4 cup olive oil",
        "2 tablespoons (1/4 stick) unsalted butter, melted",
        "2 tablespoons (1/4 stick) unsalted butter",
        "2 tablespoons olive oil",
        "3 large onions (about 2 pounds), halved, thinly sliced",
        "1 tablespoon finely chopped fresh rosemary",
        "1 teaspoon sugar",
        "1/2 teaspoon salt",
        "1 1/2 cups (about 6 ounces) crumbled blue cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Bake",
        "Cocktail Party",
        "Blue Cheese",
        "Rosemary",
        "Fall"
    ],
    "title": "Blue Cheese and Caramelized-Onion Squares",
    "url": "http://www.epicurious.com/recipes/food/views/blue-cheese-and-caramelized-onion-squares-236483"
}
