{
    "directions": [
        "Preheat oven to 350°F. and generously butter six 1/2-cup soufflé dishes or custard cups.",
        "In a small bowl stir together walnuts and 1/2 tablespoon flour. Coat soufflé dishes or custard cups with walnut mixture, knocking out excess.",
        "In a small heavy saucepan melt butter over moderately low heat and whisk in remaining 3 1/2 tablespoons flour. Cook roux, whisking constantly, 3 minutes and add milk in a stream, whisking. Bring mixture to a boil over moderate heat, whisking, and cook until thickened, about 30 seconds.",
        "Remove pan from heat and transfer mixture to a bowl. Cool mixture slightly. Whisk cheese, yolks, black pepper, and salt to taste into milk mixture until cheese is melted.",
        "In a bowl with an electric mixer beat whites until they just hold stiff peaks. Stir one third of whites into cheese mixture to lighten and fold in remaining whites gently but thoroughly.",
        "Divide soufflé mixture among prepared soufflé dishes or cups and put in a large baking pan just large enough to hold them. Add enough hot water to pan to reach halfway up sides of soufflés dishes or cups and bake soufflés in middle of oven until puffed and golden brown, about 25 minutes. Remove pan from oven and let soufflé dishes or cups stand in pan 15 minutes. (Soufflés will fall.)",
        "Lightly butter a baking sheet.",
        "Remove soufflé dishes or cups from pan and run a knife around edge of each dish or cup, carefully lifting edge of each soufflé slightly to help release it from bottom. Invert soufflé onto hand and carefully put, top side up, onto prepared baking sheet. Soufflés may be prepared up to this point 2 days ahead and chilled, covered.",
        "Increase temperature to 425°F.",
        "Bake soufflés in middle of oven until puffed slightly and heated through, about 5 minutes.",
        "Make vinaigrette while soufflés are baking.",
        "In a bowl toss mesclun with vinaigrette and divide among 6 salad plates. Arrange soufflés among 6 salad plates. Arrange soufflés along side of mesclun and garnish with bell peppers and flowers."
    ],
    "ingredients": [
        "1/4 cup finely chopped walnuts, toasted",
        "4 tablespoons all-purpose flour",
        "3 tablespoons unsalted butter",
        "2/3 cup milk",
        "5 ounces cold Saga blue cheese, rind discarded, chopped and softened (about 1 cup)",
        "3 large egg yolks",
        "freshly ground black pepper to taste",
        "5 large egg whites",
        "Red Pepper Vinaigrette",
        "6 cups mesclun (mixed baby greens, about 1/2 pound), rinsed and spun dry",
        "Garnish: finely chopped red and yellow bell peppers and edible flower petals"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Mixer",
        "Egg",
        "Leafy Green",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Blue Cheese",
        "Walnut",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Blue Cheese and Walnut Souffles and Mesclun with Red Pepper Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/blue-cheese-and-walnut-souffles-and-mesclun-with-red-pepper-vinaigrette-10186"
}
