{
    "directions": [
        "In a bowl stir together the flour, the sugar, and the salt, add the butter, and blend the mixture until it resembles coarse meal. Add the yolk mixture, toss the mixture until the liquid is incorporated, and form the dough into a ball. Dust the dough with flour and chill it, wrapped in plastic wrap, for 1 hour. Roll out the dough 1/8 inch thick on a floured surface, fit it into a 10-inch tart pan with a removable fluted rim, and chill the shell for at least 30 minutes or, covered, overnight. Line the shell with foil, fill the foil with the rice, and bake the shell in the middle of a preheated 350°F. oven for 25 minutes. Remove the foil and rice carefully, bake the shell for 5 to 10 minutes more, or until it is pale golden, and let it cool in the pan on a rack.",
        "In a blender or food processor blend together the buttermilk, the yolks, the granulated sugar, the zest, the lemon juice, the butter, the vanilla, the salt, and the flour until the mixture is smooth, spread the blueberries evenly over the bottom of the shell, and pour the buttermilk mixture over them. Bake the tart in the middle of a preheated 350°F. oven for 30 to 35 minutes, or until the filling is just set.",
        "Let the tart cool completely in the pan on the rack, sprinkle it with the confectioners' sugar, sifted, and serve it at room temperature or chilled with the ice cream."
    ],
    "ingredients": [
        "1 1/3 cups all-purpose flour",
        "1/4 cup sugar",
        "1/4 teaspoon salt",
        "1 stick (1/2 cup) cold unsalted butter, cut into bits",
        "1 large egg yolk, beaten with 2 tablespoons ice water",
        "raw rice for weighting the shell",
        "1 cup buttermilk",
        "3 large egg yolks",
        "1/2 cup granulated sugar",
        "1 tablespoon freshly grated lemon zest",
        "1 tablespoon fresh lemon juice",
        "1/2 stick (1/4 cup) unsalted butter, melted and cooled",
        "1 teaspoon vanilla",
        "1/2 teaspoon salt",
        "2 tablespoons all-purpose flour",
        "2 cups picked over blueberries",
        "confectioners' sugar for sprinkling the tart",
        "blueberry ice cream as an accompaniment if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Food Processor",
        "Dairy",
        "Dessert",
        "Bake",
        "Blueberry",
        "Gourmet"
    ],
    "title": "Blueberry Buttermilk Tart",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-buttermilk-tart-10539"
}
