{
    "directions": [
        "Blend blue cheese and butter in processor until creamy. Add flour, cornstarch, salt, and pepper. Using on/off turns, process until mixture resembles coarse meal. Add walnuts and process just until moist clumps form. Gather dough into ball. Flatten into disk. Wrap dough in plastic and refrigerate until firm, about 1 hour.",
        "Preheat oven to 325°F. Line 2 baking sheets with parchment paper. Roll out dough between sheets of plastic wrap to 1/8- to 1/4-inch thickness. Remove top sheet. Using 2 1/2x1-inch leaf-shaped cookie cutter, cut out leaves. Transfer leaves to prepared baking sheets. Gather dough scraps and reroll; cut out additional leaves. Transfer to prepared baking sheets. Bake until golden brown, about 20 minutes. Transfer leaves to rack and cool. (Can be prepared 3 days ahead. Store in airtight container at room temperature.)",
        "Using rolling pin, flatten cream cheese between sheets of plastic wrap; roll into 10x8-inch rectangle. Remove top sheet of plastic wrap. Spread 1/3 cup chutney atop cream cheese rectangle, leaving 1-inch plain border. Sprinkle chutney with 2 tablespoons green onions. Using plastic as aid and starting at 1 long side, roll up cream cheese, jelly-roll style, into log. Gently press remaining green onions onto roulade. Wrap roulade tightly with plastic. Refrigerate until set, at least 2 hours and up to 2 days.",
        "Place roulade on platter. Surround with shortbread leaves. Top roulade with remaining 1/3 cup chutney and serve."
    ],
    "ingredients": [
        "3 1/2 ounces crumbled blue cheese (about 1/2 cup)",
        "3 tablespoons unsalted butter, room temperature",
        "1/2 cup all purpose flour",
        "1/4 cup cornstarch",
        "1/4 teaspoon coarse salt",
        "1/8 teaspoon ground black pepper",
        "1/3 cup walnuts, finely chopped",
        "1 8-ounce package chilled cream cheese",
        "2/3 cup purchased spiced cranberry-apple chutney",
        "1/2 cup very thinly sliced green onions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Appetizer",
        "Bake",
        "Thanksgiving",
        "Blue Cheese",
        "Cream Cheese",
        "Cranberry",
        "Walnut",
        "Fall",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Blue Cheese Shortbread Leaves with Cream Cheese-Chutney Roulade",
    "url": "http://www.epicurious.com/recipes/food/views/blue-cheese-shortbread-leaves-with-cream-cheese-chutney-roulade-107244"
}
