{
    "directions": [
        "To make the pastry, pulse the flour, sugar, and salt together in a food processor. Add the butter and pulse until the dough resembles cornmeal. Add the egg yolk and 2 tablespoons ice water and pulse again until the dough pulls together. Wrap the dough in plastic wrap and let it rest in the refrigerator for 30 minutes.",
        "Roll the dough out on a lightly floured surface into a 12-inch circle. Roll the dough up onto the pin and lay it inside a 10-inch tart pan with a removable bottom. Press the dough into the edges of the pan and fold the excess dough inside to reinforce the rim. Cover the tart pan with plastic wrap and put it into the refrigerator for another 30 minutes to rest.",
        "To bake the shell, heat the oven to 350 degrees F.",
        "Put the tart pan on a baking sheet and prick the bottom of the dough with a fork. Cover the shell with a piece of parchment paper and fill it with pie weights or dry beans. Bake for 25 minutes. Remove the parchment and weights. Lightly beat the egg white with 1 teaspoon water and brush it onto the bottom and sides of the tart shell; set aside to cool.",
        "Whisk together the eggs, sugar, lemon juice, cream, zest, and salt. Add the blueberries to the cooled tart shell and pour the filling over the blueberries. Bake for 20 to 25 minutes. The curd should jiggle slightly when done. Cool to room temperature, remove from the tart ring, and serve."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "2 tablespoons sugar",
        "Pinch kosher salt",
        "1/2 cup (1 stick) unsalted butter, cold, in chunks",
        "1 large egg, separated",
        "2 tablespoons ice water, plus 1 teaspoon",
        "4 large eggs",
        "1 1/2 cups sugar",
        "1 cup fresh lemon juice (about 5 lemons)",
        "1/4 cup heavy cream",
        "1 lemon, zested",
        "Pinch kosher salt",
        "1 pint blueberries"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Blueberry Pie",
        "Blueberry",
        "Fruit",
        "Pie Recipes",
        "Easter Desserts",
        "Dessert",
        "Easter",
        "Holiday",
        "Baking",
        "American",
        "Lemon Recipes",
        "4th of July",
        "Recipes for Parties",
        "Spring",
        "Summer"
    ],
    "title": "Blueberry-Lemon Tart",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/blueberry-lemon-tart-recipe"
}
