{
    "directions": [
        "Pulse 1 1/4 cups flour, butter, and salt in a food processor until mixture resembles coarse meal with some pea-size pieces remaining. Drizzle 3 tablespoons ice water over mixture. Pulse until moist clumps form, adding more water by teaspoonfuls if mixture is dry. Transfer dough to a lightly floured work surface. Divide into 4 equal pieces. Working with 1 piece at a time, use the heel of your hand to smear each portion of dough twice in a forward motion to distribute butter. Gather all 4 dough pieces into a ball. Flatten into a disk, wrap in plastic, and chill dough until firm, at least 1 hour. DO AHEAD: Dough can be made up to 2 days ahead. Keep chilled.",
        "Roll out dough on a lightly floured surface to a 13\" round. Transfer to pie dish, gently pressing dough onto bottom and up sides of dish. Fold overhang under and crimp edges decoratively. Pierce bottom of crust in several places with a fork, then chill until firm, about 30 minutes.",
        "Line a large baking sheet with foil and place on a rack in middle of oven; preheat to 375°F. Line crust with parchment paper or foil and fill with pie weights. Bake until crust is set, about 20 minutes. Carefully remove parchment and pie weights. Bake until crust is pale golden, about 12 minutes longer. Transfer crust to a wire rack; let cool.",
        "Whisk 2/3 cup sugar, cornstarch, and lemon zest in a large bowl. Add blueberries and lemon juice; toss gently to coat and evenly distribute. Let filling stand, tossing occasionally, until berries release their juices, 20-30 minutes.",
        "Whisk flour, remaining 3 tablespoons sugar, light brown sugar, cinnamon, and salt in a medium bowl. Add melted butter; mix topping with fingertips to blend.",
        "Preheat oven to 375°. Spoon blueberry filling into crust, then sprinkle topping over. Bake pie until filling is bubbling and topping is golden, about 1 hour 15 minutes. Cover with foil after 30 minutes if browning too fast.",
        "Let pie cool on a wire rack. DO AHEAD: Can be made 8 hours ahead. Let stand at room temperature."
    ],
    "ingredients": [
        "1 1/4 cups unbleached all-purpose flour plus more for surface",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1/2 teaspoon kosher salt",
        "2/3 cup plus 3 tablespoons sugar",
        "2 1/2 tablespoons cornstarch",
        "1 teaspoon finely grated lemon zest plus 2 tablespoons fresh lemon juice",
        "5 cups (1 pound 10 ounces) fresh blueberries",
        "3/4 cup unbleached all-purpose flour",
        "3 tablespoons (packed) light brown sugar",
        "1/2 teaspoons cinnamon",
        "1/4 teaspoon salt",
        "5 tablespoons unsalted butter, melted, cooled slightly",
        "Special equipment: Use a 9\"-9 1/2\"-diameter glass or metal pie dish. You will need pie weights or dried beans to bake the crust."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Berry",
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Thanksgiving",
        "Mother's Day",
        "Graduation",
        "Father's Day",
        "Backyard BBQ",
        "Blueberry",
        "Spice",
        "Summer",
        "Anniversary",
        "Family Reunion",
        "Cinnamon",
        "Potluck",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blueberry Crumble Pie",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-crumble-pie-366429"
}
