{
    "directions": [
        "In a small bowl whisk together the milk, the eggs, and the vanilla. Into a bowl sift together the flour, the baking powder, and the salt. In a large bowl with an electric mixer cream the butter with the granulated sugar, the brown sugar, and the zest until the mixture is light and fluffy, add the flour mixture alternately with the egg mixture, beginning and ending with the flour mixture and beating the batter after each addition until it is just combined, and fold in 1 1/2 cups of the blueberries. Spoon one third of the batter into a greased and floured 10-inch (3-quart) bundt pan, spreading it evenly, and sprinkle 1/2 cup of the remaining blueberries over it. Spoon half the remaining batter into the pan, spreading it evenly, and sprinkle 1/2 cup of the remaining blueberries over it. Spoon the remaining batter into the pan, spreading it evenly, sprinkle the remaining blueberries over it, and bake the cake in the middle of a preheated 350°F. oven for 1 hour to 1 hour and 10 minutes, or until it is golden and a tester comes out clean.",
        "Remove the cake from the oven, poke the top immediately all over with a wooden skewer, and brush it with half the syrup. Let the cake cool in the pan on a rack for 10 minutes, invert it onto the rack, and poke it all over with the skewer. Brush the cake with the remaining syrup.",
        "In a small saucepan combine the lemon juice and the sugar, bring the mixture to a boil, stirring until the sugar is dissolved, and remove the pan from the heat."
    ],
    "ingredients": [
        "1/3 cup milk",
        "6 large eggs",
        "1 1/2 tablespoons vanilla extract",
        "2 2/3 cups all-purpose flour",
        "1 teaspoon double-acting baking powder",
        "1 1/4 teaspoons salt",
        "3 sticks (1 1/2 cups) unsalted butter, softened",
        "1/2 cup granulated sugar",
        "3/4 cup firmly packed light brown sugar",
        "1/4 cup freshly grated lemon zest",
        "3 cups picked over blueberries, tossed with 1 1/2 tablespoons flour",
        "1/3 cup fresh lemon juice",
        "1/2 cup granulated sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Blueberry",
        "Lemon",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blueberry Lemon Pound Cake",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-lemon-pound-cake-10533"
}
