{
    "directions": [
        "Preheat oven to 350°F with a baking sheet on middle rack.",
        "Stir together graham cracker crumbs, granulated sugar, and butter in a bowl with a fork until combined well, then press mixture with your fingers and back of a spoon evenly and firmly onto bottom and up side of each tart pan. (If using ramekins, press mixture 3/4 inch up sides.)",
        "Put tart pans on preheated baking sheet and bake crusts until slightly darker, about 10 minutes, then cool 10 minutes on a rack. (Ramekins will need to cool an additional 5 minutes in refrigerator.) Gently push bottom of each tart pan to loosen crust, then invert crust onto your hand and place on a serving plate. (If using ramekins, leave crusts in ramekins.)",
        "While crusts cool, whisk together brown sugar, sour cream, and vanilla in a small bowl until sugar is dissolved. Beat cream cheese in a medium bowl with an electric mixer until smooth, then add sour cream mixture and zest, beating until just combined well.",
        "Divide cream cheese filling among tart shells, spreading evenly, then top with blueberries and dust with confectioners sugar."
    ],
    "ingredients": [
        "1 cup graham cracker crumbs",
        "1 1/2 tablespoons granulated sugar",
        "1/2 stick (4 tablespoons) unsalted butter, melted",
        "2 tablespoons packed light brown sugar",
        "1/4 cup sour cream",
        "1/4 teaspoon vanilla",
        "4 oz cream cheese, softened",
        "1/2 teaspoon finely grated fresh lemon zest",
        "1 1/3 cups blueberries (6 ounces)",
        "Confectioners sugar for dusting",
        "Special equipment: 4 (3 3/4-inch) nonstick fluted tart pans or 4 (8-ounces) ramekins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Citrus",
        "Dessert",
        "Bake",
        "Cocktail Party",
        "Picnic",
        "Cream Cheese",
        "Blueberry",
        "Lemon",
        "Vanilla",
        "Summer",
        "Sour Cream",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blueberry Lemon Cream Tarts",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-lemon-cream-tarts-108364"
}
