{
    "directions": [
        "Line a 9x5\" loaf pan with plastic wrap, leaving overhang on all sides. Using an electric mixer on medium-high speed, beat mascarpone, powdered sugar, and lemon zest in a large bowl until fluffy, about 4 minutes. Reduce speed to low; gradually add cream. Increase speed to medium as mixture thickens; beat until medium peaks form. Transfer two-thirds of mascarpone mixture to another large bowl and fold in 1/2 cup lemon curd. Cover remaining mascarpone mixture; chill until ready to unmold and cover cake.",
        "Place a single layer of graham crackers over bottom of prepared pan, breaking as needed to fit. Using a small offset spatula, evenly spread a quarter of lemon cream over graham crackers. Dollop 1/2 cup jam over top, then gently spread evenly over lemon cream. Drizzle 1/4 cup lemon curd over. Spoon a third of remaining lemon cream over curd and top with another layer of graham crackers. Repeat layering process with half of remaining lemon cream, 1/2 cup jam, and remaining lemon curd. Finish with a final layer of lemon cream, then graham crackers. Cover with plastic wrap; freeze at least 6 hours. Cover and chill remaining jam until ready to serve cake.",
        "Uncover cake and invert pan onto a platter. Using the plastic overhang to help you, unmold cake; peel off plastic. Spread top and sides of cake with reserved mascarpone mixture (if mixture looks a little loose, whisk until soft peaks form before using). Chill in freezer at least 15 minutes.",
        "Just before serving, mix blueberries into reserved jam and spoon over cake.",
        "Cake can be made 2 days ahead. Cover and keep frozen."
    ],
    "ingredients": [
        "8 ounces mascarpone or plain whole-milk Greek yogurt, room temperature",
        "3/4 cup powdered sugar",
        "2 tablespoons finely grated lemon zest",
        "2 1/2 cups chilled heavy cream",
        "1 cup homemade or store-bought lemon curd, divided",
        "16 graham crackers, divided",
        "1 1/2 cups Blueberry–Chia Seed Jam, divided",
        "1/3 cup fresh blueberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chill",
        "Cake",
        "Blueberry",
        "Milk/Cream",
        "No-Cook",
        "Yogurt",
        "Cream Cheese"
    ],
    "title": "Blueberry-Lemon Icebox Cake",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-lemon-icebox-cake"
}
