{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C).",
        "Combine the graham cracker crumbs, flax seed meal, and ground almonds in a bowl; stir in the melted butter. Add a few drops of water, if necessary, for the crumb mixture to stick together. Press half of the crumb mixture into the bottom and sides of a 9-inch pie pan; the crust should only be about 1/8-inch thick. Set the other half of the crumb mixture aside.",
        "Combine the sour cream, yogurt, ground oats, sugar, honey, vanilla, and salt in a blender. Blend until combined. Transfer the blueberries to the pie pan and pour in the filling.",
        "To make the topping, stir 2 tablespoons of honey, or to taste, into the reserved crumb mixture. It should form a very thick paste. Drop teaspoonfuls of the topping on the surface of the pie.",
        "Bake the pie in the preheated oven on the middle rack for 30 to 45 minutes, or until the center is set and a knife inserted near the center of the pie comes out clean. Turn off the oven and let the pie rest in the warm oven for 10 minutes.",
        "Remove the pie from the oven and let cool on a wire rack. Chill in the refrigerator until the pie is cool and set."
    ],
    "ingredients": [
        "FOR THE CRUST",
        "1 cup graham cracker crumbs",
        "3/4 cup flax seed meal",
        "3/4 cup finely ground almonds (almond meal)",
        "1/4 cup melted butter",
        "FOR THE FILLING",
        "1/2 cup sour cream",
        "1/2 cup plain non-fat yogurt",
        "1/4 cup rolled oats, ground into flour",
        "1/4 cup white sugar",
        "1/4 cup honey",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "1 egg",
        "4 cups fresh blueberries",
        "2 tablespoons honey"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Blueberry Pie with Flax and Almonds",
    "url": "http://allrecipes.com/recipe/174294/blueberry-pie-with-flax-and-almonds/"
}
