{
    "directions": [
        "Melt 1 tablespoon butter in heavy medium skillet over medium-high heat. Add garlic, shallot, and thyme. Sauté until shallot is tender, about 5 minutes. Add broth and wine. Boil until sauce is reduced to 1/2 cup, about 12 minutes. Set sauce aside.",
        "Blend cheese, panko, and parsley in small bowl to coat cheese evenly with panko. (Sauce and cheese mixture can be made 1 day ahead. Cover separately and chill.)",
        "Preheat broiler. Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Sprinkle steaks with salt and pepper. Add steaks to skillet and cook to desired doneness, about 5 minutes per side for medium-rare. Transfer steaks to rimmed baking sheet; reserve skillet. Press cheese mixture onto top of steaks, dividing equally. Broil until cheese browns, about 2 minutes. Transfer steaks to plates.",
        "Pour sauce into reserved skillet. Bring to boil, scraping up browned bits. Boil 2 minutes. Whisk in remaining 1 tablespoon butter. Season with salt and pepper. Spoon sauce around steaks and serve.",
        "*Available at Asian markets and in the Asian section of some supermarkets."
    ],
    "ingredients": [
        "4 tablespoons (1/2 stick) chilled butter",
        "3 garlic cloves, chopped",
        "1 large shallot, chopped",
        "1 tablespoon chopped fresh thyme",
        "3/4 cup low-salt beef broth",
        "1/2 cup dry red wine",
        "1/2 cup coarsely crumbled Maytag blue cheese (about 2 ounces)",
        "1/4 cup panko (Japanese breadcrumbs)*",
        "1 tablespoon chopped fresh parsley",
        "4 1-inch-thick filet mignon steaks (each 6 to 8 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Cheese",
        "Broil",
        "Sauté",
        "Blue Cheese",
        "Steak",
        "Red Wine",
        "Fall"
    ],
    "title": "Blue-Cheese-Crusted Steaks with Red Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/blue-cheese-crusted-steaks-with-red-wine-sauce-108816"
}
