{
    "directions": [
        "Preheat oven to 350°F with rack in middle. Line bottom and sides of a 9-inch square baking pan with heavy-duty foil, leaving an overhang on 2 sides. Butter bottom and sides of pan, then dust with flour, knocking out excess.",
        "Stir together flour, sugars, cinnamon, and a pinch of salt in a large bowl. Blend in butter with your fingertips or a pastry blender until mixture forms large clumps.",
        "Whisk together flour, baking powder, baking soda, and salt in a bowl.",
        "Stir together sour cream and vanilla in a small bowl.",
        "Beat together butter and sugar in a large bowl with an electric mixer at medium-high speed until pale and fluffy, about 5 minutes. Add egg and beat until well blended.",
        "At low speed, mix in flour mixture in 3 batches, alternating with sour-cream mixture and mixing until just combined.",
        "Gently fold in blueberries.",
        "Spoon batter into pan, smoothing top (preferably with an offset spatula). Crumble half of topping evenly over batter.",
        "Bake 25 minutes, then remove from oven and crumble remaining topping evenly over cake. Bake until a wooden pick inserted into center comes out clean, about 25 minutes more. Cool in pan 10 minutes. Lift out cake using foil and cool completely on rack."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "1 tablespoon plus 1 teaspoon packed dark brown sugar",
        "1 tablespoon plus 1 teaspoon granulated sugar",
        "3/4 teaspoon cinnamon",
        "1/2 stick cold unsalted butter, cut into 1/2-inch pieces",
        "1 cup all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 cup sour cream",
        "3/4 teaspoon pure vanilla extract",
        "1/2 stick unsalted butter, softened",
        "3/4 cup granulated sugar",
        "1 large egg",
        "1/2 pound blueberries (3 1/4 cups)",
        "Accompaniment: sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Brunch",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Mother's Day",
        "Lunch",
        "Blueberry",
        "Summer",
        "Sour Cream",
        "Butter",
        "Gourmet"
    ],
    "title": "Blueberry Streusel Cake",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-streusel-cake-354217"
}
