{
    "directions": [
        "Heat 1/2 cup sugar, water, and cornstarch over medium heat. Add blueberries and bring to a boil, stirring constantly. Boil until thickened, about 1 minute. Remove from heat.",
        "Beat 2 eggs, yolks, 1/2 cup sugar, 2 tablespoons milk, and salt in a saucepan until well mixed. Stir lemon juice and zest into egg mixture. Add 1/3 cup butter.",
        "Cook and stir egg mixture over medium heat until lemon curd is thick enough to coat the back of a spoon, about 5 minutes. Pour mixture into a bowl and cool. Lemon curd can be covered and refrigerated for up to two weeks.",
        "Preheat oven to 325 degrees F (165 degrees C). Grease two 11x17-inch baking sheets.",
        "Combine flour and baking powder in a small bowl. Mix 1 cup milk, lemon extract, coconut extract, vanilla extract, butter extract, and almond extract in a separate bowl.",
        "Beat 3 cups sugar, 1 cup softened butter, and shortening in a large bowl until light and fluffy. Beat 5 eggs into butter mixture until smooth. Pour in the flour mixture alternately with milk, mixing until batter is just incorporated. Divide batter into prepared baking sheets, spreading evenly.",
        "Bake in preheated oven until cake springs back when lightly pressed, 25 to 35 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
        "Cut cake into rounds using a cookie cutter or drinking glass. Place a cake round on a plate and top with blueberry sauce and lemon curd. Top with another cake round, followed by blueberry sauce and lemon curd to make one serving. Repeat with remaining cake, sauce, and curd."
    ],
    "ingredients": [
        "1/2 cup white sugar",
        "1/3 cup water",
        "2 tablespoons cornstarch",
        "2 cups blueberries",
        "2 eggs",
        "3 egg yolks",
        "1/2 cup white sugar",
        "2 tablespoons milk",
        "1/4 teaspoon salt",
        "2 large lemons, zested and juiced",
        "1/3 cup butter, cut into small pieces",
        "3 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1 cup milk",
        "1 1/2 teaspoons lemon extract",
        "1 teaspoon coconut extract",
        "1 teaspoon vanilla extract",
        "1 teaspoon butter extract",
        "1/2 teaspoon almond extract",
        "3 cups white sugar",
        "1 cup butter, softened",
        "1/2 cup shortening",
        "5 eggs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Blueberry Lemon Shortcake",
    "url": "http://allrecipes.com/recipe/222845/blueberry-lemon-shortcake/"
}
