{
    "directions": [
        "Coat the pie tin with 1 tablespoon of butter. Clear and clean off a large, flat surface. Lightly flour the area.",
        "Crust:",
        "Combine the flour, sugar and salt in a food processor and pulse to combine. Pulse in the shortening and 1 stick of the butter. Add some of the ice water and continue to mix until it looks like wet sand. Scrape down the sides of the bowl before adding more water and pulse again until it just comes together into a ball.",
        "Put the dough on the floured surface and roll it into a ball. Cut in half. Reserve the second half. Using a rolling pin, roll out the first half, until its at least 4 to 5 inches wider than the 9-inch pie tin, about 1/4-inch thick. Gently roll the dough onto your floured rolling pin and lay the dough into the pie tin. Press it into the bottom and the sides of the tin. Refrigerate until ready to use.",
        "Roll the second half of the dough larger than the pie tin for the top of the pie. Gingerly lay it on a baking sheet and refrigerate it until filling is ready.",
        "Filling:",
        "In a large bowl, combine the blueberries, flour, butter, sugar, salt, lemon zest and juice. Mix to blend. Stir in the jam and set aside.",
        "Preheat the oven to 425 degrees F. Remove the pie pan from the refrigerator and pour in the filling.",
        "Remove the top crust from the refrigerator and fold it onto the rolling pin. Lay the dough over the top of the pie. Trim the overlapping edges to a 1 1/2-inch overhang. Tuck the edges of the top crust under the edges of the bottom crust, this eliminates the need for an egg wash. Pinch the top to make the edges fluted and sealed all around the pie. Use a pastry cutter or small knife to cut an opening in the center of the top crust.",
        "Put the pie in the center of the oven and bake, undisturbed, for 15 minutes. Lower the heat to 350 degrees F and bake for an additional 30 minutes.",
        "While the pie is baking, combine the sugar, water and orange juice in a small saucepan over low heat. Simmer gently to reduce by about half and coats the back of a spoon.",
        "Open the oven door and slide the rack out slightly. Pour the mixture over the pie and into the opening in the top of the crust. Lower the oven temperature to 325 degrees F and cook for an additional 10 minutes.",
        "Remove the pie from the oven and allow it to cool completely before slicing. Serve alongside a scoop of vanilla ice cream."
    ],
    "ingredients": [
        "1 stick unsalted butter, chilled and cubed, plus 1 tablespoon for pan",
        "5 cups all-purpose flour, plus more for rolling dough",
        "2 teaspoons granulated sugar",
        "2 teaspoons kosher salt",
        "1 cup shortening, chilled and cubed",
        "1/2 to 2/3 cup, plus 2 tablespoons ice water",
        "5 cups blueberries, discard any small or overly soft berries",
        "2 tablespoons all-purpose flour, sifted",
        "1/2 stick unsalted butter, cut into small cubes",
        "1 cup granulated sugar",
        "1 pinch kosher salt",
        "1 lemon, zested and juiced",
        "12 to 14 ounces good quality blueberry jam",
        "1/2 cup granulated sugar",
        "1/4 cup water",
        "1 orange, juiced",
        "Vanilla ice cream, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Blueberry Pie",
        "Blueberry",
        "Fruit",
        "Pie Recipes",
        "Dessert"
    ],
    "title": "Blueberry Pie",
    "url": "http://www.foodnetwork.com/recipes/alexandra-guarnaschelli/blueberry-pie-recipe"
}
