{
    "directions": [
        "Dissolve yeast and honey in 1/2 cup warm water (110°F-115°F) in a small bowl. Let sit until foamy, about 10 minutes. Combine 4 1/2 cups flour, salt, and pepper in a large bowl. Add the yeast mixture, 6 tablespoons oil, potatoes, and 1 cup warm water. Mix with a wooden spoon until almost incorporated, then finish mixing with your hands. Transfer dough to a floured work surface and knead until smooth, 4-6 minutes, adding more flour by tablespoonfuls if dough seems very sticky (dough should be soft and elastic).",
        "Brush a large bowl with oil; place dough in bowl. Cover with plastic wrap and place in a warm, draft-free area. Let rise until doubled, about 1 hour.",
        "Meanwhile, heat a large skillet over medium-high heat. Add bacon and cook until it is light golden but not crisp. Transfer to paper towels to drain.",
        "Preheat oven to 425°F. Brush a 17x11x1\" baking sheet with oil. Press dough into pan. Press with your fingertips all over, forming dimples. Drizzle remaining 2 tablespoons oil over.",
        "Bake focaccia for 10 minutes. Sprinkle cheese over, then bacon and rosemary. Return to oven and bake until golden brown, 12-15 minutes longer. Let cool for 10 minutes in pan. Slide bread onto a wire rack to cool completely. Slice into 2x1\" pieces."
    ],
    "ingredients": [
        "2 1/4 teaspoons (1 package) active dry yeast",
        "1/2 teaspoon honey",
        "4 1/2 cups (or more) all-purpose flour",
        "1 tablespoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "8 tablespoons extra-virgin olive oil, divided, plus more for brushing",
        "1 cup riced or mashed boiled russet potatoes",
        "5 ounces bacon (about 4 thick-cut strips), cut crosswise into 1/2\" pieces",
        "2 ounces blue cheese, crumbled (1/2 cup)",
        "1 tablespoon fresh rosemary sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Potato",
        "Cocktail Party",
        "Quick & Easy",
        "Blue Cheese",
        "Bacon",
        "Party"
    ],
    "title": "Blue Cheese-Bacon Focaccia",
    "url": "http://www.epicurious.com/recipes/food/views/blue-cheese-bacon-focaccia-367750"
}
