{
    "directions": [
        "Roll out pie dough on a lightly floured work surface to a 13\" round about 1/8\" thick. Transfer dough to a 9\" pie dish and allow dough to slump down into dish, leaving about 2\" overhang. Fold edges under and crimp all the way around, making sure dough extends to the outer edge of the lip of the pie dish (this will create a shelf for the dough to sit on, preventing it from sliding back into dish). Chill in freezer until dough is very cold, about 20 minutes.",
        "Place a rack in middle of oven and preheat to 350°F. Line pie dough with parchment paper or heavy-duty foil, leaving a 1 1/2\" overhang, and fill with pie weights or dried beans. Bake until crust is golden around the edge, 20–25 minutes. Remove from oven and lift out parchment and pie weights and bake until surface of crust looks dry and is golden, 10–15 minutes longer. Transfer to a wire rack and let cool.",
        "Meanwhile, reduce oven temperature to 325°F. Whisk cornmeal, salt, and 1/2 cup flour in a small bowl. Combine sugar, butter, and orange zest in a large bowl and scrape in vanilla seeds; reserve pod for another use. Using an electric mixer on medium speed, beat until light and fluffy, about 4 minutes. Add eggs one at a time, beating to blend after each addition and occasionally scraping down sides and bottom of bowl. Beat until well blended. Reduce speed to low and add dry ingredients; beat just to combine. With motor running, gradually add buttermilk; beat just to combine (mixture may look broken, which is okay). Using a rubber spatula, gently fold in blueberries. Scrape filling into cooled pie crust just to fill to crust edge (you might have some left over). Bake pie until filling is puffed and golden and center wobbles slightly when jostled, 50–60 minutes. Transfer dish to a wire rack and let pie cool before slicing, at least 2 hours.",
        "Pie can be baked 1 day ahead. Store loosely covered at room temperature."
    ],
    "ingredients": [
        "1 disk All-Purpose Pie Dough",
        "1/2 cup all-purpose flour, plus more for surface",
        "2 tablespoons fine-grind cornmeal",
        "1/2 teaspoon kosher salt",
        "1 cup sugar",
        "1/2 cup plus 2 tablespoons unsalted butter, room temperature",
        "2 teaspoons finely grated orange zest",
        "1 vanilla bean, split lengthwise",
        "4 large eggs, room temperature",
        "1 1/4 cups buttermilk, room temperature",
        "2 cups fresh (or frozen, thawed) blueberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Summer",
        "Pie",
        "Blueberry",
        "Buttermilk",
        "Egg",
        "Cornmeal",
        "Bake"
    ],
    "title": "Blueberry-Buttermilk Chess Pie",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-buttermilk-chess-pie"
}
