{
    "directions": [
        "Preheat oven to 350°F. Butter three 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottom of pans with parchment paper; butter paper. Dust pans with flour. Sift cake flour, baking powder, and salt into medium bowl. Transfer 1 tablespoon flour mixture to large bowl. Add fresh blueberries and toss to coat. Set remaining flour mixture and blueberries aside.",
        "Stir whole milk, vanilla extract, and grated lemon peel in small bowl. Using electric mixer, beat butter in another large bowl until light and creamy. Gradually add sugar, beating until mixture is light and fluffy. Beat in eggs 1 at a time. Beat in flour mixture alternately with milk mixture in 3 additions each, just until blended. Fold in blueberries. Divide batter equally among pans.",
        "Bake cakes until tester inserted into center comes out clean, about 25 minutes. Cool cakes in pans on racks 10 minutes. Run knife around pan sides to loosen. Turn cakes out onto racks to cool completely. Peel off parchment paper.",
        "Transfer 1 cake layer to platter. Spread 3/4 cup frosting over cake layer. Top with another cake layer; spread with 3/4 cup frosting. Top with third cake layer. Spread remaining frosting over top and sides of cake. (Cake can be prepared up to 1 day ahead of time. Cover with cake dome and refrigerate. Let stand 30 minutes at room temperature before continuing.) Garnish cake with lemon peel strips, if desired, and serve."
    ],
    "ingredients": [
        "2 cups plus 6 tablespoons cake flour",
        "2 teaspoons baking powder",
        "1 teaspoon salt",
        "3 cups fresh blueberries (about three 4.4-ounce packages)",
        "1 cup whole milk",
        "2 teaspoons vanilla extract",
        "1 teaspoon grated lemon peel",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 1/2 cups sugar",
        "4 large eggs",
        "Lemon Cream Cheese Frosting",
        "Lemon peel strips (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Blueberry",
        "Lemon",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Blueberry-Lemon Cake with Lemon Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-lemon-cake-with-lemon-cream-cheese-frosting-105375"
}
