{
    "directions": [
        "Whisk all ingredients in heavy large saucepan to blend. Whisk over medium-high heat until beginning to boil. Reduce heat to medium-low. Simmer until sauce is thick enough to coat spoon, whisking occasionally, about 25 minutes. (Can be made 3 days ahead. Cool. Cover and refrigerate. Rewarm over low heat before serving.)",
        "Preheat oven to 350°F. Butter 11x7-inch glass baking dish. Combine milk, cream, sugar, eggs, egg yolks, vanilla, nutmeg, and salt in large bowl; whisk to blend well. Spread 1 side of each bread slice with butter. Arrange 6 slices, buttered side up, in single layer in prepared dish, trimming to fit. Sprinkle with currants. Top with remaining bread slices, buttered side up. Pour custard through sieve over bread in dish. Let stand 15 minutes, occasionally pressing bread into custard.",
        "Place pudding in dish in 13x9x2-inch metal baking pan. Pour enough hot water into pan to come halfway up sides of pudding dish. Place in oven. Bake pudding until set in center and golden on top, about 45 minutes. Remove pudding from water bath. Serve warm or at room temperature with warm caramel sauce."
    ],
    "ingredients": [
        "1 pound dark brown sugar",
        "2 cups whipping cream",
        "1 cup light corn syrup",
        "1/2 cup dark rum",
        "2 1/2 cups whole milk",
        "1 cup whipping cream",
        "1 cup sugar",
        "4 large eggs",
        "4 large egg yolks",
        "1 tablespoon vanilla extract",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon salt",
        "12 slices good-quality white bread, crusts trimmed",
        "3 tablespoons unsalted butter, room temperature",
        "1/2 cup dried currants"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Egg",
        "Dessert",
        "Bake",
        "Currant",
        "Dried Fruit",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Bluewater Bread Pudding with Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/bluewater-bread-pudding-with-caramel-sauce-107108"
}
