{
    "directions": [
        "Position rack in center of oven and preheat to 375°F. Wrap outside of 10-inch-diameter springform pan with heavy-duty foil. Combine all ingredients in processor. Blend using on/off turns just until crumbs are moist. Press crumb mixture firmly onto bottom and 2 inches up sides of prepared pan. Bake until crust begins to brown, about 8 minutes. Transfer crust to rack and cool. Maintain oven temperature.",
        "Using electric mixer, beat cream cheese and sugar in large bowl until will blended. Beat in flour. Add eggs 1 at a time, beating just until combined. Beat in sour cream, milk and vanilla. Pour filling into crust.",
        "Place springform pan in large roasting pan. Pour enough hot water into roasting pan to come 1 inch up sides of pan. Bake cheesecake until just set in center and top is slightly puffed and golden brown, about 1 hour. Turn off oven; keep door closed. Let cheesecake stand in oven 1 hour. Remove cheesecake from roasting pan. Refrigerate until cold, at least 6 hours. Cover; refrigerate overnight.",
        "Stir blueberry spread in large skillet over low heat until melted. Remove from heat. Add blueberries; toss to coat. Spoon blueberry mixture over top of cake, spreading evenly. Chill until cold, at least 1 hour and up to 4 hours.",
        "Run small sharp knife around sides of cake to loosen. Release pan sides. Transfer cake to platter. Cut into wedges."
    ],
    "ingredients": [
        "2 1/3 cups graham cracker crumbs",
        "1/2 cup (1 stick) unsalted butter, melted",
        "1/4 cup sugar",
        "4 8-ounce packages cream cheese, room temperature",
        "1 1/2 cups sugar",
        "1/4 cup all purpose flour",
        "5 large eggs",
        "1 16-ounce container sour cream",
        "1/4 cup milk",
        "1 tablespoon vanilla extract",
        "1/3 cup all-fruit blueberry spread",
        "2 6-ounce baskets fresh blueberries or 12-ounce package frozen blueberries, thawed, drained"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Wedding",
        "Cream Cheese",
        "Blueberry",
        "Fall",
        "Chill",
        "Shavuot",
        "Sour Cream"
    ],
    "title": "Blueberry Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/blueberry-cheesecake-4302"
}
