{
    "directions": [
        "Trim ends off lemongrass and cut into 3-inch pieces. Pound gently with a heavy object until bruised.",
        "Mix lemongrass stalk, fish sauce, ginger, applesauce, curry powder, five-spice powder, and bay leaf in a large bowl. Add beef; mix until coated. Let marinate in the refrigerator, about 30 minutes.",
        "Preheat oven to 300 degrees F (150 degrees C).",
        "Drain excess marinade off beef, reserving lemongrass and bay leaf.",
        "Melt ghee in a Dutch oven over medium-high heat. Cook beef in batches until browned, about 30 seconds per side. Transfer beef to a plate. Reduce heat to medium-low. Add onion; cook and stir until soft, about 5 minutes. Stir in tomatoes and salt. Simmer until thickened into a paste, 12 to 14 minutes.",
        "Stir beef, reserved lemongrass, and bay leaf into the tomato paste. Increase heat to medium and cook, stirring often, until flavors combine, about 5 minutes. Increase heat to high. Add water and carrots; bring to a boil.",
        "Cover and cook in the preheated oven until beef is tender, about 2 1/2 hours. Garnish with cilantro."
    ],
    "ingredients": [
        "1 stalk lemongrass",
        "3 tablespoons fish sauce (patis)",
        "2 1/2 tablespoons grated ginger",
        "2 tablespoons unsweetened applesauce",
        "1 1/2 teaspoons curry powder",
        "1 teaspoon Chinese five-spice powder",
        "1 bay leaf",
        "2 1/2 pounds beef brisket, cut into 1 1/2-inch chunks",
        "3 tablespoons ghee (clarified butter)",
        "1 onion, finely chopped",
        "2 (14.5 ounce) cans diced tomatoes, drained and crushed with your hands",
        "kosher salt to taste",
        "3 cups water",
        "1 pound carrots, peeled and chopped into 1-inch pieces",
        "1/4 cup chopped fresh cilantro (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bo Kho (Spicy Vietnamese Beef Stew)",
    "url": "http://allrecipes.com/recipe/247322/bo-kho-spicy-vietnamese-beef-stew/"
}
