{
    "directions": [
        "Prepare the grill for direct and indirect cooking.",
        "Once the grill is hot (you can hold your hands an inch over the grates for no more than 2 seconds), stretch and shape the dough into a 12-inch round on a flat surface. Brush the top with oil, salt and pepper and toss on the grill, oil-side down. Cook until the bottom is golden brown, 1 minute. Check the bottom of the dough to see if it is getting browned. If it is on one part, but not the other, use a spatula or tongs to rotate the dough 90 degrees and cook for another minute. If it is still not beginning to brown, cover the grill and continue to cook a minute at a time until the bottom has browned evenly. (It should only take a couple minutes if you have a hot grill.) The top of the pizza dough will also start bubbling up with air pockets.",
        "Once the pizza dough has browned on the bottom, flip over and grill until golden brown and the dough is just firm, another minute or so. Remove to a sheet pan. Cover the grill so it retains the heat for the next step.",
        "Drizzle the top with more olive oil. Put the mozzarella and tomato slices on top and season with salt and pepper. Return the pizza to the grill on the sheet pan, cover the grill and cook for 3 or 4 minutes to melt the cheese. Remove from the grill and tear the basil leaves over the top. Slice and serve immediately."
    ],
    "ingredients": [
        "1 store-bought pizza dough",
        "Olive oil, for brushing and drizzling",
        "Kosher salt and freshly ground black pepper",
        "1 pound fresh mozzarella, sliced 1/4-inch thick",
        "3 Roma tomatoes, sliced 1/4-inch thick",
        "Handful fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Grilling Recipes",
        "Easy Recipes",
        "Grilling",
        "Pizza Recipes",
        "Cheese",
        "Mozzarella Recipes",
        "Tomato",
        "Vegetable"
    ],
    "title": "Bobby Flay's Margherita Pizza",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/bobby-flays-margherita-pizza-recipe"
}
