{
    "directions": [
        "For the mulled cider: Combine the peppercorns, star anise, allspice, cinnamon, cloves and cardamom in a large stockpot over medium heat. Toast the spices until aromatic, 3 to 5 minutes. Pour in the cider, carrot juice, ginger juice, sugar, orange zest, nutmeg and kosher salt. Reduce the heat to low and let the mixture sit uncovered until the cider is aromatic and the spices are well infused, 1 to 2 hours. Strain the cider through a fine sieve or cheesecloth; discard the solids. (The cider can be made in advance and reheated prior to serving.)",
        "For the eggnog batter: Separate the whites and yolks of the eggs into 2 medium size mixing bowls. Whip the yolks with the nutmeg, cinnamon, rum and salt. Gradually add 1/4 cup of the sugar. Mix until the texture is silky and the sugar is fully incorporated. Set aside.",
        "Whip the egg whites on medium-high speed, gradually incorporating the remaining 1/8 cup of sugar. Whip until stiff peaks form.",
        "Gently fold the egg white mixture into the yolk mixture. This batter has a lifespan of about one evening. Be sure to use fresh eggs as these will be served in a raw state.",
        "To assemble the holiday eggnog: For each drink, mix together 4 ounces of the hot mulled cider, 2 ounces of the eggnog batter, 1 ounce of the rum and 1/2 ounce of the brandy in a heat-treated glass or mug. Garnish with grated nutmeg."
    ],
    "ingredients": [
        "20 peppercorns",
        "10 star anise",
        "10 allspice berries",
        "10 cinnamon sticks",
        "10 cloves",
        "10 cardamom pods",
        "1/2 gallon apple cider",
        "2 cups fresh carrot juice",
        "1/2 cup fresh ginger juice",
        "1/2 cup demerara sugar",
        "Zest of 1 orange",
        "1/4 teaspoon freshly grated nutmeg",
        "Pinch kosher salt",
        "3 large eggs",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon ground cinnamon",
        "1/2 ounce aged rum",
        "Pinch kosher salt",
        "1/4 cup plus 1/8 cup granulated sugar",
        "12 ounces aged rum",
        "6 ounces aged brandy",
        "Freshly grated nutmeg, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Eggnog",
        "Rum Recipes",
        "Drinks",
        "Holiday"
    ],
    "title": "Holiday Eggnog",
    "url": "http://www.foodnetwork.com/recipes/bobby-deen/bobbys-vanilla-holiday-nog-recipe"
}
