{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Butter a 2 quart baking dish. Place the bread in a shallow dish, and pour the milk overtop, allowing it to soak in.",
        "Heat the vegetable oil in a skillet over medium-high heat. Stir in the onion and garlic, and cook until lightly browned, about 5 minutes. Reduce the heat to medium-low, and stir in the curry powder. Cook and stir for 2 minutes, then set the skillet aside to cool.",
        "As the onion mixture cools, combine the ground lamb, raisins, lemon zest, almonds, lemon juice, chutney, and 1 egg in a large bowl. Squeeze excess milk from the slice of bread, and add the bread to the lamb mixture; reserve the remaining milk. Season with sugar, salt, pepper, and turmeric. Add the onions to the lamb mixture, and mix until well combined. Scrape the mixture into the prepared baking dish, and level the top.",
        "Bake in the preheated oven for 1 hour. Beat the remaining egg with the remaining milk, and pour evenly over the top of the casserole. Return the casserole to the oven, and continue baking until the custard has set and the top is golden brown, 15 to 20 minutes."
    ],
    "ingredients": [
        "1 slice day-old bread",
        "1 cup milk",
        "2 tablespoons vegetable oil",
        "2 large onions, chopped",
        "2 cloves garlic, minced",
        "1 tablespoon curry powder",
        "2 pounds ground lamb",
        "1/2 cup raisins",
        "4 (2 inch) pieces lemon zest",
        "12 blanched almonds, chopped",
        "1/4 cup lemon juice",
        "3 tablespoons mango chutney, chopped",
        "1 egg",
        "1 tablespoon white sugar",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon ground turmeric",
        "1 egg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bobotie from Boschendal Manor House",
    "url": "http://allrecipes.com/recipe/135731/bobotie-from-boschendal-manor-house/"
}
