{
    "directions": [
        "Heat the olive oil in a heavy skillet over high heat until very hot. Sear the filets until well-browned on both sides,  1 to 2 minutes per side. Remove the filets from the skillet, and chill in refrigerator for at least 1 hour. Filets must be cold.",
        "In the same skillet over medium heat, melt the butter, and cook and stir the mushrooms, shallot, and garlic until the shallots are tender and translucent and the mushrooms have given off their juice, 6 to 8 minutes. Stir in 2 tablespoons of red wine, scraping and dissolving any browned flavor bits from the pan. Transfer the mushroom mix into a bowl, and chill in refrigerator for about 45 minutes.",
        "Place 2 pieces of puff pastry on a work surface, and top each with a chilled filet. Spread half the mushroom mixture in a neat layer on top of of each filet, and top each with a piece of puff pastry. Fold and pinch the edges of the pastry together, sealing in the contents, and trim to make a tidy package. Cut a small slit into the top of each package.",
        "Pour 1 1/2 cups of red wine into a saucepan over medium heat, and simmer until the wine is reduce by half, about 15 minutes. Season wine sauce to taste with salt and pepper. Meanwhile, whisk egg into milk in a bowl, and brush the pasty packages with the egg mixture for a browner crust, if desired. Return the bundles to the refrigerator to keep cold.",
        "Preheat an oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper.",
        "Place the puff pastry bundles onto the prepared baking sheet, and bake in the preheated oven until the pastry is golden brown and crisp and the filets are the desired degree of doneness (for medium-rare, about 15 minutes; an instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C)). Serve each filet in the pastry shell with spoonfuls of wine sauce on top."
    ],
    "ingredients": [
        "1 teaspoon olive oil",
        "2 (6 ounce) beef tenderloin filets",
        "1 tablespoon butter",
        "8 ounces fresh white mushrooms, minced",
        "1/3 cup minced shallot",
        "2 cloves garlic, minced",
        "2 tablespoons red wine",
        "4 6-inch squares of frozen puff pastry, thawed but still cold",
        "1 1/2 cups red wine",
        "salt and pepper to taste",
        "1 egg (optional)",
        "2 tablespoons milk (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Boeuf en Croute",
    "url": "http://allrecipes.com/recipe/213512/boeuf-en-croute/"
}
