{
    "directions": [
        "Cook bacon in boiling salted water 3 minutes, then drain.",
        "Pat beef dry and season with salt and pepper. Divide flour and beef between 2 (1-quart) sealable plastic bags, seal, then shake to coat meat.",
        "Heat 1‚ tablespoons oil and 1 1/2 tablespoons butter in a wide 6- to 8-quart heavy pot over moderately high heat until hot but not smoking, then brown beef well on all sides in 2 or 3 batches, without crowding, adding remaining ‚ tablespoon oil as needed. Transfer to a bowl.",
        "Pour off any excess oil from pot, then add brandy to pot. Deglaze by boiling over high heat 1 minute, stirring and scraping up brown bits, then pour over beef.",
        "Tie celery, parsley, thyme, bay leaves, and cloves together with kitchen string to make a bouquet garni (tuck cloves into celery so they don’t fall out).",
        "Heat 1 tablespoon butter in cleaned pot over moderately high heat until foam subsides, then sauté bacon, stirring, 2 minutes. Add chopped onions, garlic, and carrots, then sauté, stirring, until onions are pale golden, about 5 minutes. Add tomato paste and cook, stirring, 1 minute. Add wine, meat with juices, and bouquet garni and simmer gently, partially covered, until meat is tender, 3 1/2 to 4 hours.",
        "While meat simmers, blanch boiling onions in boiling salted water 1 minute and drain in a colander. Rinse under cold running water, then peel.",
        "Heat 1 tablespoon butter in a 3-quart heavy saucepan over moderately high heat until foam subsides, then saut\u2029 boiling onions, stirring occasionally, until browned in patches. Season with salt and pepper. Add 2 cups water (1 1/2 cups if using pearl onions), then simmer, partially covered, until onions are tender, 15 to 20 minutes. Boil, uncovered, stirring occasionally, until liquid is reduced to a glaze, 5 to 10 minutes.",
        "Heat remaining tablespoon butter in a large nonstick skillet over moderately high heat until foam subsides, then saut\u2029 mushrooms, stirring, until golden brown and any liquid mushrooms give off is evaporated, about 8 minutes. Season with salt and pepper.",
        "Stir onions and mushrooms into stew and cook 10 minutes. Remove bouquet garni and skim any fat from surface of stew. Season with salt and pepper."
    ],
    "ingredients": [
        "1/4 pound thick-sliced bacon",
        "3 pounds boneless beef chuck",
        "1/3 cup all-purpose flour",
        "2 tablespoons vegetable oil",
        "4 1/2 tablespoons unsalted butter",
        "1/2 cup brandy",
        "1 (4-inch) piece of celery",
        "4 fresh parsley stems (no leaves)",
        "4 fresh thyme sprigs",
        "2 bay leaves (not California)",
        "2 cloves",
        "2 onions, finely chopped",
        "3 large garlic cloves, finely chopped",
        "2 carrots, cut into 1/4-inch-thick slices",
        "1 tablespoon tomato paste",
        "1 (750-ml) bottle dry red wine (preferably Burgundy or Côtes du Rhône)",
        "1 pound small (1 1/2-inch) boiling onions or pearl onions",
        "1pound mushrooms, quartered if large",
        "Accompaniment: peeled boiled potatoes tossed with butter and parsley",
        "Special equipment: kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Mushroom",
        "Onion",
        "Stew",
        "Dinner",
        "Bacon",
        "Brandy",
        "Red Wine",
        "Winter",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Boeuf Bourguignon",
    "url": "http://www.epicurious.com/recipes/food/views/boeuf-bourguignon-104754"
}
