{
    "directions": [
        "Cut beef crosswise (across the grain) into 1/4-inch-thick slices, then cut slices into 1/2-inch-wide strips.",
        "Stir together marinade ingredients in a medium bowl until sugar is dissolved.",
        "Add beef, tossing to coat, and marinate 30 minutes to 1 hour.",
        "Separate bok choy into individual leaves and halve crosswise, keeping stems and leaves separate. Cook stems in a large pot of boiling water 15 seconds, then add leaves and cook 15 seconds more. Drain in a colander, then rinse with cold water to stop cooking and drain well.",
        "Stir together soy sauce, Sherry, and vinegar.",
        "Heat vegetable oil in a 12-inch heavy skillet over moderate heat until a deep-fat thermometer registers 400°F.",
        "Add beef to hot oil with tongs (discard marinade) and cook, stirring carefully, until slices separate, about 1 minute. Transfer beef with tongs to a colander and drain.",
        "Reserve 3 tablespoons oil from skillet and discard remainder. Heat reserved oil in skillet over moderately high heat until hot but not smoking, then stir-fry garlic and ginger until fragrant, about 30 seconds. Add beef, soy mixture, and bok choy and stir-fry until sauce is simmering and mixture is just heated through, about 1 minute. Serve immediately."
    ],
    "ingredients": [
        "1 (1-pound) piece beef tenderloin",
        "2 tablespoons soy sauce",
        "2 tablespoons sugar",
        "1 tablespoon medium-dry Sherry",
        "1 1/2 teaspoons Asian sesame oil",
        "2 teaspoons cornstarch",
        "1 1/2 pound baby bok choy",
        "2 tablespoons soy sauce",
        "3 tablespoons medium-dry Sherry",
        "1 teaspoon balsamic vinegar",
        "1 cup vegetable oil",
        "1 1/2 tablespoons minced garlic",
        "1 tablespoon minced peeled fresh ginger",
        "Accompaniment: rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Ginger",
        "Marinate",
        "Stir-Fry",
        "Quick & Easy",
        "Sherry",
        "Bok Choy",
        "Sesame",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Bok Choy with Beef",
    "url": "http://www.epicurious.com/recipes/food/views/bok-choy-with-beef-1000345"
}
