{
    "directions": [
        "Lay the eye of round roast on your work surface. Use the tip of a sharp boning or paring knife to cut a pocket by inserting the knife all the way through the center of the roast, beginning on the flat side. Rotate the blade 90 degrees and insert the knife in the same spot, creating an cross shape that extends through the roast. Stuff the chorizo pieces into the pocket. Using the same knife, pierce the roast all over. Set aside.",
        "Mash garlic and oregano with a mortar and pestle to create a paste. Rub paste all over the roast, then season with paprika, salt, and pepper. Pour the orange juice, lime juice, and lemon juice over the roast. Cover with plastic wrap and marinate in the refrigerator for at least 3 hours, or overnight. Remove the roast from the marinade, and shake off excess. Reserve marinade.",
        "Heat a large Dutch oven over medium heat. Place the roast in the Dutch oven and brown on all sides, about 10 minutes. Remove roast to a platter, and set aside.  Stir in the onions; cook and stir until the onion has softened and turned translucent, about 5 minutes. Return the roast to the pot. Add the bay leaves, sherry, beef broth, and reserved marinade. Increase heat to medium-high, bring to a boil, then cover and reduce heat to low; simmer 2 hours.",
        "Drop potatoes into the pot, cover, and continue to simmer until potatoes are tender and easily pierced with a fork, about 30 minutes more, adding additional beef broth as needed.",
        "Remove the roast and place on a platter. Cover the meat with two layers of aluminum foil, and allow to rest in a warm area for 10 minutes. Slice roast into 1/2-inch thick slices, and arrange potatoes on the platter. Spoon the remaining sauce over, and serve."
    ],
    "ingredients": [
        "4 pounds beef eye of round roast",
        "2 (4 ounce) links chorize sausage, cut into pieces",
        "6 cloves garlic",
        "1/2 teaspoon dried oregano",
        "1/8 teaspoon paprika",
        "salt and ground black pepper to taste",
        "1/2 cup orange juice",
        "1/4 cup lime juice",
        "1/4 cup lemon juice",
        "1/2 cup olive oil",
        "2 large onions, thickly sliced",
        "2 bay leaves, crumbled",
        "1 cup dry sherry",
        "3 cups beef broth, or more if needed",
        "4 potatoes, peeled and halved"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Boliche (Cuban Pot Roast)",
    "url": "http://allrecipes.com/recipe/207840/boliche-cuban-pot-roast/"
}
