{
    "directions": [
        "Sprinkle the gelatin over the 1/2 cup cold water in a heat-proof dish; set aside for 10 minutes. Microwave the rehydrated gelatin for 30 seconds or until melted (or melt it over a pot of simmering water). Transfer the melted gelatin to a small bowl and refrigerate until set.",
        "Place the potatoes into a saucepan, cover with water, and bring to a boil over medium heat. Reduce heat, and simmer until the potatoes are cooked but still firm, about 10 minutes. Remove from water, allow to cool, and shred into a bowl; set aside.",
        "Heat the olive oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the ground beef, and cook until the meat is no longer pink, breaking it up into crumbles as it cooks, about 10 minutes. Drain excess grease. Stir in the shredded potatoes, peas, spring  onion, parsley, 4 teaspoons sugar, 2 teaspoons paprika, cumin, salt and black pepper, and 3 tablespoons jalapeno sauce (optional). Simmer filling until hot, about 3 minutes. Remove from heat and set aside.",
        "Preheat an oven to 425 degrees F (220 degrees C). Lightly grease a baking sheet, or line it with parchment paper.",
        "Combine the flour, 1/4 cup sugar, and 1 teaspoon of salt. Cut in the butter with a knife or pastry blender until the mixture resembles coarse crumbs. (This can also be done in a food processor: pulse the butter and flour mixture until it looks like cornmeal. Turn mixture into a bowl and proceed.) Slowly add the hot water and knead until smooth, about 3 minutes. Keep the dough covered with plastic wrap or a clean kitchen towel to keep it warm. Divide the dough into 16 pieces and roll them into balls. Keep the other balls of dough covered with a towel while you roll out each round.",
        "On a lightly floured surface, roll each ball of dough into a 1/8-inch-thick circle. Whisk the beaten eggs and 2 teaspoons water in a small bowl. Lightly brush egg wash on the edges of the dough circle. Place about 2 tablespoons of the meat filling on one half of the dough round; top it with about a 1/2 teaspoon of hard-boiled egg, 1/4 teaspoon of gelatin, a few sliced black olives, and some raisins.",
        "Fold the dough over the filling. Seal and scallop the edges of the dough together. To scallop, start at one edge of the half circle: fold a small piece of dough (the size of your fingernail) over the seam and press gently. Fold another small piece of dough over the seam so that it overlaps the first piece; repeat until you have sealed the half circle. (You may also seal the saltenas by pressing a fork around edges.)",
        "Place the saltena on the prepared baking sheet and continue with the remaining dough and filling. Whisk the paprika into the remaining egg wash and brush the saltenas with the egg wash. Bake in the preheated oven until golden brown, 15 to 20 minutes."
    ],
    "ingredients": [
        "For the Filling:",
        "1 (.25 ounce) package unflavored gelatin",
        "3 potatoes, peeled",
        "1 1/2 tablespoons olive oil",
        "1 onion, chopped",
        "1 1/2 pounds ground beef",
        "1 (10 ounce) package frozen petite peas, thawed",
        "1 spring onion, sliced",
        "1/2 cup fresh parsley, chopped",
        "4 teaspoons white sugar",
        "2 teaspoons paprika",
        "1/4 teaspoon ground cumin",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon black pepper",
        "3 tablespoons jalapeno sauce (optional)",
        "1/2 cup cold water",
        "3 hard-cooked eggs, peeled and chopped",
        "1 (2.25 ounce) can sliced black olives, drained",
        "1 cup raisins, soaked in water and drained",
        "For the Dough:",
        "6 cups all-purpose flour",
        "1/4 cup white sugar",
        "1 teaspoon salt",
        "1 cup butter, cubed",
        "1 1/2 cups hot water",
        "2 eggs, beaten",
        "2 teaspoons water",
        "1 tablespoon paprika"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bolivian Saltenas",
    "url": "http://allrecipes.com/recipe/216872/bolivian-saltenas/"
}
