{
    "directions": [
        "Mix the bread flour and flax seed meal together on a clean surface or in a bowl. Make a well in the center for the flour mixture, then crack the eggs into the center. Mix the eggs with your fingers. Gradually incorporate the flour from the sides of the well until dough is firm. Knead dough until smooth, about 5 minutes. Remove excess flour, allow the dough to rest for 1 minute.",
        "Roll out the dough with a pasta machine or with a rolling pin until very thin. Sprinkle the sheets with a little flour, roll up each sheet of pasta, then slice them into strips. Toss with flour and set aside until ready to cook.",
        "Heat a large skillet over high heat. Stir in the beef, onion, garlic, and carrots. Cook and stir until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Stir in the oregano, garlic powder, bay leaf, salt, and black pepper. Add the tomatoes and water. Bring to boil, then reduce heat to medium-low and continue to simmer for 1 to 1 1/2 hours. Pour all but 2 cups of the sauce in an airtight container and freeze for future use.",
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the noodles, and return to a boil. Cook until the pasta floats to the top, 4 to 5 minutes; drain.",
        "Stir butter and Parmesan cheese into reserved 2 cups of sauce over medium heat. Stir noodles into sauce, and toss until pasta is well-coated. Serve in large bowls with more Parmesan cheese."
    ],
    "ingredients": [
        "Homemade Noodles",
        "2 cups bread flour",
        "1 tablespoon flax seed meal",
        "2 eggs",
        "Sauce Bolognese",
        "1 pound ground beef (85% lean)",
        "1 cup diced onion",
        "1 tablespoon minced garlic",
        "1 carrot, shredded",
        "1 tablespoon dried oregano",
        "1 teaspoon garlic powder",
        "1 bay leaf",
        "salt and ground black pepper to taste",
        "42 ounces canned crushed tomatoes (such as San Marzano®)",
        "2 cups water",
        "1 tablespoon butter",
        "1/2 cup grated Parmesan cheese, plus extra for serving"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bolognese with Homemade Noodles",
    "url": "http://allrecipes.com/recipe/219322/bolognese-with-homemade-noodles/"
}
