{
    "directions": [
        "Combine ground pork, Italian sausage, ground sirloin, and ground chuck in a large bowl. Mix them with your hands until thoroughly combined.",
        "Soak bread chunks in chicken broth in a bowl until completely soft. Combine garlic and parsley in a mini chopper or food processor and grind to a fine paste. Squeeze the excess broth out of the bread, reserving the broth in a bowl, and add the bread to the meats along with the garlic and parsley paste. Gently mix in beaten eggs and grated Pecorino Romano cheese with your hands until fully incorporated into the meat mixture. If the mixture seems dry, pour in some of the reserved chicken broth.",
        "Pinch off golf ball-sized pieces of the meat mixture and roll them into meatballs, taking care not to pack them too tightly, and set them on a baking tray. Depending on how big you make them, you should end up with about 30 meatballs.",
        "Heat the olive oil and butter in a large skillet over medium-high heat. Working in two or three batches, brown the meatballs on all sides and drain on paper towels. If you're adding them to a pot of sauce, you may undercook them slightly, as they will finish cooking in the sauce."
    ],
    "ingredients": [
        "1 1/2 pounds coarsely ground pork",
        "1 1/2 pounds sweet Italian sausage without fennel, casings removed",
        "1 1/2 pounds ground beef sirloin",
        "1 1/2 pounds ground beef chuck",
        "1/2 loaf day-old (hard) Italian bread, torn into chunks",
        "1 (32 ounce) carton low-sodium chicken broth",
        "1 whole head garlic, minced",
        "1 cup packed fresh Italian parsley leaves",
        "4 large eggs, beaten",
        "8 ounces Pecorino Romano cheese (such as Locatelli®), grated",
        "1/4 cup extra-virgin olive oil",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bon Appetit's Meatballs",
    "url": "http://allrecipes.com/recipe/222680/bon-appetits-meatballs/"
}
