{
    "directions": [
        "Preheat an oven to 200 degrees F (95 degrees C). Place the pork onto a roasting rack, and rub all over with salt, black pepper, and sage.",
        "Slow roast the pork in the preheated oven until the pork is no longer pink near the bone, about 5 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
        "While the pork is cooking, melt the butter in a large pot over medium heat. Stir in the garlic, shallot, and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the rhubarb, apple, brown sugar, vinegar, apple juice, and chicken stock. Bring to a boil over high heat, then reduce heat to medium, and simmer until the sauce has reduced to half of its original volume, about 30 minutes. Dissolve the cornstarch in the cold water, then stir into the simmering sauce. Continue to cook and stir until the sauce has thickened to the consistency of maple syrup.",
        "Once the pork has reached an internal temperature of 145 degrees F (63 degrees C), spoon enough rhubarb glaze over the pork roast to cover completely. Return the pork to the oven, and continue baking until the glaze has set, and the internal temperature has reached 160 degrees F (71 degrees C), about 20 minutes. Let rest 10 minutes before slicing. Serve with the remaining apple-rhubarb glaze."
    ],
    "ingredients": [
        "1 (5 pound) bone-in pork loin roast",
        "salt and ground black pepper to taste",
        "1/4 cup chopped fresh sage",
        "1/4 cup butter",
        "2 cloves garlic, minced",
        "1 shallot, minced",
        "1/2 onion, chopped",
        "1 pound diced rhubarb",
        "4 Gala apples - peeled, cored, and diced",
        "1/2 cup brown sugar",
        "1/4 cup red wine vinegar",
        "2 cups apple juice",
        "2 quarts chicken stock",
        "1/4 cup cornstarch",
        "1/2 cup cold water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bone-in Pork Roast with Apple-Rhubarb Glaze",
    "url": "http://allrecipes.com/recipe/217889/bone-in-pork-roast-with-apple-rhubarb/"
}
