{
    "directions": [
        "Preheat oven to 400°F.",
        "In a saucepan simmer chilies, onion, and garlic in water to cover 20 minutes and with a slotted spoon transfer to a blender. Add 1/2 cup cooking liquid, raisins, and salt and blend until smooth. Sauce may be made 1 week ahead and chilled, covered.",
        "While chilies are simmering, in a bowl stir together yogurt, garlic paste, cumin, and salt to taste. Add chicken and coat with marinade. Marinate chicken, covered and chilled, at least 15 minutes and up to 1 day.",
        "In a 10-inch non-stick skillet heat oil over moderately high heat until hot but not smoking. Add chicken with marinade clinging to it, skinned sides down, and sauté 1 minute on each side, or until golden-brown patches appear.",
        "Add chili sauce to skillet and bring to a simmer, uncovered, scraping up any brown bits. Transfer chicken mixture to a shallow baking pan just large enough to hold chicken in one layer and bake, covered, 15 minutes. Remove cover and sprinkle Münster over chicken. Remove pan from oven and let stand 1 minute to melt cheese."
    ],
    "ingredients": [
        "4 dried New Mexico red chilies*, stemmed and seeded (wear rubber gloves)",
        "1 small onion (about 1/4 pound), halved",
        "3 large garlic cloves",
        "2 tablespoons raisins",
        "1 1/2 teaspoons salt",
        "2 tablespoons nonfat plain yogurt",
        "2 large garlic cloves, minced and mashed to a paste with 1/2 teaspoon salt",
        "1/2 teaspoon ground cumin",
        "four 5-ounce skinless boneless chicken breast halves",
        "1 teaspoon vegetable oil",
        "1 tablespoon coarsely grated Münster",
        "*available at some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Pepper",
        "Poultry",
        "Marinate",
        "Sauté",
        "Gourmet"
    ],
    "title": "Boneless Chicken Breasts with Red Chili Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/boneless-chicken-breasts-with-red-chili-sauce-13116"
}
