{
    "directions": [
        "Wash the Swiss chard well, drain it, and in a heavy saucepan steam it in the water clinging to the leaves, covered, over moderate heat for 3 to 5 minutes, or until it is wilted. Drain the chard in a colander, refresh it under cold water, and squeeze it dry in a kitchen towel. In a skillet cook the garlic in 2 tablespoons of the oil over moderate heat, stirring, until it is pale golden and transfer it with a slotted spoon to a bowl. To the skillet add the chard, cook it, stirring, for 1 minute, or until any excess liquid is evaporated, and transfer it to the bowl. Let the chard mixture cool and stir in the Feta.",
        "Pat the lamb dry, arrange it, boned side up, on a work surface, and season it with salt and pepper. Spread the lamb evenly with the chard mixture, leaving a 1-inch border around the edges, beginning with a short side roll it up jelly-roll fashion, and tie it tightly with kitchen string. (The rolled and tied roast may look ungainly, but it will improve in appearance when cooked.)",
        "Transfer the lamb to a roasting pan and rub it all over with the remaining 1 tablespoon oil, 1 teaspoon of the rosemary, and salt and pepper to taste. Roast the lamb in the middle of a preheated 325°F. oven for 30 minutes, scatter the onion around it in the pan, and roast the lamb for 1 to 1 1/4 hours more (a total of 20 minutes cooking time for each pound of boneless meat), or until a meat thermometer registers 140°F. for medium-rare meat. Transfer the lamb to a cutting board and let it stand for 20 minutes.",
        "While the lamb is standing, skim the fat from the pan drippings, and set the roasting pan over moderately high heat. Add the wine, deglaze the pan, scraping up the brown bits, and boil the mixture until it is reduced by half. Strain the mixture through a fine sieve into a saucepan, add the broth, the remaining 1/2 teaspoon rosemary, the water, and any juices that have accumulated on the cutting board, and boil the mixture until it is reduced to about 2 cups. Stir the cornstarch mixture, add it to the wine mixture, whisking, and simmer the sauce for 2 minutes. Season the sauce with salt and pepper and keep it warm.",
        "Discard the strings from the lamb, arrange the lamb on a heated platter, and surround it with the quinoa timbales and clusters of the carrots. Strain the sauce into a heated sauceboat and serve it with the lamb, sliced."
    ],
    "ingredients": [
        "1 pound Swiss chard, the stems discarded and the leaves chopped coarse",
        "6 large garlic cloves, sliced thin lengthwise",
        "3 tablespoons olive oil",
        "1/4 pound Feta, crumbled (about 3/4 cup)",
        "an 8-pound leg of lamb, boned, butterflied, and trimmed well (4 to 5 pounds boneless)",
        "1 1/2 teaspoons crumbled dried rosemary, or to taste",
        "1 onion, sliced",
        "1 cup dry red wine",
        "1 1/2 cups beef broth",
        "1/2 cup water",
        "1 tablespoon cornstarch dissolved in 2 tablespoons cold water",
        "Spiced Quinoa Timbales and Honey-glazed Baby Carrots as accompaniments"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Vegetable",
        "Roast",
        "Easter",
        "High Fiber",
        "Feta",
        "Red Wine",
        "Chard",
        "Gourmet"
    ],
    "title": "Boneless Leg of Lamb Stuffed with Swiss Chard and Feta",
    "url": "http://www.epicurious.com/recipes/food/views/boneless-leg-of-lamb-stuffed-with-swiss-chard-and-feta-11738"
}
