{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 9-inch cake pans.",
        "Place the cake mix into a large mixing bowl. Pour the water into a 2-cup measure, and add enough Irish whiskey to total 1 1/3 cup of liquid (about 10 1/2 tablespoons). Reserve remaining whiskey. Beat the whiskey and water  mixture, vegetable oil, and eggs with an electric mixer on low speed just until cake mix is moistened; increase speed to medium, and beat until the batter is smooth, about 2 minutes. Pour batter into the prepared cake pans.",
        "Bake in the preheated oven until the cakes are golden brown and a toothpick inserted into the center of a cake comes out clean, 25 to 30 minutes.",
        "While the cake is baking, pour remaining Irish whiskey (about 1 1/2 tablespoon) into a saucepan, and stir in 1/4 cup of butter and 1/2 cup of sugar. Bring the mixture to a boil, stirring constantly, until sugar has dissolved; boil until slightly thickened, about 5 minutes.",
        "When cakes are done baking but still hot, poke holes all over the cakes (the end of a chopstick works well for this) and drizzle the whiskey syrup into the holes. Return the cakes to the oven, and bake for an additional 5 minutes.",
        "Remove cakes from oven, allow to cool in pans for 15 minutes, then remove from pans to finish cooling on wire racks.",
        "To make caramel sauce, mix the Irish stout beer with 1/2 cup of sugar in a saucepan over low heat. Simmer the mixture until thickened, about 40 minutes, stirring occasionally, and allow to cool.",
        "To make frosting, beat 1 cup of softened butter in a bowl with an electric mixer on medium speed until smooth, then gradually beat in confectioners' sugar, about 1/2 cup at a time. Beat in salt, then add the Irish cream liqueur, beating until the frosting is light and fluffy.",
        "To assemble the cake, place a layer onto a cake serving dish; pour the Irish stout caramel over the first layer, allowing the caramel to drip down the sides of the layer. Place the 2nd cake layer on top, and top with the buttercream, swirling the frosting into decorative waves. Do not frost sides of cake."
    ],
    "ingredients": [
        "1 (18.25 ounce) package French vanilla cake mix",
        "10 1/2 tablespoons water",
        "3/4 cup Irish whiskey, divided",
        "1/3 cup vegetable oil",
        "3 eggs",
        "1/4 cup butter",
        "1/2 cup white sugar",
        "1 (15 ounce) can dark Irish stout beer (such as Guinness®)",
        "1/2 cup white sugar",
        "1 cup butter, softened",
        "2 1/4 cups confectioners' sugar",
        "1/2 teaspoon salt",
        "1/4 cup Irish cream liqueur (such as Baileys®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Boozy Irish Cake",
    "url": "http://allrecipes.com/recipe/218743/boozy-irish-cake/"
}
