{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch baking pans.",
        "Mix flour, baking powder, and salt together in a bowl.",
        "Place white chocolate in a microwave-safe bowl; cook in microwave on high until melted, stirring between 30 second intervals, until smooth.",
        "Beat 1 1/4 cup butter and 2 1/4 cups sugar together in a large bowl until light and fluffy. Beat in 5 egg yolks, one at a time, until incorporated. Stir in melted white chocolate and 1 teaspoon vanilla extract until evenly mixed. Beat flour mixture into butter-white chocolate mixture, alternating with buttermilk, until just mixed.",
        "Beat the 5 egg whites in a separate bowl until stiff peaks form. Lift your beater or whisk straight up: the egg whites should form a sharp peak that holds its shape. Fold egg whites into the cake batter. Divide batter among the three prepared baking pans.",
        "Bake in the preheated oven until a toothpick inserted in the center of each cake comes out clean, 35 to 40 minutes. Cool cakes in pans for 10 minutes before transferring to wire rack to cool completely.",
        "Whisk 4 egg yolks, evaporated milk, and 1 1/2 teaspoons vanilla extract in a large saucepan until well blended. Add 1 1/2 cup white sugar and 3/4 cup butter; cook over medium heat until thickened and golden brown, stirring constantly, about 12 minutes. Remove from heat. Stir coconut and pecans into frosting mixture. Cool to room temperature.",
        "Place one cake on a serving plate. Spread a layer of coconut frosting on top of cake. Place second cake on top of frosting layer; spread with a layer of coconut frosting. Place last cake on top; frost top and sides of cake with remaining frosting."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "5 (1 ounce) squares white chocolate, chopped",
        "1 1/4 cups butter",
        "2 1/4 cups white sugar",
        "5 eggs, separated",
        "1 teaspoon vanilla extract",
        "1 1/4 cups buttermilk",
        "4 egg yolks",
        "1 (12 fluid ounce) can evaporated milk",
        "1 1/2 teaspoons vanilla extract",
        "1 1/2 cups white sugar",
        "3/4 cup butter",
        "1 (7 ounce) package sweetened flaked coconut",
        "1 1/2 cups chopped pecans"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bo's Best White German Chocolate Cake",
    "url": "http://allrecipes.com/recipe/223064/bos-best-white-german-chocolate-cake/"
}
