{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Grease and flour two 9 inch round cake pans. Sift the all-purpose flour, cake flour, baking powder and salt together and set aside.",
        "In a deep bowl cream 6 tablespoons of the butter with 3/4 cup sugar until light and fluffy. Beat in the 2 eggs, one at a time, then beat in the 1 teaspoon vanilla extract. Add the flour mixture alternately with the 1/2 cup of the milk in 3 additions, Beating the batter smooth after each addition. Divide the batter between the 2 prepared pans.",
        "Bake at 375 degrees F (190 degrees C) for 15 minutes or until cakes begin to shrink away from the sides of the pans and centers spring back when lightly touched. Turn the cakes onto wire racks to cool.",
        "To Make The Filling: Combine the 1/2 cup light cream with 1/4 cup of the  milk and cook over medium heat until bubbles begin to form around the edge of the pan. Immediately add 1/4 cup of the sugar and the salt, stirring until dissolved. Remove the pan from the heat.",
        "In a small bowl, combine 1/4 cup of the milk with the cornstarch and whisk to remove lumps. Whisk in the 2 eggs. Add the hot cream mixture in a thin stream, whisking constantly. Return to the mixture to the saucepan, bring to a boil, and cook over low heat, stirring constantly, until the custard thickens and is smooth (about 5 minutes). Remove from heat and stir in the 1/2 teaspoon vanilla and allow to cool to room temperature.",
        "To Make The Chocolate Frosting: In a heavy saucepan over low heat, stir the chocolate pieces and 2 tablespoons butter until they are completely melted. Remove from the heat and, stirring constantly, add the 1/4 cup light cream in a thin steady stream. When mixture is smooth, stir in the confectioners' sugar and beat  vigorously. Stir in the 1/2 teaspoon vanilla.",
        "To Assemble Cake: Spread the cooled filling over one the cooled cakes and place the second cake on top. Pour the chocolate frosting evenly over the top allowing it to spill down the sides."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=250&h=131&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F850122.jpg",
    "ingredients": [
        "6 tablespoons butter, softened",
        "2 tablespoons all-purpose flour",
        "1 ½ cups cake flour",
        "2 teaspoons baking powder",
        "¼ teaspoon salt",
        "¾ cup white sugar",
        "2  eggs",
        "1 teaspoon vanilla extract",
        "½ cup milk",
        "½ cup light cream",
        "½ cup milk",
        "¼ cup white sugar",
        "1 pinch salt",
        "4 teaspoons cornstarch",
        "2  eggs",
        "½ teaspoon vanilla extract",
        "3 (1 ounce) squares semisweet chocolate",
        "2 tablespoons butter",
        "¼ cup light cream",
        "½ teaspoon vanilla extract",
        "½ cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Boston Cream Pie I",
    "url": "http://allrecipes.com/recipe/8137/boston-cream-pie-i/"
}