{
    "directions": [
        "Preheat oven to 350 degrees. In a medium mixing bowl combine flour, sugar, baking powder, and salt. Make a well in the center of the flour mixture. Add milk, oil, egg yolks, and vanilla. Beat with an electric mixer on low to medium speed until combined. Beat an additional 3 minutes on high speed and set aside.",
        "In a large mixing bowl, beat egg whites and cream of tartar on medium to high speed until soft peaks form. Pour the egg yolk mixture over the egg white mixture and fold in. Gently pour the batter into a 9-inch greased pie pan. Bake for 25 to 30 minutes or until the top springs back when lightly touched. Invert the pan onto a wire rack. Cool completely.",
        "Pastry Cream Filling: In a medium saucepan, heat the milk and vanilla bean to a boil over medium heat. Immediately turn off the heat and set aside to infuse for 10 to 15 minutes. In a bowl, whisk the egg yolks and granulated sugar until light and fluffy. Add the cornstarch and whisk vigorously until no lumps remain. Whisk in 1/4 cup of the hot milk mixture until incorporated. Whisk in the remaining hot milk mixture, reserving the empty saucepan.",
        "Pour the mixture through a strainer back into the saucepan. Cook over medium-high heat, whisking constantly, until thickened and slowly boiling. Remove from the heat and stir in the butter. Let cool slightly. Cover with plastic wrap, lightly pressing the plastic against the surface to prevent a skin from forming. Chill at least 2 hours or until ready to serve. (The custard can be made up to 24 hours in advance. Refrigerate until 1 hour before using.)",
        "Ganache: In a medium bowl, pour the boiling cream over the chopped chocolate and stir until melted.",
        "To assemble pie, remove the cake from the pan. Cut the cake in half horizontally. Place bottom layer on a serving plate or board, and spread with the pastry cream. Top with second cake layer. Pour chocolate ganache over and down the sides of the cake. Store in refrigerator."
    ],
    "ingredients": [
        "1 cup heavy cream, boiling",
        "1 cup plus 2 tablespoons sifted cake flour",
        "2/3 cup sugar",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1/2 cup milk",
        "1/4 cup cooking oil",
        "2 egg yolks",
        "1 teaspoon vanilla",
        "2 egg whites",
        "1/4 teaspoon cream of tartar",
        "Pastry cream, recipe follows",
        "Ganache, recipe follows",
        "2 cups whole, 2 percent fat, or 1 percent fat milk",
        "1/2 vanilla bean, split lengthwise, seeds scraped out",
        "6 egg yolks",
        "2/3 cup granulated sugar",
        "1/4 cup cornstarch",
        "1 tablespoon unsalted butter",
        "8 ounces semisweet chocolate"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Baking",
        "Dessert",
        "Mixer Recipes",
        "American",
        "Boston Cream Pie",
        "Dairy Recipes"
    ],
    "title": "Boston Cream Pie",
    "url": "http://www.foodnetwork.com/recipes/boston-cream-pie-recipe0"
}
