{
    "directions": [
        "Preheat oven to 350°F. Cut two 6\" squares of foil. Coat insides of cans and one side of foil squares with 1 tablespoon butter. Stir milk and next 3 ingredients in a small saucepan over low heat until sugar dissolves and mixture is just warmed (do not boil). Whisk whole wheat flour and next 5 ingredients in a large bowl. Add milk mixture; whisk until smooth. Fold in raisins, if using. Divide batter between cans. Smooth tops.",
        "Cover cans with foil, butter side down. Secure foil with kitchen twine. Place cans foil side up in a deep roasting pan or a heavy shallow pot. Transfer pan to oven. Pour very hot water into pan to come about 3\" up sides of cans.",
        "Bake until a skewer inserted through foil into the center of each loaf comes out clean, about 1 1/2 hours. Transfer to a wire rack. Let cool for 10 minutes. Run a thin knife around edges of cans. Invert to release loaves onto rack. Let cool completely. DO AHEAD: Bread can be made 3 days ahead. Wrap tightly in plastic; store at room temperature.",
        "Slice bread. Serve with soft butter."
    ],
    "ingredients": [
        "1 tablespoon butter plus more for serving, room temperature",
        "2 cups whole milk",
        "1/2 cup mild-flavored (light) molasses",
        "1/4 cup (packed) light brown sugar",
        "1 teaspoon kosher salt",
        "1 1/4 cups whole wheat flour",
        "1 cup all-purpose flour",
        "1 cup rye flour",
        "1/3 cup cornmeal",
        "1 tablespoons baking soda",
        "1 teaspoon baking powder",
        "1 cup raisins (optional)",
        "Special equipment: Two empty, clean 11-13-ounce coffee cans",
        "Ingredient info: Rye flour is available at natural foods stores and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Milk/Cream",
        "Breakfast",
        "Brunch",
        "Side",
        "Bake",
        "Cornmeal",
        "Fall",
        "Molasses",
        "Whole Wheat",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Boston Brown Bread",
    "url": "http://www.epicurious.com/recipes/food/views/boston-brown-bread-51122630"
}
