{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Grease and flour 2 - 8 inch round cake pans and line bottoms with rounds of parchment paper. Sift together the cake flour, baking powder and salt; set aside.",
        "In a large bowl, cream together 1/2 cup butter and 1 cup sugar until light and fluffy. Add the eggs one at a time, beating well with each addition, then stir in 1 teaspoon vanilla. Add the flour mixture alternately with 3/4 cup milk. Mix only enough to blend thoroughly; do not overmix.",
        "Divide the batter between 2 - 8 inch pans. Bake in the preheated oven for 25 to 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.",
        "To make the Pastry Cream Filling:  In a small saucepan, heat 1 cup milk to the boiling point and remove from heat.  In a heatproof mixing bowl, beat 3 egg yolks until smooth. Gradually add 1/2 cup sugar and continue beating until pale yellow. Beat in 1/4 cup flour. Pour the hot milk into the egg yolk mixture in steady stream, beating constantly. When all the milk has been added, place the bowl over a pan of boiling water so that the bowl is not touching the water, or pour the mixture into the top of a double boiler. Heat, stirring constantly, until thickened. Cook 2 minutes more, then remove from the heat. Stir in 1 tablespoon butter and 1 teaspoon vanilla.  Let cool.",
        "To make the Glaze:  In the top of a double boiler, melt the chocolate with 2 tablespoons butter. When smooth, remove from the heat and beat in the confectioners sugar to make a thick paste.  Add 1/2 teaspoon vanilla.  Beat in a little of the hot water.  If the glaze does not have a spreadable consistency, add more water 1 teaspoon at a time.",
        "To assemble the cake, spread the cooled pastry cream over one of the cake layers. Place second cake layer over pastry cream and spread the chocolate glaze over the top using a metal spatula. Dust top with confectioners sugar. Refrigerate any leftover cake."
    ],
    "ingredients": [
        "2 cups cake flour",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup butter, softened",
        "1 cup white sugar",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "3/4 cup milk",
        "3 egg yolks",
        "Filling",
        "1 cup milk",
        "3 egg yolks",
        "1/2 cup granulated sugar",
        "1/4 cup all-purpose flour",
        "1 tablespoon butter",
        "1 teaspoon vanilla extract",
        "Chocolate Glaze",
        "1 (1 ounce) square unsweetened chocolate",
        "2 tablespoons butter or margarine",
        "1/2 cup confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "1 tablespoon hot water",
        "confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Boston Cream Pie III",
    "url": "http://allrecipes.com/recipe/17470/boston-cream-pie-iii/"
}
