{
    "directions": [
        "For Sponge Cake: Preheat oven to 350 degrees F.",
        "In two bowls, separate egg yolks, and whites. Add 1/2 of the sugar to each bowl. Beat both until peaked. When stiff, fold the whites into the yolk mixture. Gradually add flour, mixing with a wooden spatula. Mix in the butter. Pour this mixture into a 10 inch greased cake pan. Bake for about 20 minutes, or until spongy and golden. Remove from oven and allow to cool firmly.",
        "For Pastry Cream: In a saucepan bring the butter, milk, and light cream to a boil. While this mixture is cooking, combine the sugar, cornstarch, and eggs in a bowl and whip until ribbons form.",
        "When the cream, milk, butter mixture reaches the boiling point, whisk in the egg mixture and cook to boiling. Boil for 1 minute. Pour into a bowl and cover the surface with plastic warp. Chill overnight if possible. When chilled, whisk to smooth out and flavor with 1 teaspoon dark rum.",
        "For Chocolate Fondant Icing: Warm 6 ounces of fondant over boiling water to approximately 105 degrees. Add melted chocolate. Thin to spreading consistency with water.",
        "For White Fondant Icing: Warm 5 ounces of fondant over boiling water to approximately 105 degrees F. Thin with water if necessary. Place in a piping bag with a 1/8-inch tip.",
        "Chocolate Icing: Melt chocolate. Combine with warm water.",
        "White Icing: Combine ingredients and warm to approximately 105 degree F. Adjust the consistency with water. It should flow freely from the pastry bag.",
        "To Finish: Level the sponge cake off at the top using a slicing knife. Cut the cake into 2 layers. Spread the pastry cream over 1 layer. Top with the second cake layer. Reserve a small amount of the pastry cream to spread on sides, to let the almond stick. Spread a thin layer of chocolate fondant icing on the top of the cake. Follow immediately with spiral lines starting from the center of the cake, using the white fondant in the pastry bag. Score the white lines with the point of a paring knife, starting at the center and pulling outward to the edge. Spread sides of the cake with a thin coating of the reserved pastry cream. Press on toasted almonds."
    ],
    "ingredients": [
        "7 eggs, separated",
        "8 ounces sugar",
        "1 cup flour",
        "1 ounce melted butter",
        "1 tablespoon butter",
        "2 cups milk",
        "2 cups light cream",
        "1/2 cup sugar",
        "3 1/2 tablespoons cornstarch",
        "6 eggs",
        "1 teaspoon dark rum",
        "6 ounces fondant",
        "3 ounces semisweet chocolate, melted",
        "5 ounces fondant",
        "6 ounces semisweet chocolate, melted",
        "2 ounces warm water",
        "1 cup confectioners' sugar",
        "1 teaspoon corn syrup",
        "1 tablespoon water",
        "4 ounces toasted almonds"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Chocolate Pie",
        "Pie Recipes",
        "Baking",
        "Dessert",
        "American",
        "Frosting Recipes",
        "Boston Cream Pie",
        "Egg Recipes",
        "Nut Recipes",
        "Dairy Recipes",
        "Recipes for Parties",
        "Birthday Party"
    ],
    "title": "Boston Cream Pie",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/boston-cream-pie-recipe"
}
