{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9 inch round cake pan.",
        "Beat the flour, 1 cup sugar, baking powder, salt, 3/4 cup milk, shortening, 1 egg, and 1 teaspoon vanilla at low speed, scraping bowl constantly for 30 seconds. Beat on high speed, scraping bowl occasionally for 3 minutes. Pour batter into the prepared pan.",
        "Bake at 350 degrees F (175 degrees C) for 30 to 35 minutes or until a wooden pick inserted near the center comes out clean. Remove from the pan and let cool on a wire rack.",
        "To Make The Cream Filling: In a 2 quart saucepan, mix 1/3 cup of the sugar, the cornstarch and salt. Stir in the milk gradually and cook over medium heat, stirring constantly, until the mixture thickens and boils. Boil and stir 1 minute. Stir at least 1/2 of the mixture slowly into the egg yolks. Return egg yolk mixture to the saucepan and boil and stir for 1 minute. Remove from heat and stir in the 2 teaspoons vanilla. Let cool to room temperature.",
        "To Make Chocolate Glaze: Heat the chocolate and butter or margarine over low heat until melted. Remove from the heat and stir in the confectioners' sugar, and vanilla. Stir in the water, one teaspoon at a time, until glaze is of desired consistency.",
        "To Assemble the Cake: Split the cooled cake in half to make 2 thin layers. Fill the layers with the filling. Then spread the chocolate glaze over the top. Refrigerate any leftover cake."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1 cup white sugar",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "3/4 cup milk",
        "1/3 cup shortening",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1/3 cup white sugar",
        "2 tablespoons cornstarch",
        "1/8 teaspoon salt",
        "1 1/2 cups milk",
        "2 egg yolks",
        "2 teaspoons vanilla extract",
        "2 (1 ounce) squares unsweetened chocolate",
        "3 tablespoons butter",
        "1 cup confectioners' sugar",
        "3/4 teaspoon vanilla extract",
        "2 tablespoons hot water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Boston Cream Pie II",
    "url": "http://allrecipes.com/recipe/8138/boston-cream-pie-ii/"
}
