{
    "directions": [
        "Combine first 9 ingredients in heavy medium saucepan. Add 3 shallots. Bring to simmer. Remove from heat, cover and let stand 30 minutes. Chill overnight.",
        "Preheat oven to 325°F. Line 7-cup pâté or bread pan with plastic wrap. Melt butter in heavy small skillet over low heat. Add remaining 5 shallots. Cover and cook until very soft, stirring occasionally, about 15 minutes. Transfer to processor. Add pork, eggs, flour and Port and puree. Strain cream mixture, pressing on solids to extract as much liquid as possible. With processor running, add cream through feed tube and process just until combined with pork. Transfer to large bowl. Mix in currants.",
        "Spoon mixture into prepared pan. Cover with foil. Place pan in large pan. Add boiling water to larger pan to within 1/2 inch of top of terrine. Bake until terrine begins to shrink from sides of pan and knife inserted into center comes out clean, about 1 1/2 hours. Uncover and cool on rack. Chill until cold. (Can be made 3 days ahead. Cover and chill.)",
        "Line platter with lettuce. Arrange terrine atop. Sprinkle with pepper and parsley. Garnish with bay leaves. Spoon confit around sides. Serve with bread.",
        "Heat oil in heavy large skillet over medium-high heat. Add onions and sauté until crisp-tender, about 8 minutes. Add all remaining ingredients and stir until reduced to thick glaze, about 4 minutes. Season with salt and pepper. (Can be prepared 2 days ahead. Cover and chill.) Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups whipping cream",
        "2 medium onions, chopped",
        "5 teaspoons salt",
        "3 bay leaves",
        "3 whole cloves",
        "1 large garlic clove, crushed",
        "1 teaspoon pepper",
        "1/8 teaspoon ground nutmeg",
        "Pinch of dried thyme, crumbled",
        "8 large shallots, minced",
        "1 tablespoon butter",
        "1 pound trimmed boneless center pork loin, sinew removed cut into 1-inch chunks, well chilled",
        "3 eggs",
        "6 tablespoon all purpose flour",
        "1/4 cup tawny Port",
        "3 tablespoons dried currants, minced",
        "Lettuce leaves",
        "Cracked peppercorns",
        "Minced fresh parsley",
        "Bay leaves",
        "French bread baguette slices",
        "3 tablespoons olive oil",
        "2 large red onions, halved, sliced",
        "3 tablespoons dried currants",
        "3 tablespoons red wine vinegar",
        "1 tablespoons canned chicken broth",
        "2 teaspoons chopped fresh thyme or 3/4 teaspoon dried, crumbled",
        "1/2 teaspoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Onion",
        "Pork",
        "Bake",
        "Bastille Day",
        "New Year's Eve",
        "Dried Fruit",
        "Port",
        "Winter",
        "Chill"
    ],
    "title": "Boudin Blanc Terrine with Red Onion Confit",
    "url": "http://www.epicurious.com/recipes/food/views/boudin-blanc-terrine-with-red-onion-confit-1085"
}
