{
    "directions": [
        "Bring salt, sugar, and 2 quarts water to a boil in a large pot, stirring to dissolve salt and sugar. Let cool, then add wine, if using. Place turkey and brine in a large resealable plastic bag. Seal bag and chill 10–12 hours.",
        "Remove turkey from brine and pat dry",
        "Let sit at room temperature 1 hour.",
        "Soak breadcrumbs in cream in a small bowl 20 minutes.",
        "Meanwhile, bring broth, chestnuts, Cognac, bay leaves, and a pinch of salt to a low simmer in a small saucepan. Cook until chestnuts are very soft but not falling apart and liquid is reduced by half, 12–15 minutes. Discard bay leaves; chill while preparing spices.",
        "Toast mustard seeds, coriander, allspice, and clove in a small skillet over medium heat until fragrant and mustard seeds begin to pop, about 4 minutes; let cool. Finely grind toasted spices and peppercorns in spice mill or with mortar and pestle.",
        "Mix pork, thyme, mace, nutmeg, spice mixture, breadcrumb mixture, and 1 teaspoon salt in a large bowl. Coarsely chop chestnuts and add to pork mixture, along with cooled cooking liquid. Stir pork mixture to combine.",
        "DO AHEAD: Boudin blanc can be made 2 days ahead. Wrap tightly and chill.",
        "Preheat oven to 400°F. Working 1 at a time, place turkey breast on cutting board, skin side up. Holding knife parallel to work surface, cut through breast, stopping about 1/2\" before you get all the way through. Open breast like a book and mound boudin blanc down center, leaving a 1\" border. Fold bottom half of breast over filling, then fold top half over so it slightly overlaps. Tie at 1\" intervals with kitchen twine.",
        "Place turkey breasts on a rack set inside a roasting pan. Add 1 cup water and roast until skin is golden brown and an instantread thermometer inserted into the center of stuffing registers 145°F (breast meat should register 160°F), 1–1 1/2 hours. Let rest 10 minutes before slicing.",
        "Meanwhile, heat butter in a medium skillet over medium-high heat. Add chestnuts and thyme sprigs and cook, stirring often, until chestnuts are soft, 5–7 minutes; season with salt and pepper. Serve turkey with chestnuts.",
        "DO AHEAD: Breasts can be stuffed 1 day ahead. Cover and chill."
    ],
    "ingredients": [
        "1/2 cup kosher salt",
        "1/4 cup sugar",
        "1/4 cup sweet white wine (optional)",
        "2 skin-on, boneless turkey breasts (about 4 pounds total)",
        "2 tablespoons coarse fresh breadcrumbs",
        "1/2 cup heavy cream",
        "1 cup low-sodium chicken broth",
        "1/2 cup roasted chestnuts from a jar",
        "1 tablespoon Cognac or brandy",
        "2 bay leaves",
        "1 teaspoon kosher salt, plus more",
        "1 teaspoon yellow mustard seeds",
        "3/4 teaspoons coriander seeds",
        "1 whole allspice",
        "1 whole clove",
        "3/4 teaspoons white peppercorns",
        "1 pound ground pork belly or 3/4 pound ground pork and 1/4 pound finely chopped bacon",
        "1 tablespoon finely chopped fresh thyme",
        "1/8 teaspoon ground mace",
        "1/8 teaspoon ground nutmeg",
        "1/4 cup (1/2 stick) unsalted butter",
        "2 cups roasted chestnuts from a jar",
        "4 sprigs thyme",
        "Kosher salt, freshly ground pepper",
        "Special equipment: A spice mill or mortar and pestle",
        "Ingredient info: Roasted chestnuts can be found at specialty foods stores and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Dinner",
        "Buffet",
        "Chestnut",
        "Mortar and Pestle",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Boudin Blanc-Stuffed Turkey Breasts with Chestnuts",
    "url": "http://www.epicurious.com/recipes/food/views/boudin-blanc-stuffed-turkey-breasts-with-chestnuts-51205440"
}
