{
    "directions": [
        "Put oven rack in middle position and preheat oven to 250°F.",
        "Arrange bread slices in 1 layer in a shallow baking pan and brush both sides with oil. Bake until crisp, about 30 minutes. Rub 1 side of each toast with a cut side of garlic.",
        "Plunge lobster headfirst into a 6- to 8-quart pot of boiling water, then cook, covered, 2 minutes from time lobster enters water. Transfer lobster with tongs to a colander and let stand until cool enough to handle. Discard hot water in pot. Put lobster in a shallow baking pan. Twist off claws with knuckles from body, then crack claws with a mallet or rolling pin and separate claws from knuckles. Halve body and tail lengthwise through shell with kitchen shears, then cut crosswise through shell into 2-inch pieces. Reserve lobster juices that accumulate in baking pan.",
        "Cook tomatoes, onion, and garlic in oil in cleaned 6- to 8-quart pot over moderate heat, stirring occasionally, until onion is softened, 5 to 7 minutes. Meanwhile, peel potatoes and cut into 1/2-inch cubes. Stir potatoes into tomatoes with fennel fronds, bay leaf, saffron, sea salt, and pepper. Add stock and bring to a boil, then reduce heat and simmer, covered, until potatoes are almost tender, 8 to 10 minutes.",
        "Add thicker pieces of fish and cockles to soup and simmer, covered, 2 minutes. Stir in mussels, shrimp, lobster, including juices, and remaining fish and simmer, covered, until they are just cooked through and mussels open wide, about 5 minutes.",
        "Stir 3 tablespoons broth from soup into rouille until blended.",
        "Arrange 2 croutons in each of 6 to 8 deep soup bowls. Carefully transfer fish and shellfish from soup to croutons with a slotted spoon, then ladle some broth with vegetables over seafood.",
        "Top each serving with 1 teaspoon rouille and serve remainder on the side."
    ],
    "ingredients": [
        "12 to 16 (1/2-inch-thick) baguette slices",
        "3 tablespoons extra-virgin olive oil",
        "1 garlic clove, halved",
        "1 (1- to 1 1/4 -lb) live lobster",
        "2 large tomatoes, peeled and coarsely chopped",
        "1 large onion, chopped",
        "4 garlic cloves, chopped",
        "1/2 cup extra-virgin olive oil",
        "1 lb boiling potatoes",
        "1/3 cup finely chopped fennel fronds (sometimes called anise)",
        "1 Turkish or 1/2 California bay leaf",
        "1/4 teaspoon crumbled saffron threads",
        "1 1/2 tablespoons coarse sea salt",
        "1/2 teaspoon black pepper",
        "9 cups white fish stock (or store-bought)",
        "3 pounds white fish fillets (such as monkfish, turbot, red snapper, striped bass, porgy, grouper, and/or cod), cut into 2-inch pieces",
        "1/2 pound cockles or small hard-shelled clams, scrubbed",
        "1/2 pound cultivated mussels, scrubbed and any beards removed",
        "1/2 pound large shrimp in shells",
        "Rouille"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Garlic",
        "Onion",
        "Potato",
        "Shellfish",
        "Tomato",
        "Bake",
        "Gourmet"
    ],
    "title": "Bouillabaisse",
    "url": "http://www.epicurious.com/recipes/food/views/bouillabaisse-238411"
}
