{
    "directions": [
        "Lightly beat yolks in a medium bowl.",
        "Whisk together 3/4 cup brown sugar, cornstarch, and salt in a small heavy saucepan. Slowly whisk in milk, then boil over medium heat, whisking constantly, until pudding is thick, about 3 minutes. Gradually add hot pudding to yolks, whisking constantly, then whisk in bourbon and vanilla.",
        "Cover surface with wax paper and chill until cold, about 2 hours.",
        "Preheat oven to 350°F with rack in middle.",
        "Warm remaining 2 tablespoons brown sugar with honey and water in a small saucepan, stirring until sugar has dissolved. Stir in pecans, tossing to coat, then transfer to a lightly oiled 4-sided sheet pan.",
        "Bake, stirring occasionally, until golden brown and shiny, about 15 minutes. Transfer pecans with a metal spatula to a rack to cool. Coarsely chop, reserving 4 halves for garnish.",
        "Preheat oven to 400°F with rack in middle. Butter and flour cake pan. Warm eggs (in shell) in hot water 5 minutes.",
        "Whisk together flour and salt.",
        "Beat eggs, 1/3 cup sugar, and vanilla with an electric mixer at high speed until tripled in volume and thick enough to form a wide flat ribbon that holds its shape on top of batter when beater is lifted, 7 to 8 minutes in a stand mixer or 14 to 16 with a handheld.",
        "Transfer to a wide bowl. Sift flour mixture, one third at a time, over batter, folding gently but thoroughly with a rubber spatula after each addition. Stir together butter and about 1/4 cup batter in a small bowl until combined, then fold butter mixture into batter gently but thoroughly.",
        "Pour batter into cake pan and smooth top. Bake until golden brown and edges start to pull away from sides of pan, 12 to 14 minutes.",
        "Meanwhile, bring bourbon, water, and remaining tablespoon sugar to a boil, stirring until sugar has dissolved. Remove from heat.",
        "Transfer cake in pan to a rack, then run a thin knife between cake and side of pan and cool 5 minutes. Invert cake onto rack.",
        "Cut off one third of cake, reserving for another use. Brush remaining cake with half of bourbon syrup. Carefully turn cake right side up and brush with remaining syrup. Cool completely, about 30 minutes.",
        "Cut cake into 1 1/2-inch squares. Thinly slice bananas.",
        "In 4 bowls or 10-oz glasses make 2 layers each of pudding, bananas, cake (use all of it), and chopped pecans, then top with a third layer of pudding, bananas, and chopped pecans.",
        "Chill, loosely covered, 1 hour. Let stand at room temperature 20 minutes before serving.",
        "Whip cream with sugar until it holds soft peaks, then dollop on top of each dessert. Garnish with reserved pecan halves."
    ],
    "ingredients": [
        "3 large egg yolks",
        "3/4 cup plus 2 tablespoon packed light brown sugar, divided",
        "3 1/2 tablespoons cornstarch",
        "1/4 teaspoon salt",
        "3 cups whole milk",
        "5 teaspoons bourbon",
        "1 teaspoon pure vanilla extract",
        "1 1/2 teaspoon mild honey",
        "1 1/2 teaspoon water",
        "3/4 cup pecan halves",
        "3 large eggs",
        "1/2 cup plus 2 tablespoon sifted cake flour (not self-rising; sift before measuring)",
        "1/4 teaspoon salt",
        "1/3 cup plus 1 tablespoon granulated sugar, divided",
        "1/2 teaspoon pure vanilla extract",
        "2 1/2 tablespoons unsalted butter",
        "1/4 cup bourbon",
        "1/4 cup water",
        "3 ripe medium bananas",
        "1/2 cup heavy cream",
        "1 teaspoon granulated sugar",
        "Equipment: a 9-inch square cake pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Mixer",
        "Dessert",
        "Bake",
        "Mardi Gras",
        "Kentucky Derby",
        "Banana",
        "Pecan",
        "Chill",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Bourbon Banana Pudding with Glazed Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/bourbon-banana-pudding-with-glazed-pecans-351912"
}
