{
    "directions": [
        "Melt butter in heavy large saucepan over medium-high heat. Add onion and garlic; sauté until golden, about 5 minutes. Add 3/4 cup bourbon; boil until most of liquid is absorbed, 6 to 8 minutes. Whisk in 1/4 cup bourbon, ketchup, hot pepper sauce, tomato paste, and brown sugar. Bring to boil. Reduce heat and simmer until sauce thickens slightly, stirring occasionally, about 10 minutes. Season marinade with salt and pepper. Remove marinade from heat; cool to room temperature.",
        "Place chicken drumettes in 15 x 10 x 2-inch glass baking dish. Pour marinade over and turn drumettes to coat. Cover and refrigerate overnight.",
        "Preheat oven to 375°F. Line baking sheet with foil or parchment paper. Place cooling rack atop prepared baking sheet. Arrange drumettes on rack, spacing slightly apart. Spread any remaining marinade from dish over drumettes. Sprinkle with salt and pepper. Bake drumettes (still on cooling rack) until cooked through and brown in spots, about 45 minutes. Transfer drumettes to serving platter. Serve Blue Cheese Dipping Sauce alongside."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter",
        "1 cup chopped onion",
        "3 garlic cloves, peeled, thinly sliced",
        "1 cup bourbon, divided",
        "1 cup ketchup",
        "1/2 cup hot pepper sauce (such as Crystal)",
        "1/4 cup tomato paste",
        "3 tablespoons (packed) golden brown sugar",
        "30 chicken drumettes (about 4 pounds)",
        "Blue Cheese Dipping Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Chicken",
        "Garlic",
        "Onion",
        "Bake",
        "Super Bowl",
        "Blue Cheese",
        "Poker/Game Night",
        "Chill",
        "Party"
    ],
    "title": "Bourbon-Glazed Chicken Drumettes with Blue Cheese Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/bourbon-glazed-chicken-drumettes-with-blue-cheese-dipping-sauce-357292"
}
