{
    "directions": [
        "Mix salt, pepper, granulated sugar, and paprika in a small bowl. Arrange turkey on a cutting board breast side up. Remove legs (keeping thigh and drumstick intact) by slicing through the skin that joins breast and leg, then bend leg down to expose joint and cut completely through the joint. Try to leave as much skin on breast as possible. Place legs on a large rimmed baking sheet. Set aside neck and giblets in cavity for making gravy. Arrange turkey on baking sheet with legs and generously sprinkle legs and turkey all over with dry brine, patting to adhere. Chill, uncovered, at least 12 hours and up to 2 days.",
        "Wipe off turkey legs (do not rinse) and place in the smallest heavy pot that will accommodate legs in a single layer (it’s okay if they overlap slightly). Add garlic and rosemary. Pour in oil just to barely cover legs. Heat over medium until a few bubbles begin to appear. Cover, reduce heat, and very gently simmer until meat is tender (the meat on the drumstick will have pulled away from the bone), 3–3 1/2 hours. Let turkey thighs cool in oil until just warm, about 2 hours. Chill at least 2 hours but preferably longer. Meat will firm up the colder it gets, making it less likely to fall apart when glazing.",
        "Preheat oven to 425°F. Place turkey on a wire rack set inside a large rimmed baking sheet. Roast, rotating baking sheet once, until golden brown all over, 35–40 minutes.",
        "Meanwhile, bring brown sugar, bourbon, soy sauce, butter, and paprika to a simmer in a small saucepan over medium heat, stirring occasionally, until reduced by about half and thick enough to coat a spoon but not syrupy, 6–8 minutes. Reduce heat to very low and keep glaze warm until ready to use.",
        "Reduce oven temperature to 325°F and roast turkey until an instant-read thermometer inserted into the thickest part of breast registers 100°F–110°F. Then roast, basting every 10 minutes or so, making sure to lightly coat the entire breast each time (but save some glaze for the legs) and rotating baking sheet occasionally, until thermometer registers 150°F, 60–75 minutes total after reducing oven temperature to 325°F. Transfer breast to a cutting board and let rest at least 30 minutes before carving.",
        "Increase oven temperature back to 425°F. Remove turkey legs from oil, wiping off excess, and place on a clean rimmed baking sheet; discard or chill cooking oil (skim off juices and use them in gravy; use oil for cassoulet or another confit).",
        "Carefully move a rack to upper third of oven and roast legs until skin is golden brown and fat is rendered, 15–20 minutes. Then roast, basting every 3 minutes or so with remaining glaze, until legs are well coated, 10–12 minutes. Arrange on a platter with sliced breast for serving.",
        "Legs can be cooked 1 day ahead. Keep chilled in oil."
    ],
    "ingredients": [
        "6 tablespoons kosher salt",
        "4 tablespoons black peppercorns, medium ground",
        "1 tablespoon granulated sugar",
        "1 tablespoon paprika",
        "1 (12–14-pound) turkey",
        "1 head of garlic, cut in half crosswise",
        "2 sprigs rosemary",
        "Olive oil (for cooking; 5–7 cups)",
        "1/2 cup (packed) light brown sugar",
        "1/2 cup bourbon",
        "2 tablespoons soy sauce",
        "2 tablespoons unsalted butter",
        "1 teaspoon paprika"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Thanksgiving",
        "turkey",
        "Bourbon",
        "Garlic",
        "Rosemary",
        "Roast",
        "Dinner",
        "Poultry"
    ],
    "title": "Bourbon and Brown Sugar Glazed Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/bourbon-and-brown-sugar-glazed-turkey"
}
