{
    "directions": [
        "Combine all the ingredients for the dry rub in a small bowl and mix together well.",
        "Tear a large enough piece of Reynolds Wrap(R) Aluminum Foil to place rack of ribs on it and be able to fully cover, meat side up. Evenly coat both sides of the ribs with the dry rub, pressing it in with your hands.",
        "Fold up the sides of the foil to create a rim, and pour the apple juice in around the ribs.  Fold the foil over the ribs and crimp it to create a tight seal. Tear off one more piece of large foil and wrap the whole thing again to ensure a tight seal.",
        "Place the wrapped ribs in the fridge to marinate for 2 hours.",
        "Preheat oven to 225 degrees F and cook ribs for about 4 hours. You should be able to easily pierce them with a fork, but they shouldn't be falling off the bone.",
        "Combine all the BBQ sauce ingredients in a medium saucepan and bring to a boil over medium heat. Reduce to a simmer and allow the sauce to thicken and reduce by about a third, stirring occasionally.",
        "Preheat grill to high heat. Cover the grill rack with Reynolds Wrap(R) Aluminum Foil. Place the cooked ribs meat side up on the grill and brush the top with a layer of sauce. Close grill until the sauce is mostly dried, about 5 minutes. Brush another layer of sauce on top and close grill for an additional 5 minutes. Remove ribs from grill and lightly brush with one more layer of sauce.",
        "Cut the ribs into individual pieces and serve with extra sauce."
    ],
    "ingredients": [
        "1 rack baby back pork ribs, outer membrane removed",
        "4 ounces apple juice",
        "Reynolds Wrap® Aluminum Foil",
        "Dry Rub:",
        "2 tablespoons brown sugar",
        "1 tablespoon sea salt",
        "1 tablespoon freshly cracked black pepper",
        "1/4 tablespoon garlic powder",
        "1/4 tablespoon onion powder",
        "1/4 tablespoon ground coriander",
        "1/4 tablespoon dry mustard",
        "1/8 tablespoon cayenne pepper",
        "Bourbon-BBQ Sauce:",
        "1/2 cup ketchup",
        "1/4 cup bourbon whiskey",
        "2 tablespoons apple cider vinegar",
        "1 tablespoon Worcestershire sauce",
        "1/2 tablespoon Dijon mustard",
        "1 1/2 tablespoons brown sugar",
        "1 tablespoon molasses",
        "1 clove garlic, finely minced",
        "1/2 tablespoon soy sauce",
        "1 teaspoon onion powder",
        "1 teaspoon freshly cracked black pepper",
        "1 pinch sea salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bourbon-BBQ Glazed Baby Back Ribs",
    "url": "http://allrecipes.com/recipe/247440/bourbon-bbq-glazed-baby-back-ribs/"
}
