{
    "directions": [
        "Bring a large pot of water to a boil. Cook the pasta according to the package directions. Drain and set aside.",
        "Slice the chicken into thin strips and season with salt and pepper. Heat the butter and oil in a large skillet over medium-high heat. Add the chicken strips and cook until deep golden brown on both sides and done in the middle. Remove the chicken from the skillet and add the minced garlic. Cook the garlic for 1 minute, then pour in the broth. Let it bubble up and reduce for 1 1/2 to 2 minutes.",
        "Next, add the half-and-half, cream and some salt and pepper. Add the Parmesan, whisking constantly until it's all combined. Allow the liquid to heat up and thicken for a few minutes. If it gets too thick, you may thin it with a little chicken broth.",
        "When the sauce looks good, remove it from the heat. Return the cooked chicken to the skillet along with the grape tomatoes, spinach and pasta. Toss, taste, adjust the seasoning, top with minced parsley and serve immediately in the skillet!"
    ],
    "ingredients": [
        "12 ounces bow-tie pasta (farfalle)",
        "2 boneless, skinless chicken breasts",
        "Salt and freshly ground black pepper",
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "2 cloves garlic, minced",
        "1/2 cup low-sodium chicken broth, plus more if needed for thinning",
        "1/2 cup half-and-half",
        "1/4 cup heavy cream",
        "1 cup good-quality grated Parmesan",
        "1 cup halved grape tomatoes",
        "4 ounces baby spinach",
        "2 tablespoons fresh parsley, minced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pasta Recipes",
        "Alfredo",
        "Spinach",
        "Vegetable",
        "Chicken",
        "Poultry Recipes",
        "Cheese",
        "Parmesan Cheese Recipes",
        "Main Dish Recipes"
    ],
    "title": "Bow-Tie Skillet Alfredo",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/bow-tie-skillet-alfredo"
}
