{
    "directions": [
        "Bring 1 1/4 cups cream, half and half and sugar to simmer in heavy large saucepan, stirring occasionally. Whisk yolks in large bowl to blend. gradually whisk in cream mixture. Return mixture to saucepan. Stir over medium-low heat until mixture thickens and leaves path on back of spoon when finger is drawn across, about 4 minutes; do not boil. Strain mixture into bowl. Mix in remaining 1 cup whipping cream, lemon juice and peel. Refrigerate until cold. Transfer mixture to ice cream maker and freeze according to manufacturer's instruction. Transfer ice cream to container and freeze.",
        "Stir 1 1/4 cups sugar and 1/2 cup water in heavy medium saucepan over low heat until sugar dissolves. Puree 2 bags berries with sugar syrup in processor. Strain through coarse sieve into bowl, pressing firmly on seeds. Chill until cold. Transfer mixture to ice cream maker and freeze according to manufacturer's instructions.",
        "Carefully line 12-cup ring mold with foil, pressing as smoothly as possible to eliminate wrinkles and extending over sides. Fill prepared ring mold alternately with 1/3-cup scoops sorbet and 1/3-cup scoops ice cream. Freeze 1 hour. Cover bombe with plastic. Press down firmly to pack. Freeze bombe overnight. (Can be prepared 1 week ahead.)",
        "Puree remaining 1 bag of berries with remaining 1/3 cup sugar and 1/4 cup water in processor. Strain through coarse sieve into bowl, pressing firmly on seeds. Cover sauce and chill until cold. (Can be prepared 2 days ahead.)",
        "Place round platter in freezer 30 minutes. Lift bombe from mold using foil as aid. Invert bombe onto platter; peel off foil. Mound some berries in center of bombe. Arrange more berries around sides. Garnish top and sides with mint. Cut into slices and arrange on plates. Spoon sauce and berries around each. Serve with cookies."
    ],
    "ingredients": [
        "2 1/4 cups whipping cream",
        "1 cup half and half",
        "3/4 cup sugar",
        "6 egg yolks",
        "1/2 cup fresh lemon juice",
        "2 tablespoons finely grated lemon peel",
        "1 1/4 cups plus 1/3 sugar",
        "3/4 cup water",
        "3 16-ounce bags frozen unsweetened boysenberries or blackberries, thawed",
        "4 cups fresh boysenberries, blackberries and/or raspberries",
        "Fresh mint leaves",
        "Assorted cookies (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Citrus",
        "Dairy",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Fall"
    ],
    "title": "Boysenberry Sorbet and Lemon Ice Cream Bombe",
    "url": "http://www.epicurious.com/recipes/food/views/boysenberry-sorbet-and-lemon-ice-cream-bombe-581"
}
