{
    "directions": [
        "Slice enough onion and chop enough carrot to measure 1/4 cup each. In a 1 1/2- to 2-quart saucepan cook onions and carrots in 1 tablespoon oil over moderate heat 2 to 3 minutes, or until softened but not browned. Add wine, thyme, bay leaf, and pepper and simmer 3 minutes. Transfer mixture to a bowl and cool. In a heavy-duty sealable plastic bag combine ribs and wine mixture. Marinate ribs, chilled, turning them occasionally, at least 8 hours and up to 1 day.",
        "Preheat oven to 300°F.",
        "Remove ribs from marinade and pat dry. Pour marinade through a sieve into a small saucepan and discard solids. Bring marinade to a boil, skimming froth, and remove pan from heat.",
        "Season ribs well with salt and pepper and lightly dust with flour. In a heavy ovenproof skillet or flameproof casserole large enough to hold ribs in one layer heat remaining 1/4 cup oil over moderately high heat until it just begins to give off a faint white smoke. Brown ribs, turning them occasionally, and transfer to a plate. Pour off oil from skillet or casserole and add ribs and stock",
        ". Pour marinade through a fine sieve into skillet or casserole and bring liquid to a simmer. Cover skillet or casserole with foil or a lid and braise ribs in middle of oven (add water after 3‚ hours if most of braising liquid is evaporated) 4 hours, or until meat gives no resistance when pierced with a fork. Pour braising liquid through a sieve into a bowl and skim fat.",
        "Serve short ribs with braising liquid and vegetable ragout."
    ],
    "ingredients": [
        "1 small onion",
        "1 medium carrot",
        "1/4 cup plus 1 tablespoon vegetable oil",
        "1 cup dry red wine",
        "3 thyme sprigs",
        "1 Turkish bay leaf or 1/4 California bay leaf",
        "1/2 teaspoon cracked black pepper",
        "four 3/4-pound beef short ribs (sometimes called Flanken)",
        "all-purpose flour for dusting ribs",
        "2 cups veal stock (16 fluid ounces)",
        "1/2 cup water if necessary",
        "Accompaniment: root vegetable ragout"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Vegetable",
        "Braise",
        "Marinate",
        "Red Wine",
        "Winter",
        "Thyme",
        "Gourmet"
    ],
    "title": "Braised Beef Short Ribs with Root Vegetable Ragoût",
    "url": "http://www.epicurious.com/recipes/food/views/braised-beef-short-ribs-with-root-vegetable-ragout-100597"
}
