{
    "directions": [
        "Sprinkle lamb shanks generously with salt and pepper; dust with flour. Heat oil in heavy large deep pot over medium-high heat. Working in 2 batches, if necessary, add lamb to pot and cook until browned on all sides, turning often, about 10 minutes per batch. Transfer lamb to large bowl. Add onions, carrots, and celery to same pot; sauté until vegetables begin to soften, about 10 minutes. Add garlic and tomato paste; stir 1 minute. Stir in broth, wine, parsley, thyme, and bay leaves. Return lamb to pot; bring to boil (liquid may not cover lamb completely). Reduce heat to medium-low; cover and simmer until lamb is very tender and begins to fall off bones, turning occasionally, about 3 hours.",
        "Using tongs, transfer lamb to platter. Discard bay leaves and parsley sprigs. Spoon off fat from surface of pan juices; discard. Using immersion blender, puree pan juices until almost smooth. Season with salt and pepper. Return lamb shanks to pan juices. DO AHEAD: Can be made 1 day ahead. Cool slightly. Chill uncovered until cold, then cover and keep chilled.",
        "Mix all ingredients in small bowl. DO AHEAD: Can be made 2 hours ahead. Cover and chill.",
        "Bring large pot of salted water to boil. Add potatoes; cook until tender, about 18 minutes. Using slotted spoon, transfer potatoes to medium bowl. Add carrots to same pot; cook until tender, about 5 minutes. Using slotted spoon, transfer carrots to bowl with potatoes. Add sugar snap peas to same pot; cook 1 minute. Drain. Add to bowl with potatoes and carrots. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Bring lamb and pan juices to simmer over medium heat until heated through.",
        "Meanwhile, melt butter in large nonstick skillet over medium-high heat. Add all vegetables; sauté about 5 minutes. Season with salt and pepper.",
        "Transfer lamb and pan juices to large platter or bowl. Surround with vegetables; scatter pea tendrils over vegetables. Sprinkle lamb with gremolata and serve.",
        "Green garlic has a more delicate flavor than mature garlic. The tops of green garlic look like green onions; the root ends are white and light purple. Look for green garlic at farmers' markets during the spring months."
    ],
    "ingredients": [
        "6 1-to 1 1/4-pound lamb shanks",
        "All purpose flour",
        "2 tablespoons extra-virgin olive oil",
        "3 cups finely chopped onions (about 2 medium)",
        "2 cups finely chopped peeled carrots",
        "1 1/4 cups finely chopped celery",
        "3 garlic cloves, minced",
        "1 tablespoon (generous) tomato paste",
        "3 cups low-salt chicken broth",
        "1 1/2 cups Sauvignon Blanc or other dry white wine",
        "6 fresh Italian parsley sprigs",
        "2 tablespoons chopped fresh thyme",
        "2 bay leaves",
        "2 tablespoons chopped fresh mint",
        "1 tablespoon (packed) finely grated lemon peel",
        "1 tablespoon minced fresh green garlic or 1 garlic clove, minced",
        "1 1/2 pounds unpeeled 1 1/2-to 1 3/4-inch baby red potatoes or baby Yukon Gold potatoes",
        "8 ounces slender baby carrots, trimmed, peeled",
        "8 ounces sugar snap peas, strings removed",
        "2 tablespoons (1/4 stick) butter",
        "3 ounces fresh pea tendrils"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Braise",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Mint",
        "Carrot",
        "Spring",
        "Parsley",
        "Sugar Snap Pea",
        "Simmer",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Braised Lamb Shanks with Spring Vegetables and Spring Gremolata",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-with-spring-vegetables-and-spring-gremolata-351542"
}
