{
    "directions": [
        "Lightly season chicken thighs all over with salt and pepper. Heat vegetable oil in a large Dutch oven or other heavy pot over medium-high. Working in 2 batches and pouring off all but 2 Tbsp. fat between batches, cook chicken, skin side down, until skin is browned and crisp, 8–10 minutes. Transfer to a plate, placing skin side up (chicken will not be cooked through at this point).",
        "Cook white and pale green parts of scallions, chiles, and ginger in same pot, stirring often, until scallions and ginger are golden, about 3 minutes. Add wine, bring to a simmer, and cook until reduced to about 3 Tbsp., 5 minutes. Add soy sauce, brown sugar, sesame oil, and 1 cup broth and bring to a simmer, stirring to dissolve sugar. Return chicken to pot, placing skin side up and overlapping if needed. Partially cover pot, reduce heat, and simmer until chicken is cooked through, 25–30 minutes. Transfer chicken to a plate.",
        "Add squash and remaining 1 cup broth to pot and push in squash so it’s mostly submerged. Arrange greens on top. Bring to a simmer, partially cover pot, and cook until squash is barely fork-tender and greens are wilted, 10–12 minutes. Uncover, increase heat to medium, and continue to cook until liquid is reduced by about two-thirds and has the consistency of thin gravy, 10–15 minutes.",
        "Remove pot from heat and drizzle vinegar over vegetables. Taste sauce; it should be plenty salty, but season with more salt if needed. Add chicken back to pot, turning to coat in sauce, then scatter dark green parts of scallions and sesame seeds over top. Serve with rice.",
        "Chicken can be braised 2 days ahead. Let cool; cover and chill. Reheat covered over low."
    ],
    "ingredients": [
        "4 pounds skin-on, bone-in chicken thighs (about 12), patted dry",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons vegetable oil",
        "8 scallions, white and pale green parts sliced into 1-inch pieces, dark green parts thinly sliced",
        "4 dried chiles de árbol",
        "1 (2-inch) piece ginger, peeled, thinly sliced",
        "1 cup dry white wine",
        "1/2 cup low-sodium soy sauce",
        "3 tablespoons dark brown sugar",
        "2 tablespoons toasted sesame oil",
        "2 cups low-sodium chicken broth, divided",
        "1 acorn squash, halved lengthwise, seeds removed, sliced 1/2-inch thick",
        "1 bunch mustard greens, tough stems removed, leaves torn",
        "2 tablespoons unseasoned rice vinegar",
        "2 teaspoons toasted sesame seeds",
        "Cooked white rice (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Braise",
        "Leafy Green",
        "Mustard Greens",
        "Squash",
        "Ginger",
        "Hot Pepper",
        "White Wine",
        "Sesame",
        "Sesame Oil",
        "Dinner",
        "Winter"
    ],
    "title": "Braised Chicken Thighs With Squash and Mustard Greens",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-thighs-with-squash-and-mustard-greens"
}
