{
    "directions": [
        "Preheat oven to 300°F. Arrange chiles on a wire rack on stovetop over a gas flame and roast, turning occasionally, until blistered and lightly charred. (Or roast one at a time using tongs, or use the broiler.)",
        "Stir vinegar, brown sugar, and 2 Tbsp. hot sauce in a small bowl; set aside.",
        "Heat oil in a large heavy pot over medium-high. Season brisket generously with salt and sprinkle with pepper; cook, fat side down, until bottom side is deep golden brown, 6–8 minutes. Turn and cook until other side is golden brown, about 4 minutes. Transfer to a rimmed baking sheet. Add onion and garlic to pot and cook, reducing heat if needed, until lightly browned, 6–8 minutes. Transfer to baking sheet with brisket.",
        "Remove pot from heat and place brisket in pot, fat side up. Pour reserved vinegar mixture over and arrange garlic and blistered chiles around. Place onion on top of chiles. Cover pot and transfer to oven. Braise until brisket is fork-tender and shreds easily, 3–3 1/2 hours. Transfer brisket, onion, chiles, and garlic to a platter and let cool 15 minutes.",
        "Meanwhile, place pot over medium-high heat and bring braising liquid to a boil. Cook until thick and syrupy, 10–15 minutes. Taste pan sauce and season with more hot sauce and salt, if needed.",
        "Serve brisket, onion, chiles, and garlic with pan sauce drizzled over.",
        "Brisket can be braised 3 days ahead. Let cool in juices in pot; cover and chill."
    ],
    "ingredients": [
        "6 mild yellow or red chiles or 3 yellow or red bell peppers",
        "4 hot yellow chiles (such as banana or Hungarian wax peppers), seeds removed",
        "4 medium-hot red chiles (such as Fresno or jalapeño), seeds removed",
        "3/4 cup apple cider vinegar",
        "1/4 cup (packed) light brown sugar",
        "2 tablespoons Red Chile Hot Sauce",
        "1 tablespoon vegetable oil",
        "1 (4-pound) beef brisket, preferably from the point end",
        "Kosher salt",
        "2 teaspoons freshly ground black pepper",
        "1 large red onion, cut through root end into 6 wedges",
        "8 garlic cloves, peeled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Chile Pepper",
        "Dinner",
        "Fall",
        "Braise",
        "Summer",
        "Hot Pepper",
        "Wheat/Gluten-Free",
        "Taco"
    ],
    "title": "Braised Brisket With Hot Sauce and Mixed Chiles",
    "url": "http://www.epicurious.com/recipes/food/views/braised-brisket-with-hot-sauce-and-mixed-chiles"
}
