{
    "directions": [
        "For topping: Mix all ingredients in medium bowl to blend. (Can be prepared 8 hours ahead. Cover and refrigerate.)",
        "For lamb: Whisk chicken broth, beef broth, 1/2 cup wine, 1/3 cup currant jelly, herbes de Provence, vinegar and garlic in large glass baking dish to blend. Add lamb shanks; turn to coat. Cover and chill overnight, turning occasionally.",
        "Preheat oven to 325°F. Remove lamb from marinade; reserve marinade. Pat lamb dry with paper towels. Sprinkle with salt and pepper. Heat oil in heavy large skillet over high heat. Working in batches, add lamb; cook until brown on all sides, about 8 minutes. Transfer to large roasting pan. Add all vegetables to roasting pan.",
        "Pour reserved marinade into same skillet. Bring to boil, scraping up any browned bits. Pour over lamb. Cover; bake until lamb and vegetables are very tender, turning occasionally, about 2 hours. Using slotted spoon, transfer lamb and vegetables to large serving bowl. Tent with foil.",
        "Spoon fat off top of cooking liquid. Melt butter in heavy large saucepan over medium-high heat. Add flour. Stir until golden, about 5 minutes. Whisk in cooking liquid. Add 1/3 cup wine, 1/3 cup jelly and tomato paste. Boil until sauce thickens enough to coat spoon, whisking occasionally, about 10 minutes. Season with salt and pepper. Spoon sauce, then topping, over lamb and vegetables."
    ],
    "ingredients": [
        "Topping",
        "1/2 cup chopped fresh parsley",
        "1 tablespoon grated lemon peel",
        "1 tablespoon grated orange peel",
        "1 tablespoon minced garlic",
        "1 teaspoon drained green peppercorns in brine, coarsely chopped",
        "Lamb",
        "1 14 1/2-ounce can low-salt chicken broth",
        "1 14 1/2-ounce can beef broth",
        "1/2 cup plus 1/3 cup dry red wine",
        "2/3 cup red currant jelly",
        "2 teaspoons herbes de Provence",
        "2 teaspoons red wine vinegar",
        "3 garlic cloves, minced",
        "6 lamb shanks (each about 1 pound)",
        "3 tablespoons olive oil",
        "1 pound plum tomatoes, each cut into 4 wedges, seeded",
        "2 large turnips, peeled, cut into 3/4-inch-thick wedges",
        "2 large fennel bulbs, each cut into 4 wedges",
        "3 large carrots, peeled, cut diagonally into 3/4-inch-thick slices",
        "1 cup chopped leek (white and pale green parts only)",
        "1/4 cup (1/2 stick) butter",
        "1/3 cup all purpose flour",
        "1 tablespoon tomato paste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Tomato",
        "Braise",
        "Marinate",
        "High Fiber",
        "Fennel",
        "Leek",
        "Carrot",
        "Turnip",
        "Red Wine",
        "Winter",
        "Parsley",
        "Jam or Jelly"
    ],
    "title": "Braised Lamb Shanks with Fennel, Tomatoes, Turnips and Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-with-fennel-tomatoes-turnips-and-carrots-5125"
}
