{
    "directions": [
        "Put oven racks in upper and lower thirds of oven and preheat oven to 450°F.",
        "Trim fat and skin from sides of duck legs, leaving a covering of skin on top of legs (there may be fat underneath skin). Reserve 1/2 cup fat (for cooking). Score skin on legs in a 1/2-inch crosshatch pattern, cutting through fat but not into meat.",
        "Coarsely chop reserved duck fat and heat in a 12-inch heavy skillet over moderate heat, stirring occasionally, until melted. Remove from heat and discard any solids with a slotted spoon.",
        "Divide shallots, parsnips, garlic, thyme, bay leaves, 1 teaspoon salt, and 1 teaspoon pepper between baking pans. Add 2 tablespoons rendered duck fat to each pan, reserving remainder in skillet, and toss to coat vegetables. Roast vegetables, turning occasionally and switching position of pans halfway through roasting, until browned in patches, 20 to 30 minutes total.",
        "Pat duck legs dry. Stir together allspice, remaining 1 1/2 teaspoons salt, and remaining 3/4 teaspoon pepper in a small bowl and rub all over legs. Heat fat remaining in skillet over moderately high heat until hot but not smoking, then sauté 4 duck legs, skin sides down, until well browned, 3 to 5 minutes. Turn legs over with tongs and sauté until undersides are browned, 2 minutes more. Transfer with tongs to paper towels to drain. Brown remaining duck legs (in batches of 4) in same manner, pouring off all but 2 tablespoons fat from skillet between batches.",
        "Reduce oven temperature to 375°F.",
        "Divide duck legs between baking pans, nestling them, skin sides up, in vegetables. Add wine and just enough stock so that most of each leg is submerged but skins are not.",
        "Braise duck and vegetables, uncovered, switching position of pans halfway through braising, until duck is tender, 1 1/2 to 2 hours total.",
        "Transfer vegetables and duck with a slotted spoon to a platter. Skim fat from pan juices and serve juices, seasoned with salt and pepper if necessary, on the side."
    ],
    "ingredients": [
        "12 fresh duck legs (7 to 11 lb depending on amount of fat on legs)",
        "2 lb shallots, peeled and, if very large, halved",
        "4 lb parsnips, peeled and cut diagonally into 1-inch-thick slices (halve large slices lengthwise)",
        "2 tablespoons minced garlic",
        "1 1/2 tablespoons chopped fresh thyme or 1 teaspoon dried, crumbled",
        "2 Turkish bay leaves or 1 halved California bay leaf",
        "2 1/2 teaspoons salt",
        "1 3/4 teaspoons black pepper",
        "1/4 teaspoon ground allspice",
        "2 cups dry white wine",
        "6 to 8 cups chicken stock, homemade or store-bought (preferably not canned broth; 48 to 64 fl oz)",
        "Special equipment: 2 (13- by 9- by 2-inch) baking pans",
        "Garnish: fresh thyme sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Onion",
        "Poultry",
        "Braise",
        "Roast",
        "Christmas",
        "Dinner",
        "Parsnip",
        "White Wine",
        "Winter",
        "Shallot",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Braised Duck Legs with Shallots and Parsnips",
    "url": "http://www.epicurious.com/recipes/food/views/braised-duck-legs-with-shallots-and-parsnips-109109"
}
