{
    "directions": [
        "Season rabbits generously with salt and pepper. Just before cooking, dust the rabbits with flour and shake to remove excess.",
        "Heat a large cast-iron skillet over medium heat. Add the shortening and bacon and cook, stirring, until shortening has melted and bacon has cooked halfway and rendered much of its fat. Drain the bacon fat from skillet (strain if necessary) and refrigerate until needed (the chilled fat will be used to make the dumplings). You should have about 5 tablespoons of fat. (If you don't quite have 5 tablespoons, you can add lard or vegetable shortening.)",
        "Meanwhile, heat vegetable oil over medium-high heat in a large cast-iron Dutch oven. When the oil is very hot, add the rabbit pieces and cook until evenly browned, using tongs to turn rabbit as necessary. When the rabbit is browned, add the onion, celery, carrot, and garlic and cook, stirring, until the vegetables are coated with fat, then add wine. Bring the mixture to a boil, reduce heat and simmer until reduced by half. Add the sage, thyme, and chicken stock, return to a boil, reduce heat, cover, and simmer (turning the rabbit once or twice for even cooking) until the meat pulls very easily away from the bone, 1 1/2 to 2 hours.",
        "While the rabbit braises, prepare the dumplings. Stir together the dry ingredients in a mound on the counter or in a large mixing bowl, then add the chilled bacon fat. Use your fingers to combine dry ingredients with the fat until mixture resembles coarse pebbles. Make a well in the center of the mixture and add the water to the well. Use your fingers to work in the liquid and form dough. Knead briefly, just to combine, then shape the mixture into a ball. On a lightly floured surface, use a rolling pin to roll dough out very thin (a thin pie dough, a little thicker than fettucine) into a rough square shape. Turn dough over once if it starts to stick. Use a knife to slice the dough into 1 by 4-inch pieces, then set aside.",
        "Bring a large pot of generously salted water to a boil. Add the dumplings and boil 3 to 5 minutes, until tender, and drain. Toss the dumplings with a small amount of oil to keep them from sticking together, then set aside.",
        "When the rabbit is done cooking, use tongs to transfer it to a baking dish. Strain out braising vegetables and discard, reserving broth. Skim fat from broth and set aside. Using your fingers, separate rabbit meat from bone, feeling carefully for any small bones, and set aside.",
        "Heat the reserved vegetable fat and vegetable oil in the Dutch oven over medium-high heat. Add the onion, parsnips, poblano, carrots, celery, garlic, oregano, bay leaves, salt, and pepper, and cook, stirring, until softened, about 5 to 7 minutes. Add the mustard and wine and cook, stirring, until pan is deglazed and most of the wine has evaporated. Add the reserved stock, scraping up any browned bits. Simmer for about 10 minutes, then add the reserved rabbit meat and simmer an additional 20 minutes.",
        "To finish the dish, add the cooked dumplings, stir together just until warmed through, and serve. If you are not going to serve the entire dish at once, serve dumplings in a bowl and ladle the hot stew over the top, so the dumplings don't overcook and become mushy.",
        "When chopping poblanos and other chiles, slice them from the inside (rib side) of the pepper for a cleaner cut. If you have to cut through the thicker skin side it's easier for the knife to slip."
    ],
    "ingredients": [
        "2 rabbits, 2 1/2- to 3-pounds each",
        "Salt and black pepper",
        "Flour",
        "3 tablespoons vegetable shortening",
        "4 slices thick-sliced bacon, sliced into lardoons",
        "1 small onion, coarsely chopped",
        "2 stalks celery, coarsely chopped",
        "1 small carrot, sliced into 1-inch rounds",
        "2 cloves garlic, smashed",
        "1 cup dry white wine",
        "1/2 bunch fresh sage",
        "1/2 bunch fresh thyme",
        "6 cups chicken stock",
        "2 cups flour",
        "1/2 teaspoon baking powder",
        "1/4 cup chopped fresh sage",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "5 tablespoons chilled rendered bacon fat",
        "2 tablespoons vegetable oil",
        "1 medium onion, finely chopped",
        "2 parsnips, medium dice",
        "1 poblano, finely chopped *",
        "2 carrots, medium dice",
        "2 stalks celery, finely chopped",
        "5 cloves of garlic, minced",
        "1 tablespoon dried oregano",
        "5 bay leaves",
        "2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1/3 cup vegetable oil",
        "3 tablespoons whole-grain mustard",
        "1/2 cup dry white wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Braise",
        "Dinner",
        "Rabbit",
        "Bacon",
        "Sage",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Braised Rabbit with Bacon-Sage Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/braised-rabbit-with-bacon-sage-dumplings-363009"
}
