{
    "directions": [
        "Heat oil in heavy large Dutch oven over medium-high heat. Add chicken in batches and cook until brown on all sides, about 8 minutes per batch. Place chicken on platter. Add onions to Dutch oven; sauté until tender, about 5 minutes. Add spices; stir until fragrant, about 1 minute. Stir in tomatoes and their juices and water. Return chicken to Dutch oven. Cover; simmer over medium-low heat until chicken is very tender, about 35 minutes.",
        "Transfer chicken to platter. Tent with foil. Add 2 tablespoons vinegar, tomato paste and sugar to Dutch oven. Simmer until thickened to sauce consistency, stirring occasionally, about 10 minutes. Season with salt, pepper and more vinegar, if desired. Remove from heat. Cover to keep warm.",
        "Cook pasta in large pot of boiling salted water until tender but still firm to bite. Drain. Transfer pasta to platter. Top with chicken, sauce and cheese."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "1 3-pound chicken, cut into 8 pieces",
        "3 cups chopped red onions",
        "6 whole allspice",
        "1 cinnamon stick",
        "1 teaspoon ground cumin",
        "1 teaspoon paprika",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground cloves",
        "Pinch cayenne pepper",
        "1 28-ounce can whole Italian-style tomatoes, drained, juices reserved, tomatoes chopped",
        "1 cup water",
        "2 tablespoons (or more) red wine vinegar",
        "2 tablespoons tomato paste",
        "Pinch of sugar",
        "12 ounces perciatelli pasta or spaghetti",
        "Freshly grated kefalotyri cheese or Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Tomato",
        "Braise",
        "Valentine's Day",
        "Spice",
        "Cinnamon",
        "Clove",
        "Nutmeg"
    ],
    "title": "Braised Chicken in Aromatic Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-in-aromatic-tomato-sauce-367"
}
