{
    "directions": [
        "Preheat oven to 350°F.",
        "Pat lamb shanks dry. In a heavy skillet (preferably cast iron) large enough to fit 1 lamb shank heat 2 tablespoons oil over moderately high heat until hot but not smoking and brown lamb shanks, 1 at a time, transferring as browned to a 9-quart heavy ovenproof kettle. Pour off fat from skillet and cook onions in remaining tablespoons oil over moderate heat, stirring, until golden. Stir in garlic and cook, stirring, until fragrant, about 30 seconds. To kettle add onion mixture, tomatoes with juice, water, bay leaf, cinnamon sticks, allspice, orange peel, salt, and pepper to taste and bring liquid to a boil. Braise lamb, covered, in oven until just tender, about 1 3/4 hours.",
        "Stir in rutabaga and carrots and braise, covered, in oven until vegetables are tender, about 30 minutes. Braised lamb shanks improve in flavor if made 1 day ahead. Cool mixture, uncovered, and chill, covered. Skim fat, discarding it, and reheat lamb, if chilled, over moderate heat, stirring occasionally, until hot. Transfer lamb and vegetables with a slotted spoon to a platter and boil braising liquid until reduced to about 4 cups.",
        "Remove meat from 2 lamb shanks and chop fine, reserving chopped meat and 1 cup braising liquid for making pastitsio .",
        "Return remaining 4 lamb shanks and vegetables to kettle and simmer, covered, until heated through.",
        "Discard bay leaf. Sprinkle lamb and vegetables with parsley and serve with rice."
    ],
    "ingredients": [
        "6 lamb shanks (about 1 pound each)",
        "3 tablespoons olive oil",
        "4 medium onions, halved lengthwise and cut crosswise into 1/4-inch-thick slices",
        "3 large garlic cloves, minced",
        "a 28-ounce can whole tomatoes, chopped, with juice",
        "4 cups water",
        "1 bay leaf",
        "2 cinnamon sticks",
        "1/4 teaspoon ground allspice",
        "3/4 teaspoon dried orange peel*",
        "2 teaspoons salt",
        "1 medium rutabaga (about 2 pounds), peeled and cut into 1-inch pieces",
        "6 carrots, cut crosswise into 1-inch pieces",
        "2 tablespoons minced fresh parsley leaves",
        "Accompaniment: cooked rice",
        "*available in spice section of supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Onion",
        "Tomato",
        "Braise",
        "High Fiber",
        "Low/No Sugar",
        "Carrot",
        "Fall",
        "Winter",
        "Rutabaga",
        "Gourmet"
    ],
    "title": "Braised Lamb Shanks with Rutabaga and Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-with-rutabaga-and-carrots-13294"
}
