{
    "directions": [
        "Combine shallots, lemongrass, soy sauce, fish sauce, chili paste, salt, sugar, and five-spice powder in a large bowl. Add pork shoulder and pork belly and toss to coat. Cover and chill at least 3 hours.",
        "Remove pork from marinade, scraping excess back into bowl; set marinade aside. Heat oil in a large Dutch oven or other heavy pot over medium-high heat. Cook pork, turning occasionally, until browned all over, 10–15 minutes; transfer to a plate.",
        "Pour off all but 1 tablespoon fat from pot. Add garlic and cook, stirring, until fragrant but without taking on any color, about 1 minute. Add reserved marinade and 4 cups water and bring to a boil. Add pork, reduce heat, and simmer, partially covered, turning pork occasionally, until fork-tender but not falling apart, 1–1 1/2 hours. Let cool in liquid.",
        "DO AHEAD: Pork can be marinated 1 day ahead of braising; keep chilled. Pork can be braised 2 days ahead; cover and chill.",
        "Heat 1/2 cup oil in a small skillet over medium-high heat. Working in batches, fry wonton wrappers until golden brown, about 30 seconds per side. Transfer to paper towels to drain; season with salt.",
        "Cook noodles according to package directions. Using tongs or a spider, transfer noodles to a colander and run under cold water to stop cooking; transfer to a large bowl. Toss with remaining 1 tablespoon oil; set aside. (Keep pot of boiling water handy for reheating noodles.)",
        "Remove pork from braising liquid and slice 1/4\" thick. Bring braising liquid to a boil (it will be concentrated, like the juices in a roasting pan). Add 1/2 cup water. The flavor should still be intense and slightly salty; adjust with more water if needed. Simmer 2 minutes, remove from heat and add sliced pork. Let cool slightly.",
        "Just before serving, return noodle cooking water to a boil. Place noodles in a fine-mesh sieve and lower into hot water to reheat, 30 seconds. Divide noodles among bowls. Place bean sprouts in sieve and cook in same pot of water 30 seconds; drain and place on top of noodles. Remove pork from cooking liquid and place on top of noodles. Ladle some cooking liquid over.",
        "Serve with chile, lime wedges, wontons, a handful of herbs, and a dab of chili paste.",
        "DO AHEAD: Wontons can be fried 5 days ahead. Let cool; store airtight at room temperature."
    ],
    "ingredients": [
        "2 medium shallots, finely chopped",
        "2 lemongrass stalks, tough outer layer removed, stalks lightly smashed, finely chopped",
        "2 tablespoons reduced-sodium soy sauce",
        "1 tablespoon fish sauce",
        "1 tablespoon hot chili paste (such as sambal oelek)",
        "2 teaspoons kosher salt",
        "2 teaspoons sugar",
        "1 1/2 teaspoon Chinese five-spice powder",
        "1 pound boneless pork shoulder (Boston butt), halved",
        "1 pound skin-on pork belly, halved",
        "2 tablespoons vegetable oil",
        "6 garlic cloves, finely chopped",
        "1/2 cup plus 1 tablespoon vegetable oil",
        "4 wonton or egg roll wrappers, cut into 4 squares",
        "Kosher salt",
        "1 pound dried wide rice noodles",
        "8 ounces mung bean sprouts (about 2 cups)",
        "1 Fresno chile, with seeds, sliced",
        "1 lime, cut into wedges",
        "Mixed fresh tender herbs (such as mint, cilantro, and Thai basil), hot chili paste (such as sambal oelek; for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Pork",
        "Brunch",
        "Dinner",
        "Lunch",
        "Noodle",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Braised Spiced Pork with Cao Lau Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/braised-spiced-pork-with-cao-lau-noodles-51234440"
}
