{
    "directions": [
        "In a blender purée the garlic and the gingerroot with 1/3 cup water. In a heavy kettle heat 3 tablespoons of the oil over moderately high heat until it is hot but not smoking and in it brown the lamb, patted dry, in batches, transferring it as it is browned with tongs to a bowl. To the skillet add the remaining 3 tablespoons oil, heat it until it is hot but not smoking, and in it fry the cinnamon stick, the cloves, and the bay leaf, stirring, for 30 seconds, or until the cloves are puffed slightly. Add the onions and cook the mixture over moderate heat, stirring occasionally, until the onions are golden. Add the garlic purée and cook the mixture, stirring, for 2 minutes, or until the liquid is evaporated. Add the cumin, the coriander, and the cayenne and cook the mixture, stirring, for 1 minute. Add the tomatoes and the yogurt, simmer the mixture, stirring, for 1 minute, and add the lamb, the salt, and 1 cup water. Bring the mixture to a boil and braise it, covered, in a preheated 350°F. oven for 1 to 1 1/4 hours, or until the lamb is tender. The lamb mixture may be prepared up to this point 2 days in advance. Let the lamb cool, uncovered, and chill it, covered. Reheat the lamb mixture.",
        "In a large saucepan bring 1 inch water to a boil, add the spinach, and steam it, covered, for 2 minutes, or until it is wilted. Drain the spinach in a colander.",
        "Spoon off any excess fat from the lamb mixture and add the lemon juice and salt and pepper to taste. Distribute the spinach over the stew and stir it in gently. Transfer the stew to a heated serving dish and sprinkle it with the pine nuts."
    ],
    "ingredients": [
        "8 garlic cloves",
        "a 1 1/2-inch cube of peeled fresh gingerroot",
        "6 tablespoons vegetable oil",
        "3 pounds boneless lamb shoulder, trimmed and cut into 1 1/2-inch pieces",
        "a 3-inch cinnamon stick",
        "7 whole cloves",
        "1 bay leaf",
        "3 onions, chopped fine",
        "1 tablespoon ground cumin",
        "1 tablespoon ground coriander seeds",
        "1/4 teaspoon cayenne",
        "1 cup chopped drained canned tomatoes",
        "1/2 cup plain yogurt",
        "1 teaspoon salt",
        "1 1/4 pounds fresh spinach, coarse stems discarded and the leaves washed well and drained",
        "1 teaspoon fresh lemon juice, or to taste",
        "1 tablespoon pine nuts, toasted lightly"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Onion",
        "Braise",
        "Spinach",
        "Fall",
        "Cinnamon",
        "Clove",
        "Gourmet"
    ],
    "title": "Braised Lamb with Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-with-spinach-11496"
}
