{
    "directions": [
        "The night before you plan to cook the turkey clean the bird, slice some truffles, and slip them under the skin. Slip several truffles into the cavity as well, wrap the bird loosely in foil, and leave in the refrigerator overnight.",
        "Next day, prepare the stuffing. Sauté the pork, veal and shallots in 8 tablespoons butter and blend well with salt to taste and 1/2 cup cognac. Do not cook completely — merely mix over heat and add the crumbs and parsley. Add seasonings to taste. Combine with the truffles in the turkey and stuff lightly. Sew up the vent and truss the turkey.",
        "Brown the turkey well in butter or butter and oil mixed and place the bird on a bed of the julienne carrots, leeks and celery in a large braising pan. Add the butter or butter and oil and 1 1/2 cups white wine and turn heat to high. Cover pan, reduce heat, and cook for 2 1/2 to 3 hours, basting the bird occasionally with equal parts of melted butter and white wine. When the bird is tender, remove to a hot platter and strain off the pan juices. Reduce the juices to 2 cups and thicken with beurre manié. Season to taste with salt and freshly ground white pepper and add remaining 1/4 cup cognac.",
        "Serve with potatoes Anna and braised celery. Drink a fine Château-bottled Médoc — a Château Latour or Palmer."
    ],
    "ingredients": [
        "8 to 10 pound turkey",
        "Truffles, as many as possible, fresh if available",
        "2 pounds ground pork",
        "1 1/2 pounds ground veal",
        "8 shallots",
        "Butter",
        "Salt, pepper to taste",
        "3/4 cup cognac",
        "2 cups fine bread crumbs",
        "1/2 cup chopped parsley",
        "3 carrots, cut in fine julienne",
        "3 leeks, cut in fine julienne",
        "3 stalks celery, cut in fine julienne",
        "White wine",
        "Beurre manié",
        "Freshly ground white pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Pork",
        "turkey",
        "Braise",
        "Thanksgiving",
        "Cognac/Armagnac",
        "Celery",
        "Leek",
        "Carrot",
        "White Wine",
        "Fall",
        "Shallot",
        "Parsley",
        "House & Garden"
    ],
    "title": "Braised Truffled Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/braised-truffled-turkey-20132"
}
