{
    "directions": [
        "Place tomatoes in a large Dutch oven or other heavy pot, crushing with your hands; add wine, red pepper flakes, 2 tsp. salt, 1/2 cup oil, and 2 cups water; set aside.",
        "Pulse anchovies and garlic in a food processor until finely chopped. Add mint and pulse until coarsely chopped. With the motor running, stream in remaining 1/2 cup oil; process until a coarse paste forms. Set pesto aside.",
        "Remove several layers of dark-green outer leaves from artichokes (keep going until you get to the tender light-green leaves). Using a serrated knife, cut off top 1\" of artichokes and trim stem ends. Rub cut ends with lemon halves to prevent browning. Working with 1 artichoke at a time, use a paring knife or vegetable peeler to remove tough outer green layer from base and stem to reveal pale-green underneath; rub all over with lemon. Halve through stem and rub cut sides with more lemon. Use a spoon to scoop out choke, then pull out spiky inner leaves; rub insides with lemon. Rub reserved pesto all over artichoke halves and place artichokes in a single layer inside reserved pot, submerging in tomato mixture.",
        "Bring to a simmer over medium-low and cook, turning artichokes occasionally, until hearts are fork-tender, 55–65 minutes. Transfer artichokes to a platter and tent with foil to keep warm.",
        "Increase heat to medium, bring sauce to a boil, and cook until slightly thickened, 10–15 minutes. Taste and season with more salt if needed. Spoon over artichokes."
    ],
    "ingredients": [
        "1 (28-ounce) can whole peeled tomatoes, preferably Italian San Marzano, drained",
        "1 1/2 cups dry white wine",
        "1/2 teaspoon crushed red pepper flakes",
        "2 teaspoons kosher salt, plus more",
        "1 cup olive oil, divided",
        "12 salt-packed anchovy fillets, rinsed, patted dry",
        "8 garlic cloves",
        "1 cup (lightly packed) mint leaves",
        "6 medium artichokes",
        "2 lemons, halved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Spring",
        "Artichoke",
        "Tomato",
        "Lemon",
        "Anchovy",
        "Vegan",
        "Vegetarian",
        "Wheat/Gluten-Free"
    ],
    "title": "Braised Artichokes With Tomatoes and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/braised-artichokes-with-tomatoes-and-mint"
}
