{
    "directions": [
        "Preheat oven to 300°. Season veal with salt and pepper. Heat vegetable oil in a large heavy pot over medium-high heat. Working in batches (do not crowd), cook, turning occasionally, until golden brown all over, 8-10 minutes; transfer to a platter. Remember: Browned meat tastes better, and this is your only opportunity to build that flavor.",
        "Wipe out pot, reduce heat to medium, and cook two-thirds of bacon, stirring occasionally, until fat starts to render (you don't want it to get crisp), about 4 minutes. Stick cloves in onion quarters and add to pot along with garlic, rosemary, thyme, sage sprigs, and bay leaves; stir to coat. Add wine, bring to a simmer, and cook until reduced by half, about 4 minutes.",
        "Add tomatoes, crushing with your hands as you go, then broth and veal shanks along with any accumulated juices. Add water just to cover; season with salt and pepper. Bring to a simmer, then cover and transfer to oven.",
        "Braise veal shanks, checking occasionally to make sure liquid is not boiling too hard and shanks are still submerged (add water along the way if needed), until meat is extremely tender and nearly falling off the bone, 1 1/2-2 hours. Let shanks cool slightly in liquid, then transfer to a platter or cutting board and tent with foil. Strain braising liquid into a medium saucepan and bring to a simmer over medium-high heat; cook until liquid is reduced to about 2 1/2 cups, 30-40 minutes. Season with salt and pepper.",
        "Meanwhile, cook remaining bacon in a medium skillet over medium heat, stirring occasionally, until brown and crisp, 5-8 minutes. Transfer bacon to paper towels with a slotted spoon.",
        "Add olive oil, then breadcrumbs to skillet, season with salt and pepper, and cook, tossing occasionally to coat and brown evenly, until breadcrumbs are golden brown and crisp, 8.10 minutes. Add Parmesan, sage leaves, and reserved bacon and toss to coat. Transfer to a small bowl.",
        "Spoon some braising liquid over veal shanks and top with breadcrumbs. Serve remaining braising liquid alongside for pouring over.",
        "DO AHEAD: Veal shanks can be braised 2 days ahead. Let cool in unreduced braising liquid, then cover and chill."
    ],
    "ingredients": [
        "2 3-3 1/2 pound veal shanks",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons vegetable oil",
        "6 ounces thick-cut bacon, finely chopped, divided",
        "12 whole cloves",
        "2 medium onions, peeled, quartered",
        "2 heads garlic, halved lengthwise",
        "1/2 bunch rosemary",
        "1/2 bunch thyme",
        "1/2 bunch sage, plus 2 tablespoons leaves",
        "4 bay leaves",
        "1 cup dry white wine",
        "1 28-ounce can whole peeled tomatoes",
        "6 cups low-sodium chicken broth",
        "1 tablespoon olive oil",
        "1 1/2 cups coarse fresh breadcrumbs",
        "1/3 cup finely grated Parmesan",
        "You'll often see veal shanks cut crosswise into osso buco, but around the holidays, we like to braise them whole for a dramatic presentation. Call in advance so the butcher sets aside the entire pieces for you. There's no need to have them trimmed; the meat will shrink on the bones as it braises."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Christmas",
        "Dinner",
        "Veal",
        "Christmas Eve",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Braised Veal Shanks with Bacon-Parmesan Crumbs",
    "url": "http://www.epicurious.com/recipes/food/views/braised-veal-shanks-with-bacon-parmesan-crumbs-51259320"
}
