{
    "directions": [
        "Heat heavy large pot over medium heat. Add pancetta and sauté until crisp. Using slotted spoon, transfer pancetta to paper towels to drain. Sprinkle ribs with salt and pepper. Working in batches, brown ribs in drippings in pot over medium-high heat until brown on all sides, about 8 minutes per batch. Transfer to plate. Add onions and next 4 ingredients to pot. Cover, reduce heat to medium, and cook until vegetables are soft, stirring occasionally, about 10 minutes. Add wine. Boil uncovered until liquid is reduced by half, scraping up browned bits, about 5 minutes. Add broth, tomatoes, parsley, thyme, bay leaf, and pancetta. Return ribs to pot, cover partially, and simmer 1 1/2 hours. Uncover and simmer until rib meat is tender, stirring occasionally, about 1 1/2 hours longer.",
        "Transfer ribs to plate; discard bay leaf. Spoon fat from surface of sauce. Boil sauce until beginning to thicken, about 8 minutes. Reduce heat to medium. Add chocolate, cocoa powder, and rosemary; stir until chocolate melts. Season to taste with salt and pepper. Return ribs to pot. Simmer to rewarm, about 5 minutes."
    ],
    "ingredients": [
        "1/4 cup diced pancetta (Italian bacon; about 1 1/2 ounces)",
        "6 pounds bone-in short ribs",
        "1 1/2 cups finely chopped onions",
        "1/4 cup finely chopped shallots",
        "1/4 cup finely chopped celery",
        "1/4 cup finely chopped peeled carrots",
        "3 garlic cloves, minced",
        "2 cups dry red wine",
        "3 cups low-salt chicken broth",
        "2 cups chopped drained canned diced tomatoes",
        "2 tablespoons chopped fresh parsley",
        "1 very large fresh thyme sprig",
        "1 bay leaf",
        "3 tablespoons shaved or grated bittersweet chocolate",
        "2 tablespoons unsweetened cocoa powder (preferably Dutch-process)",
        "1 teaspoon finely chopped fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Chocolate",
        "Herb",
        "Onion",
        "Tomato",
        "Braise",
        "Beef Rib",
        "Bacon",
        "Carrot",
        "Red Wine",
        "Fall",
        "Winter",
        "Shallot"
    ],
    "title": "Braised Short Ribs with Chocolate and Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/braised-short-ribs-with-chocolate-and-rosemary-233706"
}
