{
    "directions": [
        "Preheat oven to 300°F.",
        "Cut onions into 1/4-inch-thick rings. Quarter tomatoes lengthwise. Tie each shank securely with kitchen string to keep meat attached to bone and season with salt and pepper. In an ovenproof 5- to 6-quart heavy kettle just wide enough to hold shanks in one layer toss together onions and tomatoes and season with salt and pepper. Add shanks and braise, covered, in middle of oven until very tender, about 3 hours.",
        "Peel potatoes and cut into roughly 2-inch pieces. In a 4-quart kettle cover potatoes with cold salted water by 2 inches and simmer until tender, about 25 minutes. Reserve 1/2 cup potato cooking water and drain potatoes in a colander. Return potatoes to kettle and add butter and 1/4 cup reserved cooking water. Mash potato mixture with a potato masher until smooth, adding enough of remaining cooking water to reach the desired consistency, and season with salt and pepper. Shanks and potatoes may be made up to this point 2 days ahead and cooled, uncovered, before being chilled separately, covered. Reheat shanks and potatoes before proceeding.",
        "Transfer shanks, onions, and tomatoes to a platter with a slotted spoon and keep warm, loosely covered. Boil braising liquid until reduced to about 1 cup, about 5 minutes. Season jus with salt and pepper.",
        "Serve shanks, onions, and tomatoes with mashed potatoes and jus."
    ],
    "ingredients": [
        "4 onions (about 1 pound)",
        "6 plum tomatoes (about 1 1/4 pounds)",
        "four 2-inch-thick meaty crosscut veal shanks (osso buco; about 1 pound each)",
        "2 1/2 pounds yellow-fleshed potatoes such as Yukon Gold",
        "1/2 stick unsalted butter, softened"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Potato",
        "Tomato",
        "Braise",
        "Dinner",
        "Veal",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Braised Veal Shanks with Mashed Potatoes and Tomato Onion Jus",
    "url": "http://www.epicurious.com/recipes/food/views/braised-veal-shanks-with-mashed-potatoes-and-tomato-onion-jus-101503"
}
