{
    "directions": [
        "Rinse rabbit pieces and remove any fat, then pat dry and divide into 3 batches. Mix together salt and pepper in a small bowl for seasoning rabbit.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Heat a dry 12-inch heavy skillet over moderately high heat until hot. Season first batch of rabbit, then add 3 tablespoons oil to skillet and brown rabbit on all sides, about 5 minutes total. Transfer browned rabbit to a flameproof roasting pan just large enough to hold all 3 batches in 1 layer. Season and brown remaining 2 batches of rabbit in same manner, transferring to roasting pan and adding more oil to skillet between batches if necessary. Reserve skillet.",
        "Add broth to roasting pan, then cover pan tightly with foil and braise rabbit in oven 15 minutes.",
        "While rabbit is braising, pour off any fat from skillet, then add onions, garlic, thyme, and 3 tablespoons butter and cook over moderately low heat, stirring and scraping up any brown bits, until onions are softened, about 5 minutes. Add wine and boil until liquid is reduced by half, about 10 minutes.",
        "Pour mixture over rabbit and continue to braise, covered tightly, until rabbit is tender when pierced with a fork, 45 minutes to 1 hour more. Transfer rabbit to an ovenproof serving dish and keep warm, covered loosely with foil, in turned-off oven.",
        "Straddle roasting pan over 2 burners and boil braising liquid until reduced to about 3 1/4 cups, about 10 minutes. Transfer 1/2 cup reduced liquid to a bowl and whisk in mustards. Add mustard mixture to reduced liquid in pan, whisking to incorporate. Dissolve cornstarch in water and whisk into sauce, then simmer, whisking, 2 minutes. Add remaining 3 tablespoons butter to sauce and swirl pan until incorporated. Season sauce with salt and pepper and pour over rabbit.",
        "*Available at butcher shops, specialty foods shops, and some supermarkets (may require special order)."
    ],
    "ingredients": [
        "2 (3-pound) rabbits*, each cut into 6 serving pieces",
        "1 1/2 teaspoons salt",
        "1 teaspoon black pepper",
        "3 to 4 tablespoons vegetable oil",
        "1 3/4 cups reduced-sodium chicken broth (14 fluid ounces",
        "2 medium onions, finely chopped (2 cups)",
        "3 large garlic cloves, finely chopped",
        "1 teaspoon chopped fresh thyme",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into tablespoon pieces",
        "2 1/2 cups dry white wine",
        "1/3 cup Dijon mustard",
        "1/4 cup whole-grain mustard",
        "2 teaspoons cornstarch",
        "2 tablespoons cold water",
        "Garnish: fresh thyme sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Game",
        "Mustard",
        "Poultry",
        "Braise",
        "Christmas",
        "Dinner",
        "Lunch",
        "Rabbit",
        "Fall",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Braised Rabbit with Grainy Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/braised-rabbit-with-grainy-mustard-sauce-231501"
}
