{
    "directions": [
        "In a large bowl, combine 1 cup flour, sugar, salt and yeast; stir well. Combine milk and butter in a small saucepan; heat until milk is warm and butter is softened but not melted.",
        "Gradually add the milk and butter to the flour mixture; stirring constantly. Add two eggs and 1/2 cup flour; beat well. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
        "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.",
        "Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal size rounds; cover and let rest for 10 minutes. Roll each round into a long roll about 36 inches long and 1 1/2 inches thick. Using the two long pieces of dough, form a loosely braided ring, leaving spaces for the five colored eggs. Seal the ends of the ring together and use your fingers to slide the eggs between the braids of dough.",
        "Preheat oven to 350 degrees F (175 degrees C). Place loaf on a buttered baking sheet and cover loosely with a damp towel. Place loaf in a warm place and let rise until doubled in bulk, about 45 minutes. Brush risen loaf with melted butter.",
        "Bake in preheated oven for 50 to 55 minutes, or until golden."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour, divided",
        "1/4 cup white sugar",
        "1 teaspoon salt",
        "1 (.25 ounce) package active dry yeast",
        "2/3 cup milk",
        "2 tablespoons butter",
        "2 eggs",
        "5 whole eggs, dyed if desired",
        "2 tablespoons butter, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Braided Easter Egg Bread",
    "url": "http://allrecipes.com/recipe/17244/braided-easter-egg-bread/"
}
