{
    "directions": [
        "Toss chicken pieces with peel, thyme, and chopped parsley in large bowl. Cover and refrigerate at least 4 hours or overnight.",
        "Let chicken pieces stand at room temperature 15 minutes. Sprinkle with salt and pepper; let stand 15 minutes more.",
        "Preheat oven to 325°F. Melt 2 tablespoons butter with oil in large skillet over medium-high heat. Working in 2 batches, add chicken pieces, skin side down; cook until deep brown, about 5 minutes. Turn chicken over; reduce heat to medium and cook 2 minutes. Arrange in single layer in large ovenproof pot. Pour off all but 4 tablespoons drippings from skillet. Add onion, leeks, morels, and bay leaves to skillet; sauté over medium heat until vegetables are golden, about 7 minutes. Add wine and Sherry; increase heat to high and boil until liquid is reduced by half, about 2 minutes. Add broth; bring to boil. Add 6 parsley sprigs. Pour vegetables over chicken. Cover pot with plastic wrap, then foil. Bake until chicken is very tender, about 1 1/2 hours.",
        "Increase oven temperature to 400°F. Transfer chicken pieces to rimmed baking sheet; roast in oven until brown, about 15 minutes.",
        "Meanwhile, strain vegetable-broth mixture into medium saucepan. Press on solids to extract as much liquid as possible. Boil liquid until reduced to 3 cups, about 15 minutes. Whisk in remaining 2 tablespoons butter. Season with salt and pepper.",
        "Arrange chicken on large platter. Spoon reduced juices over. Arrange white asparagus, morels, and leeks over and around chicken. Top each chicken leg with dollop of crème fraîche and serve."
    ],
    "ingredients": [
        "6 large chicken leg-thigh pieces (about 5 1/2 pounds total)",
        "2 tablespoons finely grated lemon peel",
        "2 tablespoons fresh thyme leaves",
        "2 tablespoons chopped fresh Italian parsley plus 6 sprigs",
        "4 tablespoons (1/2 stick) butter, divided",
        "1 tablespoon extra-virgin olive oil",
        "1 cup sliced onion",
        "1 cup sliced leeks (white and pale green parts only)",
        "1/2 cup dried morels (about 3/4 ounce)",
        "2 bay leaves",
        "1 cup dry white wine",
        "1/4 cup dry Sherry",
        "4 cups low-salt chicken broth",
        "White Asparagus, Morels, and Leeks",
        "1/2 cup crème fraîche or sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Onion",
        "Braise",
        "Marinate",
        "High Fiber",
        "Asparagus",
        "Leek",
        "Sherry",
        "White Wine",
        "Spring"
    ],
    "title": "Braised Chicken with White Asparagus and Morel Sauté with Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-with-white-asparagus-and-morel-saute-with-creme-fraiche-234427"
}
