{
    "directions": [
        "Pat shanks dry and season with salt and pepper. Heat 2 tablespoons oil in a deep 12-inch heavy enameled casserole over moderately high heat until hot but not smoking. Brown shanks on all sides, 5 to 7 minutes, then transfer to a bowl.",
        "Add remaining oil to casserole and sauté onions, stirring frequently, until softened and beginning to brown, 4 to 5 minutes. Return shanks to casserole and add broth. Bring to a boil; reduce heat and simmer, covered, 1 hour.",
        "While shanks cook, combine 4 cups cold water and 1/4 cup lemon juice in a large bowl. Then, working with 1 artichoke at a time, bend back outer leaves until they snap off close to base and discard. (Do not cut off stems.) Discard several more layers of leaves in same manner until exposed leaves are pale green at top and yellow at base. Cut off top leaves about 1 to 1 1/4 inches from top. Trim fibrous parts from base and stem of artichoke, being careful not to break off stem. Cut a thin slice from end of stem to expose a fresh cross section, then trim outer green fibrous part from stem.",
        "As it is trimmed, rub artichoke all over with lemon halves. Cut artichokes in half lengthwise and remove fuzzy center and any purple leaves. Place in bowl with water and lemon juice.",
        "Drain artichokes and add to shanks with 1/2 cup dill and remaining 1/4 cup lemon juice. Simmer, covered, until meat and artichokes are tender, about 40 minutes.",
        "Transfer shanks and artichokes to a deep serving dish and keep warm, covered. Skim fat from sauce in casserole and boil until reduced by half, about 10 minutes. Season sauce with salt and pepper and spoon over lamb and artichokes. Sprinkle with remaining 1/2 cup dill."
    ],
    "ingredients": [
        "4 lamb shanks (3 3/4 pounds), trimmed",
        "4 tablespoons olive oil",
        "3 small onions, chopped",
        "3 cups chicken broth or water",
        "1/2 cup fresh lemon juice",
        "4 large artichokes",
        "1 lemon, halved",
        "1 cup chopped fresh dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Braise",
        "Artichoke",
        "Spring",
        "Dill",
        "Gourmet"
    ],
    "title": "Braised Lamb Shanks with Artichokes",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-with-artichokes-103317"
}
