{
    "directions": [
        "Cover potatoes with salted cold water by 1 inch in a 4-quart pot, then briskly simmer, uncovered, over moderate heat until just tender, 25 to 30 minutes.",
        "While potatoes simmer, cook onion in oil in a 12-inch heavy skillet over moderate heat, stirring occasionally, until well browned, 10 to 12 minutes. Transfer to a bowl.",
        "Drain potatoes in a colander and, when cool enough to handle, peel, then thinly slice. Add potatoes, salt, and pepper to onion and coarsely mash with a fork. Cool to warm and stir in egg and dill until combined. Cool completely, uncovered.",
        "Cut a 7- by 5-inch pocket in center of meat parallel to bone, leaving a 1/2-inch border of meat all around. Loosely fill pocket with potato stuffing and sew pocket closed on cut side with needle and kitchen string (and sew any tears).",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Pat veal dry and rub all over with salt and pepper. Heat oil in a wide 5- to 6-quart heavy pot over moderate heat until hot but not smoking, then brown veal, meat side down, 5 to 7 minutes. Turn veal over and add wine. Boil, uncovered, until wine is reduced by half, about 4 minutes. Add broth and bay leaves and return to a boil. Cover pot tightly with lid and transfer to oven, then braise until meat is very tender, about 2 hours.",
        "Transfer veal to a cutting board using a large wide metal spatula and let stand, loosely covered with foil, 15 minutes.",
        "Discard bay leaves and skim off fat from pan juices. Bring pan juices to a boil. Whisk together cream and cornstarch in a small bowl and whisk into pan juices. Simmer, stirring occasionally, until slightly thickened, 2 to 3 minutes. If desired, pour through a fine-mesh sieve into a bowl (discard solids). Stir in dill, lemon juice, and salt and pepper to taste.",
        "Discard kitchen string from veal and cut meat from bones by holding knife against bone as you cut. Transfer stuffed meat to a cutting board and slice lengthwise 1 inch thick. Cut between ribs to separate. Serve veal slices and ribs with sauce."
    ],
    "ingredients": [
        "3/4 pound medium Yukon Gold potatoes (2 to 3), left unpeeled",
        "1 large onion, chopped (2 cups)",
        "2 tablespoons vegetable oil",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 large egg, lightly beaten",
        "1 tablespoon chopped fresh dill",
        "1 (4- to 4 1/2-pound) bone-in back portion veal breast (3 or 4 ribs)",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 tablespoon vegetable oil",
        "1 cup dry white wine",
        "1 3/4 cups reduced-sodium chicken broth (14 fluid ounces)",
        "2 Turkish bay leaves or 1 California",
        "1/2 cup heavy cream",
        "2 teaspoons cornstarch",
        "1 tablespoon chopped fresh dill",
        "1/4 teaspoon fresh lemon juice, or to taste",
        "Special equipment: a carpet or upholstery needle; kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Herb",
        "Onion",
        "Potato",
        "Braise",
        "Christmas",
        "Easter",
        "Veal",
        "Christmas Eve",
        "Dill",
        "Gourmet"
    ],
    "title": "Braised Veal Breast with Potato-and-Onion Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/braised-veal-breast-with-potato-and-onion-stuffing-237661"
}
