{
    "directions": [
        "Pour the wine into a large saucepan set over medium heat. When the wine is heated, carefully set it aflame. Let the flames die out, then increase the heat so that the wine boils; allow it to boil until it cooks down by 1/2. Remove from the heat.",
        "Center a rack in the oven and preheat the oven to 350 degrees F.",
        "Heat the oil in a Dutch oven or large casserole, large enough to hold 6 ribs, over medium-high heat. Season the ribs all over with salt and the crushed pepper. Dust the ribs with about 2 tablespoons of matzoh meal and then when the oil is hot, slip the ribs into the pot and sear for 4 to 5 minutes on each side, until well browned.",
        "Transfer the browned ribs to a plate. Remove all but 1 tablespoon of fat from the pot; lower the heat to medium, and toss in the vegetables and herbs. Brown the vegetables lightly, 5 to 7 minutes, then stir in the tomato paste and cook for 1 minute to blend.",
        "Add the reduced wine, browned ribs, and stock to the pot. Bring to a boil; cover the pot tightly, and slide it into the oven to braise for about 2 1/2 hours, or until the ribs are tender enough to be easily pierced with a fork. Every 30 minutes or so, lift the lid and skim and discard whatever fat may have bubbled up to the surface.",
        "Carefully transfer the meat to a heated serving platter with a lip and keep warm. Boil the pan liquid until it thickens and reduces to approximately 1 quart. Season with salt and pepper and pass through a fine-mesh strainer; discard the solids.",
        "Presentation: Pour the sauce over the meat. Serve with vegetables of your choice."
    ],
    "ingredients": [
        "1 bottle kosher for Passover Cabernet Sauvignon",
        "2 tablespoons kosher for Passover vegetable oil",
        "6 short ribs, trimmed",
        "Salt",
        "1 teaspoon black peppercorns, crushed",
        "Matzoh meal, for dredging",
        "10 cloves garlic, peeled",
        "8 large shallots, peeled, trimmed, rinsed, split, and dried",
        "2 medium carrots, peeled, trimmed, and cut into 1-inch lengths",
        "2 stalks celery, peeled, trimmed, and cut into 1-inch lengths",
        "1 medium leek, white and light green parts only, coarsely chopped",
        "6 sprigs Italian parsley",
        "2 sprigs thyme",
        "2 bay leaves",
        "2 tablespoons tomato paste",
        "2 quarts unsalted beef stock or chicken stock",
        "Freshly ground white pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Dutch Oven",
        "Jewish Cooking",
        "Short Ribs",
        "Holiday",
        "Passover",
        "Carrot Recipes",
        "Vegetable",
        "Leek Recipes",
        "Celery",
        "Shallot Recipes",
        "Beef",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Braised Short Ribs",
    "url": "http://www.foodnetwork.com/recipes/braised-short-ribs-recipe1"
}
