{
    "directions": [
        "Stir paprika, 1 1/2 teaspoons coarse kosher salt, 1 teaspoon black pepper, coriander, ginger, allspice, and cinnamon in small bowl to blend. Spread spice mixture all over pork shoulder. Wrap in plastic and refrigerate overnight.",
        "Preheat oven to 325°F. Melt butter with oil in heavy large oven-proof pot over medium-high heat. Add pork shoulder and brown on all sides, about 10 minutes. Transfer pork to plate. Pour off all but 2 tablespoons drippings from pot and reduce heat to medium. Add quince to pot. Sauté until cut sides are lightly browned, 5 to 7 minutes. Using slotted spoon, transfer quince to bowl. Add onions, celery, and carrot to pot. Sauté until vegetables begin to soften, about 10 minutes. Add garlic; auté1 minute. Add pomegranate juice and chicken broth. Bring to boil, scraping up browned bits. Add red currant jelly, bay leaves, and thyme, then quince. Return pork to pot, fat side up. Cover pot with foil, then lid; place in oven.",
        "Braise pork until very tender and thermometer inserted into center registers 165°F, basting occasionally, about 2 hours 15 minutes. Cool pork uncovered at room temperature 1 hour. Chill uncovered until cold, then cover and chill at least 1 day and up to 3 days.",
        "Preheat oven to 350°F. Transfer pork to work surface. Cut off string. Cut pork crosswise into 1/2-inch-thick slices. Overlap slices in 13x9x2-inch baking dish. Using slotted spoon, arrange vegetables and quince around pork. Boil juices in pot until thickened enough to coat spoon, about 15 minutes. Season with coarse kosher salt, pepper, and lemon juice to taste. Pour over pork. Cover and bake until heated through, about 30 minutes.",
        "Sprinkle pork with chopped mint; surround with lemon wedges and serve."
    ],
    "ingredients": [
        "2 teaspoons paprika",
        "1 1/2 teaspoons coarse kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon ground coriander",
        "1/2 teaspoon ground ginger",
        "1/8 teaspoon ground allspice",
        "Pinch of ground cinnamon",
        "1 5 1/2-pound boneless pork shoulder (Boston butt), trimmed, tied in several places to hold shape",
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "3 large quinces (about 1 1/2 pounds total), peeled, cored, each cut into 8 wedges",
        "2 cups chopped onions",
        "1/2 cup chopped celery",
        "1/2 cup finely chopped carrot",
        "3 large garlic cloves, chopped",
        "1 cup pomegranate juice",
        "1/2 cup low-salt chicken broth",
        "2 tablespoons red currant jelly",
        "2 small bay leaves",
        "1 teaspoon chopped fresh thyme",
        "Lemon juice",
        "Chopped fresh mint",
        "Lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Braise",
        "Marinate",
        "Father's Day",
        "Dinner",
        "Quince",
        "Carrot",
        "Fall",
        "Pomegranate",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Braised Pork Shoulder with Quince",
    "url": "http://www.epicurious.com/recipes/food/views/braised-pork-shoulder-with-quince-350109"
}
