{
    "directions": [
        "Bring apple cider, maple syrup, butter, vinegar, and salt to a simmer in a large Dutch oven or other heavy pot over medium-low heat, stirring to melt butter. Add apples to pot in a single layer (you might need to cook in batches depending on the size of your pot) and return liquid to a very gentle simmer. Cook, turning apples halfway through, until a skewer (or the tip of a small knife) slides easily through flesh but apples stay intact, 20–25 minutes; set aside.",
        "Remove apples from pot with a slotted spoon and place, cut side up, on a rimmed baking sheet; set aside. Bring liquid in pot to a boil over medium-high heat. Cook, swirling occasionally, until reduced to a thick caramel with bubbles that slowly expand and then pop, 15–20 minutes. Add cream and stir until sauce is smooth. Reduce heat to low and keep sauce warm in pot while you brûlée the caramel apples.",
        "Sprinkle cut sides of reserved apples with sugar and caramelize with kitchen torch (alternatively, you can brûlée them under the broiler, about 3 minutes).",
        "To serve, scoop ice cream into bowls; place an apple half, brûléed side up, in each. Drizzle with warm caramel sauce and top with some nuts.",
        "Apples can be braised 1 day ahead. Let cool in liquid, then cover and chill. Reheat over low before continuing."
    ],
    "ingredients": [
        "4 cups unfiltered apple cider",
        "3/4 cup pure maple syrup",
        "4 tablespoons unsalted butter",
        "2 tablespoons apple cider vinegar",
        "Pinch of kosher salt",
        "4 large firm baking apples, halved, cored with a melon baller",
        "1/4 cup heavy cream",
        "1 cup sugar",
        "2 pints vanilla ice cream",
        "Candied or unsalted, roasted nuts (for serving)",
        "A kitchen torch (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Apple",
        "Ice Cream",
        "Butterscotch/Caramel",
        "Dessert",
        "Maple Syrup",
        "Fall",
        "Wheat/Gluten-Free"
    ],
    "title": "Braised and Brûléed Apples With Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/braised-and-bruleed-apples-with-ice-cream"
}
