{
    "directions": [
        "Rinse the rice in a sieve under cold running water until the water runs clear; put to one side.",
        "Heat the olive oil in a large, heavy-bottomed pot and throw in the onions. Cook over medium heat until they soften and turn golden. Season the chicken thighs and add them to the pan. Brown on all sides, then pour in 2 1/2 cups water and bring to a simmer. Cover with a lid and cook until the chicken is tender, about 20 minutes.",
        "Meanwhile, peel the zest from the orange with a potato peeler, then cut it into matchstick strips. Blanch in a small pan of boiling water for a couple of minutes, then drain.",
        "Dissolve the sugar in 1/2 cup (scant) water in a small, heavy-bottomed pan over medium heat, then bring to a boil and let bubble to reduce and thicken for 5 to 10 minutes until syrupy. Add the orange zest, slivered almonds, and pistachios and boil for 5 minutes, skimming off any froth. Strain the syrup and return to the pan; set aside the orange zest and nuts. Add the saffron and rose water to the syrup and boil again for 3 minutes, then add the cardamom seeds.",
        "Preheat the oven to 300 degrees F. Strain the stock from the chicken thighs and add the syrup to it. Make this up to 3 cups with more water. Bring it to a boil in an ovenproof casserole and add the rice. Season and add two-thirds of the orange zest and nuts, keeping the rest to one side. Bring back to a boil, then cover and simmer until the rice is cooked. The liquid should have all been absorbed by now.",
        "Bury the chicken and onions in the rice and add the fava beans and peas, if you are including them. Put the lid on and cook in the oven for 20 minutes.",
        "Serve straight from the pan or, if you prefer, in a large, warmed serving dish. Sprinkle the last third of the orange zest and nuts over the top before bringing it to the table."
    ],
    "ingredients": [
        "1 1/2 cups brown basmati rice",
        "1/4 cup olive oil",
        "2 medium onions, peeled and minced",
        "coarse salt and black pepper",
        "4 large chicken thighs, chopped in half, or 8 smaller ones",
        "about 4 cups water",
        "1 large organic orange",
        "1 tablespoon unrefined granulated sugar",
        "1/2 cup slivered blanched almonds",
        "1/2 cup shelled, chopped pistachio nuts",
        "large pinch of saffron threads",
        "2 to 3 teaspoons rose water",
        "7 or 8 cardamom pods, lightly crushed, seeds extracted",
        "a handful of blanched, skinned baby fava beans (optional)",
        "a handful of blanched peas (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Citrus",
        "Fruit",
        "Nut",
        "Poultry",
        "Dinner",
        "Casserole/Gratin",
        "Orange",
        "Tree Nut",
        "Almond",
        "Pistachio",
        "Spice",
        "Saffron",
        "Potluck",
        "Advance Prep Required",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Braised Chicken and Rice with Orange, Saffron, Almond, and Pistachio Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-and-rice-with-orange-saffron-almond-and-pistachio-syrup-358563"
}
