{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "Simmer the garlic in a saucepan of water until tender, about 10 minutes (this will soften the flavor). Drain and let cool, then pop the jackets off the cloves and reserve.",
        "Sprinkle the chicken with salt and pepper. Heat the EVOO in a large ovenproof skillet. Add the chicken, skin-side down, and cook until the skin is browned and very crisp, 7 to 8 minutes. Flip the chicken and brown the other side, 3 to 4 minutes more. Remove the chicken to a plate. Melt the butter into the fat remaining in the skillet and add the mushrooms and thyme. Cook until the mushrooms are browned and very tender, 12 to 15 minutes. Deglaze with the Marsala, stirring and scraping up any browned bits from the bottom of the skillet with a wooden spoon. Return the chicken to the skillet, skin-side up, and add the garlic. Add enough stock to come up and around the chicken but not cover the skin. Transfer the skillet to the oven and cook for 45 minutes.",
        "Transfer the chicken to a warmed platter and loosely tent with foil. Reduce the sauce on the stovetop until it is thick enough to coat the back of a spoon. Add the kale and cook until just wilted, then stir in a bit of nutmeg.",
        "Spoon the sauce and kale into shallow bowls and top with the chicken. Serve with warm bread for mopping."
    ],
    "ingredients": [
        "40 large cloves hardneck or purple garlic, unpeeled",
        "8 large skin-on, bone-in chicken thighs",
        "Kosher salt and freshly ground pepper",
        "2 tablespoons EVOO",
        "1 small bunch Tuscan kale or spinach, stemmed (if using kale, thinly slice)",
        "4 tablespoons butter",
        "1 pound cremini mushrooms, thinly sliced",
        "2 tablespoons finely chopped fresh thyme",
        "1/2 cup Marsala wine",
        "3 to 4 cups chicken stock",
        "Freshly grated nutmeg",
        "Ciabatta bread, for mopping"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes"
    ],
    "title": "Braised Chicken Thighs with 40 Cloves of Garlic",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/braised-chicken-thighs-with-40-cloves-of-garlic-recipe"
}
