{
    "directions": [
        "Preheat oven to 350°F. Trim fat from lamb and discard. Cut each chop lengthwise along bones into 3 separate pieces, leaving bones attached to meat. Sprinkle lamb with salt and pepper. Melt 1 tablespoon butter with 1 tablespoon oil in large ovenproof pot over high heat. Working in batches, add lamb to pot and sauté until browned on all sides, about 8 minutes per batch. Transfer lamb to bowl. Add onions, 2 chopped carrots, halved head of garlic, and 6 thyme sprigs to pot and sauté until onions are brown, about 7 minutes. Add tomatoes and stir 2 minutes. Return lamb and any accumulated juices to pot. Stir in 1 1/2 cups water. Sprinkle with salt and pepper. Bring mixture to simmer. Cover pot tightly; transfer to oven and bake until lamb is very tender, adding up to 3/4 cup more water if juices evaporate, about 2 hours 15 minutes.",
        "Using tongs, transfer lamb to medium bowl; discard bones. Pour vegetable mixture from pot into strainer set over large bowl. Press on solids to extract as much vegetable pulp and pan juice as possible. Return strained pulp and juice to pot. Spoon off fat from surface. Return lamb to pot; bring mixture to simmer. Season to taste with salt and pepper.",
        "Melt 2 tablespoons butter with 1 tablespoon oil in large nonstick skillet over medium-high heat. Add sliced carrots, 2 thyme sprigs, fennel, and bay leaf and sauté until vegetables begin to soften, about 5 minutes. Reduce heat to medium-low; cover and simmer until vegetables are very tender, stirring often, about 35 minutes. Discard thyme and bay leaf. Season with salt and pepper. Serve with sautéed vegetables."
    ],
    "ingredients": [
        "4 2-inch-thick lamb shoulder-blade chops (about 4 3/4 pounds total)",
        "3 tablespoons butter",
        "2 tablespoons olive oil",
        "2 large red onions, coarsely chopped",
        "6 large carrots, 2 peeled and coarsely chopped, 4 peeled and sliced into rounds",
        "1 head of garlic, unpeeled, cut horizontally in half",
        "8 large fresh thyme sprigs",
        "1 1/2 pounds tomatoes, coarsely chopped",
        "1 1/2 cups (or more) water",
        "2 large fennel bulbs, trimmed, cored, cut into matchstick-size strips",
        "1 bay leaf"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Braise",
        "Dinner",
        "Fennel",
        "Carrot",
        "Spring",
        "Thyme",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Braised Lamb Shoulder with Thyme, Carrots, and Fennel",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shoulder-with-thyme-carrots-and-fennel-105076"
}
