{
    "directions": [
        "Place beans in large saucepan. Add cold water to cover by 2 inches and bring to boil. Remove from heat; cover and let stand 1 hour.",
        "Drain beans. Heat oil in same pan over medium-high heat. Add onion, celery, and carrot; sauté until vegetables begin to brown, about 10 minutes. Add rosemary and thyme. Return beans to pan. Add enough cold water to cover by 2 inches and bring to boil. Reduce heat to medium-low. Simmer beans uncovered until almost tender, about 45 minutes. Add 1 teaspoon salt. Continue to simmer until beans are tender, stirring occasionally and adding more water to keep covered if necessary, about 45 minutes longer. Add raisins; season beans with pepper. Cool. (Can be made 1 day ahead. Cover and chill.)",
        "Preheat oven to 350°F. Sprinkle short ribs on all sides with salt and pepper. Heat oil in heavy large wide ovenproof pot over medium-high heat. Add short ribs in single layer and brown on all sides, about 12 minutes. Transfer ribs to plate. Add onion, carrot, celery, 2 thyme sprigs, and garlic to pot. Sauté until vegetables brown, about 10 minutes. Return ribs to pot in single layer, meat side down. Add broth, vinegar, tarragon sprigs, and remaining 3 thyme sprigs and bring to simmer (broth will not cover ribs). Bake uncovered until ribs are tender, about 1 hour 45 minutes.",
        "Using oven mitts, transfer short ribs to stove top. Tilt pot; spoon off fat from surface. Drain bean-raisin mixture. Add cherry peppers and drained bean-raisin mixture. Simmer until sauce thickens slightly, about 15 minutes. Season with salt and pepper. Transfer to bowl."
    ],
    "ingredients": [
        "1 1/2 cups dried garbanzo beans",
        "1 tablespoon extra-virgin olive oil",
        "1 medium onion, quartered",
        "1 celery stalk, halved",
        "1 medium carrot, halved",
        "4 large fresh rosemary sprigs",
        "4 large fresh thyme sprigs",
        "1 teaspoon salt",
        "1/2 cup raisins",
        "8 3- to 4-inch-long meaty short ribs",
        "2 tablespoons vegetable oil",
        "1 small onion, chopped",
        "1 small carrot, chopped",
        "1 celery stalk, chopped",
        "5 large fresh thyme sprigs",
        "3 garlic cloves, unpeeled",
        "3 cups low-salt chicken broth",
        "1/2 cup Sherry wine vinegar",
        "2 fresh tarragon sprigs",
        "8 hot cherry peppers from jar, drained, left whole"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Beef",
        "Braise",
        "Dinner",
        "Raisin",
        "Beef Rib",
        "Hot Pepper",
        "Winter",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Braised Short Ribs with Garbanzo Beans and Raisins",
    "url": "http://www.epicurious.com/recipes/food/views/braised-short-ribs-with-garbanzo-beans-and-raisins-108568"
}
