{
    "directions": [
        "Cook bacon in a deep 12-inch heavy skillet over moderately low heat, stirring, until crisp, about 8 minutes. Transfer with a slotted spoon to paper towels to drain and reserve bacon fat in skillet.",
        "While bacon is cooking, pat chicken dry and season with salt and pepper. Brown, beginning with skin sides down, in 2 batches in bacon fat over moderately high heat, turning, about 8 minutes. Transfer chicken as browned with tongs to a plate and pour off all but 2 tablespoons fat from skillet.",
        "Add shallots to skillet and cook over moderately low heat, covered, stirring occasionally, until soft and pale golden, about 10 minutes.",
        "Remove lid and cook shallots, stirring, until deep golden, about 10 minutes more. Add garlic and 1 cup water to skillet and boil, stirring, 1 minute.",
        "Return chicken to skillet, turning pieces to coat, then arrange them skin sides up and gently simmer, covered, until chicken is cooked through and garlic is tender, about 30 minutes.",
        "Transfer chicken with tongs to a serving dish. Add vinegar to sauce and boil, uncovered, mashing garlic with back of a spoon, until slightly thickened. Season sauce with salt and pepper and pour over chicken, then sprinkle with bacon."
    ],
    "ingredients": [
        "6 bacon slices (4 oz), cut crosswise into 1/4-inch-wide strips",
        "1 (3 1/2-lb) chicken, cut into 8 serving pieces",
        "1 lb shallots, thinly sliced",
        "1 head garlic, cloves separated and peeled",
        "1/4 cup balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Braise",
        "Vinegar",
        "Bacon",
        "Fall",
        "Shallot",
        "Gourmet"
    ],
    "title": "Braised Chicken with Shallots, Garlic, and Balsamic Vinegar",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-with-shallots-garlic-and-balsamic-vinegar-105589"
}
