{
    "directions": [
        "Place porcini mushrooms in small bowl. Pour 1 cup boiling water over and let stand until mushrooms soften, at least 30 minutes. Drain and chop mushrooms; reserve soaking liquid.",
        "Preheat oven to 325F. Sprinkle pork with salt and pepper. Heat 3 tablespoons oil in heavy large wide pot over medium-high heat. Add pork, in batches if necessary, and saut until brown on all sides, about 15 minutes. Transfer pork to rimmed baking sheet.",
        "Spoon off and discard all but 2 tablespoons fat from pot. Reduce heat to medium. Add onion, carrots, leek, celery, and prosciutto. Cover and cook until vegetables are soft and beginning to color, stirring occasionally, about 10 minutes. Mix in garlic and chopped porcini. Add wine and bring to boil, scraping up any browned bits. Add broth and reserved mushroom soaking liquid, leaving any sediment in bowl. Mix in 1 teaspoon sage and 1 teaspoon rosemary. Return pork and any accumulated juices to pot, arranging in single layer.",
        "Bring pork mixture to boil, cover pot, and place in oven. Braise pork until very tender, turning over every 30 minutes, about 1 hour 30 minutes. Do ahead Can be made 2 days ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep refrigerated. Simmer until just warm before continuing.",
        "Preheat oven to 425F. Transfer pork to rimmed baking sheet. Brush with remaining 1 tablespoon oil; sprinkle with remaining 2 teaspoons sage, 1 teaspoon rosemary, and black pepper. Roast pork until browned, about 20 minutes.",
        "Meanwhile, tilt pan and spoon any fat from surface of sauce. Boil until sauce coats spoon lightly, about 7 minutes. Season with salt and pepper.",
        "Spoon sauce onto large shallow platter or divide among 4 shallow bowls. Top sauce with pork, sprinkle with parsley, and serve."
    ],
    "ingredients": [
        "1 ounce dried porcini mushrooms",
        "1 cup boiling water",
        "4 whole fresh pork shanks with rind (each 1 1/4 to 1 1/2 pounds)",
        "4 tablespoons olive oil, divided",
        "1 large onion, chopped",
        "1 cup chopped carrots",
        "1 cup chopped leek (white and pale green parts only)",
        "1/2 cup chopped celery",
        "2 ounces prosciutto, chopped",
        "6 garlic cloves, chopped",
        "1 cup dry white wine",
        "1 cup low-salt chicken broth",
        "3 teaspoons chopped fresh sage, divided",
        "2 teaspoons chopped fresh rosemary, divided",
        "Chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Mushroom",
        "Onion",
        "Pork",
        "Braise",
        "Roast",
        "Sauté",
        "Leek",
        "Carrot",
        "White Wine",
        "Prosciutto"
    ],
    "title": "Braised and Roasted Pork Shanks With Prosciutto and Porcini Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/braised-and-roasted-pork-shanks-with-prosciutto-and-porcini-mushrooms-236872"
}
