{
    "directions": [
        "In a large bowl, stir together the flour, yeast, sugar, and salt. Then add the milk and egg and stir briefly. Add the butter and knead the dough briefly by hand in the bowl. Scrape it out onto a lightly floured work surface and continue to knead it for several minutes. You may need to add 1 to 2 additional tablespoons of flour, but resist the urge to add more; the dough should be quite soft and rich. You won’t be able to knead it as long as other yeast doughs, but try to get it to a point where it’s no longer too sticky and can be formed into a ball.",
        "Place the ball back in the bowl. Cover the bowl with a clean dishcloth and place in a warm, draft-free place for 1 hour to rise.",
        "Place the raisins in a small bowl and add the rum and lemon juice. Set aside to macerate for 30 minutes.",
        "Heat the oven to 350°F/180°C. Line a baking sheet with parchment paper. In a medium bowl, combine the almond paste, sugar, egg white, 1 tablespoon of milk, butter, and salt; knead together by hand until well combined. Knead in the raisins and their macerating liquid. The mixture should be creamy but will still hold its shape when spread. If necessary, mix in the remaining 1 tablespoon of milk. Set aside.",
        "When the proofing hour is up, gently tug the dough onto a work surface. Roll out the dough to a 13 by 16-inch/33 by 40cm rectangle. You can pull the edges out to form neat corners.",
        "Scrape the filling onto the dough and, using a bench scraper, spread the mixture out evenly over the dough, leaving a 1-inch/2.5cm border on one of the long sides. Starting from the other long side, roll up the dough. Using a sharp bench scraper, cut the roll of dough in half lengthwise, leaving about 1 inch/2.5cm at one end still attached. Working quickly, twist the 2 strands around each other all the way down the length of the roll. Then form the wrapped dough strands into a circle. Next, slice through the end that you left attached and tuck the end pieces at both ends underneath each other to make a neat closure.",
        "Transfer the wreath to the prepared pan (you may need someone to help you do this) and bake for 45 minutes at the second-lowest rack position, rotating halfway through. When finished, the loaf will be golden brown all over and should sound slightly hollow when tapped. It will still be quite soft.",
        "Just before the end of the baking time, heat the apricot jam over medium-high heat until loose and bubbling. When the wreath emerges from the oven, immediately brush it all over with the hot jam. Place the pan on a rack to cool.",
        "When the wreath has almost fully cooled, sift the confectioners’ sugar into a small bowl and whisk in the water. Whisk until smooth and lump-free. You want a thick but pourable glaze. Add more sugar or a drop more water as needed. Drizzle the glaze back and forth over the entire wreath. Wait 1 hour for the glaze to set and the cake to cool completely and then slice and serve. The cake is best eaten the day it is made, but it can be kept at room temperature, loosely wrapped in plastic wrap, for 2 additional days."
    ],
    "ingredients": [
        "3 1/4 cups, scooped and leveled, minus 1 tablespoon/ 400g all-purpose flour, plus more for kneading",
        "1 1/2 teaspoons instant yeast",
        "1/3 cup/70g granulated sugar",
        "1/4 teaspoon salt",
        "3/4 cup plus 1 tablespoon/190ml whole milk",
        "1 egg",
        "8 tablespoons/115g unsalted high-fat, European-style butter, at room temperature",
        "2/3 cup/100g raisins",
        "3 tablespoons dark rum",
        "Juice of 1/2 lemon",
        "1 pound/455g almond paste",
        "1/4 cup/50g granulated sugar",
        "1 egg white",
        "1 to 2 tablespoons whole milk",
        "3 1/2 tablespoons/50g unsalted butter, at room temperature",
        "1/4 teaspoon salt",
        "1/2 cup/150g smooth apricot jam",
        "13 tablespoons/100g confectioners’ sugar",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Christmas",
        "Christmas Eve",
        "Bread",
        "Breakfast",
        "Brunch",
        "Dried Fruit",
        "Rum",
        "Almond",
        "Raisin",
        "Dessert"
    ],
    "title": "Braided Almond-Cream Wreath (*Kranzkuchen*)",
    "url": "http://www.epicurious.com/recipes/food/views/braided-almond-cream-wreath-kranzkuchen"
}
