{
    "directions": [
        "Pat the lamb shanks dry, season them with salt and pepper, and in a large heavy kettle brown them, 3 at a time, in the oil over moderately high heat, transferring them as they are browned to a roasting pan just large enough to hold them in one layer. To the kettle add the onion, cook it over moderate heat, stirring, until it is softened, and stir in the garlic. Cook the mixture for 3 minutes, stir in the tomatoes, the wine, the broth, the dried rosemary, the allspice, and salt and pepper to taste, and bring the sauce to a boil. Ladle the sauce over the lamb shanks. Braise the shanks, covered tightly with foil, in the middle of a preheated 350°F. oven for 1 1/2 hours, or until they are tender, transfer them to a heatproof platter, and keep them warm, covered. Pour the sauce into the kettle, cleaned, and boil it for 10 minutes, or until it is reduced to about 4 cups. The lamb shanks and the sauce may be made 2 days in advance, cooled to room temperature, and both kept in the roasting pan, covered and chilled. Heat the lamb shanks in the sauce in a preheated 350°F. oven until they are hot and transfer the shanks to the heatproof platter. Into the sauce stir 2 teaspoons of the parsley and 2 teaspoons of the fresh rosemary. Divide the shanks among 6 heated plates, spoon the sauce over them, and sprinkle it with the remaining parsley and fresh rosemary."
    ],
    "ingredients": [
        "6 lamb shanks (about 1 pound each)",
        "2 tablespoons olive oil",
        "4 cups chopped onion",
        "4 garlic cloves, minced",
        "two 28-to-32-ounce cans tomatoes, drained and chopped",
        "1 1/2 cups dry white wine",
        "1 1/2 cups chicken broth",
        "1 1/2 teaspoons crumbled dried rosemary",
        "3/4 teaspoon ground allspice",
        "1 tablespoon minced fresh parsley leaves",
        "1 tablespoon minced fresh rosemary leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Onion",
        "Tomato",
        "Braise",
        "Rosemary",
        "White Wine",
        "Fall",
        "Kosher",
        "Parsley",
        "Gourmet"
    ],
    "title": "Braised Lamb Shanks with Tomatoes and Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-with-tomatoes-and-rosemary-10740"
}
