{
    "directions": [
        "Put oven rack in lower third of oven and preheat oven to 350°F.",
        "Pat pork dry with paper towels, then sprinkle with salt. Heat 1 tablespoon oil in a wide 6-quart heavy pot over moderately high heat until hot but not smoking, then brown pork in 3 batches, turning, about 5 minutes per batch, transferring to a bowl as browned. (Add more oil to pot as needed between batches.)",
        "Pour off all but 1 tablespoon fat from pot. Add onion, bell pepper, and celery and cook over moderate heat, stirring, until softened, 3 to 5 minutes. Stir in garlic, cumin, coriander, turmeric, and cayenne and cook, stirring, 1 minute. Add pork with any juices accumulated in bowl, water, and tomatoes and bring to a simmer.",
        "Cover pot, then transfer to oven and braise pork until very tender, about 1 3/4 hours.",
        "Scatter persimmons over pork and braise in oven, partially covered, 10 minutes more. Stir in scallion greens and salt and pepper to taste."
    ],
    "ingredients": [
        "2 1/2 pounds boneless pork shoulder, cut into 1 1/2-inch pieces",
        "3/4 teaspoon salt",
        "1 to 3 tablespoons vegetable oil",
        "1 onion, chopped",
        "1 green bell pepper, chopped",
        "1 celery rib, chopped",
        "1 large garlic clove, minced",
        "1 tablespoon ground cumin",
        "2 teaspoons ground coriander",
        "1 teaspoon ground turmeric",
        "1/8 teaspoon cayenne",
        "2 cups water",
        "4 plum tomatoes (3/4 pounds total), peeled (see cooks' note, below) and chopped, or 1 (14- to 16-oz) can whole tomatoes, drained and chopped",
        "1 1/2 pounds firm-ripe Fuyu persimmons, peeled, seeded if necessary, and cut into 1/4-inch-thick wedges",
        "1/2 cup chopped scallion greens",
        "Accompaniment: cooked white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Pork",
        "Tomato",
        "Braise",
        "Low/No Sugar",
        "Spice",
        "Winter",
        "Persimmon",
        "Gourmet"
    ],
    "title": "Braised Pork with Fuyu Persimmon",
    "url": "http://www.epicurious.com/recipes/food/views/braised-pork-with-fuyu-persimmon-108886"
}
