{
    "directions": [
        "In resealable, 2-gallon plastic bag, place short ribs. Add wine, thyme, parsley, bay leaves, 1 tablespoon pepper, fennel seed, mustard seed, and garlic. Place bag in large bowl and marinate in refrigerate for at least 8 hours and up to 24 hours.",
        "Remove ribs from marinade and drain, reserving liquid. Pat ribs dry and sprinkle with kosher salt and remaining 2 teaspoons pepper.",
        "Put rack in middle position in oven and preheat to 325°F.",
        "In heavy, 12-inch skillet over moderately high heat, heat 1/4 cup oil just until smoking. Working in 3 batches (wipe pan clean and add 1/4 cup oil between batches), sear ribs, turning with tongs, until well-browned on all sides, about 8 minutes total. Transfer ribs, bone side up and in 1 layer, to a 3- to 4-inch deep roasting pan and set aside. Do not clean skillet.",
        "Add onions, carrots, celery, and mushrooms to skillet. Over moderately high heat, sauté until onions start to soften, about 15 minutes.",
        "Transfer vegetables to wide, 6-quart sauce pot, making sure to scrape up any brown bits from bottom and sides of skillet. Add reserved marinade and reduce until pan is almost dry, about 1 hour. Add stock and bring to boil. Pour stock mixture over ribs and cover with foil. Transfer to oven and braise until meat is tender and falling off bone, about 2 1/2 hours. Let cool slightly.",
        "When ribs are cool enough to handle, remove any excess fat and discard bones. Transfer beef, reserving liquid, to bowl and cover with foil to keep warm.",
        "Strain cooking liquid through fine-mesh sieve and into medium saucepan, pressing on solids. Discard solids and skim fat. Add carrots and celery and bring to a boil. Continue cooking until reduced to about 2 1/2 cups, about 25 minutes. To serve, spoon braising liquid over sauce, making sure to include carrots and celery, and finish with horseradish."
    ],
    "ingredients": [
        "10 (6-inch) beef short ribs (about 9 pounds total)",
        "8 cups red wine",
        "1 bunch fresh thyme",
        "1 bunch fresh flat-leaf parsley",
        "2 fresh bay leaves or 1 dried",
        "1 tablespoon plus 2 teaspoons freshly ground black pepper",
        "1 tablespoon fennel seed",
        "1 tablespoon mustard seed",
        "1 head garlic, peeled and coarsely chopped",
        "2 tablespoons kosher salt",
        "3/4 cup olive oil",
        "3 cups onions, peeled and cut into 1/2-inch pieces (about 3 medium onions)",
        "2 1/2 cups carrots, peeled and cut into 1/2-inch pieces (about 6 medium carrots)",
        "2 1/2 cups celery, leaves removed and cut into 1/2-inch pieces (about 6 celery ribs)",
        "1/2 pound white mushrooms, trimmed and cut into 1/2-inch pieces",
        "6 cups veal stock or low-sodium chicken broth",
        "1 cup carrots, peeled and diced (about 2 medium carrots)",
        "1 cup celery, leaves removed and diced (about 2 celery ribs)",
        "2 tablespoons fresh horseradish, grated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Mushroom",
        "Onion",
        "Braise",
        "Marinate",
        "Dinner",
        "Horseradish",
        "Beef Rib",
        "Red Wine",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Braised Short Rib of Beef",
    "url": "http://www.epicurious.com/recipes/food/views/braised-short-rib-of-beef-235925"
}
