{
    "directions": [
        "Preheat a Cuisinart multicooker on the brown/sauté setting to 450°F according to the manufacturer’s instructions. Season the beef with salt and pepper. Warm 1 Tbs. of the olive oil in the multicooker. Working in batches, brown the beef on all sides, about 8 minutes per batch. Using a slotted spoon, transfer the beef to a plate.",
        "Discard most of the fat from the multicooker insert and return the insert to the base. Add the yellow onion, thyme sprigs and bay leaves and sauté until the onion begins to brown, 4 to 6 minutes. Add the garlic and cinnamon stick and cook for 1 minute. Stir in the wine, the 2 Tbs. vinegar, carrots, tomatoes, stock and beef. Set the multicooker on the slow cook-high setting, cover and cook for 2 hours.",
        "Scatter the pumpkin over the beef, cover and cook until the beef and pumpkin are very tender, 1 to 2 hours more. Discard the thyme sprigs, bay leaves and cinnamon stick. Using a large spoon, skim off the fat.",
        "In a small bowl, whisk together the remaining 1 Tbs. olive oil, the 1 tsp. vinegar, the 1/4 tsp. salt and several grinds of pepper. Stir in the green onions and mint.",
        "Ladle the meat and vegetables into warmed bowls and spoon the green onion mixture on top. Serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "The New Slow Cooker",
        ", by Brigit Binns (Weldon Owen, 2010)."
    ],
    "ingredients": [
        "3 lb. beef bottom round, trimmed of most fat and cut into 1 1/4-inch chunks",
        "Kosher salt, to taste, plus 1/4 tsp.",
        "Freshly ground pepper, to taste",
        "2 Tbs. olive oil",
        "1 yellow onion, finely chopped",
        "2 fresh thyme sprigs",
        "3 bay leaves",
        "4 garlic cloves, finely chopped",
        "1 cinnamon stick",
        "1/3 cup dry red wine",
        "2 Tbs. plus 1 tsp. red wine vinegar",
        "2 large carrots, peeled and cut into chunks",
        "1 can (15 oz.) diced tomatoes, drained",
        "1/3 cup beef or chicken stock",
        "1 lb. pumpkin or butternut squash, peeled, seeded and cut into 3/4-inch chunks",
        "2 green onions, thinly sliced",
        "1 Tbs. chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Braised Beef with Autumn Vegetables",
    "url": "http://www.williams-sonoma.com/recipe/braised-beef-with-autumn-vegetables.html"
}
