{
    "directions": [
        "Stir flour and allspice in medium bowl to blend. Sprinkle short ribs all over with salt and pepper. Add 6 ribs to flour mixture and turn to coat. Heat 3 tablespoons oil in heavy large pot over medium-high heat. Add floured ribs; saut) until brown, turning occasionally, about 6 minutes. Transfer to large bowl. Repeat flouring and browning with remaining 6 ribs; reserve remaining flour-coating mixture. Add 1 tablespoon oil to pot. Add onions, carrots and celery stalks; saut) until vegetables begin to brown and are very tender, scraping bottom of pot often, about 30 minutes.",
        "Add garlic, thyme and caraway seeds to pot; stir 1 minute. Mix in tomatoes and bay leaves. Return ribs and accumulated juices to pot, arranging ribs in single layer. Add broth and wine. Bring to boil. Reduce heat to medium-low, cover and simmer until meat is almost tender, about 1 hour.",
        "Uncover pot. Simmer ribs 30 minutes, occasionally spooning fat from surface; reserve 2 tablespoons fat. Stir reserved flour-coating mixture and reserved 2 tablespoons fat in small bowl until smooth; mix paste into sauce around ribs. Simmer until meat is very tender and gravy thickens, about 45 minutes longer. Season with salt and pepper.",
        "Transfer short ribs and gravy to large bowl. Sprinkle with celery leaves."
    ],
    "ingredients": [
        "1/4 cup all-purpose flour",
        "1 teaspoon (generous) ground allspice",
        "12 3- to 4-inch-long meaty short ribs (about 5 1/2 pounds), top membrane trimmed",
        "4 tablespoons vegetable oil",
        "3 large onions, chopped",
        "3 large carrots, peeled, chopped",
        "3 large celery stalks, chopped",
        "4 large garlic cloves, minced",
        "1 tablespoon dried thyme",
        "2 teaspoons caraway seeds",
        "8 ounces plum tomatoes, chopped",
        "3 small bay leaves",
        "3 cups canned beef broth",
        "2 cups dry red wine",
        "Chopped celery leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Braise",
        "Beef Rib",
        "Red Wine",
        "Fall"
    ],
    "title": "Braised Short Ribs with Red Wine Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/braised-short-ribs-with-red-wine-gravy-102173"
}
