{
    "directions": [
        "Char eggplant directly over gas flame or in broiler until blackened all over and eggplant begins to collapse, turning occasionally, about 15 minutes. Place eggplant in large bowl; cool 10 minutes. Peel off skin; place eggplant flesh in strainer set over large bowl. Press on eggplant to release juices; let drain 15 minutes. Transfer eggplant to medium bowl; add lemon juice. Mix Tandoori Spice Blend and vegetable oil in small bowl; add to eggplant and mash with fork to coarse puree. Season smoked eggplant to taste with salt and pepper. DO AHEAD: Smoked eggplant can be made 1 day ahead. Cover and chill. Bring to room temperature before using.",
        "Mix diced tomato, olive oil, chopped fresh cilantro, and grated fresh ginger in small bowl; season chutney to taste with salt and pepper. DO AHEAD: Chutney can be made 4 hours ahead. Let stand at room temperature.",
        "Bring unsweetened coconut milk, clam juice, and lemongrass to simmer in large skillet. Sprinkle halibut with salt and pepper; add to skillet. Simmer until halibut is just opaque in center, 3 to 4 minutes per side.",
        "Spoon dollop of smoked eggplant into center of each of 4 shallow bowls. Using slotted spatula, transfer halibut fillets to bowls; place atop eggplant. Spoon dollop of tomato-ginger chutney alongside. Garnish with radishes, sprouts, and microgreens, if desired."
    ],
    "ingredients": [
        "1 large eggplant (about 1 1/4 pounds)",
        "1 1/2 teaspoons fresh lemon juice",
        "1 teaspoon Tandoori Spice Blend",
        "1/2 teaspoon vegetable oil",
        "1 8-ounce tomato, peeled, seeded, diced",
        "2 tablespoons extra-virgin olive oil",
        "1 tablespoon finely chopped fresh cilantro",
        "1 teaspoon grated peeled fresh ginger",
        "1 cup canned unsweetened coconut milk",
        "1/2 cup bottled clam juice",
        "1 lemongrass stalk, bottom 3 inches only, thinly sliced",
        "4 6-ounce halibut fillets",
        "4 red radishes, trimmed, scrubbed, cut into matchstick-size pieces (for garnish)",
        "Daikon radish sprouts (for garnish)",
        "Microgreens (for garnish; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Ginger",
        "Herb",
        "Dinner",
        "Coconut",
        "Seafood",
        "Halibut",
        "Eggplant",
        "Lemongrass",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Braised Halibut Fillets in Coconut and Lemongrass with Smoked Eggplant and Tomato Ginger Chutney",
    "url": "http://www.epicurious.com/recipes/food/views/braised-halibut-fillets-in-coconut-and-lemongrass-with-smoked-eggplant-and-tomato-ginger-chutney-362938"
}
