{
    "directions": [
        "Bring water to a simmer in a small saucepan, then stir in mushrooms and simmer 10 minutes. Cool to room temperature, then strain through a sieve into a large bowl. Discard stems, then chill mushroom caps, covered, until ready to braise chicken. Stir remaining marinade ingredients into mushroom liquid, then add chicken and marinate, chilled, stirring occasionally, 1 day.",
        "Remove chicken from marinade and pat dry (discard marinade).",
        "Heat oil in a 12-inch heavy nonstick skillet over medium-high heat until hot. Just before browning each batch of chicken, sprinkle with 1 teaspoon kosher salt. Brown, skin side down first, about 3 minutes per side. Transfer to a plate.",
        "Pour off all but 1 tablespoon oil from skillet, then reduce heat to medium-low and sauté ginger, stirring, 1 minute (do not brown). Add white wine and Shaoxing and boil until reduced by three fourths, about 5 minutes. Add broth, 1 1/2 cups water, sugar, soy sauce, white pepper, and remaining 2 teaspoons kosher salt and bring to a simmer.",
        "Combine cornstarch and remaining 2 tablespoons cold water and whisk into sauce, then boil 1 minute.",
        "Transfer chicken, skin side up, to a 6-to 8-quart heavy pot (place white meat on top). Add sauce, chestnuts, and reserved mushroom caps. Gently simmer, covered, until chicken is just cooked through, 15 to 25 minutes.",
        "Cut breasts in half and return to pot. Add ham. Gently simmer 3 minutes more."
    ],
    "ingredients": [
        "2 3/4 cups water",
        "12 dried Chinese black mushrooms",
        "1/2 teaspoon white pepper",
        "2 teaspoons kosher salt, divided",
        "1 tablespoon soy sauce",
        "2 teaspoon sugar",
        "1 cup sliced peeled ginger",
        "1/4 cup Shaoxing wine or dry Oloroso Sherry",
        "1/4 cup dry white wine",
        "2 small chickens (2 1/2 to 3 pounds), each cut into 6 pieces (legs, thighs, and breasts without backbones)",
        "2 3/4 cups water",
        "2 tablespoons corn oil",
        "1 tablespoon plus 2 teaspoon kosher salt, divided",
        "1/4 cup finely julienned peeled ginger",
        "1/2 cup dry white wine",
        "3/4 cup Shaoxing wine or dry Oloroso Sherry",
        "3/4 cup dry Oloroso Sherry",
        "2 1/2 cups reduced-sodium chicken broth",
        "1 1/2 cups plus 2 tablespoon cold water, divided",
        "3 1/2 teaspoons sugar",
        "2 tablespoons soy sauce",
        "1 teaspoon white pepper",
        "2 tablespoons cornstarch",
        "7 to 8 ounces bottled roasted chestnuts",
        "1/4 pound thinly sliced country ham or speck",
        "Accompaniment: steamed jasmine rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Braise",
        "Marinate",
        "Dinner",
        "Lunar New Year",
        "Ham",
        "Chestnut",
        "Party",
        "Gourmet",
        "Dairy Free",
        "Peanut Free"
    ],
    "title": "Braised Chicken with Smoked Ham, Chestnuts, and Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-with-smoked-ham-chestnuts-and-ginger-350211"
}
