{
    "directions": [
        "Combine 2 cups hot water and mushrooms in small bowl. Let stand until mushrooms soften, about 30 minutes.",
        "Using vegetable peeler, remove peel (orange part only) from oranges in long strips. Squeeze juice from oranges; reserve peel and juice. Tie bay leaves, rosemary sprigs, and cloves in square of moistened cheesecloth.",
        "Heat 4 tablespoons olive oil in wide pot over medium-high heat. Add onions; sauté until golden, about 12 minutes. Using slotted spoon, transfer onions to small bowl. Add 2 tablespoons oil to pot. Sprinkle lamb with salt and pepper. Add 3 lamb shanks to pot. Sauté until brown on all sides, about 10 minutes. Transfer to plate. Repeat with remaining shanks. Return onions to pot. Using slotted spoon, add mushrooms, then mushroom soaking liquid, leaving any sediment in bowl. Add orange peel and juice, herb bundle, wine, and tomato paste. Boil 5 minutes, scraping up browned bits.",
        "Return lamb to pot, arranging in single layer. Add broth; bring to boil. Reduce heat to medium-low. Cover; simmer 30 minutes. Partially uncover pot. Simmer until lamb is tender, turning every 15 minutes, about 1 1/2 hours longer.",
        "Transfer lamb to bowl. Tilt pot and spoon fat off top of sauce. Boil until sauce is thick enough to coat spoon lightly and is reduced to 5 cups, about 35 minutes. Discard herb bundle and orange peel. Season sauce to taste with salt and pepper. Return lamb to pot, spooning sauce over to coat. (Can be made 1 day ahead. Refrigerate lamb, uncovered, until cold, then cover and keep refrigerated. Rewarm over low heat before continuing.)",
        "Spoon polenta onto large platter. Arrange lamb atop polenta. Spoon sauce over lamb and serve.",
        "*Dried porcini mushrooms are available at Italian markets, specialty foods stores, and many supermarkets."
    ],
    "ingredients": [
        "2 cups hot water",
        "1/2 cup dried porcini mushrooms*",
        "2 large oranges",
        "4 Turkish bay leaves",
        "2 large fresh rosemary sprigs",
        "4 whole cloves",
        "6 tablespoons extra-virgin olive oil",
        "2 cups finely chopped onions",
        "6 1-pound lamb shanks",
        "1 cup dry red wine (such as Barolo)",
        "1/4 cup tomato paste",
        "8 cups low-salt chicken broth",
        "Soft Polenta with Bay Leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Braise",
        "Rosemary",
        "Lamb Shank",
        "Red Wine",
        "Fall",
        "Clove"
    ],
    "title": "Braised Lamb Shanks on Soft Polenta with Bay Leaves",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-on-soft-polenta-with-bay-leaves-108567"
}
