{
    "directions": [
        "In a heavy skillet heat the oil over moderately high heat until it is hot but not smoking, in it brown the chicken, patted dry, and transfer the chicken to a plate. In the fat remaining in the skillet cook the onion, the garlic, and the peperoncini over moderately low heat, stirring, until the onion is softened. Add the bell pepper, the mushrooms, and salt and pepper to taste and cook the mixture over moderate heat, stirring, until the bell pepper is softened. Add the wine, the broth, the artichoke hearts, and the chicken, bring the liquid to a boil, and simmer the mixture, covered, for 15 to 20 minutes, or until the chicken is cooked through. Transfer the chicken to a platter and keep it warm. Whisk the beurre manié into the pepper mixture and simmer the sauce, whisking, for 2 to 3 minutes, or until it is thickened. Stir in the parsley and pour the sauce over the chicken."
    ],
    "ingredients": [
        "1 1/2 tablespoons olive oil",
        "1 whole chicken breast, halved",
        "1/2 cup finely chopped onion",
        "1 tablespoon minced garlic",
        "2 tablespoons minced peperoncini (pickled Tuscan peppers)",
        "1 red bell pepper, cut into julienne strips",
        "1/2 pound mushrooms, sliced",
        "1/2 cup dry white wine",
        "1/2 cup chicken broth",
        "a 14-ounce can artichoke hearts, rinsed, drained, and quartered",
        "a beurre manié made by kneading together 1 tablespoon softened unsalted butter and 1 tablespoon all-purpose flour",
        "3 tablespoons minced fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Pepper",
        "Braise",
        "Sauté",
        "Artichoke",
        "Gourmet"
    ],
    "title": "Braised Chicken with Artichoke Hearts, Mushrooms, and Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-with-artichoke-hearts-mushrooms-and-peppers-11955"
}
