{
    "directions": [
        "Preheat oven to 350°F.",
        "In a fine sieve rinse wild rice well and drain. In a small saucepan bring broth to a simmer. In a small flameproof casserole Sauté rice in oil over moderately high heat, stirring, 1 minute and stir in hot broth and salt and pepper to taste. Bring mixture to a boil and bake, covered, in middle of oven 1 hour, or until liquid is absorbed and rice is tender.",
        "While rice is cooking, in a 10-inch skillet cook bacon over moderate heat until crisp and transfer to paper towels to drain. Transfer all but 1 tablespoon drippings to a small bowl and reserve for cooking pheasant.",
        "Heat drippings remaining in skillet over moderately high heat until hot but not smoking and sauté onion and cabbage, stirring, until softened. Add vinegar and salt and pepper to taste and sauté, stirring, 1 minute. Chop bacon. Just before serving, stir cabbage mixture and bacon into wild rice.",
        "Rinse pheasant under cold water and pat dry inside and out. Cut pheasant into 6 serving pieces, transferring feet, back, neck, and wing tips to a small saucepan. To saucepan add water and bay leaf and simmer, uncovered, 15 to 20 minutes, or until reduced to about 3/4 cup. Strain stock through a fine sieve into a heatproof bowl.",
        "In a small bowl stir together salt, pepper, and allspice. Pat pheasant dry again and sprinkle evenly with allspice mixture. In a 10-inch heavy ovenproof skillet heat oil with 1 tablespoon reserved drippings over moderately high heat until hot but not smoking and sauté pheasant until golden, about 5 minutes on each side. Transfer pheasant to a plate.",
        "In fat remaining in skillet cook raisins and shallots over moderate heat, stirring, until shallots are softened. Stir in gin and boil until most is evaporated. Stir in wine and boil until reduced by about half. Stir in stock, tomato paste, rosemary sprig, and salt and pepper to taste and bring sauce to a boil.",
        "Add pheasant to sauce, skin sides down, and braise, tightly covered, in middle of 350°F. oven until breast meat is cooked through and tender, about 10 minutes. Transfer breasts to a clean plate and keep warm, covered. Braise legs and thighs until cooked through and tender, about 10 minutes more. Transfer legs and thighs to plate and keep warm, covered. Stir minced rosemary and grapes into sauce and boil until slightly thickened, about 1 minute.",
        "Divide pheasant between 2 dinner plates, spooning sauce over it, and serve with red cabbage wild rice."
    ],
    "ingredients": [
        "1/2 cup wild rice",
        "1 cup chicken broth",
        "1 tablespoon olive oil",
        "4 slices bacon",
        "1 small onion, sliced thin",
        "2 cups thinly sliced red cabbage (about 1/6 head)",
        "2 teaspoons red-wine vinegar",
        "a 2-pound pheasant*",
        "1 1/2 cups water",
        "1 bay leaf",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon ground allspice",
        "1 1/2 tablespoons olive oil",
        "1/3 cup golden raisins",
        "1/4 cup minced shallots (about 3)",
        "1/4 cup gin",
        "1/2 cup dry white wine",
        "1 teaspoon tomato paste",
        "a 3-inch fresh rosemary sprig plus 1/2 teaspoon minced leaves",
        "1/2 cup halved red and/or green seedless grapes",
        "*Pheasant is available at specialty butcher shops."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Gin",
        "Game",
        "Poultry",
        "Braise",
        "New Year's Day",
        "Raisin",
        "White Wine",
        "Fall",
        "Cabbage",
        "Grape",
        "Wild Rice",
        "Gourmet"
    ],
    "title": "Braised Pheasant with Red Cabbage Wild Rice",
    "url": "http://www.epicurious.com/recipes/food/views/braised-pheasant-with-red-cabbage-wild-rice-10085"
}
