{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Simmer the red wine in a large saucepan over medium-high heat until reduced by half. Meanwhile, combine the flour, garlic powder, onion powder, salt, and pepper in a large bowl. Dredge the oxtail in the seasoned flour, and shake off excess; set aside. Heat 1 tablespoon of butter in a roasting pan over medium-high heat. Brown the oxtail on all sides, about 10 minutes.",
        "Remove the oxtails from the pan and set aside. Turn the heat to medium-low and melt another 1 tablespoon of butter in the pan. Stir in the shallots, garlic, onion, carrots, and celery. Cook and stir until the vegetables have softened, about 10 minutes. Stir in the thyme, bay leaf, parsley, beef broth, and reduced red wine. Place the browned oxtail on top of the vegetables in a single layer, then bring to a boil.",
        "Cover with a tight fitting lid or aluminum foil, then bake in preheated oven until the oxtail is very tender and nearly falling off the bone, 3 to 3 1/2 hours.",
        "Once the oxtail is tender, remove the meat to a serving dish, cover, and keep warm. Strain the remaining braising liquid through a mesh strainer into a saucepan. Simmer over medium-high heat until the sauce has reduced to 2 cups. Whisk in the remaining 2 tablespoons butter and pour over the oxtail to serve."
    ],
    "ingredients": [
        "2 (750 milliliter) bottles dry red wine",
        "1 cup all-purpose flour",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "salt and pepper to taste",
        "5 pounds beef oxtail, cut into pieces",
        "1/4 cup butter, divided",
        "5 shallots, chopped",
        "5 cloves garlic, chopped",
        "1 onion, chopped",
        "2 carrots, chopped",
        "2 celery ribs, chopped",
        "2 sprigs fresh thyme",
        "1 bay leaf",
        "2 sprigs flat-leaf parsley",
        "5 cups beef broth"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Braised Oxtails in Red Wine Sauce",
    "url": "http://allrecipes.com/recipe/161666/braised-oxtails-in-red-wine-sauce/"
}
