{
    "directions": [
        "Preheat oven to 325°F. Whisk flour, 1 teaspoon cinnamon, 1 teaspoon cardamom, 1 teaspoon salt, and 1 teaspoon freshly ground black pepper in pie dish to blend. Working with 1 lamb shank at a time, coat shanks in seasoned flour. Heat oil in heavy large skillet over medium-high heat. Add 3 lamb shanks. Sauté until brown, turning occasionally, 8 to 10 minutes. Transfer lamb to large roasting pan. Repeat with remaining 3 lamb shanks.",
        "Add half of green onions to same skillet. Reduce heat to low; stir 2 minutes. Add garlic; stir 30 seconds. Add tomatoes with juice, broth, raisins, tomato paste, remaining 1 teaspoon cinnamon, 3/4 teaspoon cardamom, saffron, and cloves. Increase heat and bring to boil, scraping up browned bits. Pour broth mixture over lamb.",
        "Cover roasting pan with foil; place in oven. Braise lamb until tender, turning every 30 minutes, about 2 1/2 hours. Transfer lamb to large rimmed baking sheet. Set pan aside.",
        "Meanwhile, cut center rib (including stem portion) from each chard leaf. Cut chard ribs crosswise into 1/2-inch-wide pieces. Stack several leaf halves at a time and cut crosswise into 1-inch-wide strips.",
        "Tilt roasting pan and spoon off all fat from top of sauce that pools at lower end. Set roasting pan over 2 burners. Add chard ribs and remaining green onions and bring to boil over medium-high heat. Return lamb to roasting pan. Cover and return to oven. Braise until chard ribs are tender, about 20 minutes. Uncover; mix chard leaves into pan juices. Return pan to oven and roast uncovered until chard softens, stirring occasionally, about 5 minutes.",
        "Transfer lamb to rimmed platter. Season chard mixture in pan to taste with salt and pepper. Spoon chard mixture over lamb. Sprinkle with parsley; serve with bulgur."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "2 teaspoons ground cinnamon, divided",
        "1 3/4 teaspoons ground cardamom, divided",
        "6 1- to 1 1/4-pound lamb shanks",
        "1/4 cup extra-virgin olive oil",
        "12 green onions, chopped, divided",
        "6 large garlic cloves, chopped",
        "1 14.5-ounce can diced tomatoes in juice",
        "1 3/4 cups (14 ounces) beef broth",
        "1/4 cup golden raisins",
        "1 tablespoon tomato paste",
        "1/4 teaspoon saffron threads, crumbled",
        "Large pinch of ground cloves",
        "1 to 1 1/4 pounds Swiss chard (about 2 bunches)",
        "1/4 cup chopped fresh Italian parsley",
        "2 5.25-ounce packages bulgur (about 2 cups), prepared according to package directions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Vegetable",
        "High Fiber",
        "Dinner",
        "Meat",
        "Lamb Shank",
        "Winter",
        "Chard",
        "Party",
        "Bulgur",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Braised Lamb Shanks with Swiss Chard",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-with-swiss-chard-363721"
}
