{
    "directions": [
        "Mix all ingredients in a small bowl.",
        "Rub brisket all over with spice rub. Cover and chill for at least 2 hours or overnight. Let stand at room temperature for 1 hour before continuing.",
        "Preheat oven to 325°F. Heat 1 tablespoon oil in a large wide pot over high heat. Add brisket, fat side down. Cook undisturbed until well browned, 5-6 minutes. Turn brisket over and cook until browned, about 3 minutes. Using tongs, transfer to a plate. Reduce heat to medium and add remaining 1 tablespoon oil. Add onion and garlic. Cook, stirring occasionally, until onion is slightly golden, about 5 minutes. Add broth and all remaining ingredients. Bring liquid to a simmer. Return brisket to pot. Cover and transfer to oven.",
        "Braise until brisket is very tender to the touch but still holds its shape, about 4 1/2 hours. Using a large spatula, transfer brisket, fat side up, to a large plate. Strain braising liquid into a large bowl. Return liquid to pot, bring to a simmer, and cook until reduced to 2 cups, about 15 minutes. Score fat side of brisket by cutting a crosshatch pattern of 1/4\"-deep slits spaced 1/2\" apart. Return brisket, fat side up, to pot with reduced braising liquid. DO AHEAD: Brisket can be made 2 days ahead. Return brisket to pot, cover, and chill. Bring to a simmer and rewarm brisket before proceeding.",
        "Transfer 1/4 cup braising liquid to a blender. Add jam and bourbon and purée until smooth. Season with salt and pepper.",
        "Preheat broiler. Spread 3-4 tablespoons glaze on top of brisket with the back of a spoon. Broil brisket in pot until browned and glazed, watching carefully to prevent burning, 4-5 minutes.",
        "Transfer brisket to a cutting board. Slice against the grain and transfer to a large platter. Ladle braising liquid over. Drizzle remaining glaze on top."
    ],
    "ingredients": [
        "1 tablespoon plus 1 teaspoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1/4 teaspoon smoked paprika",
        "1/8 teaspoon ground cinnamon",
        "1 4-pound trimmed flat-cut brisket with about 1/3\" top layer of fat",
        "2 tablespoons grapeseed oil, divided",
        "3/4 cup chopped onion",
        "3 garlic cloves, smashed",
        "4 cups beef broth",
        "1 12-ounce bottle stout",
        "3/4 cup bourbon",
        "1/4 cup (packed) light brown sugar",
        "1/4 cup soy sauce",
        "6 large sprigs thyme",
        "3 celery stalks, chopped",
        "2 plum tomatoes, cored, chopped",
        "1 large carrot, chopped",
        "1 tablespoon balsamic vinegar",
        "1/2 cup peach jam or preserves",
        "2 teaspoons bourbon",
        "Kosher salt and freshly ground black pepper",
        "Ingredient info: Smoked paprika can be found at most supermarkets, at specialty foods stores, and at latienda.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Bourbon",
        "Beef",
        "Braise",
        "Dinner",
        "Meat",
        "Brisket",
        "Winter",
        "Jam or Jelly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Braised Brisket with Bourbon-Peach Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/braised-brisket-with-bourbon-peach-glaze-388709"
}
