{
    "directions": [
        "To make the tomato sauce, place a food mill over a saucepan and pass the tomatoes through the mill. Set the pan over medium-high heat and bring the tomatoes to a boil, then add the garlic, basil, salt and pepper. Boil until the sauce is thickened and reduced to 1 cup, about 5 minutes. Set aside.",
        "Preheat an oven to 275°F. Season the brisket generously with salt and pepper.",
        "In a large Dutch oven over medium-high heat, warm the oil. Add the brisket and brown on both sides, 8 to 10 minutes total. Transfer to a platter. If the bottom of the pan is too dark, deglaze with water and discard the burned bits.",
        "Set the pot over medium heat and melt the butter. Add the onions and cook, stirring occasionally, until golden brown, about 20 minutes. Add the tomato sauce, the beer, bay leaf, salt and pepper and bring to a boil. Return the brisket to the pot, cover and transfer to the oven. Cook, turning the brisket over twice, until it is fork-tender, about 3 1/2 hours.",
        "Transfer the brisket to a carving board, cover loosely with aluminum foil and let rest for 10 minutes. Meanwhile, skim the fat off the sauce and remove and discard the bay leaf. Cut the brisket into thin slices and arrange on a warmed platter. Pour the sauce over the meat and sprinkle with the parsley. Serve immediately with mashed potatoes. Serves 6.",
        "Adapted from",
        "Jamie Kennedy's Seasons,",
        "by Jamie Kennedy (Whitecap Books, 2000)."
    ],
    "ingredients": [
        "1 can (28 oz.) whole peeled tomatoes, drained and coarsely chopped",
        "3 garlic cloves, sliced",
        "2 Tbs. coarsely chopped fresh basil",
        "Kosher salt and freshly ground pepper, to taste",
        "3 lb. point-cut beef brisket",
        "Kosher salt and freshly ground pepper, to taste",
        "1 Tbs. vegetable oil",
        "3 Tbs. unsalted butter",
        "2 yellow onions, thinly sliced",
        "2 cups lager beer",
        "1 bay leaf",
        "2 Tbs. finely chopped fresh flat-leaf parsley",
        "Mashed potatoes for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Braised Brisket with Beer & Onion Sauce",
    "url": "http://www.williams-sonoma.com/recipe/braised-brisket-with-beer-and-onion-sauce.html"
}
