{
    "directions": [
        "In a 9- to 10-quart heavy ovenproof kettle whisk together marinade ingredients.",
        "Add shanks to marinade and toss to coat. Marinate shanks, covered and chilled, at least 8 hours or overnight.",
        "Preheat oven to 325°F.",
        "Transfer shanks with tongs to a plate. Pat shanks dry and season with salt and pepper. Pour marinade through a sieve set over a bowl and reserve vegetables, liquid, and bouquet garni separately. In kettle heat 2 tablespoons oil over moderate heat until hot but not smoking and brown shanks on all sides in batches, transferring to a plate. Add reserved vegetables to fat remaining in kettle and cook, stirring occasionally, 5 minutes. Add vegetables to shanks.",
        "Add flour to kettle and cook over moderately low heat, stirring, 3 minutes, or until golden. Whisk in reserved marinade liquid and add reserved bouquet garni, shank mixture, and tomatoes. Bring mixture to a boil and simmer, uncovered, 20 minutes, or until liquid is reduced by half. Add water and braise mixture, covered, in middle of oven 2 hours, or until lamb is tender.",
        "While shanks are braising, peel and core apples and cut into 1/8-inch-thick slices. In a large heavy skillet heat remaining tablespoon oil over moderate heat until hot but not smoking and cook apples, stirring, 2 minutes. Add orange juice and simmer, covered, 20 minutes. Keep apple mixture warm.",
        "Arrange shanks around edge of a large platter and spoon apple mixture into center of platter. Keep shanks and apple mixture warm.",
        "Bring braising liquid to a boil, skimming any fat that rises to surface, and discard bouquet garni. Add dried fruits and mint and simmer sauce 5 minutes, or until fruits are softened. Season sauce with salt and pepper and spoon over shanks. Serve any remaining sauce separately."
    ],
    "ingredients": [
        "2 cups dry white wine",
        "5 tablespoons olive oil",
        "4 shallots, chopped fine",
        "4 carrots, cut into 1/4-inch dice",
        "4 garlic cloves, chopped fine",
        "1 leek (white and pale green part only), halved lengthwise, washed well, and chopped fine",
        "a bouquet garni composed of 1 bay leaf, 1 fresh thyme sprig, and 1/4 bunch fresh parsley sprigs tied together in a cheesecloth bag",
        "1 tablespoon cumin seed",
        "1 teaspoon coriander seeds",
        "6 lamb shanks (about 6 pounds total)",
        "3 tablespoons olive oil",
        "2 tablespoons all-purpose flour",
        "3 medium vine-ripened tomatoes, chopped",
        "2 cups water",
        "4 tart apples such Jonathan",
        "1/3 cup fresh orange juice",
        "6 dried figs, chopped",
        "6 dried pitted dates, chopped",
        "6 dried apricots, chopped",
        "2 tablespoons raisins",
        "1 cup packed fresh mint leaves, washed well, spun dry, and shredded fine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Lamb",
        "Braise",
        "Spring",
        "Kosher",
        "Gourmet"
    ],
    "title": "Braised Lamb Shanks with Dried Fruits",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-with-dried-fruits-12014"
}
