{
    "directions": [
        "Pat chicken dry and sprinkle all over with salt and pepper. Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown chicken, starting skin sides down, turning over once, 8 to 10 minutes. Transfer to a plate and pour off all but 1 tablespoon fat from skillet.",
        "Add butter to skillet and heat over moderately high heat until foam subsides, then sauté celery root and garlic, stirring frequently, until celery root is browned, about 5 minutes.",
        "Add broth and thyme and deglaze skillet by boiling, stirring and scraping up any brown bits, 1 minute. Return chicken, skin sides up, to skillet along with any juices accumulated on plate, then reduce heat and simmer, covered, until chicken is cooked through, 15 to 20 minutes for white meat, about 25 minutes for dark meat. Transfer chicken to a serving bowl as cooked and keep warm, loosely covered with foil.",
        "When all chicken pieces are done cooking, transfer sauce and vegetables to bowl with chicken, discarding thyme."
    ],
    "ingredients": [
        "3 lb chicken parts such as breasts and thighs (with skin and bone) and drumsticks",
        "1 1/4 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1 tablespoon olive oil",
        "1 tablespoon unsalted butter",
        "1 celery root (sometimes called celeriac; 1 1/4 lb), peeled with a sharp knife and cut into 3/4-inch cubes",
        "1 head garlic, cloves separated and left unpeeled",
        "1 1/4 cups reduced-sodium chicken broth (10 fl oz)",
        "2 fresh thyme sprigs",
        "Accompaniment: crusty bread",
        "Garnish: fresh thyme"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Garlic",
        "Poultry",
        "Vegetable",
        "Braise",
        "Quick & Easy",
        "Fall",
        "Winter",
        "Thyme",
        "Simmer",
        "Gourmet"
    ],
    "title": "Braised Chicken with Celery Root and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-with-celery-root-and-garlic-231183"
}
