{
    "directions": [
        "Pat short ribs dry and season with salt and pepper. In a heavy kettle (at least 6 quarts) heat oil over moderately high heat until hot but not smoking and brown ribs in batches, transferring with tongs to a large bowl.",
        "Add chopped onions to kettle and cook over moderate heat, stirring, until golden. Add garlic and cook, stirring, 1 minute. Add wine, tomatoes, broth, Worcestershire sauce, zest, rosemary, and salt and bring to a boil. Add ribs including any juices that have accumulated in bowl and simmer, covered, 30 minutes.",
        "Add pearl onions and carrots, stirring and pushing down to make sure they are covered by liquid, and simmer, covered, 1 to 1 1/2 hours, or until meat is tender. Transfer meat, pearl onions, and carrots with a slotted spoon to a large bowl. Discard zest and boil braising liquid, stirring occasionally, until slightly thickened and reduced to about 5 cups. Return meat and vegetables to kettle and cook over low heat, stirring occasionally, until heated through. Stew may be made 3 days ahead and cooled uncovered before chilling covered. Reheat stew, adding water as necessary to thin sauce.",
        "Serve stew sprinkled with parsley."
    ],
    "ingredients": [
        "6 pounds beef short ribs, cut into 1-rib pieces",
        "1 tablespoon olive oil",
        "3 medium onions, chopped",
        "4 large garlic cloves, minced",
        "1 1/2 cups dry red wine",
        "a 28- to 32-ounce can whole tomatoes including liquid coarsely puréed in a blender",
        "1 1/2 cups beef broth",
        "2 tablespoons Worcestershire sauce",
        "six 3- by 1-inch strips fresh orange zest removed with a vegetable peeler",
        "2 teaspoons chopped fresh rosemary leaves or 1 teaspoon dried rosemary, crumbled",
        "1/2 teaspoon salt",
        "10 ounces pearl onions (about 2 cups), blanched in boiling water 2 minutes and peeled",
        "a 1-pound bag peeled baby carrots",
        "Garnish: finely chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Tomato",
        "Vegetable",
        "Braise",
        "Fall",
        "Gourmet"
    ],
    "title": "Braised Short Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/braised-short-ribs-13048"
}
