{
    "directions": [
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Combine red wine vinegar and brown sugar in a saucepan; cover and bring to a boil. Reduce heat and simmer until sugar is dissolved and mixture is slightly thickened, 5 to 10 minutes.",
        "Heat a large skillet over medium heat; cook and stir bacon until crisp, adding 3 dashes liquid smoke while cooking, 5 to 10 minutes. Transfer bacon to a paper towel-lined plate and drain bacon grease.",
        "Place potatoes, skin-side down, in a baking dish. Drizzle 1 tablespoon olive oil over potatoes and season with salt and pepper.",
        "Bake in the preheated oven until tender, about 20 minutes.",
        "Mix apples and bacon into vinegar-brown sugar mixture; bring to a boil. Add garlic, reduce heat to low, cover, and simmer for 30 minutes.",
        "Heat remaining 2 tablespoons olive oil in a skillet over medium-high heat. Season chicken with salt and pepper and place in the hot oil; cook for 7 minutes. Flip chicken;add water and a few shakes liquid smoke. Cover skillet and cook until chicken is no longer pink in the center, about 10 minutes more. An instant-read thermometer inserted into the center should read 165 degrees F (74 degrees C).",
        "Place chicken on a serving plate and top with apple mixture. Arrange potatoes alongside chicken."
    ],
    "ingredients": [
        "1 cup red wine vinegar",
        "1 cup brown sugar",
        "1/2 pound bacon, cut into 1/4-inch pieces, or more to taste",
        "6 dashes liquid smoke flavoring, or to taste",
        "4 red potatoes, quartered",
        "3 tablespoons olive oil, divided",
        "salt and ground black pepper to taste",
        "3 Red Delicious apples - peeled, cored, and chopped",
        "4 cloves garlic, minced",
        "4 skinless, boneless chicken thighs",
        "1/4 cup water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Braised Chicken Thighs with Apples, Bacon Chutney, and Roasted Red Potatoes",
    "url": "http://allrecipes.com/recipe/256750/braised-chicken-thighs-with-apples-b/"
}
