{
    "directions": [
        "Position rack in lowest third of oven and preheat to 325°F. Heat oil in heavy large pot or Dutch oven over high heat. Add all lamb bones and cook until brown, turning often, about 15 minutes. Transfer bones to plate. Season lamb with salt and pepper and dredge thoroughly in flour. Add to pot and cook until brown on all sides, about 10 minutes. Transfer lamb to plate with bones.",
        "Add onions and garlic to pot and cook until onions are just golden, scraping up browned bits, about 5 minutes. Return lamb to pot. Arrange bones around lamb. Stir in stock and next 7 ingredients. Bring liquid to boil. Baste top of lamb. Cover; bake until lamb is tender when pierced with long sharp knife, turning once, about 2 hours 15 minutes. Cool; cover and chill overnight.",
        "Preheat oven to 325°F. Remove fat from surface of lamb and cooking liquid. Transfer lamb to platter. Remove string from lamb. Cut into 1/2-inch-thick slices. Arrange in shallow baking dish.",
        "Bring pan juices to boil. Remove bones and discard. Strain pan juices, pressing hard on solids to extract as much liquid as possible. Melt margarine in same pot over medium heat. Add 1 1/2 tablespoons flour and stir until mixture begins to brown, about 2 minutes. Whisk in pan juices and boil until sauce is reduced to 2 cups, about 15 minutes. Season with salt and pepper. Pour over lamb. Cover with foil and bake until lamb is heated through, about 25 minutes. Arrange lamb on platter. Spoon sauce over. Garnish with parsley."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "1 pound lamb neck bones",
        "1 7- to 7 1/2-pound lamb shoulder, boned (bones reserved), well trimmed, rolled, tied",
        "All purpose flour",
        "2 medium onions, chopped",
        "10 large garlic cloves",
        "2 cups chicken stock or canned broth",
        "1 cup dry red wine",
        "1 cup unsweetened pomegranate juice",
        "2 tablespoons tomato paste",
        "2 tablespoons firmly packed golden brown sugar",
        "1 tablespoon dried oregano, crumbled",
        "1 teaspoon ground cinnamon",
        "3/4 teaspoon ground allspice",
        "1 1/2 tablespoons margarine",
        "1 1/2 tablespoons all purpose flour",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Braise",
        "Hanukkah",
        "Spice",
        "Winter",
        "Pomegranate"
    ],
    "title": "Braised Lamb in Pomegranate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-in-pomegranate-sauce-1081"
}
