{
    "directions": [
        "Season the pork lightly with salt and pepper. In the stovetop-safe insert of a slow cooker over medium-high heat, warm the oil. Add the pork and brown on all sides, about 8 minutes total. Transfer to a plate. Add the sausages and brown on all sides, about 3 minutes total. Transfer to a plate.",
        "Reduce the heat to medium, add the onions and celery and cook, stirring occasionally, until softened, 6 to 8 minutes. Add the garlic, tomato paste, thyme and bay leaf and cook, stirring constantly, until fragrant, about 1 minute. Add the bourbon and cook for 1 minute.",
        "Stir in the tomatoes, cannellini beans, maple syrup and broth. Nestle the pork into the bean mixture and arrange the sausages around the pork. Increase the heat to medium-high and bring the mixture to a simmer. Transfer the insert to the slow-cooker base, cover and cook on high according to the manufacturer’s instructions until the pork and beans are tender, about 4 hours. Skim the fat off the sauce, and remove and discard the bay leaf. Adjust the seasonings with salt and pepper.",
        "Preheat a broiler.",
        "In a large nonstick sauté pan over medium-high heat, cook the bacon until crisp and browned, 7 to 8 minutes. Using a slotted spoon, transfer the bacon to a paper towel-lined plate. Discard all but 1 Tbs. of the fat in the pan. Add the bread crumbs and sage and cook, stirring occasionally, until lightly browned and toasted, about 4 minutes. Remove from the heat and stir in the parsley and bacon.",
        "Sprinkle the bread crumb mixture over the pork mixture. Broil until the bread crumbs are golden brown, about 3 minutes. Serves 8 to 10.",
        "Williams-Sonoma Kitchen."
    ],
    "ingredients": [
        "2 lb. boneless pork shoulder, cut into 4 pieces",
        "Kosher salt and freshly ground pepper, to taste",
        "1 Tbs. vegetable oil",
        "2 lb. kielbasa (2 large links), each cut into 3 pieces",
        "3 yellow onions, diced",
        "2 celery stalks, diced",
        "1 Tbs. minced garlic",
        "3 Tbs. tomato paste",
        "2 tsp. chopped fresh thyme",
        "1 bay leaf",
        "1/4 cup bourbon",
        "1 can (14 1/2 oz.) diced tomatoes, drained",
        "1 1/2 lb. cannellini beans, soaked overnight and drained",
        "1/4 cup maple syrup",
        "3 cups chicken broth",
        "4 oz. bacon, diced",
        "2 cups fresh bread crumbs",
        "1 tsp. chopped fresh sage",
        "2 Tbs. chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Braised Maple-Bourbon Pork with Beans",
    "url": "http://www.williams-sonoma.com/recipe/braised-maple-bourbon-pork-with-beans.html"
}
