{
    "directions": [
        "Combine 6 cups water, beans and onion in large pot. Bring to boil. Reduce heat, cover partially and simmer until beans are tender, about 1 hour 20 minutes. Cool in cooking liquid. Drain bean mixture, discarding cooking liquid.",
        "Meanwhile, place chicken in medium bowl. Add 1 tablespoon oil, oregano, thyme and rosemary and toss to coat. Let stand 30 minutes at room temperature.",
        "Heat remaining 1 tablespoon oil in heavy large deep skillet over medium-high heat. Sprinkle chicken with salt and pepper. Working in batches, cook chicken in skillet until golden brown, about 4 minutes per side. Transfer to plate.",
        "Pour off drippings from skillet. Add wine and garlic to skillet; simmer until liquid is reduced by half, scraping up browned bits, about 2 minutes. Stir in squash, tomatoes in juice and drained bean mixture. Season with salt and pepper. Add chicken to skillet. Cover and simmer until chicken is cooked through and squash is tender, about 40 minutes. Stir in parsley. Simmer uncovered until sauce thickens slightly, about 3 minutes. Transfer chicken to serving bowl. Spoon bean-and-vegetable mixture over."
    ],
    "ingredients": [
        "6 cups water",
        "1 1/4 cups dried Great Northern beans",
        "1/2 onion, cut into quarters",
        "6 large bone-in chicken thighs with skin",
        "2 tablespoons olive oil",
        "2 teaspoons minced fresh oregano or 3/4 teaspoon dried",
        "2 teaspoons minced fresh thyme or 3/4 teaspoon dried",
        "1 teaspoon minced fresh rosemary or 1/2 teaspoon dried",
        "1/2 cup dry white wine",
        "2 1/2 teaspoons minced garlic",
        "2 1/2 cups 1/3-inch pieces peeled butternut squash",
        "1 14 1/2-ounce can diced tomatoes in juice",
        "2 tablespoons minced fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Chicken",
        "Herb",
        "Poultry",
        "Tomato",
        "Vegetable",
        "Braise",
        "Squash",
        "Butternut Squash",
        "Fall"
    ],
    "title": "Braised Provencal Chicken with Butternut Squash and White Beans",
    "url": "http://www.epicurious.com/recipes/food/views/braised-provencal-chicken-with-butternut-squash-and-white-beans-4811"
}
