{
    "directions": [
        "Pat the chicken dry and season salt and pepper. Heat the olive oil in a Dutch oven or heavy soup pot over medium-high heat. Add the chicken, working in batches if necessary, and cook until well browned on each side, about 3 minutes per side. Transfer to a plate.",
        "Decrease the heat to medium. Add the onion and a pinch of salt and sauté until soft and slightly golden, about 5 minutes. Add the garlic and sauté for 1 minute. Add the turmeric, cumin, coriander, red pepper flakes, cinnamon stick, and bay leaf and cook, stirring constantly, until fragrant, about 1 minute. Pour in 1/4 cup of the broth to deglaze the pot, stirring to loosen any bits stuck to the pot. Stir in a pinch of salt and cook until the liquid is reduced by half. Stir in the remaining 1 3/4 cups of broth, the lemon zest, and 2 tablespoons of the lemon juice. Decrease the heat to medium-low, cover, and simmer for 15 minutes.",
        "Add the chicken, chickpeas, artichoke hearts, and olives and stir gently to combine. Increase the heat to medium-high and simmer uncovered, stirring occasionally, until the chicken is heated through, about 5 minutes. Stir in the remaining tablespoon of lemon juice. Taste; you may want to add another squeeze of lemon juice or pinch of salt. Garnish with the mint."
    ],
    "ingredients": [
        "8 organic boneless, skinless chicken thighs (about 11/2 pounds), trimmed of excess fat",
        "Sea salt",
        "Freshly ground black pepper",
        "3 tablespoons extra-virgin olive oil",
        "1 yellow onion, diced",
        "3 cloves garlic, thinly sliced",
        "1 teaspoon turmeric",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground coriander",
        "Generous pinch red pepper flakes",
        "1 cinnamon stick, or 1/4 teaspoon ground cinnamon",
        "1 bay leaf",
        "2 cups organic chicken broth, homemade or\nstore-bought",
        "2 teaspoons grated lemon zest",
        "3 tablespoons freshly squeezed lemon juice",
        "1 cup canned chickpeas, drained, rinsed, and mixed with a spritz of lemon juice and a pinch of salt",
        "8 thawed frozen or jarred artichoke hearts (see note), quartered",
        "1/2 cup pitted green olives, such as picholine or manzanilla",
        "2 tablespoons chopped fresh mint or cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Olive",
        "Vegetable",
        "Braise",
        "Dinner",
        "Spice",
        "Artichoke",
        "Healthy",
        "One-Pot Meal",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Braised Chicken With Artichokes and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-with-artichokes-and-olives-51150800"
}
