{
    "directions": [
        "Put flour in a shallow bowl. Pat chicken dry and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper, then dredge, 1 piece at a time, in flour, shaking off excess. Transfer to a sheet of wax paper as coated.",
        "Heat 1 tablespoon oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté chicken, skinned sides down first, turning over once, until deep golden brown, 6 to 8 minutes total. Transfer to a plate (chicken will not be fully cooked).",
        "Add onion with remaining tablespoon oil to skillet and cook over moderate heat, stirring, until golden brown around edges, about 6 minutes. Add wine and boil, stirring and scraping up any brown bits, 1 minute. Stir in broth, artichokes, and remaining 1/2 teaspoon salt. Return chicken to skillet along with any juices from plate and bring to a boil over high heat. Cover skillet and reduce heat, then simmer until chicken is tender, about 25 minutes. Stir in peas and simmer, covered, 5 minutes.",
        "Transfer chicken to a shallow serving dish. Stir parsley and remaining 1/4 teaspoon pepper into artichoke mixture, then spoon over chicken."
    ],
    "ingredients": [
        "1/4 cup all-purpose flour",
        "4 large chicken thighs with skin and bone (2 pounds total)",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "2 tablespoons olive oil",
        "1 large onion, chopped",
        "1/2 cup dry white wine",
        "1/2 cup reduced-sodium chicken broth",
        "1 (14-ounce) can artichoke hearts, rinsed, drained, and halved lengthwise",
        "1 cup frozen baby peas (not thawed)",
        "1 tablespoon chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Onion",
        "Poultry",
        "Vegetable",
        "Braise",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Artichoke",
        "Pea",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Braised Chicken with Artichokes and Peas",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-with-artichokes-and-peas-236937"
}
