{
    "directions": [
        "Put beans in a 4-to 5-quart heavy pot with enough water to cover by 2 inches.",
        "Bring to a boil and boil 2 minutes, then remove from heat and let stand, covered, 1 hour.",
        "Wipe anchos clean, then stem and seed. Discard ribs and tear anchos into pieces.",
        "Soak anchos in boiling-hot water until softened, about 20 minutes. Transfer anchos to a blender, reserving soaking liquid.",
        "Purée anchos with onion, garlic, chipotles with sauce, tomato paste, molasses, cumin, cloves, 1/3 cup water, and 1 teaspoon salt.",
        "Pat ribs dry and season with 1 1/2 teaspoons salt and 1 teaspoon pepper (total). Heat oil in a wide 6-to 8-quart heavy pot over medium-high heat until it shimmers. Brown ribs in batches, about 6 minutes per batch. Transfer as browned to a platter. Discard fat from pot.",
        "Preheat oven to 350°F with rack in middle.",
        "Cook bacon in pot over medium heat until browned, then transfer with a slotted spoon to platter.",
        "Stir chile purée into fat in pot (it may spatter). Cook, stirring frequently, 6 minutes. Stir in reserved chile-soaking liquid, remaining 2 cups water, and cinnamon stick and bring to a boil. Return ribs and bacon to pot and braise, covered, in oven until ribs are very tender, 3 to 3 1/4 hours. Skim fat from sauce.",
        "Drain beans, then return to pot and add fresh water (8 cups), bay leaf, and 1/2 teaspoon salt. Bring to a boil, then reduce heat and simmer, uncovered, until beans are just tender, 1 1/4 to 2 hours (depending on age of beans). Drain just before serving.",
        "Serve short ribs with beans."
    ],
    "ingredients": [
        "1 pound dried black beans (about 2 1/4 cups)",
        "8 cups water",
        "1 Turkish or 1/2 California bay leaf",
        "1 1/4 ounces dried ancho chiles (3 to 4 medium)",
        "2 cups boiling-hot water",
        "1 medium onion, chopped",
        "3 garlic cloves, coarsely chopped",
        "2 tablespoons finely chopped canned chipotles in adobo plus 1 tablespoon adobo sauce",
        "2 tablespoons tomato paste",
        "2 tablespoons molasses (not robust or blackstrap)",
        "1 teaspoon cumin seeds",
        "3 whole cloves",
        "2 1/3 cups cold water, divided",
        "5 pounds beef short ribs",
        "1 tablespoon vegetable oil",
        "1/4 pound sliced bacon, chopped",
        "1 (3-inch) cinnamon stick",
        "Accompaniments: chopped white or red onion; chopped cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Braise",
        "Father's Day",
        "Dinner",
        "Beef Rib",
        "Winter",
        "Cinnamon",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Braised Chile-Spiced Short Ribs with Black Beans",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chile-spiced-short-ribs-with-black-beans-351293"
}
