{
    "directions": [
        "Mix wine, 1 tablespoon garlic, mustard and red pepper in large glass baking dish. Add short ribs; turn to coat. Cover and refrigerate overnight, turning occasionally.",
        "Preheat oven to 500°F. Using tongs, transfer short ribs to large roasting pan; reserve marinade. Sprinkle short ribs with salt and pepper. Roast until brown, turning once, about 30 minutes. Transfer short ribs to large bowl. Place roasting pan over 2 burners. Heat over medium-high heat. Add 1 cup beef stock to pan and bring to boil, scraping up any browned bits. Pour pan juices into bowl with short ribs.",
        "Reduce oven temperature to 350°F. Heat oil in heavy large ovenproof pot over medium-high heat. Add carrots, celery, onions and 2 tablespoons garlic. Sauté until vegetables are tender, about 12 minutes. Add short ribs and pan juices, reserved marinade, 2 3/4 cups beef stock, chicken stock, thyme and bay leaves. Bring to boil. Cover pot and place in oven. Bake until ribs are tender, about 2 hours.",
        "Using tongs, transfer short ribs to large bowl. Boil cooking liquid until reduced to thin sauce consistency, about 25 minutes. Strain liquid; discard solids and return liquid to pot. Dissolve cornstarch in 1/4 cup water. Whisk into cooking liquid. Boil until sauce thickens and coats spoon, stirring constantly, about 2 minutes. Season with pepper. Return ribs to pot. Simmer until heated through, 3 minutes. Transfer to platter. Garnish with thyme."
    ],
    "ingredients": [
        "1 cup dry white wine",
        "3 tablespoons minced garlic",
        "2 tablespoons Dijon mustard",
        "1 teaspoon dried crushed red pepper",
        "18 3-to-4 inch pieces meaty beef chuck short ribs",
        "3 3/4 cups beef stock or canned broth",
        "2 tablespoons olive oil",
        "1 1/2 cups finely chopped carrots",
        "1 1/2 cups finely chopped celery",
        "1 1/2 cups finely chopped onions",
        "5 1/4 cups chicken stock or canned low-salt broth",
        "4 teaspoons chopped fresh thyme",
        "2 bay leaves",
        "4 teaspoons cornstarch",
        "1/4 cup water",
        "Fresh thyme sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Braise",
        "Marinate",
        "Roast",
        "Sauté",
        "Beef Rib",
        "Celery",
        "Carrot",
        "White Wine",
        "Fall",
        "Winter",
        "Chill",
        "Thyme",
        "Simmer",
        "Boil"
    ],
    "title": "Braised Short Ribs with Carrots and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/braised-short-ribs-with-carrots-and-onions-4256"
}
