{
    "directions": [
        "Preheat an oven to 325°F. In a Dutch oven, heat 2 Tbs. of the oil over medium-high heat. Season the short ribs with 2 tsp. salt and the pepper. In batches to avoid crowding, add the short ribs to the pot and cook, turning occasionally, until browned on all sides, 5 to 6 minutes per batch. Transfer to a plate.",
        "Add the remaining 1 Tbs. oil to the pot and heat. Add the onion and carrots and cook, stirring occasionally, until the onion softens, about 5 minutes. Stir in the garlic and cook until fragrant, about 1 minute. Sprinkle in the flour and stir well. Slowly stir in the wine, then the stock. Stir in the tomato paste, rosemary and bay leaf. Return the short ribs to the pot. The short ribs should be barely covered with liquid. If not, add hot water as needed. Bring the liquid to a boil. Cover the pot, place in the oven, and cook, moving the position of the ribs every 45 minutes or so to be sure that they are covered with liquid and are cooking evenly, until very tender, about 2 1/2 hours. Transfer the ribs to a deep serving platter (don’t worry if the meat separates from the bones), and tent with aluminum foil to keep warm.",
        "Let the cooking liquid stand for 5 minutes. Skim off the fat from the surface and discard. Bring to a boil over high heat. Cook, stirring, until reduced by about one-fourth, about 10 minutes. Discard the bay leaf. Return the short ribs to the pot.",
        "Just before serving, make the polenta: In a heavy saucepan, bring 3 cups water, the milk, and the remaining 2 tsp. salt to a boil over high heat. Slowly whisk in the polenta and reduce the heat to medium-low. Cook, whisking often, until the polenta is thick, about 2 minutes. Stir in the 1/2 cup Parmigiano-Reggiano. Divide the polenta among warmed deep serving bowls, top with the ribs and sauce and serve at once. Serves 6.",
        "Variation: If you have leftover short ribs, you can easily turn them into a divine ragù. Simply remove the bones, shred the meat, stir it back into the sauce and reheat until warm. Toss with freshly cooked pappardelle.",
        "Adapted from Williams-Sonoma",
        "Comfort Food,",
        "by Rick Rodgers (Oxmoor House, 2009)."
    ],
    "ingredients": [
        "3 Tbs. olive oil",
        "6 lbs. meaty, bone-in, individual-cut short ribs",
        "4 tsp. kosher salt",
        "1 tsp. freshly ground pepper",
        "1 yellow onion, chopped",
        "2 carrots, diced",
        "6 cloves garlic, chopped",
        "1/3 cup all-purpose flour",
        "2 cups hearty red wine",
        "3 cups beef stock or broth",
        "2 Tbs. tomato paste",
        "1 Tbs. minced fresh rosemary",
        "1 bay leaf",
        "1 cup whole milk",
        "1 1/3 cups quick-cooking polenta",
        "1/2 cup freshly grated Parmigiano-Reggiano, plus more for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Braised Short Ribs with Creamy Polenta",
    "url": "http://www.williams-sonoma.com/recipe/braised-short-ribs-with-creamy-polenta.html"
}
