{
    "directions": [
        "If you see or feel dirt in the leeks, rinse well, separating layers, then pat dry; otherwise, leave rounds intact.",
        "Heat 2 Tbsp. oil in a large skillet over medium-high until hot but not smoking. Add leeks in a single layer; season with 1/4 tsp. salt and a pinch of pepper. Reduce heat to low and cook, turning once, until leeks are lightly golden, 16–18 minutes. Transfer leeks to a plate; reserve skillet.",
        "Lightly crush fennel seeds with the bottom of a heavy skillet or pot. Pat chicken thighs dry with paper towels and season with fennel, 1 1/2 tsp. salt, and 1/4 tsp. pepper. Heat remaining 2 Tbsp. oil in a 5–7-qt. Dutch oven or large wide saucepan over medium-high. Cook thighs, skin side down, until well-browned, 12–14 minutes. Transfer skin side up to a plate. Pour off and discard fat.",
        "Add wine to pot, bring to a simmer, and cook, scraping up bits from bottom of pot, 1 minute. Add broth and return chicken skin side up to pot. Lower heat to medium-low, cover pot, and cook until chicken is cooked through, 15–18 minutes.",
        "Meanwhile, combine asparagus, peas, and 2 Tbsp. water in reserved skillet, cover, and cook over medium heat until asparagus is crisp-tender, about 5 minutes. Remove from heat. Add 1/2 tsp. lemon zest, remaining 1/4 tsp. salt, and a pinch of pepper; stir gently to just combine.",
        "Divide chicken, asparagus mixture, and reserved leeks among large shallow bowls. Bring broth to a simmer, add lemon juice, then ladle into bowls. Top with dill and remaining 1 Tbsp. lemon zest."
    ],
    "ingredients": [
        "2 medium leeks, white and light-green parts only, cut crosswise into 1/3-inch rounds",
        "1/4 cup olive oil, divided",
        "2 teaspoons kosher salt, divided",
        "1/4 teaspoon freshly ground black pepper, plus more",
        "2 teaspoons whole fennel seeds",
        "8 bone-in chicken thighs (about 4 pounds)",
        "1/2 cup dry white wine",
        "1 1/2 cups low-sodium chicken broth",
        "3/4 pound medium asparagus, trimmed, cut crosswise in half and on the bias",
        "2 cups shelled fresh peas (from about 2 pounds pods) or frozen peas, thawed",
        "1 tablespoon plus 1/2 teaspoon finely grated lemon zest, divided",
        "2 teaspoons fresh lemon juice",
        "3 tablespoons chopped dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Spring",
        "Chicken",
        "Asparagus",
        "Leek",
        "Pea",
        "Fennel",
        "Braise"
    ],
    "title": "Braised Chicken With Asparagus, Peas, and Melted Leeks",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-with-asparagus-peas-and-melted-leeks"
}
