{
    "directions": [
        "Preheat broiler. Stand neck bones (close together for support), meat side up, in row in heavy large roasting pan. Brush meaty tops with oil; sprinkle with salt and pepper.",
        "Broil until meat is deep brown, turning pan for even cooking, about 12 minutes. Transfer bones to rimmed baking sheet. Reduce oven temperature to 350°F.",
        "Place roasting pan over 2 burners. Add 1/4 cup oil, onions, celery, and carrots. Sauté over medium-high heat until tender and beginning to brown, about 20 minutes. Transfer 1 cup vegetable mixture to small bowl and reserve for sauce.",
        "Add ginger and garlic to pan; stir 30 seconds. Add wine and boil until reduced to glaze, about 5 minutes. Return neck bones to pan, arranging flat side down in single layer. Nestle in herb sprigs, bay leaves, and juniper berries. Top with pig's feet, cut side down. Pour broth over and bring to boil.",
        "Cover roasting pan tightly with foil and place in oven. Braise until meat is very tender and falling off bones, about 3 hours. Using tongs, transfer neck bones to rimmed baking sheet to cool. Discard pig's feet.",
        "Strain pan juices into large bowl, pressing on solids in strainer to release all juices; discard solids. Spoon all fat off surface of pan juices, reserving 1 tablespoon fat for sauce. Return juices to roasting pan. Boil over 2 burners until reduced to 3 1/2 cups, about 20 minutes, occasionally stirring up browned bits. Transfer juices to large pot. Add reserved 1 cup vegetable mixture. Stir 1 tablespoon reserved fat and flour in small bowl to smooth paste; whisk into sauce. Boil until reduced to 3 1/2 cups, about 12 minutes. Add pears to sauce. Simmer pears, uncovered, until tender, about 8 minutes.",
        "Pull all meat off bones; cut meat into bite-size pieces. Sprinkle lightly with salt and pepper. Mix meat into sauce in pot. DO AHEAD: Stew can be made 1 day ahead. Cool 1 hour; cover and refrigerate. Rewarm before continuing.",
        "Spoon stew into large bowl. Sprinkle with chopped parsley and serve."
    ],
    "ingredients": [
        "6 pounds meaty beef neck bones",
        "1/4 cup olive oil plus additional for brushing",
        "5 cups chopped onions (about 1 1/4 pounds)",
        "2 1/2 cups diced celery",
        "2 cups diced carrots",
        "3 tablespoons chopped peeled fresh ginger",
        "6 large garlic cloves, chopped",
        "1 1/2 cups dry red wine",
        "10 whole fresh Italian parsley sprigs plus chopped for garnish",
        "6 large fresh thyme sprigs",
        "5 large fresh rosemary sprigs",
        "4 Turkish bay leaves",
        "1 1/2 teaspoons juniper berries*",
        "2 pig's feet, split in half lengthwise",
        "8 cups beef broth (preferably organic)",
        "1 tablespoon all purpose flour",
        "2 large ripe unpeeled Bartlett pears, halved, cored, each half cut into 4 wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Ginger",
        "Pork",
        "Braise",
        "Sauté",
        "Dinner",
        "Pear",
        "Meat",
        "Celery",
        "Red Wine",
        "Simmer"
    ],
    "title": "Braised Beef with Pears and Fresh Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/braised-beef-with-pears-and-fresh-ginger-354859"
}
