{
    "directions": [
        "Grind first 5 ingredients in spice mill. Sprinkle beef with additional pepper and 3 1/2 teaspoons herb-salt mixture. Heat 1/2 cup corn oil in heavy large pot over high heat. Working in batches, add beef and brown well, turning occasionally, about 8 minutes per batch. Using tongs, transfer beef to large bowl. Pour off oil from pot. Add 1 cup broth to drippings in pot and bring to boil, scraping up any browned bits. Pour deglazed pan juices into small bowl.",
        "Heat 4 tablespoons olive oil in same pot over medium-high heat. Add onion, carrots, and celery; sauté until beginning to brown, about 12 minutes. Add tomato paste and sauté 2 minutes. Add deglazed pan juices and bring to simmer. Return beef and any accumulated juices to pot. Add wine and remaining 3 cups broth and bring to boil. Reduce heat to low. Season with pepper. Cover and cook until beef is very tender, stirring occasionally, about 2 hours.",
        "Using tongs, transfer beef to large bowl. Tilt pot and spoon off fat from surface of sauce. Working in batches, puree sauce with vegetables in blender until smooth; return to pot. Boil until reduced to 4 cups, about 15 minutes. Add beef and stir to heat through. DO AHEAD: Can be made 1 day ahead. Cool slightly. Refrigerate uncovered until cold, then cover and refrigerate. Bring to simmer before continuing.",
        "Cook potatoes in pot of boiling salted water until tender, about 25 minutes. Drain. Place 1 potato on each plate; press to mash slightly. Drizzle with extra-virgin olive oil. Top with beef. Spoon sauce around beef and potatoes and serve."
    ],
    "ingredients": [
        "5 whole black peppercorns",
        "1 small bay leaf",
        "2 tablespoons coarse sea salt",
        "2 tablespoons fresh rosemary leaves",
        "2 tablespoons (packed) fresh sage leaves",
        "4 1/2 pounds beef short ribs, well trimmed",
        "1/2 cup corn oil",
        "4 cups low-salt chicken broth, divided",
        "4 tablespoons extra-virgin olive oil, plus additional for potatoes",
        "2 cups chopped onion",
        "1 1/2 cups finely chopped carrots",
        "1 1/2 cups finely chopped celery",
        "1/4 cup tomato paste",
        "1 750-ml bottle red wine from Campania (Aglianico or Taurasi)*",
        "6 large white-skinned potatoes",
        "*Syrah or Cabernet Franc can be substituted."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Chicken",
        "Herb",
        "Onion",
        "Potato",
        "Tomato",
        "Vegetable",
        "Braise",
        "Dinner",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Braised Short Ribs with Red Wine and Pureed Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/braised-short-ribs-with-red-wine-and-pureed-vegetables-235843"
}
