{
    "directions": [
        "Heat the oven to 325 degrees F. Grate 1 teaspoon zest from the lemon.",
        "Heat the olive oil in a roasting pan over medium-high heat. Add the beef and cook until well browned on both sides. Remove the beef from the pan. Pour off all but 1 tablespoon pan drippings.",
        "Reduce the heat to medium. Add the garlic cloves to the pan and cook until golden, stirring occasionally. Add the vinegar to the pan and cook and stir for 1 minute, scraping up the browned bits from the bottom of the pan. Stir in the stock, thyme and rosemary sprigs. Reduce the heat to low. Cook for 5 minutes.  Season with black pepper.",
        "Return the beef to the pan. Spoon the stock mixture over the beef. Cover the pan.",
        "Bake for 2 1/2 hours or until the beef is fork-tender. Baste the beef with the pan juices every 30 minutes. Remove the beef from the pan, cover and keep warm.",
        "Strain the pan drippings through a sieve into a medium bowl, reserving the garlic and discarding the thyme and rosemary sprigs. Spoon off any fat.",
        "Place about half the garlic cloves and about 1 cup pan drippings into a food processor or blender. Cover and process until the mixture is smooth.",
        "Heat the garlic mixture, remaining garlic cloves, remaining pan drippings, chopped rosemary, minced garlic and lemon zest in a 10-inch skillet over medium-high heat to a boil.  Cook and stir until the gravy is thickened.  Serve the gravy with the beef."
    ],
    "ingredients": [
        "1 lemon",
        "3 tablespoons olive oil",
        "5 pounds beef brisket",
        "36 cloves garlic, peeled",
        "2 tablespoons red wine vinegar",
        "3 cups Swanson® Beef Stock or Swanson® Unsalted Beef Stock",
        "3 sprigs fresh thyme leaves, or more to taste",
        "2 sprigs fresh rosemary leaves",
        "1 teaspoon chopped fresh rosemary leaves",
        "1 teaspoon minced garlic"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Braised Brisket with Garlic",
    "url": "http://allrecipes.com/recipe/244562/braised-brisket-with-garlic/"
}
