{
    "directions": [
        "Heat oil in heavy large pot over high heat. Sprinkle spareribs with salt and pepper. Working in batches, add ribs to pot and brown on all sides, about 6 minutes. Transfer ribs to bowl. Add onions, garlic, cherry peppers and crushed red pepper to pot. Sauté until onions just begin to brown, about 10 minutes. Add tomatoes with their juices. Using back of fork or potato masher, coarsely crush tomatoes. Return spareribs and juices to pot. Add broth, wine, thyme and bay leaves and bring to boil. Reduce heat to medium- low. Simmer uncovered until spareribs are very tender and sauce thickens, stirring occasionally, about 2 hours. Season with salt and pepper. (Can be made 2 days ahead. Cool slightly. Refrigerate until cold, then cover and keep chilled. Remove chilled fat from top of sauce, if desired. Rewarm before continuing.)",
        "Cook pasta in large pot of boiling salted water until just tender but still firm to bite. Drain and return pasta to same pot. Add cheese, parsley and some sauce from spareribs and toss to coat. Transfer pasta to large bowl. Top with spareribs and remaining sauce and serve."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "4 pounds pork spareribs, cut into individual ribs",
        "1 pound onions, thinly sliced",
        "10 large garlic cloves, chopped",
        "8 cherry peppers from jar, drained, seeded, chopped",
        "3/4 teaspoon dried crushed red pepper",
        "3 28-ounce cans Italian-style tomatoes in juice",
        "1 cup canned low-salt chicken broth",
        "1 cup dry white wine",
        "4 large fresh thyme sprigs",
        "2 bay leaves",
        "1 pound rigatoni",
        "1 1/2 cups freshly grated Parmesan",
        "1/3 cup chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Cheese",
        "Dairy",
        "Pasta",
        "Pork",
        "Tomato",
        "Braise",
        "Dinner",
        "Parmesan",
        "Meat",
        "White Wine",
        "Fall",
        "Winter",
        "Noodle",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Braised Spareribs with Rigatoni",
    "url": "http://www.epicurious.com/recipes/food/views/braised-spareribs-with-rigatoni-103893"
}
