{
    "directions": [
        "Pre-Heat oven to 300 degrees. In an enamel covered Dutch oven brown the short ribs over medium to medium-high heat in the olive oil. This may be done in two batches to not overcrowd your pan. Once the meat is browned, remove it and set aside. Add the onions, garlic, mushrooms, tomatoes, tomato paste, salt & pepper to the pot. Cook for about 5 to 6 minutes then add the meat back to the pan.",
        "Deglaze with the wine and stock. Add the fresh rosemary and cook for 3-4 hours, covered, until the meat is fall apart and tender. Check the short ribs halfway through cooking add a little water if the liquid is low or looking dry.",
        "In a large soup or stock pot bring the chicken broth to a simmer over medium-high heat and add the chopped cauliflower and diced onion. Simmer, until the cauliflower is falling apart and much of the stock has evaporated, about 20 minutes. Add the heavy cream, butter, salt and pepper. Using a stick blender, blend the mixture until smooth. It will be thick. Fold in the Parmesan cheese. Serve hot as a base for the short ribs."
    ],
    "ingredients": [
        "3 pounds beef short ribs, trimmed",
        "2 tablespoons olive oil",
        "1 large yellow onion, sliced",
        "4 cloves garlic, smashed",
        "1 cup mushrooms, sliced",
        "2 medium tomatoes, sliced",
        "2 tablespoons tomato paste",
        "Salt and pepper to taste",
        "2 cups red wine",
        "2 cups low-sodium beef stock or water",
        "2 sprigs fresh rosemary",
        "Parmesan Cauliflower Mash:",
        "2 cups chicken broth",
        "2 pounds cauliflower, chopped",
        "1 onion, diced",
        "1 1/2 cups heavy cream",
        "1/2 cup butter",
        "Salt and pepper to taste",
        "1 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Braised Short Ribs over Parmesan Cauliflower Mash",
    "url": "http://allrecipes.com/recipe/256245/braised-short-ribs-over-parmesan-caul/"
}
