{
    "directions": [
        "Mix coriander, fennel, and peppercorns in heavy small skillet. Toast on medium-high heat until aromatic and slightly darker, about 2 minutes. Transfer to spice grinder; process until finely ground. Rub each shank with 1 rounded teaspoon spice blend. Sprinkle with salt and pepper.",
        "Heat 2 tablespoons oil in heavy large wide pot over medium-high heat. Add shanks to pot. Cook until brown on all sides, about 20 minutes. Transfer to large bowl. Add remaining 2 tablespoons oil to same pot. Add onion and next 4 ingredients; sauté over medium heat until vegetables begin to soften, about 5 minutes. Add remaining spice blend and stir 1 minute. Add Port and simmer until liquid is reduced to 2/3 cup, about 15 minutes. Add both broths; boil until liquid is reduced to 3 1/2 cups, about 30 minutes.",
        "Preheat oven to 350°F. Return shanks to pot. Add cloves, star anise, bay leaves, and crushed red pepper. Cover pot with foil, then lid. Place pot in oven and braise lamb until tender, about 2 hours. (Can be made 2 days ahead. Uncover and cool slightly. Place in refrigerator until cool, then cover and keep refrigerated. Rewarm in 350°F oven for 20 minutes before serving.)",
        "Place 1 lamb shank on each of 4 plates. Season sauce to taste with salt and pepper. Spoon sauce and vegetables over lamb and serve.",
        "*Brown, star-shaped seed pods; available in the spice section of some supermarkets, at Asian markets, and at specialty foods stores."
    ],
    "ingredients": [
        "2 tablespoons coriander seeds",
        "2 tablespoons fennel seeds",
        "1 tablespoon black peppercorns",
        "4 large lamb shanks (about 5 pounds)",
        "4 tablespoons olive oil, divided",
        "1 large white onion, cut into 1 1/2-inch pieces",
        "10 garlic cloves, peeled",
        "3 celery stalks, cut crosswise into 1 1/2-inch pieces",
        "2 carrots, peeled, cut crosswise into 1 1/2-inch pieces",
        "1 small leek",
        "3 cups ruby Port",
        "4 cups low-salt chicken broth",
        "4 cups beef broth",
        "6 whole cloves",
        "2 whole star anise*",
        "2 bay leaves",
        "1/2 teaspoon dried crushed red pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Onion",
        "Braise",
        "Christmas",
        "Lamb Shank",
        "Port",
        "Winter",
        "Family Reunion",
        "Coriander"
    ],
    "title": "Braised Lamb Shanks with Coriander, Fennel, and Star Anise",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-with-coriander-fennel-and-star-anise-234136"
}
