{
    "directions": [
        "Heat 2 tablespoons oil in 5-quart pot over moderate heat until hot but not smoking, then cook onions, garlic, 1/2 teaspoon salt, and 1/4 teaspoon pepper, stirring occasionally, until onions are soft and golden, about 20 minutes. Transfer onions to a bowl and reserve pot.",
        "Simmer prunes and Armagnac in a 1- to 2-quart saucepan 5 minutes. Remove from heat and set aside.",
        "Make a hole for stuffing: Insert a long thin sharp knife into middle of one end toward center of loin, then repeat at opposite end to make an incision that runs lengthwise through roast. Enlarge incision with your fingers, working from both ends, to create a 3/4-inch-wide opening.",
        "Pack about 20 prunes into pork, pushing from both ends toward center (reserve remaining Armagnac and prunes). Pat pork dry and season with 1/2 teaspoon salt and remaining 1/4 teaspoon pepper.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Wrap parsley, thyme, sage, bay leaf, peppercorns, and cloves in cheesecloth and tie into a bundle with kitchen string.",
        "Brush pork with mustard, then evenly coat with brown sugar. Heat remaining 2 tablespoons oil in reserved pot over high heat until hot but not smoking, then brown meat on all sides (not ends), reducing heat if necessary to keep from burning, about 6 minutes total.",
        "Transfer pork with tongs to a plate, then add white wine and reserved Armagnac (but not prunes) to pot. Bring to a boil, then remove from heat.",
        "Add broth, onions, and cheesecloth bundle to pot with Armagnac mixture, then add pork with any juices accumulated on plate and turn pork fat side up. Bring to a boil over high heat, covered, then transfer to oven and braise 30 minutes.",
        "Add remaining prunes and braise until thermometer inserted diagonally 2 inches into meat (avoid stuffing) registers 150°F, about 15 minutes.",
        "Transfer pork to a cutting board and cut off and discard string, then cover with heavy-duty foil (temperature of pork will rise as it stands).",
        "While pork stands, skim fat from surface of sauce (if necessary) and remove and discard cheesecloth bundle, then stir in vinegar and remaining 1/4 teaspoon salt and pepper to taste."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "2 lb onions (6 to 8 medium), halved lengthwise, then thinly sliced lengthwise",
        "1 head of garlic, cloves separated and peeled",
        "1 1/4 teaspoons salt",
        "1/2 teaspoon black pepper",
        "2 cups pitted prunes (14 oz)",
        "1 cup Armagnac",
        "1 (3- to 3 1/2-lb) boneless center-cut pork loin roast (3 to 4 inches in diameter), tied",
        "10 fresh parsley stems",
        "2 large fresh thyme sprigs",
        "1 large fresh sage sprig",
        "1 California bay leaf or 2 Turkish",
        "1/4 teaspoon black peppercorns",
        "2 whole cloves",
        "1/3 cup Dijon mustard",
        "1/3 cup packed light brown sugar",
        "1 cup dry white wine",
        "1 cup reduced-sodium chicken broth (8 fl oz)",
        "2 to 3 tablespoons red-wine vinegar",
        "Special equipment: a 5-qt heavy pot with lid (round or oval to accommodate a 12-inch roast; see cooks' note, below); a 6-inch square of cheesecloth; kitchen string; an instant-read thermometer; heavy-duty foil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Mustard",
        "Onion",
        "Pork",
        "Braise",
        "Prune",
        "Cognac/Armagnac",
        "White Wine",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Braised Pork Loin with Prunes",
    "url": "http://www.epicurious.com/recipes/food/views/braised-pork-loin-with-prunes-233544"
}
