{
    "directions": [
        "Toast coriander seeds in a dry small skillet over medium heat, tossing often, until fragrant, about 2 minutes. Let cool; finely grind in spice mill or mortar and pestle.",
        "Pound garlic, rosemary, oregano, and pepper with a mortar and pestle or pulse in a food processor until garlic and rosemary are broken into fine pieces or finely chopped. Mix in coriander, then, stirring constantly, stream in 1/2 cup oil. Mix until a thick paste forms. Season lamb all over with kosher salt and spread half of the rosemary paste over inside of lamb. Starting from a short end, roll up lamb so it’s resting seam side down. Starting at the center, tie with kitchen twine at even intervals. Rub outside of lamb with remaining rosemary paste and place on a rimmed baking sheet. Chill at least 4 hours and up to 12 hours (letting the lamb marinate longer will really allow the flavors to meld and permeate the meat).",
        "Remove lamb from refrigerator and let sit to come to room temperature, about 1 hour (this facilitates even cooking).",
        "Preheat oven to 450°F. Roast lamb until well browned all over, 20–25 minutes. Remove from oven and reduce oven temperature to 300°F.",
        "Meanwhile, heat remaining 1/4 cup oil in a Dutch oven or other heavy pot large enough to fit lamb over medium. Add onion, fennel, carrot, and garlic and cook, stirring occasionally, until vegetables are soft and golden, 15–20 minutes. Add chiles de árbol and wine and bring to a simmer. Remove from heat.",
        "Carefully place lamb in pot and pour in water to come halfway up sides of meat. Place in oven and braise lamb, uncovered, until an instant-read thermometer inserted into the thickest part registers 120°F, about 1 hour. Transfer lamb to a cutting board and let rest 30 minutes.",
        "Slice lamb and transfer to a platter. Spoon some braising liquid over and sprinkle with sea salt. Serve with salsa verde and harissa."
    ],
    "ingredients": [
        "2 teaspoons coriander seeds",
        "4 garlic cloves, smashed",
        "1/2 cup coarsely chopped rosemary",
        "2 teaspoons dried oregano",
        "2 teaspoons freshly ground black pepper",
        "3/4 cup olive oil, divided",
        "1 (6-pound) boneless leg of lamb, butterflied",
        "Kosher salt",
        "1 medium onion, coarsely chopped",
        "1 medium fennel bulb, coarsely chopped",
        "1 medium carrot, peeled, coarsely chopped",
        "1 head of garlic, halved crosswise",
        "2 dried chiles de árbol or 1/2 teaspoon crushed red pepper flakes",
        "3/4 cup red wine",
        "Flaky sea salt",
        "Salsa Verde With Toasted Breadcrumbs and Roasted Red Pepper Harissa (for serving)",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Red Wine",
        "Winter",
        "Chile Pepper",
        "Rosemary",
        "Garlic",
        "Oregano",
        "Coriander",
        "Fennel",
        "Braise"
    ],
    "title": "Braised Lamb With Rosemary and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-with-rosemary-and-garlic"
}
