{
    "directions": [
        "Pour boiling water over porcini in a bowl and let stand until softened, 10 to 20 minutes. Lift out porcini, squeezing excess liquid back into bowl, and rinse to remove any grit. Pour soaking liquid through a sieve lined with a dampened paper towel into another bowl. Chop porcini and reserve for polenta.",
        "Pat veal dry and cut 20 (1 1/2-inch-deep) slits all over with a thin-bladed knife. Stuff each slit with a slice of garlic, then season veal with salt and pepper.",
        "Heat oil in a 4- to 6-quart heavy pot over moderately high heat until hot but not smoking, then brown veal on all sides, about 10 minutes. Add wine and deglaze pot by boiling over high heat (keep veal in pot), stirring and scraping up brown bits, until wine is reduced by half, about 5 minutes. Stir in porcini-soaking liquid and bring to a simmer. Simmer gently, covered, turning veal every 30 minutes, until meat is tender, about 2 hours. Transfer veal to a cutting board and cool completely.",
        "Skim any fat and froth from surface of pan juices, then boil until reduced to about 2 cups. Pour through a very fine sieve into a saucepan and bring to a simmer. Stir dissolved potato starch, then whisk into pan juices. Simmer sauce until slightly thickened.",
        "Stir together gremolata ingredients.",
        "Stir half of gremolata into sauce and season with salt and pepper. Chill remaining gremolata, covered.",
        "Preheat oven to 350°F.",
        "Remove strings from veal and cut meat across the grain into 1/4-inch-thick slices. Overlap slices in a 13- by 9-inch ceramic or glass baking dish and pour sauce over meat. Cover dish with foil and heat in middle of oven 30 minutes.",
        "Sprinkle with remaining gremolata."
    ],
    "ingredients": [
        "2 cups boiling water",
        "1 ounce dried porcini",
        "1 (4 1/2- to 5-pounds) boneless veal shoulder roast, rolled and tied by butcher",
        "2 large garlic cloves, cut lengthwise into 20 thin slices",
        "1 tablespoon olive oil",
        "1 cup dry white wine",
        "1 tablespoon potato starch dissolved in 1 1/2 tablespoons cold water",
        "2 tablespoons finely chopped fresh flat-leaf parsley",
        "1 tablespoon finely chopped fresh basil",
        "1 tablespoon finely grated fresh lemon zest",
        "2 teaspoons minced garlic",
        "Accompaniment: porcini matzo polenta wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Braise",
        "Passover",
        "Lemon",
        "Basil",
        "Veal",
        "White Wine",
        "Spring",
        "Kosher",
        "Parsley",
        "Gourmet"
    ],
    "title": "Braised Veal with Gremolata",
    "url": "http://www.epicurious.com/recipes/food/views/braised-veal-with-gremolata-104893"
}
