{
    "directions": [
        "Place smashed garlic in a resealable plastic bag along with lamb shanks and 1/4 cup fish sauce. Seal bag, pressing out air. Turn lamb shanks to coat and chill at least 4 hours and up to 1 day.",
        "Let lamb sit at room temperature 1 hour.",
        "Preheat oven to 300°F. Heat oil in a large Dutch oven or other heavy pot over medium-high. Remove lamb shanks from bag and add to pot; discard marinade. Cook shanks, turning occasionally, until browned evenly on all sides, 14–18 minutes. Transfer to a large plate.",
        "Reduce heat to medium and cook shallots, cilantro stems, and finely chopped garlic in the same pot, stirring often and scraping up browned bits from the bottom, until shallots are golden, 5–7 minutes. Add chiles, kaffir lime leaves, bay leaves, stock, and 1/4 cup fish sauce, and stir, scraping up any remaining stuck-on bits from bottom of pot. Bring to a simmer, return lamb to pot, and cover. Transfer to oven and braise until meat is pulling away from bones but not quite fork-tender, 50–60 minutes.",
        "Turn shanks and add fennel and carrots to pot, submerging in liquid. Cover and braise until meat is very tender and nearly falling off the bone, 40–50 minutes. Let rest 15–20 minutes before serving.",
        "Serve lamb shanks with fennel and carrots and some braising liquid (for a thicker sauce, simmer the braising liquid until it reduces slightly), topped with cilantro, basil, and/or celery leaves, and seasoned with a few more drops of fish sauce if desired.",
        "Lamb and vegetables can be braised 2 days ahead. Let cool; cover and chill. Reheat over low before topping with herbs and more fish sauce."
    ],
    "ingredients": [
        "12 garlic cloves, 6 smashed, 6 finely chopped",
        "4 (16-ounce) lamb shanks, excess fat and silver skin trimmed",
        "1/2 cup fish sauce, divided; plus more for serving (optional)",
        "1/4 cup vegetable oil",
        "5 medium shallots, thinly sliced",
        "2 tablespoons finely chopped cilantro stems",
        "6 dried bird chiles",
        "4 kaffir lime leaves or 2 teaspoons finely grated lime zest",
        "2 bay leaves",
        "4 cups homemade chicken stock or low-sodium chicken broth",
        "2 large fennel bulbs, quartered",
        "8 ounces small carrots, scrubbed, or larger carrots, scrubbed, cut into 3-inch pieces",
        "1 cup cilantro, Thai or sweet basil, and/or celery leaves, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Braise",
        "Lamb",
        "Lamb Shank",
        "Garlic",
        "Fennel",
        "Carrot",
        "Cilantro",
        "Chile Pepper",
        "Shallot",
        "Lime",
        "Dinner",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Braised Lamb Shanks With Fish Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-with-fish-sauce"
}
