{
    "directions": [
        "Preheat oven to 450°F.",
        "Put lamb shanks in a large metal roasting pan, then rub with oil and season with salt and pepper. Arrange onion wedges around lamb. Roast lamb in middle of oven 40 minutes. Turn shanks over, scatter with herb sprigs, and roast 40 minutes more.",
        "Pour wine, broth, and water into roasting pan. Cover pan tightly with foil and braise lamb until tender, 45 minutes to 1 hour. Transfer shanks to a plate and remove and discard skins from onions. Pour cooking liquid (including onions) into a large glass measure (do not clean roasting pan).",
        "Pierce each potato once with a fork and bake on rack in lower third of oven until cooked through, 45 to 50 minutes.",
        "Cool potatoes 10 minutes, then halve lengthwise and scoop out flesh. Force warm potatoes through ricer into a bowl. Stir in salt, milk, and pepper to taste.",
        "Cook carrots in boiling salted water until tender, about 10 minutes. Rinse under cold running water to stop cooking.",
        "Skim fat from cooking liquid (you'll have about 2 1/2 cups broth). Whisk together 1 cup broth and flour in a large bowl to make a thin paste, then whisk in remaining broth (including onions). Set roasting pan across 2 burners and pour broth mixture into pan. Boil over moderate heat, whisking, until thickened, about 5 minutes. Remove from heat and season with salt and pepper.",
        "Cut lamb meat from bones, then tear meat into bite-size pieces. Stir meat into gravy.",
        "Reduce oven to 350°F.",
        "Spoon lamb-shank mixture into a 12- by 3-inch oval gratin dish or a 2 1/2- to 3-quart shallow baking dish, spreading evenly. Scatter carrots over lamb, then top with creamed spinach, spreading evenly. Top spinach with mashed potatoes, spreading evenly to edges of dish to cover filling completely. Make swirl patterns on surface of potatoes with back of spoon, then drizzle with melted butter.",
        "Put baking dish in a foil-lined shallow (1-inch-deep) baking pan to catch drips and bake until top is golden and filling is bubbling, about 1 hour."
    ],
    "ingredients": [
        "5 1/2 pounds large lamb shanks (4 large)",
        "2 tablespoons extra-virgin olive oil",
        "2 small onions, trimmed and quartered (do not peel)",
        "1/2 cup fresh thyme sprigs",
        "1/2 cup fresh rosemary sprigs",
        "1/2 cup dry white wine",
        "1 1/4 cups beef broth",
        "1 1/4 cups water",
        "3 pounds russet (baking) potatoes (6)",
        "1 1/4 to 1 1/2 teaspoons salt",
        "3/4 cup whole milk",
        "5 medium carrots, cut into 1/4-inch-thick slices",
        "1/4 cup all-purpose flour",
        "Creamed spinach",
        "2 tablespoons unsalted butter, melted",
        "Special equipment: a ricer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Lamb",
        "Potato",
        "Bake",
        "Braise",
        "Spinach",
        "Winter",
        "Gourmet"
    ],
    "title": "Braised-Lamb Shank Shepherd's Pie with Creamed Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shank-shepherds-pie-with-creamed-spinach-104641"
}
