{
    "directions": [
        "In a small bowl, stir together the white sugar, soy sauce, white wine and 1/2 cup of chicken broth. Set the sauce aside.",
        "Pat the tofu dry with paper towels, and cut into cubes. Season the cubes with salt and pepper. Sprinkle 1 tablespoon of cornstarch over them on all sides.",
        "Heat a little more than 1 inch of oil in a large deep skillet over medium-high heat. If you have a deep-fryer, fill to the recommended level, and heat the oil to 375 degrees F (190 degrees C). When the oil is hot, add the tofu, and fry until golden brown on all sides. Turn occasionally. Remove from the oil with a slotted spoon, and drain on paper towels.",
        "In a separate skillet, heat one tablespoon of oil over medium-high heat. Add the onions and green beans; cook and stir for 3 to 5 minutes. Season with salt and pepper. Stir in the tomatoes, and cook until they begin to break apart, about 4 minutes. Add the bamboo shoots, and stir to blend.",
        "Stir the sauce into the skillet with the beans, and bring to a boil. Cook for 5 minutes, stirring occasionally. If the liquid starts to evaporate too much, stir in up to 1 cup of chicken broth.",
        "Mix together the remaining 2 tablespoons of cornstarch and water until cornstarch is dissolved. Stir this into the sauce in the skillet. Simmer, stirring gently, until the sauce clears and thickens. Add the fried tofu, and stir to coat with the sauce."
    ],
    "ingredients": [
        "2 tablespoons white sugar",
        "3 tablespoons soy sauce",
        "1 cup dry white wine",
        "1/2 cup chicken broth",
        "1 (14 ounce) package tofu, drained",
        "salt and pepper to taste",
        "1 tablespoon cornstarch",
        "3 cups oil for frying, or as needed",
        "1 onion, chopped",
        "4 plum tomatoes, sliced into thin wedges",
        "12 ounces fresh green beans, trimmed and cut into 3 inch pieces",
        "1 cup bamboo shoots, drained and sliced",
        "1 cup chicken broth, or as needed",
        "2 tablespoons cornstarch",
        "3 tablespoons water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Braised Green Beans with Fried Tofu",
    "url": "http://allrecipes.com/recipe/86222/braised-green-beans-with-fried-tofu/"
}
