{
    "directions": [
        "Preheat oven to 350°F. Combine bread pieces and whole milk in medium bowl, pressing on bread to submerge; let stand until milk is absorbed, about 10 minutes. Squeeze out most of milk from bread; discard milk. Place bread in large bowl. Add ground beef, eggs, finely chopped onion, 1/2 cup chopped Italian parsley, salt, pepper, and dried summer savory and mix well. Transfer meat mixture to processor. Process until well blended and mixture looks pasty. Form mixture into 1 3/4-inch-diameter meatballs (about 30). Divide meatballs between two 13x9x2-inch glass baking dishes. Bake meatballs 30 minutes. Set meatballs aside.",
        "Dust meatballs with flour; shake off excess. Melt butter with oil in heavy large skillet over medium-high heat. Working in batches, add meatballs to skillet and sauté until brown on all sides, about 3 minutes. Return all meatballs to skillet. Whisk wine and tomato paste in small bowl to blend. Add wine mixture to meatballs and bring to boil. Continue boiling until wine thickens slightly, stirring frequently, about 5 minutes. Add broth, reduce heat to medium and simmer until flavors blend and gravy thickens, stirring frequently, about 15 minutes. Season to taste with salt and pepper. Transfer meatballs and gravy to bowl. Sprinkle with remaining 1 tablespoon parsley and serve."
    ],
    "ingredients": [
        "1 6-ounce piece day-old French bread (generous 1/3 of 16-ounce loaf), crust left on, bread cut into 8 pieces",
        "1 cup whole milk",
        "1 3/4 pounds ground beef (7% to 15% fat)",
        "2 large eggs",
        "1 medium onion, finely chopped",
        "1/2 cup plus 1 tablespoon chopped fresh Italian parsley",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon dried summer savory",
        "All purpose flour",
        "2 tablespoons (1/4 stick) butter",
        "1 1/2 teaspoons olive oil",
        "2 cups dry red wine",
        "1/4 cup tomato paste",
        "3 cups canned beef broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Braise",
        "Winter"
    ],
    "title": "Braised Meatballs in Red-Wine Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/braised-meatballs-in-red-wine-gravy-104712"
}
