{
    "directions": [
        "Preheat the oven to 300 degrees F.",
        "Liberally sprinkle all sides of the short ribs with salt and pepper. Heat a large Dutch oven over medium-high heat and add the oil. Sear the short ribs on all sides until browned, 3 to 4 minutes per side, working in batches if necessary. Set aside on a plate.",
        "Add the carrots, celery, garlic and onions to the pot with the short rib drippings and sprinkle with some salt and pepper. Cook the vegetables until they turn golden brown, 10 to 12 minutes. Add in the tomato paste and cook for 1 minute more. Add the wine and deglaze the pot, scraping up any developed fond (brown bits) from the bottom. Bring the wine to a simmer and add some salt and pepper. Add the thyme, bay leaf and short ribs and any leftover juices from the plate. Cover the pot, transfer to the oven and cook, turning the short ribs once after about 1 hour of cooking, until the meat is fork-tender, 2 to 2 1/2 hours. Remove the short ribs from the braising liquid and set aside to cool slightly.",
        "Skim the fat off the top of the braising liquid. Strain the liquid and bring it to a simmer until reduced by half, about 8 minutes (you should have about 2/3 cup of reduced sauce). Season with salt and pepper.",
        "Serve the ribs and sauce over creamy polenta."
    ],
    "ingredients": [
        "4 English-cut bone-in short ribs (about 3 by 3 1/2 inches and 2 1/2 pounds)",
        "Kosher salt and freshly cracked black pepper",
        "2 tablespoons vegetable oil",
        "3 carrots, peeled and chopped",
        "2 stalks celery, chopped",
        "2 cloves garlic, smashed",
        "2 yellow onions, roughly chopped",
        "1 tablespoon tomato paste",
        "2 cups dry red wine",
        "3 sprigs fresh thyme",
        "1 bay leaf",
        "Creamy polenta, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Dutch Oven",
        "Short Ribs",
        "Vegetable",
        "Beef",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Braised Short Ribs",
    "url": "http://www.foodnetwork.com/recipes/jeff-mauro/braised-short-ribs"
}
