{
    "directions": [
        "Season the beef generously all over with salt and pepper. In a large fry pan over medium-high heat, warm the olive oil. When the oil is hot, add the beef and sear, turning as needed, until deep golden brown on all sides, about 10 minutes total. Transfer the beef to a plate.",
        "Pour off most of the fat from the pan and return to medium-high heat. Add the onion and celery and sauté until golden, about 6 minutes. Add the apple juice and stir to scrape up the browned bits from the pan bottom. Transfer the contents of the pan to a slow cooker, add the bay leaves and place the beef on top. Cover and cook on low according to the manufacturer’s instructions until the beef is very tender, about 8 hours.",
        "Meanwhile, make the arugula and grapefruit salad: In a bowl, whisk together the vinegar, mustard, salt and pepper. Whisk in the olive oil. Add the arugula, avocados, grapefruit, hazelnuts and basil and toss gently to mix.",
        "Transfer the beef to a cutting board and let rest for about 5 minutes. Meanwhile, using a large spoon, skim the fat off the braising liquid. Snip the strings on the beef and shred with 2 forks or slice across the grain.",
        "Divide the beef among individual plates and spoon enough of the braising liquid on top to moisten (reserve the remainder for another use or discard). Mound the salad on top of or alongside the beef and serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "The New Slow Cooker,",
        "by Brigit Binns (Weldon Owen, 2010)."
    ],
    "ingredients": [
        "1 beef bottom round, about 3 1/2 lb., trimmed of most fat and\n  tied",
        "Salt and freshly ground pepper, to taste",
        "2 Tbs. olive oil",
        "1 yellow onion, sliced",
        "1 celery stalk, sliced",
        "1/2 cup apple juice, preferably unfiltered",
        "3 bay leaves",
        "1 1/2 Tbs. white wine vinegar",
        "1 tsp. honey mustard",
        "1/4 tsp. salt",
        "Freshly ground pepper, to taste",
        "1/4 cup extra-virgin olive oil",
        "4 cups baby arugula",
        "2 avocados, halved, pitted, peeled and sliced lengthwise\n  1/2 inch thick",
        "1 large grapefruit, peeled and segmented",
        "2/3 cup hazelnuts, toasted and skinned",
        "4 large fresh basil leaves, finely slivered (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Braised Beef with Arugula and Grapefruit Salad",
    "url": "http://www.williams-sonoma.com/recipe/braised-beef-arugula-grapefruit.html"
}
