{
    "directions": [
        "In a kettle heat 2 tablespoons of the oil and the butter over moderately high heat until the foam subsides, in the fat brown the veal shanks, and transfer them to a plate. Pour off the fat from the kettle, add the remaining 3 tablespoons oil, and in it cook the onion, the carrot, the celery, the garlic, the bay leaves, and salt and pepper to taste over moderate heat, stirring, until the vegetables are softened. Return the shanks to the kettle, add the thyme, 5 of the parsley sprigs, the zest, the beans, the tomatoes, the wine, and the broth, and bring the liquid to a boil. Braise the mixture, covered, in the middle of a preheated 350°F. oven, basting the shanks every 30 minutes, for 2 hours, transfer the shanks with a slotted spoon to a plate, and keep them warm, covered. Discard the thyme sprigs and the bay leaves and in a blender or food processor puree the vegetable mixture in batches. (For a chunky sauce, purée half the vegetable mixture and stir the purée into the remaining vegetable mixture.)",
        "Serve the veal shanks topped with the sauce and sprinkled with the gremolata. Garnish each serving with an additional parsley sprig.",
        "In a small bowl stir together the parsley, the zest, and the garlic."
    ],
    "ingredients": [
        "5 tablespoons olive oil",
        "2 tablespoons unsalted butter",
        "6 large 2-inch-thick veal shanks (about 4 1/2 pounds), each patted dry and tied securely with kitchen string to keep the meat and bone attached",
        "1 1/2 cups chopped onion",
        "1 cup chopped carrot",
        "1 cup chopped celery",
        "2 garlic cloves",
        "2 bay leaves",
        "2 fresh thyme sprigs or 1 teaspoon crumbled dried thyme",
        "5 large parsley sprigs plus additional parsley sprigs for garnish",
        "two 2-inch strips of lemon zest removed with a vegetable peeler",
        "a 15- to 19-ounce can white beans, rinsed and drained",
        "a 28-ounce can plum tomatoes, drained and chopped",
        "1 cup dry white wine",
        "2 cups chicken broth",
        "1/4 cup finely chopped parsley leaves",
        "1 tablespoon freshly grated lemon zest",
        "1 1/2 teaspoons minced garlic, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Beef",
        "Tomato",
        "Braise",
        "Winter",
        "Gourmet"
    ],
    "title": "Braised Veal Shanks with White Bean Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/braised-veal-shanks-with-white-bean-tomato-sauce-10339"
}
