{
    "directions": [
        "Preheat oven to 350°F.",
        "Remove 2-inch-wide strips of skin from opposite sides of each eggplant with a vegetable peeler and discard. Holding knife parallel to a peeled side, cut each eggplant lengthwise into 8 (1/3-inch-thick) slices.",
        "Brush eggplant slices on both sides with oil and arrange in 1 layer in 2 shallow baking pans. Sprinkle with salt and pepper and bake in upper and lower thirds of oven, switching position of pans halfway through baking, until eggplant is tender and lightly browned, 30 to 40 minutes total. Cool eggplant in pans. Leave oven on.",
        "Pat shanks dry and sprinkle with salt and pepper. Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown shanks in 2 batches, turning occasionally, about 5 minutes per batch. Transfer as browned to a roasting pan just large enough to hold shanks in 1 layer. Reserve skillet.",
        "Cook bell pepper, garlic, spices, and bay leaves in fat remaining in skillet over moderate heat, stirring occasionally, until garlic is golden, about 3 minutes. Add wine and bring to a boil, stirring and scraping up any brown bits. Add chopped tomatoes and bring to a boil. Season sauce with salt and pepper and pour over shanks (liquid should come about halfway up sides of meat).",
        "Cover roasting pan tightly with foil and braise in middle of oven until very tender, 2 1/2 to 3 hours. Cool shanks, uncovered. Leave oven on.",
        "Remove shanks from sauce. Discard bones and gristle, then cut meat into 1 1/2-inch pieces. Skim fat from sauce and season sauce with salt and pepper. Spoon one third of sauce into a 13- by 9-inch glass or ceramic baking dish.",
        "Arrange 2 eggplant slices end to end lengthwise on a work surface so that ends overlap by about 2 inches. Put one eighth of lamb on eggplant where it overlaps, then wrap ends of eggplant over lamb to form a bundle. Transfer bundle to baking dish with a wide metal spatula. Make 7 more bundles in same manner, arranging them in 1 layer in dish. Spoon remaining sauce over and around bundles and cover dish tightly with foil.",
        "Braise bundles in middle of oven 30 minutes."
    ],
    "ingredients": [
        "2 (1 1/2-lb) eggplants (at least 10 inches long and 4 inches in diameter), trimmed",
        "1/3 cup extra-virgin olive oil",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "6 lb lamb shanks, trimmed of excess fat",
        "1 1/2 teaspoons salt",
        "1 teaspoon black pepper",
        "2 tablespoons extra-virgin olive oil",
        "1/2 large green bell pepper, cut into 1/2-inch pieces",
        "2 garlic cloves, chopped",
        "1 (1 1/2-inch) piece cinnamon stick",
        "16 whole allspice",
        "15 whole black peppercorns",
        "2 Turkish bay leaves or 1 California",
        "1 cup dry white wine",
        "1 (28- to 32-oz) can whole tomatoes in purée, coarsely chopped (including purée) in a food processor"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Tomato",
        "Vegetable",
        "Braise",
        "Spice",
        "Eggplant",
        "Bell Pepper",
        "White Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Braised Lamb Shanks Wrapped in Eggplant",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-wrapped-in-eggplant-107589"
}
