{
    "directions": [
        "Whack cinnamon stick with the blunt side of a chef’s knife to break into pieces. Toast cinnamon, coriander seeds, cumin seeds, and peppercorns in a dry small skillet over medium-high heat, tossing occasionally, until fragrant, about 3 minutes. Let cool, then finely grind in spice mill. Transfer to a small bowl and stir in turmeric and cardamom.",
        "Preheat oven to 400°F. Heat oil in a large heavy pot over medium-high. Season chicken generously with salt and, working in batches if needed, cook, turning occasionally, until well browned all over, 10–15 minutes. Transfer to a plate.",
        "Cook onions in same pot, stirring occasionally, until soft and translucent, 6–8 minutes. Add spice mixture, garlic, lemon zest, bay leaves, and ginger; cook, stirring often, until fragrant, about 3 minutes. Add tomatoes, crushing with your hands, and cook, scraping up brown bits and stirring occasionally, until tomatoes are broken down and sauce is slightly thickened, 8–12 minutes. Stir in chiles, honey, and stock; season with salt. Return chicken to pot, skin side up, and bring to a simmer. Transfer to oven; bake, uncovered, 30 minutes. Add chickpeas and cook until chicken is very tender and skin is browned, 10–15 minutes. Transfer chicken to a plate. Add chard to stew and stir to wilt; season with salt. Serve chicken over stew topped with sesame seeds.",
        "Stew (without greens) can be made 3 days ahead. Let cool; cover and chill. Reheat before adding greens."
    ],
    "ingredients": [
        "1 (3-inch) cinnamon stick",
        "1 teaspoon coriander seeds",
        "1 teaspoon cumin seeds",
        "1/2 teaspoon black peppercorns",
        "1 teaspoon ground turmeric",
        "1/4 teaspoon ground cardamom",
        "3 tablespoons olive oil",
        "6 chicken legs (thighs and drumsticks)",
        "Kosher salt",
        "2 medium onions, thinly sliced",
        "4 garlic cloves, thinly sliced",
        "2 wide (2-inch) strips lemon zest",
        "2 fresh bay leaves",
        "1 tablespoon finely grated ginger",
        "1 (28-ounce) can whole peeled tomatoes, drained",
        "2 dried chiles de árbol, seeds removed",
        "2 tablespoons honey",
        "4 cups chicken stock or low-sodium chicken broth",
        "1 (15-ounce) can chickpeas, rinsed",
        "4 cups coarsely chopped Swiss chard leaves",
        "1 tablespoon toasted sesame seeds",
        "A spice mill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Braise",
        "Chickpea",
        "Dinner",
        "Chard",
        "Chile Pepper",
        "Spice",
        "Cardamom",
        "Cinnamon",
        "Tomato",
        "Ginger",
        "Sesame",
        "Wheat/Gluten-Free"
    ],
    "title": "Braised Chicken With Chickpeas and Swiss Chard",
    "url": "http://www.epicurious.com/recipes/food/views/braised-chicken-with-chickpeas-and-swiss-chard"
}
