{
    "directions": [
        "Preheat an oven to 350ºF (180ºC).",
        "Season the flank steak with salt and pepper. In a 3 1/2-quart (3.5-l) wide oval Dutch oven over medium-high heat, warm 1 Tbs. of the olive oil. Add the steak and sear on all sides, 8 to 10 minutes total. Transfer to a plate.",
        "Reduce the heat to medium and warm the remaining 2 Tbs. olive oil. Add the mushrooms and cook, stirring occasionally, about 8 minutes. Transfer to a bowl. Add the onions to the pot and cook, turning once, until browned on both sides, about 3 minutes per side.",
        "Return the mushrooms to the pot. Add the garlic and demi-glace and cook, stirring, until fragrant, about 1 minute. Increase the heat to high. Add the stock, olives, rosemary and thyme and bring to a boil. Place the steak on top. Cover the pot with foil and a lid. Transfer to the oven and cook until the meat is fork-tender, about 2 hours.",
        "Transfer the beef to a carving board. Skim the excess fat off the sauce. Set the pot over medium-high heat and simmer, stirring occasionally, until the sauce is thickened. Adjust the seasoning with salt and pepper. Slice the beef and serve with the sauce over polenta. Serves 6.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "1 flank steak, 2 to 2 1/2 lb. (1 to 1.25 kg), rolled and tied",
        "Kosher salt and freshly ground pepper, to taste",
        "3 Tbs. olive oil",
        "1/2 lb. (250 g) shiitake mushrooms, trimmed and halved",
        "3/4 lb. (375 g) cipollini onions, peeled",
        "2 garlic cloves, minced",
        "1 Tbs. beef demi-glace",
        "1 1/2 cups (12 fl. oz./375 ml) beef stock",
        "1/4 lb. (125 g) calvestrano olives, pitted",
        "1 Tbs. fresh rosemary leaves",
        "1 tsp. chopped fresh thyme",
        "Polenta for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Braised Beef with Cipollini Onions, Shiitakes and Olives",
    "url": "http://www.williams-sonoma.com/recipe/braise-beef-onion-shiitake-olive.html"
}
