{
    "directions": [
        "Preheat oven to 350°F. Place veal on work surface; open flat like book. Sprinkle top surface evenly with coarse salt, freshly ground black pepper, and reserved gremolata seasoning. Roll up veal. Tie with kitchen string every 1 1/2 inches to hold shape. Sprinkle outside of roast with coarse salt and pepper.",
        "Preheat oven to 350°F. Place veal on work surface; open flat like book. Sprinkle top surface evenly with coarse salt, freshly ground black pepper, and reserved gremolata seasoning. Roll up veal. Tie with kitchen string every 1 1/2 inches to hold shape. Sprinkle outside of roast with coarse salt and pepper.",
        "Heat 2 tablespoons oil in heavy large ovenproof pot over high heat. Add veal and brown on all sides, turning with 2 wooden spoons, 15 to 18 minutes. Transfer veal to small rimmed baking sheet.",
        "Reduce heat to medium. Add remaining 1 tablespoon oil to same pot. Add onions, carrots, and celery; sauté until beginning to soften, about 5 minutes. Add wine; boil 3 minutes, scraping up browned bits. Add broth, tomatoes, garlic, and rosemary. Return sauce to boil. Return veal to pot. Sprinkle olives around veal. Cover; transfer to oven.",
        "Braise veal until very tender, turning with wooden spoons every 30 to 40 minutes, about 2 1/2 hours total. Cool veal, uncovered, in sauce in pot, 2 hours. DO AHEAD: can be made 1 day ahead. Chill until cold, then cover and keep chilled.",
        "Spoon off any fat from surface of sauce. Transfer veal to work surface. Cut veal crosswise into 1/2-to 3/4-inch-thick slices, removing string. Overlap veal slices in 13 x 9 x 2-inch glass baking dish.",
        "Rewarm sauce in pot over low heat. Spoon off any additional fat from surface. Boil sauce until reduced to 4 cups, about 12 minutes. Transfer 1 cup solids from sauce (without olives) to blender and puree. Return puree to sauce. Season sauce with coarse salt and pepper. Spoon sauce over veal. DO AHEAD: can be made 1 day ahead. Cover dish with foil and chill. Rewarm, covered, in 350°F oven 20 to 30 minutes.",
        "Sprinkle veal with reserved 1/4 cup gremolata and serve."
    ],
    "ingredients": [
        "3/4 cup chopped fresh Italian parsley",
        "6 large garlic cloves, finely chopped",
        "3 large tablespoons finely grated lemon peel",
        "4 teaspoons chopped fresh rosemary",
        "1 5-pound boned trimmed veal shoulder clod roast",
        "Coarse kosher salt",
        "3 tablespoons extra-virgin olive oil, divided",
        "2 cups chopped onions",
        "2 medium carrots, diced",
        "1 cup chopped celery",
        "1/2 cup dry red wine",
        "2 cups low-salt chicken broth",
        "1 1/2 cups drained diced canned tomatoes (from 14.5-ounce can)",
        "2 large garlic cloves, chopped",
        "1 tablespoon chopped fresh rosemary",
        "3/4 cup halved pitted kalamata olives",
        "Special equipment: Kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Tomato",
        "Braise",
        "Passover",
        "Father's Day",
        "Veal",
        "Family Reunion",
        "Parsley"
    ],
    "title": "Braised Veal Shoulder with Gremolata and Tomato-Olive Salad",
    "url": "http://www.epicurious.com/recipes/food/views/braised-veal-shoulder-with-gremolata-and-tomato-olive-salad-364670"
}
