{
    "directions": [
        "Brown the meat",
        "Preheat an oven to 325°F.",
        "Season the brisket with the paprika, salt and pepper. In a large heavy pot or Dutch oven over medium-high heat, warm the olive oil. Add the brisket and cook, turning as needed, until well browned on all sides, about 10 minutes total. Transfer to a platter.",
        "Cook the vegetables and the brisket",
        "Add the onions, celery and carrots to the drippings in the pot and sauté over medium heat until the vegetables are softened, about 5 minutes. Pour in the broth and stir, scraping up the browned bits from the pan bottom. Stir in the wine, the tomatoes and their juices. Return the meat and any juices from the platter to the pot. Cover, transfer to the oven and bake until the brisket is fork-tender, 3 to 3 1/2 hours.",
        "Make the sauce",
        "Transfer the brisket to a carving board, cover loosely with aluminum foil and let rest for 10 minutes. Spoon off and discard the fat from the liquid in the pot. Place the pot over medium-high heat and bring the liquid to a boil. Stir in the marjoram, reduce the heat to medium and simmer until the liquid is reduced by one-fourth, 7 to 10 minutes. Adjust the seasonings with salt and pepper.",
        "Slice the brisket across the grain and serve with some of the sauce and vegetables spooned on top. Serves 4 (makes about 10 cups sliced or shredded brisket total).",
        "Storage Tip:",
        "To store the leftover brisket, place it, uncut or shredded, in an airtight container. Put the sauce in a separate airtight container. Refrigerate the meat and sauce for up to 3 days.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Weeknight",
        ", by Melanie Barnard (Oxmoor House, 2006)."
    ],
    "ingredients": [
        "1 beef brisket, about 5 lb., trimmed of excess fat",
        "1 Tbs. paprika",
        "Salt and freshly ground pepper, to taste",
        "2 Tbs. olive oil",
        "2 yellow onions, chopped",
        "3 celery stalks, chopped",
        "2 carrots, chopped",
        "2 cups beef broth",
        "3/4 cup dry red wine",
        "1 can (14 1/2 oz.) diced tomatoes with juices",
        "2 Tbs. minced fresh marjoram"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Braised Brisket",
    "url": "http://www.williams-sonoma.com/recipe/braised-brisket.html"
}
