{
    "directions": [
        "Cut 1 lemon in half. Squeeze juice into bowl of cold water; add lemon halves. Quarter second lemon. Working with 1 artichoke at a time, trim off tough outer leaves (about 3 layers). Cut off 3/4 inch of top; cut off stem. Cut artichoke in half lengthwise; rub all cut surfaces with lemon quarter to prevent discoloration. Scoop out any choke from center. Drop artichoke halves into lemon water.",
        "Heat oil in large skillet over medium heat. Add green onions. Sauté until tender, about 5 minutes. Add bell peppers. Sauté until peppers soften, about 3 minutes. Add garlic; stir 2 minutes. Drain artichokes and add to skillet. Add 1 cup water, 2 tablespoons lemon juice, thyme, bay leaf, and lemon peel. Sprinkle with salt and pepper; bring to simmer. Cover and simmer until artichokes are tender, adding more water by 1/4 cupfuls if mixture is dry and stirring occasionally, about 20 minutes. (Can be made 1 day ahead. Cover and chill. Rewarm, covered, over low heat, adding more water if dry.) Mix in parsley; season with salt and pepper."
    ],
    "ingredients": [
        "2 whole lemons",
        "2 1/2 pounds baby artichokes",
        "2 tablespoons olive oil",
        "8 green onions, chopped",
        "2 large red bell peppers, diced",
        "4 large garlic cloves, minced",
        "1 cup (or more) water",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon chopped fresh thyme",
        "1 large bay leaf",
        "2 teaspoons finely grated lemon peel",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Side",
        "Braise",
        "Passover",
        "Lemon",
        "Artichoke",
        "Bell Pepper",
        "Spring",
        "Kosher",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Braised Baby Artichokes with Red Peppers and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/braised-baby-artichokes-with-red-peppers-and-garlic-109398"
}
