{
    "directions": [
        "Place mushrooms in bowl. Pour boiling water over; let soak until mushrooms soften, at least 45 minutes and up to 4 hours. Strain mixture, reserving 1 1/2 cups soaking liquid. Cut stems from mushrooms and discard; thinly slice caps.",
        "With food processor running, add ginger and garlic and finely chop. Add cilantro, black bean sauce, 2 teaspoons peanut oil, and five-spice powder. Process until paste forms, occasionally scraping down sides of work bowl. Using sharp knife, cut 5 small shallow slits into each lamb shank, spacing apart; rub generous 1 tablespoon black bean-cilantro paste into slits and all over surface of each shank. (Mushrooms and lamb shanks can be prepared 6 hours ahead. Cover mushrooms, soaking liquid and shanks separately and chill.)",
        "Preheat oven to 325°F. Cut six 18-inch squares of aluminum foil; place on work surface. Place green onions and sliced mushroom caps in center of each foil square, dividing equally. Heat remaining 4 teaspoons peanut oil in heavy large skillet over medium-high heat. Working in batches, add lamb shanks and cook until brown on all sides, about 5 minutes per batch. Place 1 lamb shank atop green onions and mushrooms on each foil square.",
        "Pour reserved mushroom soaking liquid and Sherry into same skillet. Boil until liquid is reduced to 3/4 cup, scraping up any browned bits from bottom of skillet, about 10 minutes. Spoon 2 tablespoons reduced liquid over each lamb shank, pulling up foil around shanks to prevent liquid from spilling out. Enclose shanks completely in foil, twisting foil to seal; place on large rimmed baking sheet.",
        "Bake lamb shanks until very tender and meat almost falls off bones, about 2 hours. Open up foil packets; place each atop bowl of steamed rice, allowing diners to remove foil.",
        "Available at Asian markets and in the Asian foods section of supermarkets.\n** A blend of ground anise, cinnamon, star anise, cloves, and ginger; available in the spice section of most supermarkets.",
        "** A blend of ground anise, cinnamon, star anise, cloves, and ginger; available in the spice section of most supermarkets."
    ],
    "ingredients": [
        "12 dried shiitake mushrooms",
        "2 1/2 cups boiling water",
        "1 3-inch-long piece fresh ginger, peeled, thickly sliced",
        "3 garlic cloves, peeled",
        "3/4 cup coarsely chopped fresh cilantro",
        "4 1/2 tablespoons black bean garlic sauce*",
        "6 teaspoons peanut oil",
        "1 1/2 teaspoons Chinese five-spice powder**",
        "6 large lamb shanks (about 1 pound each), excess fat trimmed",
        "3/4 cup thinly sliced green onions",
        "3/4 cup dry Sherry",
        "Steamed white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Lamb",
        "Braise",
        "Dinner",
        "Meat",
        "Lamb Shank",
        "Spice",
        "Fall",
        "Winter"
    ],
    "title": "Braised Lamb Shanks with Ginger and Five-Spice",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-with-ginger-and-five-spice-106210"
}
