{
    "directions": [
        "Sprinkle veal ribs on all sides with salt, pepper, thyme, and sage. Heat oil in heavy large wide pot over medium-high heat. Add half of ribs and sauté until brown, turning occasionally, about 10 minutes. Transfer ribs to bowl. Repeat with remaining ribs.",
        "Reduce heat to medium-low. Add onion, garlic, and shallots to pot. Cover and cook until soft, occasionally scraping up any browned bits, about 8 minutes. Mix in anchovy fillets; cook 1 minute. Add white wine and Pernod. Increase heat and boil mixture 3 minutes. Add diced tomatoes with juice, chicken broth, and chopped fresh tarragon; stir to blend. Add veal and any accumulated juices from bowl, arranging veal in single layer in pot. Bring to simmer. Reduce heat to medium-low, cover, and simmer until veal is tender, turning veal occasionally, about 1 3/4 hours.",
        "Add peeled pearl onions and green olives to pot. Cover and simmer until pearl onions are tender, about 25 minutes longer. Do ahead Braised veal can be made 2 days ahead. Cool slightly. Chill uncovered until cold, then cover and keep refrigerated. Rewarm before continuing.",
        "Using tongs, transfer veal to plate. Tilt pot and spoon off fat from top of sauce; discard fat. Boil sauce until thick enough to coat spoon, about 5 minutes. Mix in grated lemon peel. Return veal to sauce and simmer until heated through and flavors blend, about 5 minutes. Season to taste with salt and pepper. Transfer veal to large shallow bowl and serve."
    ],
    "ingredients": [
        "1 (4 3/4- to 5-pound) large end of veal breast (about 8 bones), cut between bones into individual ribs",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh sage",
        "2 tablespoons olive oil",
        "1 large onion, halved, thinly sliced",
        "8 large garlic cloves, chopped",
        "2 large shallots, sliced",
        "3 anchovy fillets, chopped",
        "1 cup dry white wine",
        "1/4 cup Pernod or other anise-flavored liqueur",
        "1 14 1/2-ounce can diced tomatoes in juice",
        "1 cup low-salt chicken broth",
        "1 tablespoon chopped fresh tarragon",
        "1 (10-ounce) bag pearl onions, peeled",
        "1 cup brine-cured green olives (such as picholine; about 6 ounces)",
        "2 tablespoons grated lemon peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Garlic",
        "Herb",
        "Olive",
        "Onion",
        "Tomato",
        "Braise",
        "Sauté",
        "Veal",
        "Pernod",
        "White Wine"
    ],
    "title": "Braised Veal Breast with Herbs, Pernod, and Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/braised-veal-breast-with-herbs-pernod-and-tomatoes-236876"
}
