{
    "directions": [
        "Pat lamb shanks dry and season with salt and pepper. In an 8-quart heavy flameproof casserole heat oil over moderately high heat until hot but not smoking and brown lamb shanks well in batches, transferring to a plate as browned. To casserole add onion, carrot, celery, and garlic and sauté until onion is softened. Add wine and simmer mixture, stirring occasionally, until liquid is reduced to about 3 cups. Return lamb shanks to casserole and stir in broth, tomato paste, and thyme. Bring liquid to a boil and simmer, covered, stirring and turning lamb shanks occasionally, 1 1/2 hours. Simmer mixture, uncovered, stirring occasionally, 1 hour more, or until lamb shanks are tender.",
        "In a small bowl stir together gremolata ingredients.",
        "In a saucepan heat oil over moderately high heat until hot but not smoking and cook onions, carrots, celery, and garlic, stirring, 2 or 3 minutes, or until softened. Add beans, 2 cups broth, butter, and bay leaf and cook over moderate heat, stirring occasionally and adding enough remaining broth to keep beans moist and to reach a creamy consistency, about 30 minutes. Discard bay leaf and add half of gremolata and salt and pepper to taste.",
        "Transfer lamb shanks to a plate and keep warm, covered with foil. Strain braising liquid through a sieve into a saucepan, discarding solids, and stir in butter and tarragon. Boil sauce, stirring occasionally, until thickened slightly. Strain sauce through sieve into a bowl and season with salt and freshly ground black pepper.",
        "Sprinkle lamb shanks with remaining gremolata and serve with beans and sauce."
    ],
    "ingredients": [
        "4 lamb shanks (about 1 pound each)",
        "2 tablespoons olive oil",
        "1 medium onion, chopped coarse",
        "1 medium carrot, chopped coarse",
        "1 celery rib, chopped coarse",
        "8 garlic cloves, chopped coarse",
        "3 1/2 cups Bordeaux or other full-bodied red wine",
        "4 cups chicken broth",
        "1 tablespoon tomato paste",
        "2 fresh thyme sprigs",
        "3 tablespoons chopped fresh parsley leaves (preferably flat-leafed)",
        "1 teaspoon freshly grated lemon zest (about 1 lemon)",
        "3 garlic cloves, minced",
        "2 tablespoons extra-virgin olive oil",
        "2 small onions, chopped fine",
        "2 small carrots, chopped fine",
        "2 celery ribs, chopped fine",
        "3 garlic cloves, minced",
        "2 cups cooked white beans (preferably Great Northern or navy)",
        "2 to 2 1/2 cups chicken broth",
        "2 tablespoons unsalted butter",
        "1 bay leaf",
        "1 tablespoon unsalted butter",
        "3 fresh tarragon sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Lamb",
        "Braise",
        "Red Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Braised Lamb Shanks with White Beans",
    "url": "http://www.epicurious.com/recipes/food/views/braised-lamb-shanks-with-white-beans-11831"
}
