{
    "directions": [
        "Grind 1 tablespoon cumin seeds and 1/2 tablespoon coriander seeds in spice or coffee grinder. Transfer to small bowl. Stir in remaining cumin and coriander seeds, thyme, rosemary, curry powder, and salt. Whisk in 1/2 cup oil. Place lamb shanks in 13x9x2-inch glass baking dish. Rub spice oil all over shanks. Cover with plastic wrap; chill overnight, turning occasionally.",
        "Preheat oven to 350°F. Heat 1 tablespoon oil in heavy large ovenproof pot over high heat. Add lamb shanks and cook until brown on all sides, turning occasionally, about 10 minutes. Add stock and garlic; bring to boil, cover and transfer to oven. Cook 1 hour; remove from oven and turn lamb shanks over. Cover and continue cooking until lamb is tender, about 45 minutes longer. Using tongs, transfer lamb to platter; tent with foil to keep warm.",
        "Bring liquid in pot to simmer over medium heat. Add potatoes; simmer 10 minutes. Add carrots to liquid and simmer 5 minutes longer. Add tomatoes, zucchini, and asparagus to liquid and simmer until all vegetables are just tender, about 5 minutes. Using slotted spoon, transfer vegetables to platter with lamb. Pour braising liquid into 4-cup measuring cup. Spoon off fat, reserving 1 tablespoon. Heat reserved fat in heavy large skillet over medium heat. Whisk in flour; stir 2 minutes. Whisk in braising liquid and tomato paste. Boil until gravy coats spoon lightly, about 2 minutes. Serve lamb and vegetables with gravy."
    ],
    "ingredients": [
        "1 1/2 tablespoons cumin seeds",
        "1 1/2 tablespoons coriander seeds",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh rosemary",
        "1/2 tablespoon curry powder",
        "1/2 teaspoon coarse salt",
        "1/2 cup plus 1 tablespoon olive oil",
        "4 18- to 20-ounce lamb shanks",
        "6 cups chicken stock or canned low-salt chicken broth",
        "4 garlic cloves, peeled, smashed",
        "1/2 pound red-skinned new potatoes, quartered lengthwise",
        "8 small carrots, peeled",
        "4 plum tomatoes, halved lengthwise",
        "2 small zucchini, quartered lengthwise",
        "8 asparagus stalks",
        "1 tablespoon all purpose flour",
        "1 tablespoon tomato paste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Lamb",
        "Braise"
    ],
    "title": "Braised Spiced Lamb Shanks",
    "url": "http://www.epicurious.com/recipes/food/views/braised-spiced-lamb-shanks-105988"
}
