{
    "directions": [
        "In a ceramic or glass bowl let the salt cod soak in cold water to cover, changing the water several times, for 24 hours and drain it. In a kettle poach the cod in simmering water to cover for 25 minutes, or until it flakes easily when tested with a fork, drain it in a colander, and refresh it under cold water. Pat the cod dry and break it into pieces. In a skillet cook the onion in 2 tablespoons of the oil over moderately low heat, stirring, until it is soft and let it cool. In a food processor puree the onion mixture, the garlic and the cod until the mixture is smooth, with the motor running add the remaining 1/3 cup oil in a stream, 1/2 cup of the cream, the lemon juice, and salt and pepper to taste, and puree the mixture until it is smooth. The brandade de morue may be made 2 days in advance and kept covered and chilled. If desired, thin the brandade with the remaining 2 tablespoons cream.",
        "On oiled baking sheets arrange the potatoes, cut crosswise into 1/4-inch-thick slices, without touching, drizzle them with the oil, and roast them in a preheated 400°F. oven, turning them once, for 30 to 40 minutes, or until they are tender, slightly crisp around the edges, and pale golden. Transfer the potatoes to paper towels to drain. Arrange the potato slices on a platter, top each slice with a dollop of the brandade, and top the brandade with the roasted red pepper.",
        "Using a long-handled fork char the peppers over an open flame, turning them, for 2 to 3 minutes, or until the skins are blackened. (Or broil the peppers on the rack of a broiler pan under a preheated broiler about 2 inches from the heat, turning them every 5 minutes, for 15 to 25 minutes, or until the skins are blistered and charred.) Transfer the peppers to a a bowl and let them steam, covered, until they are cool enough to handle. Keeping the peppers whole, peel them starting at the blossom end, cut off the tops, and discard the seeds and ribs. (Wear rubber gloves when handling chilies.)"
    ],
    "ingredients": [
        "1/2 pound thick-cut skinless boneless salt cod",
        "1/2 cup finely chopped onion",
        "1/3 cup plus 2 tablespoons olive oil",
        "1 garlic clove",
        "1/2 cup heavy cream plus, if desired, 2 tablespoons for thinning the brandade",
        "2 teaspoons fresh lemon juice, or to taste",
        "3 russet (baking) potatoes (about 1 1/2 pounds)",
        "1/4 cup olive oil",
        "1 red bell pepper, roasted (procedure follows), or 1 drained bottled roasted red pepper, chopped fine and patted dry"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Fish",
        "Pepper",
        "Potato",
        "Poach",
        "Roast",
        "Cocktail Party",
        "Bastille Day",
        "Chill",
        "Gourmet"
    ],
    "title": "Brandade de Morue Canapes",
    "url": "http://www.epicurious.com/recipes/food/views/brandade-de-morue-canapes-12332"
}
