{
    "directions": [
        "Bring 1 cup sugar, lemon juice, butter and peel to boil in heavy large saucepan, stirring to dissolve sugar. Whisk eggs in bowl to blend.",
        "Gradually whisk in hot butter mixture. Return to saucepan and stir over low heat until curd thickens and leaves path on back of spoon when finger is drawn across, about 2 minutes; do not boil.",
        "Divide curd evenly between 2 bowls. Add remaining 2 tablespoons sugar, then cream and milk to 1 bowl and whisk to combine. Cover and chill lemon curd and lemon cream until cold.",
        "Transfer lemon cream to ice cream maker and process according to manufacturer's instructions. Freeze ice cream in covered container. (Can be prepared 3 days ahead. Keep curd refrigerated. Keep ice cream frozen.)",
        "Preheat oven to 350°F. Butter nonstick cookie sheet. Combine first 4 ingredients in heavy small saucepan. Stir over medium heat until sugar dissolves. Bring to boil. Remove from heat; whisk in flour. Form 2 cookies by spooning 1 tablespoon batter for each onto prepared cookie sheet, spacing evenly. Bake until cookies are lacy and golden, about 10 minutes. Cool cookies on sheet just until firm enough to lift without breaking, about 30 seconds. Working quickly, lift 1 cookie from sheet, using spatula. Drape over inverted 3/4-cup custard dish. Gently flatten cookie on dish bottom; mold and crimp sides to form cup. Repeat with remaining cookie, returning cookie sheet to oven briefly if cookie hardens. Repeat baking and molding of remaining batter. Cool. Gently remove cookie cups from dishes. (Can be made 1 day ahead. Store airtight.)",
        "Stir lemon curd over low heat just until slightly warm. Place 1 cookie cup on each plate. Fill with scoops of ice cream. Spoon some lemon curd over. Sprinkle with berries."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons sugar",
        "2/3 cup fresh lemon juice",
        "1/2 cup (1 stick) unsalted butter, cut into pieces",
        "3 tablespoons grated lemon peel",
        "3 large eggs",
        "1 cup whipping cream",
        "1/2 cup milk",
        "3 tablespoons dark corn syrup",
        "2 tablespoons firmly packed dark brown sugar",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 tablespoon brandy",
        "1/3 cup all purpose flour",
        "2 1/2-pint baskets fresh blackberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Citrus",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Frozen Dessert",
        "Blackberry",
        "Lemon",
        "Brandy",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Brandysnaps with Lemon Curd Ice Cream and Blackberries",
    "url": "http://www.epicurious.com/recipes/food/views/brandysnaps-with-lemon-curd-ice-cream-and-blackberries-1830"
}
