{
    "directions": [
        "For Crust: Blend flour, sugar and salt in processor. Using on/off turns, cut in butter and cream cheese until coarse meal forms. With machine running, pour just enough water down feed tube to form moist clumps. Gather dough into ball. Divide dough in half. Flatten each half into disk. Wrap in plastic and chill at least 1 hour. (Can be made 2 days ahead.)",
        "For Filling: Mix sugar, cornstarch, cinnamon and salt in large bowl. Mix in pears, prunes and figs. Sprinkle brandy over and mix well. Let stand 15 minutes to allow juices to form.",
        "Position rack in lowest third of oven and preheat to 400° F. Roll out 1 dough disk on lightly floured surface to 14-inch-diameter round. Transfer to 10-inch-diameter glass pie dish; gently press dough into place. Spoon filling into crust, mounding slightly in center. Roll out second dough disk on lightly floured surface to 14-inch-diameter round. Drape dough over filling. Trim dough overhang to 1/2 inch. Press edges together to seal and fold under. Crimp edge decoratively. Brush top of crust (but not edge) with glaze. Cut several small slits in crust to allow steam to escape.",
        "Bake pie until crust is golden brown and pears are tender when pierced through steam vents, about 50 minutes. Cool slightly and serve."
    ],
    "ingredients": [
        "2 1/4 cups all purpose flour",
        "1 tablespoon sugar",
        "3/4 teaspoon salt",
        "1 cup (2 sticks) chilled unsalted butter, cut into small pieces",
        "6 ounces chilled cream cheese, cut into small pieces",
        "6 tablespoons (about) ice water",
        "1/2 cup packed dark brown sugar",
        "1/4 cup cornstarch",
        "2 teaspoons ground cinnamon",
        "Pinch of salt",
        "3 3/4 to 4 pounds Barlett pears, peeled, halved, cored, cut into 1/3-inch-thick slices",
        "1/2 cup diced pitted prunes (about 3 ounces)",
        "1/2 cup diced stemmed Calimyrna figs",
        "1/4 cup brandy",
        "1 egg beaten to blend with 1 tablespoon brandy (glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Prune",
        "Fig",
        "Pear",
        "Brandy",
        "Winter"
    ],
    "title": "Brandied Pear, Prune and Fig Pie",
    "url": "http://www.epicurious.com/recipes/food/views/brandied-pear-prune-and-fig-pie-2625"
}
