{
    "directions": [
        "Combine sugar and vanilla bean in processor. Blend 2 minutes. Sift to remove vanilla pieces. (Can be made 2 weeks ahead. Store airtight.)",
        "Combine 1/4 cup vanilla sugar, water, brandy, preserves and raspberries, if using in heavy medium saucepan. Stir over medium-high heat until sugar dissolves. Add peaches. Bring to boil; reduce heat and cook until peaches are barely tender, about 5 minutes. Using slotted spoon, transfer peaches to strainer set over bowl. Boil syrup until very thick and reduced to scant 1/3 cup, adding any juices that continue to drain from peaches, about 13 minutes. Strain syrup into small bowl; mix in peaches. Cool. (Can be made 1 day ahead. Cover and chill.)",
        "Preheat oven to 350°F. Grease bottom of 9-inch-diameter springform pan. Combine cake meal and potato starch in small bowl; whisk to blend. Beat egg yolks and 1/2 cup vanilla sugar in large bowl until thick, about 2 minutes. Beat in margarine, then nondairy creamer and brandy. Beat in dry ingredients. Using clean dry beaters, beat whites and salt in another large bowl until soft peaks form. Gradually add 1/2 cup vanilla sugar and beat until stiff but not dry. Fold whites into yolks mixture in 3 additions. Transfer 1 cup batter to small bowl. Cover; chill. Pour remaining batter into prepared pan.",
        "Bake cake until tester inserted into center comes out clean, about 20 minutes. Cool cake in pan on rack 10 minutes. Maintain oven temperature.",
        "Spoon reserved 1 cup batter in 1-inch band around edge of cake. Arrange peaches close together in spoke pattern in center, pressing ends into batter at edge. Spoon 2 tablespoons peach juices over fruit. Bake until band at edge is firm, about 35 minutes. Cool cake in pan on rack; let stand up to 8 hours.",
        "Cut around pan sides to loosen cake; release sides. Garnish with fresh raspberries, if desired."
    ],
    "ingredients": [
        "1 2/3 cups sugar",
        "1 vanilla bean, chopped",
        "1 1/2 cups water",
        "1/4 cup brandy (kosher for Passover)",
        "1 tablespoon peach or apricot preserves",
        "6 fresh or frozen unsweetened raspberries (optional)",
        "1 1/4 pounds frozen unsweetened sliced peaches (about 5 cups), thawed",
        "1/2 cup matzo cake meal",
        "1/2 cup potato starch",
        "5 large eggs, separated",
        "1/4 cup (1/2 stick) unsalted pareve margarine, melted",
        "1/3 cup liquid nondairy creamer",
        "1 tablespoon brandy (kosher for Passover)",
        "1/2 teaspoon coarse salt",
        "Fresh raspberries (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Dessert",
        "Bake",
        "Passover",
        "Raspberry",
        "Peach",
        "Brandy",
        "Kosher",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Brandied Peach Compote Cake",
    "url": "http://www.epicurious.com/recipes/food/views/brandied-peach-compote-cake-1692"
}
