{
    "directions": [
        "Place apple rings in a bowl and pour in enough water to cover. Add lemon juice to water.",
        "Bring sugar and 3 cups water to a boil in a large saucepan; cook and stir until sugar dissolves, about 5 minutes. Add apples to sugar-water mixture and return to a boil. Reduce heat to medium-low and simmer until apples are tender, about 30 minutes.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack apple rings into hot, sterilized jars, filling to within 1/4 inch of the top. Keep syrup in the saucepan.",
        "Bring the syrup back to a boil and add brandy; cook and stir until heated through, 2 to 3 minutes. Ladle the syrup over apple rings, filling the jars to within 1/4 inch of the top.",
        "Run a knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "4 1/2 pounds apples, cored and sliced into 1/4-inch thick rings",
        "water to cover",
        "1 tablespoon lemon juice",
        "4 cups white sugar",
        "3 cups water",
        "1 cup brandy",
        "3 1-pint canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Brandied Apple Rings",
    "url": "http://allrecipes.com/recipe/238476/brandied-apple-rings/"
}
