{
    "directions": [
        "Heat oil in a large saucepan over medium heat; add mustard seeds, coriander, and cardamom and cook, stirring often, until mustard seeds begin to pop, about 1 minute. Add shallots, garlic, and ginger and cook, stirring often, until softened, about 5 minutes. Add fish sauce, sugar, turmeric, and red pepper flakes and cook, stirring constantly, until sugar is dissolved, about 1 minute.",
        "Add tomatoes. Bring to a boil, reduce heat, and simmer, stirring often, until tomatoes are falling apart and mixture thickens, 35-45 minutes. Mix in lime juice; season with salt and pepper. Let cool (you should have about 3 cups).",
        "DO AHEAD: Tomato jam can be made 3 days ahead. Cover and chill.",
        "Preheat oven to 350°F. Season fish lightly with salt and pepper. Lay 4 large rectangular pieces of parchment paper on a work surface. Spoon 1/4 cup reserved tomato jam in the center of 1 side of each sheet; top with fish, then another 1/2 cup tomato jam. Fold parchment paper over fish and crimp edges tightly to form a sealed packet. Place packets on 2 large rimmed baking sheets. Bake fish, rotating halfway through, 30 minutes.",
        "Open packets and top fish with herbs."
    ],
    "ingredients": [
        "1/4 cup vegetable oil",
        "3 tablespoons yellow mustard seeds",
        "1 tablespoon ground coriander",
        "1/2 teaspoon ground cardamom",
        "2 medium shallots, thinly sliced",
        "2 garlic cloves, chopped",
        "2 tablespoons chopped peeled ginger",
        "1/4 cup fish sauce (such as nam pla or nuoc nam)",
        "1/4 cup sugar",
        "1 tablespoon ground turmeric",
        "1 teaspoon crushed red pepper flakes",
        "4 beefsteak tomatoes (about 2 pounds), coarsely chopped",
        "2 tablespoons fresh lime juice",
        "Kosher salt",
        "4 1-pound whole branzino, cleaned",
        "Kosher salt, freshly ground pepper",
        "1 cup (packed) fresh tender herbs (such as basil, dill, cilantro, and/or flat-leaf parsley)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Tomato",
        "Low Carb",
        "Low Fat",
        "Low Cal",
        "Wheat/Gluten-Free",
        "Dinner",
        "Seafood",
        "Summer",
        "Low Cholesterol",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Branzino with Herbs and Tomato Jam",
    "url": "http://www.epicurious.com/recipes/food/views/branzino-with-herbs-and-tomato-jam-51175000"
}
