{
    "directions": [
        "Roll out three fourths of the dough 1/8 inch thick on a lightly floured surface, fit it into a 10-inch (6-cup capacity) pie plate, and trim the edge, leaving a 1/2-inch overhang. Fold the overhang under the dough flush with the edge of the pie plate and with a sharp knife make 1/2-inch-long cuts at 3/4-inch intervals all the way around the edge of the shell. Turn every other section of the dough in toward the center of the shell to form a decorative edge and chill the shell for 30 minutes.",
        "Roll out the remaining dough 1/8 inch thick on the lightly floured surface and with a 3-inch leaf-shaped cutter cut out 3 leaves. Transfer the pastry leaves to a baking sheet, score them lightly with the back of a knife to form veins, and chill them for 15 minutes, or until they are firm. Brush the leaves lightly with some of the egg wash and bake them in the middle of a preheated 375°F. oven for 12 to 15 minutes, or until they are golden. Transfer the leaves to a rack and let them cool completely.",
        "In a bowl whisk together the pumpkin, the brown sugar, the cinnamon, the ginger, the salt, the heavy cream, the milk, the eggs, and the Cognac until the filling is smooth and pour the filling into the shell. Brush the edge of the shell lightly with some of the remaining egg wash if desired and bake the pie in the middle of a preheated 375°F. oven for 1 hour, or until the filling is set but the center still shakes slightly. (The filling will continue to set as the pie cools.) Transfer the pie to a rack and let it cool completely. Garnish the pie with the pastry leaves just before serving and serve it with the ginger whipped cream."
    ],
    "ingredients": [
        "1 1/2 recipes pâte brisée",
        "an egg wash made by beating 1 large egg yolk with 1 teaspoon water",
        "2 cups canned solid-pack pumpkin",
        "2/3 cup firmly packed light brown sugar",
        "2 teaspoons cinnamon",
        "1 teaspoon ground ginger",
        "1/2 teaspoon salt",
        "1 cup heavy cream",
        "2/3 cup milk",
        "2 large eggs",
        "1/4 cup Cognac or other brandy",
        "ginger whipped cream as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cognac/Armagnac",
        "Pumpkin",
        "Gourmet"
    ],
    "title": "Brandied Pumpkin Pie",
    "url": "http://www.epicurious.com/recipes/food/views/brandied-pumpkin-pie-13329"
}
