{
    "directions": [
        "Blend together flour, salt, butter, shortening, and 2 tablespoons sugar with your fingertips or a pastry blender in a large bowl (or pulse in a food processor, then transfer to a large bowl) just until most of mixture resembles coarse meal with small (roughly pea-size) butter lumps. Drizzle evenly with 1/2 cup ice water and gently stir with a fork until incorporated.",
        "Squeeze a small handful: If it doesn't hold together, add more ice water, 1 tablespoon at a time, stirring until just incorporated, then test again. (Do not overwork mixture, or pastry will be tough.)",
        "Turn out mixture onto a lightly floured surface and divide into 8 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather dough together with scraper and divide into 2 balls, one slightly larger than the other, then flatten each into a 5- to 6-inch disk. Chill, wrapped in plastic wrap, until firm, at least 1 hour.",
        "Peel, halve, and core pears. Cut pears into 1/4-inch dice, then stir together with remaining filling ingredients in a 3-quart heavy pot. Bring to a boil, stirring, then reduce heat and simmer, uncovered, stirring occasionally, until thick, about 10 minutes. Transfer filling to a shallow dish and cool to room temperature.",
        "Roll out smaller disk of dough into a 13-inch round (about 1/8 inch thick) on a floured surface with a floured rolling pin, lifting up dough carefully and flouring surface as necessary to keep dough from sticking.",
        "Cut out as many rounds as possible (about 12) with 3 1/2-inch fluted cutter, transferring as cut to a wax-paper-lined baking sheet. Chill rounds until firm, about 10 minutes, before decorating. Gather dough scraps and chill 20 to 30 minutes, then reroll, cut, and chill additional 31/2-inch rounds (reroll scraps only once) for a total of 16.",
        "Cut out shapes from rounds with decorative cutters or a sharp paring knife, leaving a 1/2-inch border around edge, and reserve cutout pieces if desired for additional decoration. Brush tops lightly with milk. Lightly press reserved cutouts (if using) onto decorated pastry rounds and brush lightly with milk. Sprinkle remaining tablespoon sugar evenly over tops and chill while making bottoms.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Roll out larger disk of dough into a 15-inch round (about 1/8 inch thick) on floured surface with floured rolling pin, lifting up dough carefully and flouring surface as necessary to keep dough from sticking. Cut out as many rounds as possible (about 12) with 4-inch cutter. Gather dough scraps and chill 20 to 30 minutes, then reroll and cut additional 4-inch rounds (reroll scraps only once) for a total of 16. Fit each 4-inch round into a tartlet pan (don't trim). Fill each tartlet with 3 tablespoons cooled filling and brush edge of pastry lightly with milk. Place decorated tops over filling in each tartlet, then press each top lightly around edge to help seal edges and trim pastry if necessary.",
        "Bake tartlets on a large baking sheet until golden, 20 to 25 minutes. Transfer tartlets to a rack and cool 10 minutes. To remove tartlets from pans, cover 1 hand with a folded kitchen towel and invert tartlets 1 at a time onto towel, reinverting them onto a platter. Serve warm or at room temperature."
    ],
    "ingredients": [
        "3 1/2 cups all-purpose flour",
        "1 teaspoon salt",
        "2 sticks (1 cup) cold unsalted butter, cut into 1/2-inch cubes",
        "1/2 cup cold vegetable shortening",
        "3 tablespoons sugar",
        "8 to 10 tablespoons ice water",
        "3 tablespoons whole milk",
        "1 1/2 pounds firm-ripe pears (about 3)",
        "2 cups dried sour cherries (10 ounces)",
        "1/2 cup brandy",
        "1/2 cup water",
        "3 tablespoons sugar",
        "2 tablespoons cornstarch",
        "Special equipment: a pastry or bench scraper; a 3 1/2-inch fluted round cookie cutter; small (1/2- to 3/4-inch) decorative cutters; a 4-inch fluted or plain round cutter; 16 (3 1/4- to 3 1/2- by 5/8-inch) fluted round nonstick tartlet pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pear",
        "Cherry",
        "Brandy",
        "Fall",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Brandied Sour Cherry and Pear Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/brandied-sour-cherry-and-pear-tartlets-108780"
}
