{
    "directions": [
        "Place chuck roast, onion, carrots, celery, peppercorns, cloves, garlic, cinnamon stick, rosemary, and bay leaves together in a stockpot. Pour wine over meat and vegetable mixture to cover entirely. Cover stockpot and marinate for 6 hours in the refrigerator. Turn meat in marinade to make sure it is completely covered; return to refrigerator to finish marinating, about 6 hours more.",
        "Transfer chuck roast from marinade to a plate to rest; pat dry thoroughly with paper towels. Pour marinade through a strainer and into a bowl to separate vegetable mixture from wine, reserving both vegetable mixture and wine.",
        "Heat olive oil in the stockpot over medium-high heat. Brown chuck roast on all sides, 4 to 6 minutes per side. Reduce heat to medium. Add strained vegetable mixture to stockpot; cook with the chuck roast until fragrant, adding more oil as necessary to prevent burning, about 8 minutes.",
        "Pour reserved wine back into stockpot; add salt. Reduce heat to medium-low, cover, and simmer without removing cover for 2 hours. Remove cover, stir, and cook until meat easily shreds with a fork, 10 minutes to 1 hour longer. Transfer meat from cooking liquid to serving platter; tent with foil to keep warm.",
        "Return cooking liquid to a boil over medium-high heat; simmer until reduced to sauce consistency, 20 to 30  minutes. Discard cinnamon stick, rosemary, and bay leaves. Season with salt; puree mixture with a handheld immersion blender until smooth. Pour sauce over meat to serve."
    ],
    "ingredients": [
        "1 (2 pound) beef chuck roast",
        "1 onion, cut into 8 pieces, layers separated",
        "2 large carrots, cut into 1-inch pieces",
        "2 ribs celery, cut into 1-inch pieces",
        "10 whole black peppercorns",
        "5 whole cloves",
        "1 clove garlic, crushed",
        "1 cinnamon stick",
        "1 sprig rosemary",
        "2 bay leaves",
        "1 (750 milliliter) bottle Barolo (dry Italian) red wine",
        "3 tablespoons olive oil, or more to taste",
        "1 teaspoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Brasato al Barolo - Braised Chuck Roast in Red Wine",
    "url": "http://allrecipes.com/recipe/246417/brasato-al-barolo---braised-chuck-roa/"
}
