{
    "directions": [
        "Cook eggs in a large saucepan of boiling water for 7 minutes (whites will be set and yolks still slightly soft). Drain; transfer to a bowl of ice water and let sit until cool. Drain; peel eggs and cut in half lengthwise. Set aside.",
        "Preheat oven to 500°F. Toss broccolini with 1 Tbsp. oil on a rimmed baking sheet and season with salt. Roast, turning occasionally, until crisp-tender and charred in spots, 8–10 minutes. Let cool, then coarsely chop.",
        "Whisk shallot, vinegar, mustard, and remaining 4 Tbsp. oil in a large bowl until emulsified; season with salt. Add kale and brussels sprouts and toss to coat; season with salt and pepper. Massage kale until slightly softened, about 5 minutes. Add roasted broccolini and 2 Tbsp. sunflower seeds; toss again.",
        "Swipe some hummus along the inside of each bowl with a spoon. Divide salad among bowls and add an avocado wedge and 2 reserved egg halves to each. Top with chives, sesame seeds, and remaining sunflower seeds; sprinkle with red pepper flakes."
    ],
    "ingredients": [
        "4 large eggs",
        "1 bunch broccolini, trimmed",
        "5 tablespoons olive oil, divided",
        "Kosher salt",
        "1 small shallot, finely chopped",
        "2 tablespoons apple cider vinegar",
        "1 tablespoon whole grain mustard",
        "1/2 bunch curly kale, ribs and stems removed, leaves torn into 2-inch pieces (about 8 cups)",
        "8 ounces brussels sprouts, trimmed, thinly sliced lengthwise",
        "Freshly ground black pepper",
        "1/2 cup unsalted, roasted sunflower seeds, divided",
        "1/2 cup hummus",
        "1 avocado, quartered lengthwise",
        "2 tablespoons finely chopped chives",
        "1 tablespoon toasted sesame seeds",
        "Crushed red pepper flakes (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lunch",
        "Kale",
        "Brussel Sprout",
        "Hummus",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Avocado",
        "Seed",
        "Healthy"
    ],
    "title": "Brassicas Bowl",
    "url": "http://www.epicurious.com/recipes/food/views/brassicas-bowl"
}
