{
    "directions": [
        "Pat fish fillets dry and put in a bowl. Stir together lime juice, malagueta peppers, 1 tablespoon garlic, and 1 1/2 teaspoons salt, then pour over fish and toss to combine. Marinate, covered and chilled, 30 minutes. Add shrimp and chill at least 30 minutes but no longer than 1 1/2 hours more.",
        "Put tomatoes in bottom of a wide 5- to 6-quart heavy pot. Top with onion and remaining tablespoon garlic, then sprinkle with bell peppers. Place plantains on top of vegetables. Sprinkle evenly with remaining 1/2 teaspoon salt. Arrange fish in 1 layer on top of plantain. Sprinkle cilantro and parsley over fish, then arrange shrimp in 1 layer over herbs, reserving marinade. Pour oil and marinade evenly over mixture in pot.",
        "Bring to a simmer, then cover pot. Adjust heat to gently simmer until vegetables are softened and have released liquid and fish is just cooked through, about 20 minutes.",
        "Serve stew over soft manioc polenta ."
    ],
    "ingredients": [
        "8 (6-ounce) pieces skinless hake or Pacific cod fillet (1/2 to 1 1/4 inches thick)",
        "1/4 cup fresh lime juice",
        "1/2 teaspoon finely chopped bottled malagueta peppers or 1/4 teaspoon dried hot red-pepper flakes",
        "2 tablespoons finely chopped garlic (3 cloves)",
        "2 teaspoons salt",
        "1 pound extra-large shrimp in shell (16 to 20 per pound), peeled and deveined, reserving shells if making soft manioc polenta as accompaniment",
        "1 1/2 pound tomatoes, cut into 1/2-inch cubes",
        "1 large onion, chopped",
        "1/2 cup chopped green bell pepper",
        "1/3 cup chopped yellow bell pepper",
        "2 yellow plantains, peeled and each cut diagonally into 8 pieces",
        "1/2 cup finely chopped fresh cilantro",
        "1/4 cup finely chopped fresh flat-leaf parsley",
        "1/4 cup extra-virgin olive oil",
        "Accompaniments: soft manioc polenta ; malagueta pepper sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Herb",
        "Onion",
        "Pepper",
        "Tomato",
        "Marinate",
        "Dinner",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Brazilian Fish Stew (_Moqueca Capixaba_)",
    "url": "http://www.epicurious.com/recipes/food/views/brazilian-fish-stew-238413"
}
