{
    "directions": [
        "Preheat oven to 350°F. Finely chop all nuts with sugar in processor. Add butter and blend until well combined. Press mixture firmly onto sides, then bottom of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Freeze 10 minutes. Bake until light brown, about 20 minutes. Cool on rack.",
        "Bring 1 cup cream, half and half and sugar to simmer in heavy medium saucepan, stirring occasionally. Whisk yolks in medium bowl. Whisk in hot cream mixture. Return mixture to saucepan and stir over medium-low heat until custard thickens and leaves path on back of spoon when finger is drawn across, about 5 minutes; do not boil. Strain into bowl. Add white chocolate; whisk until melted. Mix in remaining 2 cups cream. Chill until cold.",
        "Peel and slice 1 1/2 pounds bananas. Puree bananas with lemon juice in processor. Mix puree into custard. Transfer custard to ice cream maker and process according to manufacturer's instructions. Spoon ice cream into prepared crust; smooth top. Cover and freeze overnight. (Can be made 1 week ahead; keep frozen.)",
        "Bring cream and syrup to simmer in medium saucepan. Reduce heat to low. Add chocolate; whisk until smooth. Cool to lukewarm. (Can be made 1 day ahead. Cover and chill. Rewarm over low heat before using; do not boil.)",
        "Remove pan sides from torte. Arrange bananas and strawberries in rows atop ice cream. Serve with sauce."
    ],
    "ingredients": [
        "3 cups walnuts (about 12 ounces)",
        "1 cup whole almonds",
        "1/3 cup firmly packed dark brown sugar",
        "1/4 cup (1/2 stick) unsalted butter, melted, cooled",
        "3 cups whipping cream",
        "1 cup half and half",
        "3/4 cup sugar",
        "4 large egg yolks",
        "8 ounces imported white chocolate (such as Lindt), chopped",
        "1 1/2 pounds very ripe bananas",
        "3 tablespoons fresh lemon juice",
        "3/4 cup whipping cream",
        "1/4 cup light corn syrup",
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3 large ripe bananas, peeled, cut on diagonal into 1/4-inch-wide slices",
        "15 small strawberries with stems"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Frozen Dessert",
        "Strawberry",
        "Banana",
        "Almond",
        "Walnut"
    ],
    "title": "Brazilian Banana and White Chocolate Ice Cream Torte",
    "url": "http://www.epicurious.com/recipes/food/views/brazilian-banana-and-white-chocolate-ice-cream-torte-2835"
}
