{
    "directions": [
        "Preheat oven to 200 degrees F (95 degrees C).",
        "Heat the olive oil in a large skillet over medium-high heat. Place the potato slices in the skillet and season with salt, pepper, and chili powder. Cook until the potatoes are tender, about 10 minutes. Remove from the pan to a baking sheet and put in the warm oven.",
        "Stir chorizo into skillet and cook until browned and crumbly, stirring frequently to break apart. Pour off the grease, then place the chorizo in the oven with the potatoes. Wipe the skillet dry with paper towels.",
        "Wrap the tortillas with aluminum foil and place in the warm oven.",
        "Melt butter in the skillet over medium-low heat. Pour in the eggs and continually stir while cooking. When the eggs are nearly set, mix in the chorizo and potatoes. Add the cream cheese and stir until melted; just before serving, fold in the cilantro.",
        "Place the tortillas onto individual plates and spoon the eggs onto the lower half of each. Fold the sides over the filling, then roll the tortillas into a tight cylinder; top with green salsa to serve."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=250&h=131&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F170879.jpg",
    "ingredients": [
        "2 tablespoons olive oil",
        "8 small red potatoes, cut into 1/4 inch slices",
        "salt and ground black pepper to taste",
        "1 tablespoon chili powder",
        "½ pound bulk chorizo sausage",
        "4  burrito-size flour tortillas",
        "1 tablespoon butter",
        "5  eggs, lightly beaten",
        "1 (4 ounce) package cream cheese",
        "3 tablespoons chopped fresh cilantro",
        "¼ cup green salsa"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Breakfast Burritos with Green Salsa",
    "url": "http://allrecipes.com/recipe/143165/breakfast-burritos-with-green-salsa/"
}