{
    "directions": [
        "Put the tahini in a small bowl. Stir in the 2 Tbs. lemon juice and then the 2 Tbs. hot water. If needed, stir in more water to thin the mixture to the texture of thick mayonnaise. Stir in two-thirds of the green onions. Season the sauce with salt and pepper. Set aside.",
        "Place the chicken breast halves between 2 sheets of waxed paper. Using a meat mallet or a rolling pin, pound the breasts to a thickness of 1/3 to 1/2 inch. In a bowl, combine the egg, the remaining green onions, the mustard and lemon zest and stir with a fork. Add the chicken and turn to coat. Season the chicken with salt and pepper. Spread out the panko in a pie dish or a cake pan.",
        "In a large nonstick fry pan over medium-high heat, warm 2 Tbs. of the olive oil. Dip the chicken in the panko, turning to coat on both sides, and add to the pan. Cook, turning once, until the chicken is browned and cooked through, about 4 minutes per side.",
        "Meanwhile, put the spinach in a large bowl. Add the remaining 1 Tbs. olive oil and toss to coat. Season with salt and pepper. Mix in the 1 tsp. lemon juice. Divide the spinach among 4 plates. Slice the chicken breasts crosswise and place 1 breast half on top of the spinach on each plate. Spoon the tahini sauce over the top and serve immediately. Serves 4.",
        "Quick Tips:",
        "Make extra sauce to use as a dip for vegetables or pita wedges another night. It’s also delicious as a sauce for fish. Tahini, a peanut butter-like paste made from ground sesame seeds, is available near the peanut butter in some supermarkets, at natural food stores and in Middle Eastern stores. Stir it thoroughly before using. Panko, Japanese bread crumbs, are terrific for quick breading and are available where Asian food is sold.",
        "Adapted from Williams-Sonoma",
        "Weeknight Fresh & Fast,",
        "by Kristine Kidd (Williams-Sonoma, 2011)."
    ],
    "ingredients": [
        "1/4 cup tahini",
        "2 Tbs. plus 1 tsp. fresh lemon juice",
        "2 Tbs. hot water, plus more as needed",
        "3 green onions, white and green portions finely chopped",
        "Coarse kosher salt and freshly ground pepper, to taste",
        "4 boneless, skinless chicken breast halves, each 5 to 6 oz.",
        "1 egg",
        "2 tsp. Dijon mustard",
        "1 tsp. grated lemon zest",
        "1 cup panko (Japanese bread crumbs)",
        "3 Tbs. olive oil",
        "6 oz. baby spinach"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Breaded Chicken with Lemon-Green Onion Tahini",
    "url": "http://www.williams-sonoma.com/recipe/breaded-chicken-with-lemon-green-onion-tahini.html"
}
