{
    "directions": [
        "In a bowl whisk together the wine, the vinegar, the soy sauce, the lemon juice, the garlic, the gingerroot, the oil and salt and pepper to taste.",
        "Put the duck breasts in a large resealable plastic bag, pour the marinade over them, and seal the bag. Put the plastic bag in a large bowl and let the duck marinate, chilled, overnight. Remove the duck from the marinade and pat it dry between layers of paper towels. Score the skin of each duck breast in a crosshatch pattern with a sharp knife and sprinkle both sides of the duck with salt and pepper to taste. Heat 2 heavy skillets over moderately high heat until they are hot and in each skillet cook 1 of the duck breasts, skin side down, for 10 minutes. Turn the duck and cook it for 2 minutes more, transfer the skillets to the middle of a preheated 450°F. oven (wrap the skillet handles with a double thickness of foil if the handles are not ovenproof), and roast the duck for 5 to 7 minutes, or until a meat thermometer registers 145°F. to 150°F. for medium meat.",
        "While the duck is roasting, in a small heavy saucepan combine the sugar and the water, bring the mixture to a boil, stirring until the sugar is dissolved, and boil it, swirling the pan, until the mixture is a golden caramel. Add the vinegars carefully, swirling the pan until the caramel is dissolved, and reserve the mixture.",
        "Transfer the duck to a cutting board and let it stand, covered loosely with foil, for 5 minutes. Pour off all but 2 tablespoons of the fat from 1 of the skillets and in the fat remaining in the skillet cook the shallot and the garlic over moderately low heat, stirring, until the shallot is softened. Add the dry red wine and boil the mixture until it is reduced by half. Add the broth, boil the mixture until it is reduced by one third, and pour the mixture through a fine sieve set over the reserved vinegar mixture, pressing hard on the solids. Whisk in the cream and the Port, simmer the mixture for 1 minute, and add the beurre manié, a little at a time, whisking until the sauce is smooth. Simmer the sauce, whisking occasionally, for 2 minutes, whisk into the sauce any juices that have accumulated on the cutting board, and season the sauce with salt and pepper.",
        "Cut the duck diagonally across the grain into thin slices, divide the duck slices among 8 plates, and spoon the sauce over the duck. Serve the duck with the dried cherry and shallot confit."
    ],
    "ingredients": [
        "1 1/4 cups dry red wine",
        "1/4 cup balsamic vinegar",
        "3 tablespoons soy sauce",
        "1/4 cup fresh lemon juice",
        "3 garlic cloves, crushed",
        "1 1/2 tablespoons grated fresh gingerroot",
        "1/4 cup olive oil",
        "two 2-pound whole boneless duck breasts with skin*",
        "3 tablespoons sugar",
        "3 tablespoons water",
        "2 tablespoons white-wine vinegar",
        "3 tablespoons balsamic vinegar",
        "1/4 cup minced shallot",
        "1 large garlic clove, minced",
        "1 1/2 cups dry red wine",
        "3/4 cup beef broth",
        "1/3 cup heavy cream",
        "1/4 cup Tawny Port",
        "a beurre manié made by kneading together 3 tablespoons softened unsalted butter and 2 tablespoons all-purpose flour",
        "dried cherry and shallot confit",
        "dried cherry and shallot confit",
        "*Whole boneless duck breasts are available at many butcher shops and specialty foods shops."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Ginger",
        "Roast",
        "Valentine's Day",
        "Port",
        "Gourmet"
    ],
    "title": "Breast of Duck with Port Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/breast-of-duck-with-port-sauce-10669"
}
