{
    "directions": [
        "Set an oven rack 6 inches from the heat source and preheat the oven to 425 degrees F.",
        "Bring a large pot of salted water to a boil. Add the macaroni and cook until it is al dente, about 6 minutes. Strain, reserving 1 3/4 cups of the pasta water. Set aside.",
        "Heat the oil in a large saucepan over medium-high heat. Add the sausage and cook until lightly browned, breaking up the meat with the back of a wooden spoon, about 5 minutes. Transfer the browned meat to a plate with a slotted spoon. Add the onions, 1 tablespoon water and a pinch of salt to the saucepan and cook until just starting to soften, 3 to 4 minutes, scraping up any browned bits with the wooden spoon. Add the bell peppers and cook until lightly browned and softened, 6 to 8 minutes. Transfer the onion and green bell pepper to the plate with the browned sausage.",
        "Carefully wipe out the saucepan (or give it a quick rinse if it is really dirty). Add the half-and-half and cayenne and bring to a simmer over medium heat. Cook until reduced to 1 1/2 cups, about 15 minutes. Add the cream cheese and stir until melted. Whisk in the Cheddar and Gruyere until all the cheese is melted and the sauce is smooth.",
        "Add the macaroni and reserved pasta water to the saucepan and stir to combine. (The mixture will look very loose, but the pasta will suck up a lot of the sauce as it bakes.) Gently fold in the browned meat and vegetables and season with more salt if needed. Pour into a 13-by-9-inch baking dish. Toss the hash browns with the melted butter and a pinch of salt and scatter over the macaroni and cheese. Bake until the cheese is bubbly and the hash browns are just starting to brown, about 10 minutes. Broil until the hash browns are golden brown and crispy, about 3 minutes."
    ],
    "ingredients": [
        "Kosher salt",
        "1 pound elbow macaroni",
        "1 tablespoon vegetable oil",
        "1 pound breakfast sausage, casings removed",
        "1 large yellow onion, chopped",
        "2 small green bell peppers, chopped",
        "2 1/2 cups half-and-half",
        "1/8 to 1/4 teaspoon cayenne pepper",
        "1 pound cream cheese, room temperature",
        "8 ounces sharp Cheddar, shredded (about 3 cups)",
        "3 ounces Gruyere, shredded (about 1 cup)",
        "1 1/2 cups frozen shredded hash browns, thawed",
        "4 tablespoons unsalted butter, melted"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Macaroni and Cheese",
        "Cheese",
        "Sausage Recipes",
        "Potato",
        "Vegetable",
        "Sauteing Recipes"
    ],
    "title": "Breakfast Macaroni and Cheese with Sausage and Hash Browns",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/breakfast-macaroni-and-cheese-with-sausage-and-hash-browns"
}
