{
    "directions": [
        "In a blender, combine milk and eggs. Mix on medium-high speed until foamy, about 10 seconds. Turn blender to low speed and remove feed top. With blender going, add sugar and salt. Replace feed top and blend on high speed for a few seconds, then turn blender back to low. In the same manner, add butter, brandy, and vanilla, replacing feed top and blending for several seconds after each addition. Turn blender off. Add flour all at once and blend until just combined.",
        "Place crêpe pan over moderately high heat. With flexible spatula, spread a tiny amount of butter in pan (an alternative method is to brush the pan with melted butter using a pastry brush) and heat until butter just begins to smoke. Pour 1/4 to 1/3 cup batter into the pan. As you pour, quickly tilt the pan in all directions to spread a thin layer of batter across the bottom. Pour in just enough batter to cover the pan.",
        "Cook crêpe over moderately high heat until bubbles just begin to form on the exposed surface, about one to two minutes. Lift up the edge to check the cooking process — if the crêpe starts to burn before it is cooked through, turn down the heat. If it is not nicely browned after two minutes, turn up the heat.",
        "When underside of crêpe is browned, flip and cook another minute or less, until other side is browned. Remove from pan and keep warm in the oven, loosely covered with foil.",
        "Grease pan with a very small amount of butter and repeat process. Continue until all batter is used, stacking cooked crêpes on a plate in the oven. To serve, sprinkle each crêpe with sugar or spread with jelly and fold or roll up."
    ],
    "ingredients": [
        "1 1/2 cups whole milk",
        "3 large eggs",
        "3 tablespoons sugar",
        "1 teaspoon salt",
        "Scant 5 tablespoons unsalted butter, melted",
        "1/2 cup brandy",
        "1 teaspoon vanilla extract",
        "1 cup all-purpose flour",
        "Additional butter for cooking",
        "Additional sugar or clear jelly such as apple or apricot for serving",
        "Iron skillet or crêpe pan",
        "Flexible metal or plastic spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Breakfast",
        "Brunch",
        "Quick & Easy",
        "Brandy",
        "Pan-Fry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Breakfast Crepes",
    "url": "http://www.epicurious.com/recipes/food/views/breakfast-crepes-108134"
}
