{
    "directions": [
        "Combine 1 cup sugar, 2 cups water, apricots and cherries in medium saucepan. Bring to boil, stirring until sugar dissolves. Remove from heat. Cover; let stand 20 minutes. Strain fruit; reserve fruit and soaking liquid separately.",
        "Combine 1 cup sugar and remaining 1/4 cup water in heavy medium saucepan. Stir over low heat until sugar dissolves. Increase heat; boil without stirring until deep amber color, brushing down sides of pan with wet pastry brush and swirling pan occasionally, about 12 minutes. Remove from heat. Gradually whisk in 1 cup reserved soaking liquid (mixture will bubble vigorously). Stir over low heat until caramel thickens slightly, about 6 minutes. Add 1 cup cream. Bring to boil and simmer until caramel thickens slightly, about 3 minutes. Remove from heat. Cool caramel sauce 30 minutes, whisking occasionally. (Can be made 1 day ahead. Cover caramel sauce and fruit separately and refrigerate.)",
        "Preheat oven to 350°F. Bring 2 cups cream and milk to simmer in another medium saucepan. Remove from heat. Whisk 2 cups sugar and egg yolks in large bowl to blend. Gradually whisk in warm milk mixture. Cool custard slightly. Lightly butter 13 x 9 x 2-inch glass baking dish. Arrange enough bread in single layer over bottom and up sides of prepared dish to cover completely, trimming bread to fit. Sprinkle reserved fruit over bread. Arrange remaining bread slices over fruit, trimming to fit and overlapping slightly.",
        "Pour custard over bread. Press bread gently to submerge into custard. Let stand until custard is absorbed, about 10 minutes. Bake until custard is set and bread is golden brown on top, about 55 minutes.",
        "Rewarm sauce over low heat. Serve pudding warm with sauce."
    ],
    "ingredients": [
        "4 cups sugar",
        "2 1/4 cups water",
        "4 ounces dried apricots, thinly sliced",
        "4 ounces dried tart cherries or dried cranberries",
        "3 cups whipping cream",
        "2 cups whole milk",
        "8 large egg yolks",
        "1 1/2 24-ounce loaves sliced white bread, crusts trimmed, each slice halved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Apricot",
        "Cherry",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Bread Pudding with Dried Apricots, Dried Cherries and Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/bread-pudding-with-dried-apricots-dried-cherries-and-caramel-sauce-15575"
}
