{
    "directions": [
        "In a 10-inch nonstick fry pan over medium-high heat, melt the butter with 1 Tbs. of the oil. Add the potatoes and cook, stirring occasionally, until browned and crisp on all sides, about 10 minutes. Add the green onions, salt and pepper and cook, stirring constantly, for 1 minute more. Remove from the heat and cover with aluminum foil.",
        "Position a rack in the upper third of an oven and preheat to 500°F.",
        "In a 12-inch oven-safe nonstick fry pan over medium-high heat, cook the chorizo, stirring occasionally and crumbling with a wooden spoon, until browned, 5 to 6 minutes. Transfer to a paper towel-lined plate.",
        "Wipe out the pan with paper towels. Return the pan to medium-high heat and warm the remaining 1 Tbs. oil. Add the yellow onion and cook, stirring occasionally, until softened, about 4 minutes. Add the chard and cook, stirring occasionally, until tender, about 5 minutes. Add the chorizo and bell pepper and cook for 1 minute. Stir in the cheese and season lightly with salt and pepper.",
        "Crack the eggs over the chorizo mixture, spacing them evenly, and season with salt and pepper. Transfer the pan to the oven and bake until the eggs are just set, 5 to 6 minutes. Serve immediately with the home fries. Serves 6.",
        "Williams-Sonoma Kitchen."
    ],
    "ingredients": [
        "2 Tbs. unsalted butter",
        "2 Tbs. vegetable oil",
        "1 1/2 lb. small red potatoes, boiled until just tender, drained and quartered",
        "4 green onions, white and light green portions, thinly sliced on the bias",
        "Kosher salt and freshly ground pepper, to taste",
        "1 lb. Mexican chorizo, casings removed",
        "1/2 yellow onion, diced",
        "1 large bunch Swiss chard, stems and ribs removed, leaves cut into 1/2-inch strips",
        "1 red bell pepper, roasted, seeded and cut into 1/4-inch strips",
        "1 cup shredded white cheddar cheese",
        "8 eggs"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Breakfast Skillet with Green Onion Home Fries",
    "url": "http://www.williams-sonoma.com/recipe/breakfast-skillet-with-green-onion-home-fries.html"
}
