{
    "directions": [
        "Preheat oven to 375°F. Cut bottom crust and short ends off bread; discard. Cut remaining bread with crust into 1-inch cubes (about 10 cups loosely packed). Place in very large bowl. Add oil, thyme, and garlic; toss. Spread cubes out on large rimmed baking sheet. Sprinkle with salt and pepper. Bake until golden and slightly crunchy, stirring occasionally, 20 minutes. Return to same very large bowl.",
        "Melt butter in large skillet over medium-high heat. Add next 3 ingredients. sauté until soft, about 10 minutes. Add crawfish; sauté 2 minutes. Transfer to medium bowl. sauté bacon in same skillet over medium-high heat until crisp. Using slotted spoon, transfer bacon to bowl with vegetables. Pour off all but 1 tablespoon bacon fat from skillet. Add greens and 1 cup broth. Cover and simmer until greens are almost tender, about 5 minutes. Add greens and broth in skillet to vegetable mixture. Add parsley. DO AHEAD Bread cubes and vegetable mixture can be made 1 day ahead. Cover separately. Store bread at room temperature. Chill vegetable mixture.",
        "Preheat oven to 375°F. Butter 13x9x2-inch glass baking dish. Stir vegetable mixture into bread. Add remaining 3/4 cup broth; toss. Transfer to prepared dish. Cover with buttered foil, buttered side down. Bake until heated through, 25 minutes. Uncover; bake until top starts to brown, 25 minutes longer."
    ],
    "ingredients": [
        "1 (1-pound) loaf crusty country-style white bread",
        "1/4 cup olive oil",
        "4 teaspoons chopped fresh thyme",
        "1 large garlic clove, minced",
        "6 tablespoons (3/4 stick) butter",
        "1 1/2 cups finely chopped onion",
        "1 1/2 cups thinly sliced celery",
        "1 cup finely chopped green bell pepper",
        "1 pound peeled cooked crawfish tails, thawed if frozen",
        "1/2 pound sliced bacon, chopped",
        "1 (1-pound) bag sliced collard greens, coarsely torn",
        "1 3/4 cups low-salt chicken broth or turkey stock, heated, divided",
        "1/3 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Vegetable",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Bell Pepper",
        "Fall",
        "Collard Greens",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Bread Stuffing with Crawfish, Bacon, and Collard Greens",
    "url": "http://www.epicurious.com/recipes/food/views/bread-stuffing-with-crawfish-bacon-and-collard-greens-236497"
}
