{
    "directions": [
        "Heat 2 teaspoons oil in a 12-inch nonstick skillet over moderately high heat until hot but not smoking, then sauté chorizo and onion, stirring, until onion is softened. Add potatoes with salt and pepper to taste and cook, covered, stirring occasionally, until potatoes begin to turn golden brown, about 6 minutes. Stir in jalapeños, tomatoes, and cumin and cook, uncovered, stirring occasionally, until potatoes are tender and golden brown, about 6 minutes. Transfer to a bowl and cool completely. Stir in cilantro, cheese, and salt and pepper to taste.",
        "Roll out each empanada wrapper into a 6-inch round on a lightly floured surface. Put about 1/3 cup filling in center of each wrapper and form filling into a log. Moisten wrapper edges with a finger dipped in water and fold each wrapper over filling to form a half-moon. Press down around filling to force out air and seal by pressing edges together firmly with a fork.",
        "Heat remaining 3 cups oil in a deep 12-inch skillet over moderate heat until hot but not smoking, then fry empanadas in 3 batches, gently turning, until golden brown, about 3 minutes. Transfer empanadas to paper towels to drain."
    ],
    "ingredients": [
        "3 cups plus 2 teaspoons vegetable oil",
        "2 Spanish chorizo links (spicy dried pork sausage; 6 to 8 ounces), cut into 1/2-inch pieces",
        "1 onion, chopped",
        "1 pound boiling potatoes such as Yukon Gold, peeled and cut into 1/2-inch cubes",
        "2 jalapeños, seeded and finely chopped",
        "2 plum tomatoes, seeded and chopped",
        "1/2 teaspoon ground cumin",
        "1/4 cup finely chopped fresh cilantro",
        "1/3 cup grated queso blanco or Monterey Jack",
        "8 frozen empanada or turnover wrappers, thawed",
        "Accompaniments: bottled or homemade salsa verde and sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Pepper",
        "Pork",
        "Breakfast",
        "Brunch",
        "Sausage",
        "Jalapeño",
        "Monterey Jack",
        "Gourmet"
    ],
    "title": "Breakfast Empañadas",
    "url": "http://www.epicurious.com/recipes/food/views/breakfast-empanadas-102975"
}
