{
    "directions": [
        "Beat eggs in a large bowl with an electric mixer on medium speed until foamy, 2 to 3 minutes. Beat in milk, cream, 1 1/2 cup sugar, rum, vanilla extract, and salt until mixture is thoroughly combined. Gently stir bread cubes into the egg mixture to coat. Let bread soak until the egg mixture has been absorbed, about 1 hour; stir occasionally.",
        "Dissolve 1 cup sugar with 1/2 cup water and vinegar in a heavy saucepan. Place over high heat and cook without stirring until the sugar mixture is dark amber in color, about 10 minutes. Remove from heat and let cool until it stops bubbling. Gradually stir 1/4 cup water into the syrup, about 1 tablespoon at a time, stirring until water is incorporated.",
        "Pour warm sauce into a 9x9-inch baking pan and swirl the pan so the caramel sauce coats the bottom and sides of the pan. Let caramel sauce set, about 15 minutes. Coat inside of baking dish and caramel layer with butter. Transfer soaked bread cubes and any remaining liquid into the baking dish over caramel sauce and gently press bread cubes together. Cover pan with parchment paper.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place baking pan into a large roasting pan and pour enough boiling water into the roasting pan to reach halfway up the sides of the baking pan.",
        "Bake in the preheated oven until a knife inserted into the middle of the pudding comes out clean, about 1 hour and 15 minutes. Let stand for 5 to 10 minutes. Run a knife around the outside of the pan and invert pudding and caramel sauce onto a serving platter."
    ],
    "ingredients": [
        "8 eggs",
        "2 cups milk",
        "2 cups heavy whipping cream",
        "1 1/2 cups white sugar",
        "1/4 cup rum",
        "2 teaspoons vanilla extract",
        "1/4 teaspoon salt",
        "1 loaf Italian bread, cut into 1-inch cubes",
        "1 cup white sugar",
        "1/2 cup water",
        "1/2 teaspoon vinegar",
        "1/4 cup water",
        "1/4 cup butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bread Pudding With Caramel Sauce",
    "url": "http://allrecipes.com/recipe/229122/bread-pudding-with-caramel-sauce/"
}
