{
    "directions": [
        "Preheat oven to 400°F. Place vegetables on large rimmed baking sheet. Sprinkle with salt and pepper. Drizzle oil over; toss to coat. Roast vegetables until tender and brown around edges, turning occasionally, about 45 minutes. Remove from oven. Increase oven temperature to 500°F.",
        "Meanwhile, spray large nonstick baking sheet with oil spray. Place breadcrumbs on sheet of waxed paper. Whisk egg whites in shallow bowl until foamy. Using mallet, pound chicken breasts to 1/3-inch thickness. Sprinkle chicken with salt and pepper. Turn chicken in breadcrumbs; place on platter. Stir Parmesan into remaining breadcrumbs on waxed paper. Dip chicken into egg whites to coat. Then dip chicken into Parmesan breadcrumbs to coat; shake off excess.",
        "Transfer vegetables to bowl; mix in parsley and thyme. Add broth to baking sheet; scrape up any browned bits. Pour over vegetables. Keep warm.",
        "Bake chicken on prepared sheet 5 minutes. Turn chicken over; bake just until cooked through, about 5 minutes longer. Transfer chicken to plates. Spoon vegetable sauce alongside."
    ],
    "ingredients": [
        "4 large plum tomatoes, quartered",
        "1 large onion, cut into 1/2-inch-wide wedges",
        "2 red or green bell peppers, sliced",
        "1 8-ounce zucchini, trimmed, halved lengthwise, sliced crosswise",
        "1 tablespoon olive oil",
        "Nonstick vegetable oil spray",
        "1 cup dry breadcrumbs",
        "4 large egg whites",
        "4 skinless boneless chicken breast halves",
        "1/4 cup freshly grated Parmesan cheese",
        "2 tablespoons chopped fresh Italian parsley",
        "1 teaspoon chopped fresh thyme or 1/2 teaspoon dried",
        "1 cup canned low-salt chicken broth, hot"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Tomato",
        "Vegetable",
        "Bake",
        "Kid-Friendly",
        "Back to School",
        "Dinner",
        "Bell Pepper",
        "Zucchini",
        "Winter",
        "Healthy"
    ],
    "title": "Breaded Chicken Cutlets with Chunky Vegetable Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/breaded-chicken-cutlets-with-chunky-vegetable-sauce-4973"
}
