{
    "directions": [
        "Preheat oven to 325°F. Spread bread cubes on 2 baking sheets. Bake until bread cubes are dry and crisp, stirring occasionally, about 25 minutes. Transfer bread to large bowl.",
        "Sauté bacon in heavy large skillet over medium-high heat until brown and crisp. Using slotted spoon, transfer bacon to paper towels and drain. Pour off all but 1/4 cup drippings from skillet. Add chopped leeks and celery to skillet and sauté until tender and beginning to brown, about 10 minutes. Add mushrooms, sage, thyme, salt and pepper and sauté until tender, about 10 minutes. Pour mushroom mixture over bread cubes. Add bacon and toss to blend. Mix in 2 cups broth. (Stuffing can be prepared 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 350°F. Butter 13 x 9 x 2-inch glass baking dish. Beat eggs and baking powder in small bowl to blend. Mix eggs into stuffing; moisten stuffing with more broth if stuffing is dry. Transfer to prepared baking dish. Bake stuffing until cooked through and golden brown on top, about 1 hour."
    ],
    "ingredients": [
        "1 1/4 pounds sourdough bread, crusts trimmed, cut into 1/2-inch cubes (about 12 cups)",
        "3/4 pound bacon (about 12 slices), cut into 1/2-inch pieces",
        "3 cups chopped leeks (white and pale green parts only; about 2 medium)",
        "3 cups chopped celery",
        "1 pound mushrooms, sliced",
        "1 1/2 tablespoons dried sage leaves",
        "2 teaspoons dried thyme",
        "1 teaspoon salt",
        "3/4 teaspoon ground black pepper",
        "2 1/2 cups (or more) canned low-salt chicken broth",
        "2 large eggs",
        "1 1/2 teaspoons baking powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Bacon",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Bread Stuffing with Mushrooms and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/bread-stuffing-with-mushrooms-and-bacon-880"
}
