{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place eggplant slices in a large dish and cover with salted water. Let soak, about 15 minutes. Drain and cover with milk.",
        "Combine flour, 1 teaspoon garlic powder, 1/2 teaspoon onion powder, 1/4 teaspoon red pepper flakes, 1/4 teaspoon salt, and 1/4 teaspoon pepper in a large resealable plastic bag.",
        "Beat eggs lightly in a shallow bowl that is long enough for the eggplant slices to fit in.",
        "Combine panko, remaining 1 teaspoon garlic powder, 1/2 teaspoon onion powder, 1/4 teaspoon red pepper flakes, 1/4 teaspoon salt, and 1/4 teaspoon pepper in another large resealable plastic bag.",
        "Place 1 slice eggplant in flour mixture, shaking to coat. Dip in egg. Transfer to bag with panko mixture, shaking to coat. Repeat with remaining slices.",
        "Heat 1 tablespoon olive oil in a large skillet. Cook coated eggplant slices in batches until golden brown and crisp, about 2 minutes per side. Transfer to a cooling rack. Repeat with remaining eggplant, adding oil as needed.",
        "Heat 2 tablespoons oil in a large pot over medium heat. Add onion and garlic; cook and stir until onion softens, about 5 minutes. Stir in tomato sauce, diced tomatoes, chopped tomatoes, 2 teaspoons pepper, oregano, basil, 1 teaspoon salt, and poultry seasoning. Reduce heat to low and cover; cook sauce, stirring occasionally, until flavors combine, 10 to 15 minutes.",
        "Mix ricotta cheese, spinach, egg, Parmesan cheese, 1 teaspoon garlic, nutmeg, salt, and pepper together gently in a bowl to make filling.",
        "Spread 2 to 3 tablespoons of filling over each eggplant slice. Roll slices into logs and arrange in a single layer in a 9x13-inch baking pan. Pour tomato sauce evenly on top.",
        "Bake in the preheated oven until sauce is bubbly, about 30 minutes. Let stand for 5 minutes before serving."
    ],
    "ingredients": [
        "Eggplant:",
        "1 large eggplant, cut lengthwise into 1/4-inch slices",
        "1/2 cup milk",
        "1/2 cup whole wheat flour",
        "2 teaspoons garlic powder, divided",
        "1 teaspoon onion powder, divided",
        "1/2 teaspoon red pepper flakes, or to taste",
        "1/2 teaspoon salt, divided",
        "1/2 teaspoon ground black pepper, divided",
        "2 eggs",
        "1 cup panko bread crumbs",
        "1/4 cup olive oil, divided",
        "Sauce:",
        "2 tablespoons olive oil",
        "1/2 large onion, chopped",
        "2 teaspoons minced garlic, or to taste",
        "1 (15 ounce) can tomato sauce",
        "1 (14.5 ounce) can petite diced tomatoes",
        "1/2 (14.5 ounce) can chopped tomatoes",
        "2 teaspoons ground black pepper",
        "2 teaspoons dried oregano, or to taste",
        "2 teaspoons dried basil, or to taste",
        "1 teaspoon salt",
        "1 teaspoon poultry seasoning, or to taste",
        "Filling:",
        "1 (15 ounce) container low-fat ricotta cheese",
        "1 (8 ounce) package fresh spinach",
        "1 egg",
        "2 tablespoons grated Parmesan cheese",
        "1 teaspoon minced garlic",
        "1/8 teaspoon ground nutmeg",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Breaded Eggplant Rollatini",
    "url": "http://allrecipes.com/recipe/254955/breaded-eggplant-rollatini/"
}
