{
    "directions": [
        "Heat a large skillet over medium-high heat. Cook and stir sausage, onion, garlic pepper, and 1 tablespoon Italian seasoning in the hot skillet until browned and crumbly, about 10 minutes.",
        "Bring a large pot of lightly salted water to a boil. Cook gemelli pasta in the boiling water, stirring occasionally until tender yet firm to the bite, 12 minutes. Drain.",
        "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil.",
        "Melt butter in a small saucepan over medium heat; stir in garlic powder until butter is melted and garlic is fragrant, 2 to 3 minutes.",
        "Cut the top portion out of the Vienna bread, forming a boat-shape. Brush garlic butter over the opening in the bread and place on the prepared baking sheet.",
        "Bake in the preheated oven until bread is toasted, about 10 minutes.",
        "Combine sausage mixture, marinara sauce, tomatoes, pasta, and half of the mozzarella cheese in a large bowl. Add more marinara sauce if mixture is dry, but not so much that the mixture is too wet. Fill bread \"boat\" with sausage mixture and top with the remaining mozzarella cheese and 1 teaspoon Italian seasoning.",
        "Bake in the preheated oven until cheese is melted and pasta is hot, about 10 minutes."
    ],
    "ingredients": [
        "1 pound ground sausgae",
        "1 red onion, chopped",
        "1 tablespoon garlic pepper",
        "1 tablespoon Italian seasoning",
        "1/4 (16 ounce) package gemelli pasta",
        "1/4 cup butter",
        "1 pinch garlic powder, or to taste",
        "1 (1 pound) loaf Vienna bread",
        "1 cup marinara sauce, or more as needed",
        "7 ounces diced tomatoes",
        "1 cup shredded mozzarella cheese",
        "1/2 teaspoon Italian seasoning, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bread Boat Pasta Bake",
    "url": "http://allrecipes.com/recipe/256987/bread-boat-pasta-bake/"
}
