{
    "directions": [
        "Position a rack in the center of the oven and preheat the oven to 350°F. Line a baking sheet with parchment paper or a silicone baking mat.",
        "If using a flax \"eggs,\" in a clean coffee or spice grinder, process the flaxseeds to a fine powder. In a small bowl, whisk together the flax powder and water. Set aside to thicken for 10 minutes, whisking occasionally; it should be thick and viscous and the consistency of a beaten egg.",
        "In the bowl of a food processor fitted with the steel blade, process 3/4 cup of the oats to a flour (a few tweedy bits here and there, without any whole oats in the mix, are fine). Transfer the oat flour to a large bowl. To the bowl, add the remaining oats, coconut, cinnamon, baking powder, salt, and baking soda. Whisk to blend.",
        "In the food processor, combine the date paste, oil, maple syrup, and vanilla extract. Add the flax \"egg\" (or whole egg, if using) to the processor and blend until slightly aerated, 1 full minute.",
        "Scrape the wet ingredients into the bowl with the dry ingredients and stir until the dough is evenly moistened. Fold in the dried fruit. Let the dough rest for 10 minutes.",
        "Using a standard ice cream scoop, drop 9 quarter cupfuls of the dough onto the prepared baking sheet, spacing them evenly. Use your fingertips to flatten each cookie to a 1/2-inch thickness-the cookies will not spread much during baking. Bake until golden, about 30 minutes. You'll know they're done when their fragrance fills the kitchen, and the cookies are set enough that you can lift one off the sheet to make sure the bottom is a deep golden color, though the centers will still be soft.",
        "Cool the cookies on the baking sheet for 5 minutes before transferring to a wire rack to cool completely. Store in an airtight container for up to 3 days."
    ],
    "ingredients": [
        "1 tablespoon (3/8 ounce/11 grams) golden flaxseeds, or 1 whole large egg",
        "3 tablespoons (1 1/2 ounces/43 grams) hot water",
        "1 1/2 cups (4 1/2 ounces/125 grams) old-fashioned rolled oats",
        "3/4 cup (3/4 ounces/105 grams) cooked quinoa",
        "1/4 cup (3/4 ounce/20 grams) unsweetened shredded coconut or finely chopped nuts",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon fine sea salt",
        "1/4 teaspoon baking soda",
        "1/3 cup (3 ounces/85 grams) Date Paste",
        "1/3 cup (2 5/8 ounces/75 grams) coconut or canola oil",
        "1/4 cup (3 ounces/85 grams) pure maple syrup",
        "1/2 teaspoon pure vanilla extract",
        "1/2 cup (2 7/8 ounces/80 grams) chopped dried fruit"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Dessert",
        "Bake",
        "Low Fat",
        "Kid-Friendly",
        "Wheat/Gluten-Free",
        "Dried Fruit",
        "Date",
        "Coconut",
        "Oat",
        "Quinoa",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Cinnamon",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Breakfast Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/breakfast-cookies-56389472"
}
