{
    "directions": [
        "Using the flat side of a knife, smash garlic. Finely chop, then sprinkle with salt. Press flat side of knife into garlic and drag it across, repeating until a paste forms. Place pork in a medium bowl and add garlic paste. Finely chop 1 medium-sized chipotle chile with seeds and add to pork (you should have about 1 Tbsp. chopped chile). Add vinegar and 2 Tbsp. adobo from can and stir to combine.",
        "Heat 8 cups cold water in a large pot over medium-high. Add potatoes and vinegar and season liberally with salt. Bring to a boil, then reduce heat to medium-low and bring to a simmer. Cook until potatoes are just tender, about 5 minutes, and drain well.",
        "Meanwhile, heat a large cast-iron or non-stick skillet over medium-high. Add 1 Tbsp. oil and reserved chorizo. Cook, breaking chorizo into small pieces with a wooden spoon, until browned and cooked through, 4–6 minutes. Using a slotted spoon, transfer to a large bowl, and reserve fat in skillet. (You will need 3 tablespoons fat to cook the potatoes, so add a few more tablespoons of oil if necessary.)",
        "Heat the skillet over medium. Add potatoes, 1/2 tsp. salt, and 1/4 tsp. pepper. Toss potatoes in oil and cook, stirring often, until golden brown, crispy, and cooked through, about 18 minutes. Be patient—cooking your potatoes slowly will guarantee a soft, fluffy interior and a perfectly crisp exterior. Add scallions and 1 Tbsp. butter and cook, stirring occasionally, until scallions are soft, 2 minutes more. Add potato mixture to chorizo; reserve skillet.",
        "While potatoes cook, combine eggs, milk, 1/4 tsp. salt, and remaining 1/4 tsp. pepper in a medium bowl. Heat tortillas in a dry medium skillet over medium until hot and lightly toasted (or wrap them in damp paper towels and heat in a microwave for about 20 seconds). Wrap in damp paper towels and keep warm between 2 plates.",
        "Heat reserved skillet over medium and add remaining 1 Tbsp. butter. Add egg mixture and cook, stirring occasionally, until barely set, about 2 minutes. Return sausage and potatoes to skillet and cook, stirring occasionally, until reheated, about 2 minutes.",
        "Place 2 tortillas each on 4 plates and divide egg mixture among tortillas. Top with cheese, hot sauce, avocado, and cilantro.",
        "Chorizo can be made up to 3 days in advance and stored in the refrigerator."
    ],
    "ingredients": [
        "3 garlic cloves, peeled",
        "1/2 teaspoon kosher salt",
        "8 ounces ground pork",
        "1 small can chipotle chiles in adobo",
        "1 tablespoon distilled white vinegar",
        "1 large russet potato, peeled and cut into 1/2-inch cubes",
        "2 tablespoons distilled white vinegar",
        "Kosher salt",
        "1 tablespoon neutral vegetable oil (such as grapeseed), plus more if needed",
        "1/2 teaspoon freshly ground black pepper, divided",
        "2 tablespoons unsalted butter, divided",
        "2 scallions, thinly sliced",
        "6 large eggs",
        "2 tablespoons milk, half-and-half, or cream",
        "8 small flour tortillas",
        "1/2 cup grated cheddar or Monterey Jack cheese (or a mix)",
        "Creamy Jalapeño Sauce or your favorite hot sauce (for serving)",
        "Sliced avocado (for serving)",
        "Cilantro leaves (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Breakfast",
        "Kid-Friendly",
        "Cinco de Mayo",
        "Jalapeño",
        "Tortillas",
        "Taco",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Breakfast Tacos With Homemade Chorizo, Crispy Potatoes, and Egg",
    "url": "http://www.epicurious.com/recipes/food/views/breakfast-tacos-with-homemade-chorizo-crispy-potatoes-and-egg-56389517"
}
