{
    "directions": [
        "Cut 12 (12x16\") pieces of heavy-duty foil. Layer 2 pieces of foil on top of each other to create 6 stacks. Line top pieces of foil with parchment paper cut to the same size.",
        "Toss scallions, potatoes, sausage, oil, salt, and pepper in a large bowl. Divide mixture among prepared packs, arranging in the center of each piece of parchment. Bring edges of foil together to enclose each pack, covering completely, then crimp to seal packs closed.",
        "Prepare a campfire or grill for medium, indirect heat, preferably with hardwood or hardwood charcoal. Let coals burn until covered with ash and glowing red with no black remaining.",
        "Place packs side by side directly onto hot coals or grill and cook, rotating with tongs occasionally, about 5 minutes. Carefully remove 1 pack from heat and check if ingredients are steaming hot. If necessary, return pack to coals and continue to cook, 5–10 minutes more.",
        "Transfer packs with tongs to a flat surface and carefully open them (they will be full of hot steam). Top each pack with spinach, then crack 1 egg into the center of each and season with salt and pepper. Reseal, return to coals, and cook until egg whites are opaque but yolks are still runny, 4–5 minutes.",
        "Carefully remove packs from coals, open, and sprinkle with cheddar, if using. Serve immediately.",
        "Packs can be assembled and chilled for up to 2 days or frozen for up to 1 month."
    ],
    "ingredients": [
        "3 scallions, trimmed, sliced",
        "1 (16-ounce) package frozen shredded hash brown potatoes, defrosted",
        "12 ounces cooked breakfast sausages (about 16 sausage links), cut into 3/4\" pieces",
        "1/4 cup olive oil",
        "1 teaspoon kosher salt, plus more to taste",
        "1/2 teaspoon freshly ground black pepper, plus more to taste",
        "3 (packed) cups baby spinach",
        "6 large eggs",
        "1/2 cup shredded cheddar (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Potato",
        "Breakfast",
        "Kid-Friendly",
        "Cheddar",
        "Sausage",
        "Spinach",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Breakfast Hobo Packs with Hash Brown Potatoes, Sausage, and Scallions",
    "url": "http://www.epicurious.com/recipes/food/views/breakfast-hobo-packs-with-hash-brown-potatoes-sausage-and-scallions-56389750"
}
