{
    "directions": [
        "Cut 12 (12x16\") pieces of heavy-duty foil. Layer 2 pieces of foil on top of each other to create 6 stacks. Line top pieces of foil with parchment paper cut to the same size.",
        "Toss peppers, zucchini, onion, jalapeños (if using), beans, corn, salsa, oil, salt, and pepper in a large bowl. Divide mixture among prepared packs, arranging in the center of each piece of parchment. Bring edges of foil together to enclose each pack, covering completely, then crimp to seal packs closed.",
        "Prepare a campfire or grill for medium, indirect heat, preferably with hardwood or hardwood charcoal. Let coals burn until covered with ash and glowing red with no black remaining.",
        "Place packs side by side directly onto hot coals or grill and cook, rotating with tongs occasionally, about 5 minutes. Carefully remove 1 pack from heat and check if ingredients are steaming hot. If necessary, return pack to coals and continue to cook, 5–10 minutes more.",
        "Meanwhile, wrap tortillas in foil and heat close to the coals until warm, 5–10 minutes.",
        "Transfer packs with tongs to a flat surface and carefully open them (they will be full of hot steam). Crack 1 egg into the center of each pack and season with salt and pepper. Reseal, return to coals, and cook until egg whites are opaque but yolks are still runny, 4–5 minutes.",
        "Carefully remove packs from coals, open, and sprinkle evenly with cheese and cilantro, if using. Serve each pack immediately with 2 warm tortillas.",
        "Packs can be assembled and chilled for up to 2 days or frozen for up to 1 month."
    ],
    "ingredients": [
        "2 bell peppers, stemmed, seeded, thinly sliced lengthwise",
        "1 medium zucchini, halved lengthwise, sliced into 1/4\"-thick half moons",
        "1 small red onion, thinly sliced (about 1 cup)",
        "2 medium jalapeños, seeded, thinly sliced (optional)",
        "1 (14-ounce) can black beans, drained, rinsed",
        "1 cup defrosted frozen corn",
        "6 tablespoons tomatillo salsa",
        "2 tablespoons olive oil",
        "1 teaspoon kosher salt, plus more to taste",
        "1/2 teaspoon freshly ground black pepper, plus more to taste",
        "12 soft taco-size corn or flour tortillas",
        "6 large eggs",
        "1/2 cup shredded Monterey Jack cheese (optional)",
        "1/4 cup cilantro leaves and tender stems (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Egg",
        "Breakfast",
        "Kid-Friendly",
        "Healthy",
        "Tortillas",
        "Monterey Jack"
    ],
    "title": "Breakfast Taco Hobo Packs With Black Beans, Zucchini, and Corn",
    "url": "http://www.epicurious.com/recipes/food/views/breakfast-taco-hobo-packs-with-black-beans-zucchini-and-corn-56389752"
}
