{
    "directions": [
        "To make marinade, mix the onion soup, 4 minced cloves of garlic, soy sauce, maple syrup, Worcestershire sauce, bacon drippings, mustard powder, and hot sauce together in a bowl; stir in the amber beer. Cut small slits into the prime rib roast and push slivers of garlic into the slits until slivers are not visible. Place the roast into a large resealable plastic bag, pour in the marinade, and refrigerate for 1 hour. Remove from refrigerator and allow roast to marinate in the bag at room temperature for an additional hour.",
        "Preheat oven to 400 degrees F (200 degrees C). Place a rack into a roasting pan.",
        "Remove roast from the marinade and place onto the rack in the roasting pan. Pour the marinade all over the roast, and allow to drip into the pan. Rub the olive oil thoroughly over the roast, season with salt and black pepper, and place a large sheet of aluminum foil over the meat. Seal the aluminum foil to the edges of the roasting pan.",
        "Bake the roast for 1 hour. Remove the aluminum foil, and baste the meat with the pan juices. Return the uncovered pan to the oven and continue roasting until the meat is browned and an instant-read meat thermometer inserted into the thickest part, not touching bone, reads 130 to 135 degrees F (54 to 57 degrees C) for medium-rare, about 1 more hour.",
        "Remove the roast from the oven, cover with a tent of aluminum foil, and allow to rest for 20 to 30 minutes before carving. As the meat rests, temperature will rise about 10 degrees to 140 to 145 degrees F (60 to 65 degrees C)."
    ],
    "ingredients": [
        "1 envelope dry onion soup mix",
        "4 cloves garlic, minced",
        "3 tablespoons soy sauce",
        "2 tablespoons maple syrup",
        "1 1/2 teaspoons Worcestershire sauce",
        "1 1/2 teaspoons bacon drippings",
        "1 tablespoon mustard powder",
        "1/4 teaspoon hot sauce",
        "1 cup amber or dark beer",
        "1 (5 pound) prime rib roast",
        "2 cloves garlic, cut into slivers",
        "1/4 cup olive oil",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Brian's Garlicky Prime Rib",
    "url": "http://allrecipes.com/recipe/219585/brians-garlicky-prime-rib/"
}
