{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C). Grease and flour three round tube pans, one 10 inch, one 8 inch, and one 5 inch.",
        "Sift the flour, baking soda, ground mace, and 2 1/4 cups of the sugar into a large bowl.",
        "Using your hands, rub in the butter into the flour mixture.",
        "Separate the eggs. Add the lemon juice and the vanilla to the egg yolks and beat well. Add the egg yolk mixture a little at a time to the flour mixture using your hands to combine the ingredients.",
        "In a large bowl whip the egg whites with the salt and the cream of tartar until stiff. Gradually beat in the remaining 2 1/4 cups of the sugar till the whites are very stiff and glossy. Fold in the beaten egg whites into the batter in four portions, folding in very gently with your hands until no white lumps are visible. Spoon batter into the prepared pans.",
        "Bake at 300 degrees F (150 degrees C) for 2 1/2 hours for the 10 inch pan, 2 1/4 hours for the 8 inch pan, and 1 1/2 hours for the 5 inch pan. Cakes are done when they shrink from the sides of the pans. Remove the 5 inch cake from the oven and let stand in pan for one hour before turning out. When the 8 inch cake is done turn off the oven and let it stand for 1/2 hour more in oven, remove it then 15 minutes later remove the 10 inch cake. Let the 8 and 10 inch cakes stand on cooling rack for 1/2 hour before turning out. Allow cakes to cool overnight before frosting.  If the cake tiers are to be separated by pillars, the holes left by the tube pans may be covered by rounds of cardboard before they are iced.  Use Decorator Frosting and decorate as desired."
    ],
    "ingredients": [
        "1 1/2 pounds butter",
        "5 1/4 cups all-purpose flour",
        "3/8 teaspoon baking soda",
        "3/4 teaspoon ground mace",
        "4 1/2 tablespoons lemon juice",
        "4 1/2 cups white sugar",
        "1 1/2 tablespoons vanilla extract",
        "15 eggs",
        "3/8 teaspoon salt",
        "1 1/2 teaspoons cream of tartar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Bride's Cake",
    "url": "http://allrecipes.com/recipe/7771/brides-cake/"
}
