{
    "directions": [
        "Discard rind from Brie and cut into 1/4-inch dice. Freeze Brie cubes, covered, until hard, at least 1 hour, and up to 3 days.",
        "In a bowl lightly beat egg. With a 3 1/2-inch round cutter cut out 4 rounds from 1 pastry sheet and fit rounds into four 1/2-cup muffin cups. Fill cups with frozen Brie cubes. With a 2 1/2-inch round cutter cut out 4 rounds from remaining pastry sheet. Brush 1 side of each round with egg and put 1 round, egg side down, onto each filled cup. With a sharp small knife make steam vents in pastry tops. Chill pastries 30 minutes.",
        "In a small bowl whisk together vinegar, mustard, and chutney and add oil in a stream, whisking until emulsified. Season dressing with salt and pepper. Dressing may be made 1 day ahead and chilled, covered.",
        "Quarter tomatoes and cut out seed sections. Cut quarters into thin strips.",
        "Preheat oven to 425° F.",
        "Bake pastries in middle of oven until deep golden, about 25 minutes. Cool Brie en croûte in cups on a rack 5 minutes and lift from cups, keeping upright. Whisk dressing to combine and in a bowl toss together mesclun, tomatoes, enough dressing to coat, and salt and pepper to taste. Serve Brie en croûte warm with salad."
    ],
    "ingredients": [
        "6 ounces Brie, chilled",
        "1 large egg",
        "a thawed 17 1/4-ounce package frozen puff pastry sheets (2 sheets)",
        "3 tablespoons white-wine vinegar",
        "1 teaspoon Dijon mustard",
        "1 teaspoon chutney (preferably tomato)",
        "extra-virgin olive oil",
        "2 vine-ripened tomatoes",
        "4 cups mesclun (mixed baby greens; about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Appetizer",
        "Bake",
        "Brie",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Brie en Croûte",
    "url": "http://www.epicurious.com/recipes/food/views/brie-en-croute-14926"
}
