{
    "directions": [
        "Preheat oven to 350°F.",
        "On a work surface arrange 1 phyllo sheet with a long side facing you and brush lightly with some butter. Top with a second phyllo sheet and brush lightly with butter. Top with a third phyllo sheet and cut stacked phyllo lengthwise into 4 strips and crosswise into 6 strips to make twenty-four 3-inch squares. With scissors cut off corners of squares to form octagons and cover with plastic wrap.",
        "Line each mini-muffin cup with 1 phyllo octagon, letting edges curl naturally, and bake in middle of oven until golden brown, about 10 minutes. Carefully transfer shells in cups to racks to cool completely. Make 24 more octagons with remaining 3 phyllo sheets and butter in same manner, Shells may be made 1 week ahead and kept in cups, wrapped in plastic wrap, at room temperature, or 1 month ahead and frozen.",
        "In a small saucepan simmer cream with saffron until reduced to about 3/4 cup and cool slightly. Whisk in yolks and season with salt and pepper. Divide Brie among shells and spoon 2 teaspoons saffron cream into each shell. Bake tartlets in 2 batches in middle of oven about 8 minutes, or until filling is puffed. Cool tartlets in cups on racks 5 minutes and carefully lift out onto racks to cool completely. Serve tartlets warm or at room temperature."
    ],
    "ingredients": [
        "six 17- by-12 inch phyllo sheets, thawed if frozen, stacked between 2 sheets wax paper and covered with a towel",
        "3 tablespoons unsalted butter, melted",
        "1 cup heavy cream",
        "1/2 teaspoon saffron threads",
        "3 large egg yolks",
        "10 ounces Brie, rind discarded and cheese cut into 1/3-inch cubes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Brie",
        "Saffron",
        "Phyllo/Puff Pastry Dough",
        "Simmer",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Brie and Saffron Phyllo Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/brie-and-saffron-phyllo-tartlets-14256"
}
