{
    "directions": [
        "Lightly grease an 8x8-inch baking pan (or another heatproof vessel with approximately the same dimensions) with butter or nonstick cooking spray.",
        "In a medium heavy-bottomed saucepan, combine the sweetened condensed milk, cocoa powder, butter, and salt. Place the pan over medium heat and whisk often to encourage the butter to melt and the cocoa powder to dissolve. Once the candy comes to a bubble, reduce the heat to low and cook, whisking often. The candy is finished when it's the consistency of a thick brownie batter and slides in a soft mass from one side of the pan to the other when the pan is tilted—this can take anywhere from 15 to 25 minutes, depending on your stove, but it’s better to keep the heat low and give the candy more time to cook down than to rush it and risk burning it. Stir in the vanilla extract. Pour the candy into the prepared baking pan. Chill in the refrigerator until the candy is somewhat firm with a claylike texture, about 1 hour.",
        "When you’re ready to form the candies, pour your desired coatings onto individual plates. Use your fingers or a small ice cream scoop with a capacity of about 1 teaspoon to portion out bits of candy and roll them into 1-inch balls. Drop each ball into a dish of coating and roll to coat. Set the finished candies on a small baking sheet, or place them into small paper candy cups. Store in the refrigerator in an airtight container."
    ],
    "ingredients": [
        "1 1/4 cups (14 ounces/397 grams) sweetened condensed milk",
        "1/3 cup (1 1/8 ounces/32 grams) unsweetened natural cocoa powder",
        "2 tablespoons (1 ounce/28 grams) unsalted butter, cut into small pieces",
        "1/8 teaspoon fine sea salt",
        "1/4 teaspoon pure vanilla extract",
        "Chocolate sprinkles, grated chocolate, cocoa powder, or other creative coatings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Candy",
        "Chocolate",
        "snack",
        "Kid-Friendly",
        "Wheat/Gluten-Free",
        "Dessert",
        "Valentine's Day"
    ],
    "title": "Brigadeiros",
    "url": "http://www.epicurious.com/recipes/food/views/brigadeiros"
}
