{
    "directions": [
        "In heavy large stockpot over high heat, bring 2 gallons water to boil. Stir in salt and sugar until completely dissolved. Remove from heat and add carrots, onions, celery, leeks, bay leaves, peppercorns, coriander seeds, red pepper flakes, fennel seeds, star anise, thyme, sage, and parsley. Cover and refrigerate at least 6 hours or overnight.",
        "Line large cooler with large heavy-duty garbage bag. Strain brine into cooler, discarding solids.",
        "Rinse turkey inside and out and pat dry. Transfer, breast side up, to cooler. If necessary, place large plate on top to keep turkey submerged in liquid. Tie bag tightly, then close cooler and transfer to cool place. Allow turkey to brine for 12 hours, turning over once halfway through. Using probe thermometer, check temperature of liquid every 3 hours and if necessary, add freezer packs enclosed in resealable plastic bags to keep temperature at or below 40°F.",
        "Line large, rimmed baking sheet with paper towels and top with wire rack. Remove turkey from brine and transfer, breast side up, to rack. Let stand 30 minutes to drain completely, then pat dry. Transfer to roasting pan. Tuck wing tips under breast and tie drumsticks loosely together with kitchen string. Place butter in pan next to turkey.",
        "If using gas grill, open hood, light all burners, and set on high. Close hood and preheat 10 minutes.",
        "If using charcoal grill, open bottom and lid vents and light charcoal. Let coals burn until completely coated in gray ash, about 25 minutes, then arrange around perimeter of grill to form circle.",
        "Transfer roasting pan to grill rack and cover grill. If using gas grill, turn all burners to low. During cooking, adjust burners to maintain temperature at 450°F.",
        "If using charcoal grill, if necessary lower temperature by partially closing vents (do not close completely). Maintain temperature by adding 60 new coals, prelit in chimney starter until completely covered in gray ash, every hour.",
        "Cook turkey, basting every 15 minutes with pan juices (tilt pan to let juices run out of cavity) and rotating pan 180° every hour, until instant-read thermometer inserted into thickest part of thigh (do not touch bone) registers 170°F, about 1 1/2 hours. (Time may be longer in cold weather. Avoid opening lid often because of rapid heat loss.)",
        "Transfer turkey to platter, cover loosely with foil, and let stand 20 minutes before carving."
    ],
    "ingredients": [
        "2 cups Diamond Crystal kosher salt",
        "1 1/2 cups sugar",
        "6 medium carrots, coarsely chopped",
        "2 large onions, coarsely chopped",
        "25 stalks celery (from 2 bunches), coarsely chopped",
        "4 leeks, white and green parts only, coarsely chopped",
        "4 fresh or dried bay leaves",
        "2 tablespoons whole black peppercorns",
        "2 tablespoons whole coriander seeds",
        "1/2 teaspoon dried red pepper flakes",
        "1/2 teaspoon fennel seeds",
        "4 whole star anise",
        "2 bunches fresh thyme",
        "2 bunches fresh sage",
        "1 bunch fresh parsley",
        "1 (14- to 16-pound) turkey, any feathers or quills removed with tweezers or needlenose pliers and neck and giblets removed and discarded for another use",
        "8 tablespoons (1 stick) unsalted butter",
        "Special equipment: large (at least 8-gallon) cooler, large heavy-duty garbage bag, large disposable roasting pan, kitchen string, gas or charcoal grill fitted with thermometer, bulb baster (optional), instant-read thermometer."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Thanksgiving",
        "Dinner",
        "Fall",
        "Winter",
        "Grill",
        "Brine",
        "Grill/Barbecue",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Brined and Barbecued Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/brined-and-barbecued-turkey-240484"
}
