{
    "directions": [
        "Bring water to a boil with kosher salt, mustard seeds, sugar, pickling spices, and garlic and simmer 15 minutes. Cool brine completely, then add chops and chill, covered, 1 to 2 days.",
        "Preheat oven to 425°F.",
        "Remove chops from brine and pat dry. Heat 2 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown chops in batches, without crowding, turning once, 3 to 4 minutes on each side. (Add oil 1 to 2 tablespoons at a time as needed between batches.)",
        "Transfer chops to a roasting pan and roast in middle of oven until an instant-read thermometer inserted horizontally 2 inches into center of meat (do not touch bone) registers 155°F, 15 to 20 minutes. Transfer chops to a platter and let stand, loosely covered, 5 minutes before serving (do not clean pan).",
        "Straddle pan across 2 burners and add any meat juices from platter along with wine and broth and deglaze by boiling over moderately high heat, stirring and scraping up brown bits, until reduced to about 1/2 cup, about 4 minutes. Season pan juices with salt and pepper and serve with chops."
    ],
    "ingredients": [
        "2 qt water",
        "1/4 cup kosher salt",
        "1/4 cup mustard seeds",
        "1/4 cup sugar",
        "2 tablespoons pickling spices",
        "6 garlic cloves, smashed with side of a large knife",
        "6 (1 1/2-inch-thick) rib pork chops",
        "4 to 6 tablespoons olive oil",
        "1/2 cup dry Riesling",
        "1/2 cup chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Marinate",
        "Roast",
        "Dinner",
        "Meat",
        "Pork Chop",
        "Brine",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Brined Pork Chops",
    "url": "http://www.epicurious.com/recipes/food/views/brined-pork-chops-106156"
}
