{
    "directions": [
        "Working with 1 artichoke at a time, peel and cut into 1/2-inch cubes. Immediately place in bowl of water to prevent browning. Place cream in large saucepan. Drain artichokes; add to pan. Bring to boil, reduce heat to mediumlow, and simmer covered until artichokes are tender and almost all liquid is absorbed, adding water by tablespoonfuls if dry and artichokes are not yet tender, about 25 minutes. Puree in processor. Season with coarse salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover; chill. Serve warm.",
        "Combine first 7 ingredients in processor and blend well. Add breadcrumbs; process until ball forms. Add lemon juice; process to blend. Transfer to parchment paper. Spread out to 6- to 7-inch square. Top with second sheet of parchment. Roll out to 10-inch square. Freeze crust in paper until set, at least 15 minutes and up to 8 hours. Remove paper.",
        "Preheat oven to 400°F. Cut crust into 6 pieces about the same size as fish fillets. Arrange fish in single layer on rimmed baking sheet. Sprinkle with salt and pepper. Place 1 piece of crust atop each fillet. Roast until fish is cooked through and crust is browned around edges, about 7 minutes.",
        "Divide fish among plates. Serve with Jerusalem Artichoke Pickles and warm Jerusalem Artichoke Puree.",
        "Tubers of a variety of sunflower; available in the produce section of some supermarkets and at farmers' markets."
    ],
    "ingredients": [
        "2 1/2 pounds Jerusalem artichokes (also called sunchokes)*",
        "2 cups heavy whipping cream",
        "Coarse kosher salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "3 tablespoons minced fresh Italian parsley",
        "2 tablespoons minced fresh chives",
        "1 1/2 tablespoons minced fresh tarragon",
        "1 teaspoon finely minced lemon peel",
        "1/2 teaspoon coarse kosher salt",
        "1/4 teaspoon ground black pepper",
        "21/2 cups fine breadcrumbs from fresh crustless brioche or other egg bread",
        "1 tablespoon fresh lemon juice",
        "6 6- to 8-ounce turbot or tilapia fillets",
        "Jerusalem Artichoke Pickles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Roast",
        "High Fiber",
        "Dinner",
        "Tilapia",
        "Jerusalem Artichoke",
        "Winter",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Brioche Crusted fish with Jerusalem Artichoke Puree and Jerusalem Artichoke Pickles",
    "url": "http://www.epicurious.com/recipes/food/views/brioche-crusted-fish-with-jerusalem-artichoke-puree-and-jerusalem-artichoke-pickles-351044"
}
