{
    "directions": [
        "Stir together milk, yeast, and 1 tablespoon flour in a small bowl and let stand until foamy, about 5 minutes. (If mixture doesn't foam, discard and start over with new yeast.)",
        "Put remaining flour in a large bowl and stir in salt and sugar. Make a well in flour and add 6 beaten eggs and yeast mixture. Stir with your hands until a sticky dough forms, then turn out onto an unfloured work surface. Knead dough vigorously at least 10 minutes (your hands will be covered in sticky dough), by slapping it against work surface, then stretching it toward you and folding it in half over itself to incorporate air. Turn your hands 90 degrees to scoop dough up again (using pastry scraper to scrape dough together as necessary) and continue kneading dough in this manner until dough starts to come off surface by itself (it will still be sticky). Stretch dough out on work surface and smear softened butter onto it. Pull dough over butter so it is enclosed and continue to work dough, slapping and folding over, until once again dough lifts off surface by itself and is smooth and silky, about 20 minutes.",
        "Form dough into a ball, pulling surface \"skin\" taut by stretching dough and tucking it underneath ball, then put dough in a lightly buttered 3- to 4-quart bowl and dust top with a little flour. Cover with a kitchen towel (not terry cloth) or plastic wrap and chill, 10 to 16 hours (so dough rises slowly).",
        "Bring dough, still covered, to cool room temperature (until dough is softened), about 3 hours. Turn out dough onto a work surface (a thin crust will have formed on top, but underneath the dough will be moist) and gently roll into a fat log (it will deflate), folding in any dry crust from surface of dough. Cut off about one fifth of dough and reserve. Form remaining dough into a ball, again stretching surface of dough taut by pulling it underneath ball. Put ball in buttered brioche mold, then make a hole in center of dough by gently pulling it apart with dampened fingers. Form reserved dough into a smaller ball and put it in the hole, pressing to attach so smaller ball stays firmly placed in larger piece of dough.",
        "Loosely cover with a kitchen towel (not terry cloth) and let dough stand in a warm draft-free place until it has risen slightly and surface feels airy and tender, about 2 hours.",
        "Put oven rack in lower third of oven and preheat oven to 350°F.",
        "Lightly brush brioche with some of egg wash and bake until crust is deep golden and a wooden pick or skewer inserted into center of brioche comes out clean, 1 to 1 1/4 hours.",
        "Gently unmold brioche and transfer to a rack to cool, about 1 hour, before filling.",
        "Cut off \"hat\" from brioche and cut out center to make room for gaga filling. Spoon as much filling as possible into brioche and place \"hat\" on top. Serve any remaining filling and reserved mushrooms on the side."
    ],
    "ingredients": [
        "1/4 cup warm milk or water (105-115°F)",
        "1 (1/4-oz) package active dry yeast (2 1/2 teaspoons)",
        "4 cups bread flour or all-purpose flour",
        "1 1/2 teaspoons salt",
        "1/4 cup sugar",
        "6 large eggs, lightly beaten, plus 1 additional beaten egg for egg wash",
        "2 sticks (1 cup) unsalted butter, softened",
        "< \"\">Gaga Filling< >.",
        "Special equipment: a pastry or bench scraper; a 9-inch fluted brioche mold (3 1/2 inches deep)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Mushroom",
        "Side",
        "Bake",
        "Tarragon",
        "Chive",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Brioche Gaga",
    "url": "http://www.epicurious.com/recipes/food/views/brioche-gaga-235431"
}
