{
    "directions": [
        "Season brisket all over with salt and pepper. Transfer to a large 2-gallon resealable plastic bag or bowl (use roasting pan only if necessary).",
        "Purée garlic, walnuts, honey, and 1 cup pomegranate juice in a blender until very smooth. Add remaining 2 cups pomegranate juice and blend until smooth. Pour marinade over brisket. Seal bag or cover bowl tightly with foil. Chill, turning occasionally, at least 24 hours or up to 48 hours.",
        "Transfer brisket and marinade to roasting pan, cover tightly with foil, and let sit at room temperature 1 hour.",
        "Preheat oven to 275°F. Bake brisket, covered, until meat shreds easily with 2 forks, about 5 hours; if meat is still tough, continue cooking, covered, 1 hour.",
        "Transfer brisket to a cutting board and cover loosely with foil. Transfer cooking liquid to a saucepan and spoon off fat from surface. Cook over medium-high heat, skimming off fat and foam as it surfaces, until reduced by two-thirds (you should have about 2 cups sauce). Season with salt and pepper if necessary.",
        "Pulse mint, pistachios, garlic, lemon zest, salt, and pepper in a food processor until coarsely chopped. Drizzle in oil, pulsing until just combined (do not overprocess).",
        "To serve, slice brisket against the grain and transfer to a platter. Spoon sauce over and top with gremolata.",
        "Brisket can be cooked, without slicing, 2 days ahead. Cover and chill; warm before slicing. Sauce can be made 2 days ahead. Cover and chill."
    ],
    "ingredients": [
        "1 (7-pound) beef brisket with fat, fat trimmed to 1/4\" thickness",
        "2 teaspoons (or more) kosher salt",
        "1 teaspoon (or more) freshly ground black pepper",
        "1 head of garlic, peeled",
        "1 cup walnuts",
        "2 tablespoons honey",
        "3 cups pomegranate juice, divided",
        "1 1/2 cups (packed) mint leaves (about 1 bunch)",
        "1/2 cup shelled roasted, salted pistachios",
        "2 garlic cloves",
        "2 teaspoons finely grated lemon zest",
        "1/4 teaspoon kosher salt",
        "1/8 teaspoon freshly ground black pepper",
        "2 tablespoons extra-virgin olive oil",
        "A large roasting pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Passover",
        "Kosher for Passover",
        "Kosher",
        "Brisket",
        "Beef",
        "Roast",
        "Pistachio",
        "Pomegranate Juice",
        "Garlic",
        "Mint",
        "Spring",
        "Wheat/Gluten-Free"
    ],
    "title": "Brisket With Pomegranate-Walnut Sauce and Pistachio Gremolata",
    "url": "http://www.epicurious.com/recipes/food/views/brisket-with-pomegranate-walnut-sauce-and-pistachio-gremolata"
}
