{
    "directions": [
        "Preheat oven to 300°F. Whisk wine, broth, cranberry concentrate and flour to blend in medium bowl; pour into 15 x 10 x 2-inch roasting pan. Mix in onion, garlic and rosemary. Sprinkle brisket on all sides with salt and pepper. Place brisket, fat side up, in roasting pan. Spoon some of wine mixture over. Cover pan tightly with heavy-duty foil.",
        "Bake brisket until very tender, basting with pan juices every hour, about 3 1/2 hours. Transfer brisket to plate; cool 1 hour at room temperature. Thinly slice brisket across grain. Arrange slices in pan with sauce, overlapping slices slightly. (Brisket can be prepared 2 days ahead. Cover and refrigerate.)",
        "Preheat oven to 350°F. Place mushrooms and cranberries in sauce around brisket. Cover pan with foil. Bake until mushrooms are tender and brisket is heated through, about 30 minutes (40 minutes if brisket has been refrigerated).",
        "Transfer sliced brisket and sauce to platter and serve."
    ],
    "ingredients": [
        "1 cup dry red wine",
        "1 cup canned beef or chicken broth",
        "1/2 cup frozen cranberry juice cocktail concentrate, thawed",
        "1/4 cup all purpose flour",
        "1 large onion, sliced",
        "4 garlic cloves, chopped",
        "1 1/2 tablespoons chopped fresh rosemary",
        "1 4-pound trimmed flat-cut brisket",
        "12 ounces medium portobello mushrooms, dark gills scraped away, caps thinly sliced",
        "1 cup dried cranberries (about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Fruit",
        "Mushroom",
        "Braise",
        "Hanukkah",
        "Passover",
        "Rosh Hashanah/Yom Kippur",
        "Cranberry",
        "Brisket",
        "Red Wine"
    ],
    "title": "Brisket with Portobello Mushrooms and Dried Cranberries",
    "url": "http://www.epicurious.com/recipes/food/views/brisket-with-portobello-mushrooms-and-dried-cranberries-5787"
}
