{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Mix first 5 ingredients in small bowl. Rub herb mixture all over brisket. Heat bacon fat in heavy extra-large wide ovenproof pot over medium-high heat. Add brisket to pot and cook until deep brown, about 5 minutes per side. Transfer brisket to platter or rimmed baking sheet. Add 2 cups broth to pot and bring to boil, scraping up browned bits from bottom of pot. Stir in porter, prunes, bay leaves, and brown sugar; bring to boil. Return brisket to pot, fat side down; scatter onion slices over to cover meat, then add garlic.",
        "Cover pot; place in oven and braise brisket 1 hour. Remove pot from oven; uncover and turn brisket over so that onion slices fall into liquid in pot. Return pot to oven and braise uncovered 30 minutes. Add 1 cup broth. Cover and bake 1 hour 30 minutes longer.",
        "Transfer brisket to platter or rimmed baking sheet; add 1 more cup broth to liquid in pot, then add mushrooms and carrots. Return brisket to pot. Cover and return to oven; braise until meat and carrots are very tender, adding more broth by cupfuls, if needed, to cover vegetables, about 45 minutes longer. Cool slightly. Refrigerate uncovered until cold, then cover and keep chilled at least 1 day and up to 2 days.",
        "Preheat oven to 350°F. Spoon off any fat from surface of brisket pan juices and discard. Transfer brisket to cutting board. Thinly slice brisket across grain. Place brisket slices in large roasting pan. Bring pan juices with vegetables in pot to boil. Whisk in mustard and 1 tablespoon vinegar. Season to taste with salt and pepper, adding more vinegar by teaspoonfuls, if desired. Pour pan juices and vegetables over brisket in roasting pan. Cover roasting pan tightly with heavy-duty foil and cook in oven until brisket slices and vegetables are heated through, about 1 hour 15 minutes. Serve meat with vegetables and sauce."
    ],
    "ingredients": [
        "1 tablespoon coarse kosher salt",
        "2 teaspoons freshly ground black pepper",
        "2 teaspoons dry mustard (such as Colman's)",
        "2 teaspoons chopped fresh sage",
        "2 teaspoons chopped fresh thyme",
        "1 6-pound flat-cut brisket, trimmed but with some fat still attached",
        "2 tablespoons rendered bacon fat or olive oil",
        "4 cups (or more) low-salt chicken broth, divided",
        "1 12-ounce bottle porter or stout",
        "6 whole pitted prunes",
        "4 bay leaves",
        "2 teaspoons (packed) dark brown sugar",
        "6 cups thinly sliced onions (2 1/2 pounds)",
        "8 whole garlic cloves, peeled",
        "1 pound mushrooms, sliced",
        "1 pound medium carrots, peeled, cut crosswise into 1 1/2-inch lengths",
        "2 tablespoons whole grain Dijon mustard",
        "1 tablespoon (or more) malt vinegar",
        "Special equipment: Heavy extra-large wide ovenproof pot"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Garlic",
        "Onion",
        "Bake",
        "Braise",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Prune",
        "Brisket",
        "Oktoberfest",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Brisket Braised in Porter",
    "url": "http://www.epicurious.com/recipes/food/views/brisket-braised-in-porter-355237"
}
