{
    "directions": [
        "Preheat the oven to 375 degrees F. Line a 9-inch pie plate with pie dough and crimp as desired; chill 30 minutes. Line with foil, then fill with pie weights or dried beans. Bake until the crust is set, about 20 minutes. Remove the foil and weights and continue baking until lightly golden, 5 to 10 more minutes. Let cool while you prepare the filling.",
        "Put the broccoli and red onions in a large bowl. Add the pepper jack and toss to combine.",
        "Whisk the eggs, heavy cream, 1/2 teaspoon salt and 1/4 teaspoon pepper in a large bowl. Stir in the chives. Add the and paprika, chile powder or lemon zest, if desired. Spread the vegetable-cheese mixture in the crust, then pour the egg mixture on top. Reduce the oven temperature to 350 degrees F and bake until the filling is set, 40 to 50 minutes. Let cool at least 30 minutes before slicing.",
        "Pulse the flour, salt and sugar in a food processor. Add about one-third of the butter; process until the butter is combined. Pulse in the remaining butter in 5 or 6 pulses to form coarse crumbs. Add the vinegar; pulse quickly a few times while adding 1/3 cup ice water. Squeeze some dough between your fingers. It should just hold its shape; if it's still crumbly, quickly pulse in more ice water by the tablespoonful. (Do not overwork the dough.)",
        "Turn the dough out onto a large piece of plastic wrap. Wrap the dough, then press and flatten into a thin round. Refrigerate 1 hour.",
        "Roll out the dough into an 11-to-12-inch round, about 1/8 inch thick, on a lightly floured surface. Center over a 9-inch pie plate. Fold in the edges and crimp as desired. Refrigerate at least 30 minutes before using.",
        "Photograph by Andrew Purcell"
    ],
    "ingredients": [
        "Store-bought or Homemade Pie Dough, recipe follows",
        "1/4 to 1/2 cup chopped roasted or steamed broccoli",
        "1/4 to 1/2 cup sauteed sliced red onions",
        "3/4 to 1 cup shredded pepper jack cheese",
        "3 large eggs",
        "1 1/4 cups heavy cream, half-and-half or milk",
        "Kosher salt and freshly ground pepper",
        "1 to 2 tablespoons chopped chives",
        "1/2 teaspoon paprika or chile powder, or some grated lemon zest (optional)",
        "1 3/4 cups all-purpose flour, plus more for dusting",
        "1/2 teaspoon salt",
        "2 tablespoons sugar",
        "12 tablespoons (1 1/2 sticks) unsalted butter, diced and chilled",
        "4 teaspoons apple cider vinegar or white vinegar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Quiche",
        "Onion Recipes",
        "Vegetable",
        "Broccoli"
    ],
    "title": "Broccoli and Red Onion Quiche",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/broccoli-and-red-onion-quiche-recipe"
}
