{
    "directions": [
        "Preheat oven to 375°F with rack in middle.",
        "Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 13-inch round. Fit dough into pie plate, letting excess hang over edge. Fold overhang inward and press against side of pie plate to reinforce edge. Prick bottom all over with a fork. Chill until firm, about 30 minutes.",
        "Line pie shell with foil and fill with pie weights. Bake until pastry is set and edge is pale golden, 20 to 25 minutes.",
        "Carefully remove foil and weights, then bake shell until deep golden all over, 15 to 20 minutes more. Put pie plate in a 4-sided sheet pan. Leave oven on.",
        "While shell bakes, cook broccoli in a 3-quart pot of boiling salted water 4 minutes. Drain broccoli and rinse under cold water to stop cooking, then pat dry.",
        "Mince and mash garlic to a paste with a generous pinch of salt.",
        "Whisk together garlic paste, eggs, half-and-half, nutmeg, cayenne, and 1/4 teaspoon salt in a large bowl until smooth.",
        "Pour filling into pie shell and add broccoli, then sprinkle with cheeses.",
        "Bake quiche until custard is just set, 45 to 50 minutes. (Center will tremble slightly; filling will continue to set as it cools.) Cool at least 20 minutes.",
        "Serve quiche warm or at room temperature."
    ],
    "ingredients": [
        "All-butter pastry dough",
        "10 ounces (1-inch-wide) broccoli florets (with 1 to 2 inches of stem attached)",
        "2 large garlic cloves",
        "6 large eggs",
        "1 1/2 cups half-and-half",
        "1/4 teaspoon grated nutmeg",
        "1/4 teaspoon cayenne",
        "5 ounces extra-sharp Cheddar, coarsely grated (2 cups)",
        "1/4 cup grated Parmigiano-Reggiano",
        "Equipment: a 9 1/2-inch deep-dish pie plate or a 9-inch (2-inch-deep) round fluted tart pan with removable bottom; pie weights or dried beans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Garlic",
        "Bake",
        "Vegetarian",
        "Lunch",
        "Cheddar",
        "Broccoli",
        "Chill",
        "Gourmet",
        "Sugar Conscious"
    ],
    "title": "Broccoli Garlic Quiche",
    "url": "http://www.epicurious.com/recipes/food/views/broccoli-garlic-quiche-354952"
}
