{
    "directions": [
        "To make the dough, in a food processor, combine the flours, yeast, sugar and salt. Pulse to mix the ingredients. With the motor running, add the water and olive oil in a steady stream, and then pulse until the dough comes together in a rough mass, about 12 seconds. If the dough does not form into a ball, sprinkle with 1 to 2 tsp. of water and pulse again until a rough mass forms. Let the dough rest for 5 to 10 minutes.",
        "Process the dough again for 25 to 30 seconds, steadying the top of the food processor with one hand. The dough should be tacky to the touch but not sticky. Transfer the dough to a lightly floured work surface and form into a smooth ball. Place the dough in a large oiled bowl, turn to coat with oil, and cover with plastic wrap. Let the dough rise in a warm place until doubled in bulk and spongy, about 1 1/2 hours.",
        "Turn the dough out onto a lightly floured work surface, punch it down, and shape into a smooth cylinder. Divide into 2 equal pieces. Shape each piece into a smooth ball, dusting with flour only if the dough becomes sticky. Cover both balls of dough with a clean kitchen towel and let rest for 10 minutes. Unless you are doubling the recipe for the toppings and making two pizzas, place the second ball in a gallon-size sealable plastic bag and freeze for up to 2 months.",
        "Place a pizza stone in the middle of the oven and preheat to 450°F (230°C). Once the oven has reached 450°F (230°C), let the stone continue to heat for 15 to 30 minutes longer, without opening the door.",
        "Bring a saucepan of water to a boil over high heat. Add the broccoli rabe and cook until the stems are crisp-tender, about 3 minutes. Drain well and let cool. When cool enough to handle, cut into 2-inch (5-cm) pieces. Set aside.",
        "In a fry pan over medium-high heat, warm the olive oil. Add the garlic and red pepper flakes and sauté just until the garlic begins to soften but not brown, about 1 minute. Add the chopped broccoli rabe and stir to coat each piece with the oil. Season to taste with salt and black pepper and stir in the lemon juice. Remove from the heat and set aside.",
        "On a floured pizza peel, stretch or roll out the pizza dough into a 12-inch (30-cm) round. If the dough springs back, let it rest for about 10 minutes before continuing. Leaving a 1-inch (2.5-cm) border, spread the sauce over the dough round and top with the cheese. Distribute the broccoli rabe evenly around the pizza. Brush the outside edge of the dough with olive oil and season the whole pizza lightly with salt and black pepper.",
        "Carefully slide the pizza from the peel onto the hot stone in the oven and bake for 10 to 12 minutes, or until the crust is golden brown. Using the peel, transfer the pizza to a cutting board. Let cool for a few minutes, then slice and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Pizza Night",
        ", by Kate McMillan (Weldon Owen, 2014)"
    ],
    "ingredients": [
        "3 1/3 cups (17 oz./530 g) all-purpose flour, plus more for dusting",
        "1/4 cup (1 1/2 oz./45 g) whole-wheat flour",
        "1 package (2 1/2 tsp.) quick-rise yeast",
        "1 Tbs. sugar",
        "1 Tbs. kosher salt",
        "1 1/4 cups (10 fl. oz./310 ml) warm water (110°F/43°C), plus more as needed",
        "2 Tbs. olive oil, plus more as needed",
        "1 small bunch broccoli rabe, thick stems trimmed",
        "2 Tbs. olive oil, plus more for brushing",
        "6 garlic cloves, thinly sliced",
        "1/4 tsp. red pepper flakes, or to taste",
        "Kosher salt and freshly ground black pepper",
        "Juice of 1/2 lemon",
        "1 cup (8 fl. oz./250 ml) tomato sauce",
        "2 cups (8 oz./250 g) shredded smoked mozzarella cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Broccoli Rabe, Garlic and Smoked Mozzarella Pizza",
    "url": "http://www.williams-sonoma.com/recipe/broccoli-rabe--garlic-and-smoked-mozzarella-pizza.html"
}
