{
    "directions": [
        "In a large pot over medium heat, melt the butter. Add the onion and stir it around to cook, 3 to 4 minutes.",
        "Sprinkle the flour on top of the onion and use a whisk to work in the flour. Once it’s combined, cook the onion-flour mixture for 2 to 3 minutes.",
        "Add the milk and half-and-half, whisking constantly until combined.",
        "Sprinkle in the salt, pepper, and nutmeg.",
        "Add the broccoli florets and stir them into the soup. Cover the pot and reduce the heat to low, then simmer the soup until it’s thickened and the broccoli is tender, 20 to 25 minutes.",
        "Stir in the chicken broth and check the consistency. The soup should be thick, but if it still seems too thick, splash in a little more broth.",
        "Throw in the cheese! Stir it in until it’s melted, taste and adjust the seasonings . . . and get ready to serve it up.",
        "At an angle, cut off the top third of the bread. Remove the “lid.” Tear out chunks of bread, leaving a 1/2-inch rim around the crust. (Save the bread in a plastic storage bag for another use.)",
        "Ladle in the thick, yummy soup and top it with more shredded cheese."
    ],
    "ingredients": [
        "1/2 cup butter",
        "1 large onion, diced",
        "1/3 cup all-purpose flour",
        "4 cups whole milk",
        "2 cups half-and-half",
        "Salt and pepper",
        "1/2 teaspoon ground nutmeg",
        "4 broccoli heads, cut into florets",
        "1/2 cup chicken broth",
        "3 cups shredded sharp cheddar cheese, more for garnish",
        "Small bread loaves for bowls (you can buy them in nice bakeries)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Dinner",
        "Soup/Stew",
        "Quick & Easy",
        "Broccoli",
        "Cheddar",
        "Cheese",
        "Kid-Friendly"
    ],
    "title": "Broccoli-Cheese Soup",
    "url": "http://www.epicurious.com/recipes/food/views/broccoli-cheese-soup"
}
