{
    "directions": [
        "Line a baking sheet with parchment paper. On a lightly floured surface unfold pastry sheet and gently roll out to a 14- by 12-inch rectangle. Transfer pastry to baking sheet and prick all over with a fork. Chill pastry, covered, at least 30 minutes and up to 1 day.",
        "Preheat oven to 400°F.",
        "Have ready a bowl of ice and cold water. Trim 1 inch from bottoms of broccoli rabe stems. In a saucepan of boiling salted water blanch broccoli rabe 30 seconds and transfer with tongs to ice water to stop cooking. Drain broccoli rabe well in a colander and pat dry. Cut broccoli rabe into 1/2-inch pieces and transfer to a bowl. Pit and chop olives. Mince garlic. Add olives, garlic, lemon juice, and salt and pepper to taste to broccoli rabe and toss well. Into another bowl coarsely grate mozzarella and chill, covered.",
        "Bake pastry in middle of oven until golden, 15 to 20 minutes. Sprinkle cheese evenly over pastry, leaving a 1/2-inch border on all sides. Spread broccoli rabe mixture evenly on top of cheese and bake in middle of oven 10 minutes, or until heated through. Drizzle oil over pizza.",
        "Cut pizza into serving pieces."
    ],
    "ingredients": [
        "1 puff pastry sheet (from one 17 1/4-ounce package frozen puff pastry sheets), thawed",
        "1/2 pound broccoli rabe",
        "1/3 cup drained Kalamata or other brine-cured black olives",
        "2 garlic cloves",
        "1 tablespoon fresh lemon juice",
        "6 ounces smoked mozzarella",
        "1 tablespoon extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Olive",
        "Bake",
        "Cocktail Party",
        "Mozzarella",
        "Phyllo/Puff Pastry Dough",
        "Broccoli Rabe",
        "Gourmet"
    ],
    "title": "Broccoli Rabe, Black Olive, and Smoked Mozzarella Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/broccoli-rabe-black-olive-and-smoked-mozzarella-pizza-15155"
}
