{
    "directions": [
        "Heat 3 tablespoons oil in a small saucepan over medium-low heat; add garlic and red pepper flakes. Cook, stirring often, until garlic begins to turn golden, about 4 minutes. Add beans with liquid. Bring to a simmer; cook, stirring often, until liquid thickens, about 10 minutes. Transfer to a food processor; add 3 tablespoons oil. Process until smooth. Season with salt and pepper.",
        "Cook broccoli rabe, 1 bunch at a time, in a large pot of boiling salted water for 2 minutes (return to a boil between batches). Transfer broccoli rabe to a baking sheet; let cool. Squeeze dry; coarsely chop.",
        "Heat a large pot over medium heat; add 1/4 cup oil, garlic, and red pepper flakes. Cook, stirring often, until garlic is fragrant and beginning to turn golden, 2-3 minutes. Add broccoli rabe; cook, stirring often, until stem pieces are just tender, 4-5 minutes. Add remaining 1/4 cup oil and 3 tablespoons lemon juice. Season with salt, pepper, and more juice, if desired. Spread out on a rimmed baking sheet and let cool. DO AHEAD: Can be made one day ahead. Cover and chill.",
        "Arrange racks in top and bottom thirds of oven; preheat to 400°F. Open rolls and arrange on 2 rimmed baking sheets. Drizzle generously with oil. Spread bean purée on one side of each roll; add broccoli rabe. Top with cheese, then chile. Toast, rotating pans after 5 minutes, until cheese is melted, 7-10 minutes. Top, slice, and serve."
    ],
    "ingredients": [
        "6 tablespoons olive oil, divided",
        "3 garlic cloves, thinly sliced",
        "1/2 teaspoon crushed red pepper flakes",
        "1 15-ounce can cannellini (white kidney) beans with liquid",
        "Kosher salt, freshly ground pepper",
        "4 bunches broccoli rabe (rapini, 4-5 pounds), ends trimmed",
        "Kosher salt",
        "1/2 cup olive oil, divided, plus more",
        "1 head of garlic, cloves peeled and thinly sliced",
        "1 1/2 teaspoons crushed red pepper flakes",
        "3 tablespoons (or more) fresh lemon juice",
        "Freshly ground black pepper",
        "8 6\"-8\"-long French rolls, split lengthwise",
        "8 ounces thinly sliced provolone piccante or other aged provolone cheese",
        "1 Fresno chile or red jalapeño, seeded, very thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Super Bowl",
        "Vegetarian",
        "Low Cal",
        "Lunch",
        "Hot Pepper",
        "Tailgating",
        "Poker/Game Night",
        "Broccoli Rabe",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Broccoli Rabe and Provolone Grinders",
    "url": "http://www.epicurious.com/recipes/food/views/broccoli-rabe-and-provolone-grinders-388710"
}
