{
    "directions": [
        "Place a rack in the middle of the oven and preheat to 450 degrees F. Butter an 8-by-8-by-2-inch baking dish or an 8-cup gratin dish.",
        "Melt 3 tablespoons of the butter in a medium saucepan over medium heat. Whisk in the flour until smooth. Cook, stirring, for 1 minute. Add the milk, 1 1/2 teaspoons salt, and nutmeg and bring to a boil while whisking constantly. Lower the heat and simmer, stirring occasionally, until the white sauce is thickened, about 10 minutes. Season with pepper. Remove from the heat.",
        "Meanwhile, bring about 1-inch of water to a boil in a large saucepan and set up a collapsible steamer on top. Put the broccoli in the steamer and season with salt. Cover, and steam until crisp-tender, about 5 minutes. Put the broccoli in the prepared dish, sprinkle with half of the cheese and pour on the sauce. Cover with the remaining cheese.",
        "Melt the remaining 1 tablespoon butter in a medium skillet over medium-high heat. Add the bread crumbs and cook, stirring, until lightly browned, about 2 minutes. Cover the gratin with the bread crumbs. Bake until lightly browned and bubbly, about 20 minutes. Serve immediately.",
        "Copyright 2005 Television Food Network, G.P. All rights reserved."
    ],
    "ingredients": [
        "1/4 cup unsalted butter, plus more for the baking dish",
        "3 tablespoons all-purpose flour",
        "1 1/2 cups whole milk",
        "1 1/2 teaspoons kosher salt, plus more as needed",
        "Pinch freshly grated nutmeg",
        "Freshly ground black pepper",
        "2 pounds broccoli (about 4 heads), cut into small florets (about 8 cups)",
        "1 cup grated sharp Cheddar (about 4 ounces)",
        "1/2 cup fresh bread crumbs"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Side Dish Recipes",
        "Easy Recipes",
        "Easy Baking",
        "Broccoli Side Dish",
        "Broccoli",
        "Vegetable",
        "Vegetarian",
        "Steamer",
        "American",
        "Cheddar",
        "Cheese"
    ],
    "title": "Broccoli Gratin",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/broccoli-gratin-recipe"
}
