{
    "directions": [
        "Preheat oven to 275 degrees F (135 degrees C).",
        "Separate florets from broccoli stalks. Remove the outer layer of the broccoli stalks using a vegetable peeler or sharp knife, leaving the soft interior of the stalk.",
        "Bring a 1-quart saucepan of salted water to a boil. Cook florets in the boiling water until tender, about 6 minutes. Transfer florets to a bowl of ice water, reserving the boiled water in the saucepan; drain and place florets in a bowl, reserving the ice water.",
        "Place the broccoli stalks in the reserved boiled water in the saucepan and cook over medium heat until tender, about 10 minutes. Transfer stalks to the reserved ice water; drain.",
        "Place broccoli stalks and about 2/3 of the florets in a food processor; process until smooth.",
        "Beat heavy cream, eggs, egg yolk, pepper, and salt together in a bowl until smooth; add to food processor with broccoli mixture and process until well combined.",
        "Melt 1 tablespoon butter in a saucepan over medium heat; pour into six 4-ounce ramekins and spread butter around until evenly coated.",
        "Place ramekins in a baking dish. Pour broccoli mixture into each ramekin. Fill baking dish with hot water until it comes halfway up the sides of the ramekins. Cover the ramekins with a sheet of parchment paper.",
        "Bake in the preheated oven until custard is set, about 30 minutes.",
        "Melt 1 1/2 tablespoons butter in a skillet over medium heat; cook and stir shallots until fragrant, about 1 minute. Add vegetable broth; cook and stir until sauce is slightly reduced, 2 to 3 minutes more.",
        "Melt remaining 1 1/2 teaspoons butter in a separate skillet over medium heat; cook and stir remaining broccoli florets until lightly browned, 2 to 3 minutes.",
        "Place a plate over each ramekin and flip; remove ramekin to release custard onto plate, using a knife if needed. Spoon shallot sauce over each custard and top with florets."
    ],
    "ingredients": [
        "2 1/2 pounds broccoli",
        "1 cup heavy whipping cream",
        "2 eggs",
        "1 egg yolk",
        "1/2 teaspoon freshly ground black pepper, or to taste",
        "1/4 teaspoon salt, or to taste",
        "3 tablespoons unsalted butter, divided",
        "2 shallots, minced",
        "1/4 cup vegetable broth"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Broccoli Custard",
    "url": "http://allrecipes.com/recipe/256276/broccoli-custard/"
}
