{
    "directions": [
        "In large saucepan of boiling water, cook broccoli 1 minute. Immediately drain and rinse under cold water to stop cooking. Pat dry. Transfer half of broccoli to covered container and refrigerate until ready to serve. Transfer other half to food processor and add scallions and garlic. Pulse until finely chopped, about 10 (1-second) pulses. Transfer mixture to medium bowl.",
        "In same processor, combine Cheddar and cream cheese and process until smooth, about 3 minutes. Return broccoli mixture to processor, add yogurt and pepper, and pulse until blended, about 15 (1-second) pulses. Transfer to large covered container and refrigerate until ready to serve. Serve dip with reserved broccoli florets and bread sticks or pretzels.",
        "For simple, elegant, cooler-to-blanket serving, refrigerate the dip in a sturdy glass bowl with a lid, such as those made by Pyrex. If you'll be serving it to a large group, use two bowls for easy passing. Transport pretzels or breadsticks in their packaging and then place them in bowl at the picnic site, or transfer them at home to a Tupperware container and use that as a serving dish as well."
    ],
    "ingredients": [
        "4 cups broccoli florets (10 ounces), cut into 1 1/2-inch pieces",
        "3 scallions (white and green parts), trimmed and cut into 1/2-inch pieces (about 3/4 cup)",
        "1 small garlic clove",
        "10 ounces sharp Cheddar cheese, room temperature, cut into 3/4-inch cubes (about 2 cups)",
        "4 ounces cream cheese, room temperature",
        "1 cup plain whole or lowfat yogurt",
        "1/4 teaspoon freshly ground black pepper",
        "4 ounces bread sticks or pretzels, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Food Processor",
        "Cheese",
        "Dairy",
        "Vegetable",
        "Appetizer",
        "Picnic",
        "Super Bowl",
        "Vegetarian",
        "Quick & Easy",
        "Yogurt",
        "Cheddar",
        "Broccoli",
        "Poker/Game Night",
        "Shower",
        "Party",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Broccoli-Cheddar Dip",
    "url": "http://www.epicurious.com/recipes/food/views/broccoli-cheddar-dip-238866"
}
