{
    "directions": [
        "To make the croutons, cut the bread slices into 3/4-inch cubes. In a fry pan over medium-high heat, combine the olive oil and garlic. Fry until the garlic turns brown, about 4 minutes; do not allow it to burn. Using a slotted spoon, scoop out and discard the garlic. Add the bread cubes to the pan and fry, stirring often, until golden brown on all sides, about 5 minutes. Transfer to paper towels to drain.",
        "To make the soup, in a large saucepan over medium heat, warm the olive oil. Add the leeks and sauté until softened, 3 to 5 minutes. Add the broccoli and sauté, stirring frequently, until slightly softened, about 2 minutes more.",
        "Add the stock and bring to a simmer. Cover partially and cook until the vegetables are tender when pierced with a sharp knife, 15 to 20 minutes. Remove from the heat.",
        "In a blender or food processor, puree the soup in batches until smooth and return the soup to the pan. Alternatively, process with a stick blender in the pan until smooth. Reheat the soup gently over medium heat. Season with salt and white pepper.Ladle the soup into warmed bowls and garnish with the sour cream, croutons and chives. Serve immediately."
    ],
    "ingredients": [
        "4 to 6 slices coarse country bread, each 3/4 inch  &nbsp thick, crusts removed",
        "1/3 cup extra-virgin olive oil",
        "4 garlic cloves, sliced lengthwise",
        "2 Tbs. olive oil",
        "2 leeks, including tender green portions,  &nbsp rinsed well and finely chopped",
        "1 1/2 lb. broccoli, trimmed, florets and stalks  &nbsp cut into 1-inch pieces",
        "4 cups chicken stock",
        "Salt and freshly ground white pepper, to taste",
        "1/4 cup sour cream or plain yogurt",
        "2 Tbs. finely chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Broccoli-Leek Soup",
    "url": "http://www.williams-sonoma.com/recipe/broccoli-leek-soup.html"
}
