{
    "directions": [
        "Melt 1 tablespoon butter in a large pot over medium heat; add onion. Cook and stir until onion turns translucent, 5 to 6 minutes. Add garlic; stir for 1 minute. Pour in broth; bring to a simmer over high heat.",
        "Separate florets from heads of broccoli. Cut large florets in half. Cut stems in half and cut into 1/2-inch pieces. Add broccoli to simmering broth. Cover and cook until broccoli softens slightly, 2 to 3 minutes. Reduce heat to medium-low; simmer, stirring occasionally, until broccoli is very tender, about 10 minutes. Remove from heat.",
        "Blend broccoli with an immersion blender into a very smooth puree. Stir in cream, salt, pepper, nutmeg, and cayenne. Return soup to medium-low heat; cook until cream is heated through, about 5 minutes.",
        "Preheat oven to 375 degrees F (190 degrees C). Line a rimmed baking sheet with aluminum foil.",
        "Butter both sides of bread with remaining 1 tablespoon butter and place on the lined baking sheet.",
        "Bake bread in the preheated oven, turning halfway through, until toasted and crisp, 4 to 5 minutes.",
        "Place 6 oven-proof soup crocks on the foil-lined baking sheet. Ladle soup into the crocks, filling almost to the top. Place 1 piece of toasted bread in each crock; cover with Cheddar cheese.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Place baking sheet under broiler and broil until cheese is browned and bubbly, 3 to 4 minutes."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter, divided",
        "1 large onion, diced",
        "3 cloves garlic, minced",
        "5 cups vegetable broth, or more to taste",
        "2 pounds broccoli, trimmed",
        "1/2 cup heavy whipping cream",
        "2 teaspoons kosher salt, or more to taste",
        "freshly ground black pepper to taste",
        "1 pinch freshly grated nutmeg",
        "1 pinch ground cayenne pepper, or to taste",
        "3 slices country white bread, halved crosswise",
        "3 cups shredded sharp Cheddar cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Broccoli Soup au Gratin",
    "url": "http://allrecipes.com/recipe/256887/broccoli-soup-au-gratin/"
}
