{
    "directions": [
        "Whisk salt and 2 cups flour in a large bowl to combine. Work in butter with your fingers until largest pieces are pea-size. Drizzle in 1/4 cup ice water and rake with your fingers to combine. Turn dough out onto a work surface and lightly knead to work into a shaggy dough (no dry spots should remain). Flatten into a disk; wrap in plastic and chill until firm, at least 2 hours and up to 2 days ahead.",
        "Place a rack in middle of oven; preheat to 350°F. Roll out dough on a lightly floured surface to a 14\" round. Transfer dough to pan. Lift up edges and allow dough to slump down into pan, then pat into corners and up around the sides of pan. Smooth out dough so it doesn’t have any creases or folds and trim to just below the rim. (Save any scraps for patching.) Freeze until very firm, about 20 minutes.",
        "Line dough with 2 layers of overlapping parchment paper and fill with pie weights or dried beans (ideally right up to the rim; pillage the pantry for old dried beans and rice to get you there). Bake until crust is golden brown all the way around edges (peek below the parchment), 60–75 minutes. Carefully remove parchment and pie weights. If needed, patch any cracks with reserved dough trimmings and bake crust just until patches are opaque, about 5 minutes. Let crust cool.",
        "Reduce oven heat to 325°F. Heat oil in a large skillet over medium. Cook shallot and garlic, stirring occasionally, until softened, about 5 minutes. Add broccoli and cook, tossing occasionally, until crisp-tender, about 5 minutes. Add Swiss chard leaves and cook, tossing often, just until wilted, about 2 minutes. Let cool. Stir in feta and cheddar.",
        "Whisk eggs, egg yolks, cream, and half-and-half in a medium bowl just to combine. Mix in chives and salt; season with pepper. Scrape vegetable mixture into crust, then carefully pour in egg mixture. Bake quiche until filling is lightly browned and set across the surface but slightly wobbly in the center inch or two, 75–90 minutes. Let quiche cool in pan before unmolding and slicing.",
        "Quiche can be baked 2 days ahead. Cover and chill."
    ],
    "ingredients": [
        "1 teaspoon kosher salt",
        "2 cups all-purpose flour, plus more for surface",
        "11 tablespoons chilled unsalted butter, cut into pieces",
        "1 tablespoon olive oil",
        "1/2 small shallot, chopped",
        "1 garlic clove, finely chopped",
        "1 small head of broccoli (about 8 ounces), halved lengthwise, chopped (about 3 cups)",
        "1 bunch small Swiss chard, ribs and stems removed, leaves coarsely torn (about 4 cups)",
        "4 ounces feta, crumbled (about 1 cup)",
        "2 ounces sharp cheddar, grated (about 1 cup)",
        "6 large eggs",
        "3 large egg yolks",
        "1 3/4 cups heavy cream",
        "1 cup half-and-half or heavy cream or whole milk",
        "3 tablespoons chopped chives",
        "1 teaspoon kosher salt",
        "Freshly ground black pepper",
        "A 9-inch springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Brunch",
        "Breakfast",
        "Broccoli",
        "Vegetarian",
        "Egg",
        "Cheddar",
        "Feta",
        "Cheese",
        "Chard",
        "Milk/Cream",
        "Quiche"
    ],
    "title": "Broccoli and Cheese Quiche",
    "url": "http://www.epicurious.com/recipes/food/views/broccoli-and-cheese-quiche"
}
