{
    "directions": [
        "Discard tough lower third of broccoli stem. Peel remaining stem and finely chop. Cut remaining broccoli into very small (1-inch) florets. Cook florets in a large pot of boiling salted water until just tender, 2 to 3 minutes. Transfer with a slotted spoon to a bowl of ice water to stop cooking, then drain. Reserve 3 cups cooking water for chowder.",
        "Peel potato and cut into 1/2-inch cubes. Cook potato, onion, bell pepper, broccoli stems, and garlic in butter in a 3- to 4-quart heavy pot over moderate heat, stirring occasionally, until onion is softened, 8 to 10 minutes. Add cumin, salt, pepper, and mustard and cook, stirring, 1 minute. Add flour and cook, stirring, 2 minutes. Add reserved cooking water and simmer (partially covered), stirring occasionally, until potatoes are tender, about 10 minutes. Stir in cream and cheese and cook, stirring, until cheese is melted, then season with salt and pepper.",
        "Purée about 2 cups of chowder in a blender until smooth (use caution when blending hot liquids) and return to pot. Add florets and cook over moderate heat, stirring occasionally, until heated through, about 2 minutes."
    ],
    "ingredients": [
        "1 small head broccoli (1/2 pound)",
        "1 large boiling potato (1/2 pound)",
        "1 large onion, chopped",
        "1 red bell pepper, cut into 1/2-inch pieces",
        "l large garlic clove, finely chopped",
        "2 tablespoons unsalted butter",
        "1 teaspoon ground cumin",
        "1 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/2 teaspoon dry mustard",
        "2 tablespoons all-purpose flour",
        "3/4 cup heavy cream",
        "6 oz sharp Cheddar, coarsely grated (1 1/2 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Cheese",
        "Vegetable",
        "Vegetarian",
        "Lunch",
        "Cheddar",
        "Broccoli",
        "Bell Pepper",
        "Fall",
        "Gourmet"
    ],
    "title": "Broccoli, Red Pepper, and Cheddar Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/broccoli-red-pepper-and-cheddar-chowder-105893"
}
