{
    "directions": [
        "Melt butter in large nonstick skillet over medium-high heat. Add onion and garlic; sauté until onion is soft, about 4 minutes. Mix in dry mustard, then 2 tablespoons Dijon mustard, blending well. Add breadcrumbs; sauté until crumbs are crisp and golden, stirring and pressing with back of fork to separate, about 8 minutes. Season with salt and pepper; cool completely. Mix in 3/4 cup cheese.",
        "Cook broccoli florets in large pot of boiling generously salted water until crisp-tender, about 3 minutes. Drain. Transfer to paper towels; cool. (Streusel and broccoli can be made 1 day ahead. Cover separately and refrigerate.)",
        "Preheat oven to 350°F. Butter 13x9x2-inch glass baking dish. Place broccoli in large bowl. Add whipping cream, remaining 2 tablespoons Dijon mustard, and 1/4 cup cheese; toss to coat evenly. Arrange broccoli in prepared dish. Sprinkle streusel over. Bake until broccoli is heated through and streusel is browned, about 30 minutes."
    ],
    "ingredients": [
        "4 tablespoons (1/2 stick) butter",
        "1/3 cup minced onion",
        "2 large garlic cloves, minced",
        "1/2 teaspoon dry mustard",
        "4 tablespoons Dijon mustard",
        "2 1/2 cups fresh breadcrumbs made from crustless sourdough bread",
        "1 cup (packed) grated Parmesan cheese (about 3 ounces)",
        "12 to 13 cups broccoli florets (from about 3 pounds broccoli crowns)",
        "1/2 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mustard",
        "Vegetable",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Parmesan",
        "Broccoli",
        "Fall",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Broccoli Gratin with Mustard-Cheese Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/broccoli-gratin-with-mustard-cheese-streusel-107297"
}
