{
    "directions": [
        "Line baking sheet with foil. Place sugar and 1/4 cup water in heavy small saucepan. Stir over medium heat until sugar dissolves. Increase heat and boil without stirring until syrup is pale golden color, occasionally brushing down pan sides with wet pastry brush and swirling pan, about 6 minutes. Stir in nuts and cook until caramel is deep amber, swirling pan occasionally, 1 to 2 minutes. Pour onto prepared baking sheet. Cool completely. Peel macadamia brittle from foil. Transfer to work surface. Chop coarsely.",
        "Preheat broiler. Line rimmed baking sheet with foil. Arrange pineapple slices in single layer on prepared sheet; sprinkle brown sugar over. Broil until sugar bubbles and turns amber, watching closely to avoid burning, 5 to 10 minutes. Remove pineapple from broiler.",
        "Bring brown sugar, rum, butter, and vanilla to boil in heavy small saucepan. Stir until sugar dissolves. Boil without stirring until mixture is slightly thickened, 1 to 2 minutes.",
        "Arrange warm pineapple on large serving platter. Drizzle pineapple with rum caramel. Sprinkle macadamia toffee over."
    ],
    "ingredients": [
        "1/2 cup sugar",
        "1/4 cup water",
        "1/2 cup macadamia nuts",
        "1 4-pound fresh pineapple, peeled, cored, cut lengthwise into 16 long wedges, each wedge halved crosswise",
        "1/4 cup (packed) brown sugar",
        "2 tablespoons (packed) brown sugar",
        "2 tablespoons dark rum",
        "1 tablespoon butter",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Broil",
        "High Fiber",
        "Pineapple",
        "Macadamia Nut",
        "Low Cholesterol",
        "Boil",
        "Butter",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Broiled Pineapple with Rum Caramel and Macadamia Toffee",
    "url": "http://www.epicurious.com/recipes/food/views/broiled-pineapple-with-rum-caramel-and-macadamia-toffee-357353"
}
