{
    "directions": [
        "Boil all sauce ingredients in a 2- to 3-quart heavy saucepan over moderate heat, skimming foam occasionally, until syrupy and reduced to about 1 cup, 30 to 40 minutes. Let stand while duck broils.",
        "Remove rack of a broiler pan, then add 1 cup water to broiler pan and replace rack. Preheat broiler with pan 5 to 6 inches from heat.",
        "Pat duck breasts dry and score skin at 1-inch intervals with a sharp knife (do not cut into meat), then sprinkle all over with salt and pepper. Broil duck breasts, skin sides down, 4 minutes for Long Island duck or 8 minutes for Muscovy, then turn over and broil until thermometer inserted horizontally into center of a breast registers 130°F (see cooks' note, below), 8 to 10 minutes more for medium-rare. Transfer to a cutting board and let stand 5 minutes. Add any juices accumulated on cutting board to sauce and simmer until slightly thickened, 1 to 2 minutes.",
        "Holding a sharp knife at a 45-degree angle, cut each duck breast into thin slices and serve with sauce."
    ],
    "ingredients": [
        "2 1/2 cups fresh orange juice",
        "1/4 cup fresh lime juice",
        "3 tablespoons maple syrup (preferably dark amber or Grade B)",
        "1 tablespoon finely chopped canned chipotle chiles in adobo",
        "1 (3- to 4-inch) cinnamon stick",
        "2 whole cloves",
        "1 teaspoon salt",
        "3 (1-lb) boneless Muscovy duck breasts with skin or 6 (7- to 8-oz) Long Island (also called Pekin) duck breast halves with skin",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Broil",
        "Quick & Easy",
        "Lime",
        "Orange",
        "Hot Pepper",
        "Cinnamon",
        "Maple Syrup",
        "Gourmet"
    ],
    "title": "Broiled Duck Breasts with Orange Chipotle Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/broiled-duck-breasts-with-orange-chipotle-sauce-232789"
}
