{
    "directions": [
        "Cook fennel bulbs in large saucepan of boiling salted water until crisp-tender, about 8 minutes. Drain; cool.",
        "Toss fennel, bell peppers, olive oil and 1 teaspoon chopped thyme in large bowl to coat. Season to taste with salt and pepper. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Preheat broiler. Using mallet or rolling pin, pound each chicken breast between sheets of plastic to 1/2-inch thickness. Sprinkle chicken with salt and pepper. Place chicken, skin side down, on broiler pan.",
        "Watching closely, broil chicken 4 to inches from heat source until golden brown and almost cooked through, about 5 minutes. Remove broiler pan from oven. Pour off any pan drippings. Using tongs, turn chicken over and broil until skin is golden brown and chicken is cooked through, about 4 minutes longer. Transfer chicken to platter. Tent with foil to keep warm. Pour off any additional pan drippings.",
        "Working in 2 batches, arrange peppers and fennel in single layer on broiler pan. Broil until vegetables begin to brown and peppers and tender, about 2 minutes per side. Transfer vegetables to platter with chicken.",
        "Meanwhile, melt butter in heavy small saucepan over medium-low heat. Mix in remaining 2 teaspoons chopped thyme, lemon peel and fennel seeds. Season to taste with salt and pepper.",
        "Drizzle butter mixture over chicken. Garnish chicken with thyme sprigs, if desired, and serve."
    ],
    "ingredients": [
        "3 small fennel bulbs (about 2 3/4 pounds), trimmed, quartered lengthwise",
        "3 red bell peppers, cut into 1-inch-wide strips",
        "2 tablespoons olive oil (preferably extra-virgin)",
        "3 teaspoons chopped fresh thyme",
        "6 boneless chicken breasts",
        "2 tablespoons (1/4 stick) butter",
        "2 teaspoons finely grated lemon peel",
        "1 teaspoon fennel seeds, crushed",
        "Fresh thyme sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Broil",
        "Fennel",
        "Bell Pepper",
        "Spring",
        "Thyme"
    ],
    "title": "Broiled Chicken with Thyme, Fennel and Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/broiled-chicken-with-thyme-fennel-and-peppers-5153"
}
