{
    "directions": [
        "Cut tofu into 10 thin slices. Set on a baking sheet, cover with another baking sheet, and weigh down with something heavy, such as a large can of food. Drain until excess water is removed, at least 30 minutes.",
        "Heat olive oil in a small cast iron skillet over medium heat. Toast ground cumin, chili powder, and oregano in the hot oil until spices are aromatic, about 2 to 3 minutes.",
        "Transfer oil and spice mixture to a saucepan over medium heat; stir in minced garlic, white wine vinegar, and white wine. Bring to a simmer, then remove marinade from heat.",
        "Place drained tofu into a glass dish; pour marinade over tofu. Cover with plastic wrap; refrigerate for at least 8 hours.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Remove tofu from marinade; pat dry with paper towels and place on broiler rack. Broil on each side until skin is crisp, about 6 minutes per side.",
        "To assemble, spread mayonnaise on one side of each slice of bread; place 2 tofu slices on 5 of the bread slices; top tofu with sliced tomato, arugula, red onion, salt, black pepper, and remaining slices of bread."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3648&h=1910&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4459685.jpg",
    "ingredients": [
        "1 pound firm tofu",
        "¼ cup olive oil",
        "½ teaspoon ground cumin",
        "½ teaspoon chili powder",
        "½ teaspoon dried oregano",
        "2 cloves garlic, minced",
        "¼ cup white wine vinegar",
        "¼ cup dry white wine",
        "10 slices whole wheat bread",
        "¼ cup mayonnaise",
        "5  Roma tomatoes, sliced",
        "1 cup arugula",
        "1  red onion, thinly sliced",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Broiled, Marinated Tofu Sandwich",
    "url": "http://allrecipes.com/recipe/223096/broiled-marinated-tofu-sandwich/"
}