{
    "directions": [
        "Preheat broiler.",
        "Brush both sides of bread with oil, then put bread on a large baking sheet.",
        "Stir together mayonnaise, mustard, cheese, and zest in a small bowl, then coat top of cutlet with about 2 tablespoons sauce, reserving remaining sauce. Transfer chicken to baking sheet.",
        "Brush cut sides of tomato with oil and season with salt and pepper, then sprinkle with herbes de Provence. Transfer to baking sheet.",
        "Toss romaine with 1 tablespoon oil, lemon juice, and 1/8 teaspoon each of salt and pepper in a bowl until coated. Transfer to baking sheet.",
        "Broil 3 to 4 inches from heat until bread is golden-brown, about 2 minutes. Turn bread and continue broiling until browned, about 2 minutes. Remove toast from broiler and continue broiling until romaine is wilted and well browned in spots, chicken is just cooked through, and tomato is lightly browned, 1 to 4 minutes more (remove romaine, chicken, and tomato as done).",
        "Rub toast with cut side of garlic (reserve other 1/2 clove for another use). Top garlic toast with chicken, lettuce, and tomato. Serve with remaining sauce."
    ],
    "ingredients": [
        "1 (1/2-inch-thick) center slice from a round Italian loaf of bread",
        "1 tablespoon extra-virgin olive oil plus additional for brushing",
        "3 tablespoons mayonnaise",
        "2 teaspoons Dijon mustard",
        "2 tablespoons grated parmesan",
        "1/2 teaspoon grated lemon zest",
        "1 chicken cutlet (about 1/4 inch thick)",
        "1 plum tomato, halved lengthwise",
        "1/4 teaspoon herbes de Provence or dried thyme",
        "1/4 head romaine (quarter head lengthwise), tough outer leaves removed and root end kept intact",
        "1 teaspoon fresh lemon juice",
        "1 garlic clove, halved crosswise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Tomato",
        "Broil",
        "Quick & Easy",
        "Dinner",
        "Mayonnaise",
        "Parmesan",
        "Lettuce",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Broiled Chicken, Romaine, and Tomato Bruschetta",
    "url": "http://www.epicurious.com/recipes/food/views/broiled-chicken-romaine-and-tomato-bruschetta-356052"
}
