{
    "directions": [
        "Pat tofu dry with paper towels, then wrap in fresh paper towels and put in a microwave-safe dish (see cooks' note, below). Microwave at high power 30 seconds. Pour off any liquid and wrap tofu in fresh paper towels. Microwave 1 or 2 more times for 30 seconds each time, pouring off any liquid, until tofu feels firmer.",
        "Preheat broiler.",
        "Stir together miso, sugar, and sake in a small saucepan. (If miso mixture is very thick, stir in 1 tablespoon water.) Cook over medium-high heat, stirring, until bubbling, glossy, and the consistency of ketchup, 1 to 3 minutes.",
        "Cut tofu in half horizontally and arrange, cut sides up, on a cutting board. Cut each half into 6 squares (pieces might not be perfectly square).",
        "Arrange tofu on a foil-lined broiler pan, cut sides up, and broil about 2 inches from heat until a crust just forms, 1 to 2 minutes. Remove from oven and spread crusted side of each square with about 3/4 teaspoon miso mixture. Broil until tops are just bubbling and starting to color, 1 to 2 minutes. Transfer to a plate. Skewer each square with 1 two-pronged pick or 2 parallel straight picks. Sprinkle with seeds."
    ],
    "ingredients": [
        "1 (14-to 16-ounces) block firm tofu, drained",
        "1/3 cup red (dark) miso (preferably Japanese; see Shopping List, page 104)",
        "2 tablespoons sugar",
        "2 tablespoons sake, dry Sherry, or dry white wine",
        "1 teaspoon sesame seeds, toasted",
        "Equipment: 12 two-pronged wooden picks or 24 (2 1/2-to 31/2-inch) straight wooden picks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Broil",
        "Vegetarian",
        "Quick & Easy",
        "Tofu",
        "Healthy",
        "Gourmet",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Broiled Tofu with Miso (_Tofu Dengaku_)",
    "url": "http://www.epicurious.com/recipes/food/views/broiled-tofu-with-miso-em-tofu-dengaku-em-353652"
}
