{
    "directions": [
        "1. Preheat the broiler, set on high if you have a choice.",
        "2. Make the sauce: In a medium sauté pan, warm the jelly over low heat until it liquefies. Stir in the lemon juice and cardamom, then raise the heat, bring to a simmer, and simmer until the sauce is reduced by half, about 10 minutes. Remove from the heat and add the cold butter a little at a time, swirling the pan to blend it into the sauce. Stir in the mint leaves and set aside.",
        "3. As soon as the sauce is done, cook the chops: Dry the chops with paper towels, rub them with the cut sides of the garlic cloves, brush with olive oil, and season with salt and pepper. Place them on the rack of the broiler pan about 3 inches from the heat source and cook until well seared on the outside and done to your liking on the inside, 5 to 6 minutes per side for medium rare. To check for doneness, nick, peek, and cheat: Make a 1/4-inch cut in the thickest part of the meat: it should be slightly less done than you like it. Remove the chops from the broiler and allow to rest for 5 minutes.",
        "4. Serve the chops accompanied by the sauce."
    ],
    "ingredients": [
        "One 8-ounce jar mint jelly",
        "1/4 cup fresh lemon juice (about 1 lemon)",
        "Seeds from 4 cardamom pods (or 1/4 teaspoon ground cardamom)",
        "2 tablespoons cold unsalted butter, cut into pieces",
        "1/4 cup fresh mint leaves, cut into very thin strips",
        "4 8-ounce double lamb rib chops, 1 1/2 inches thick",
        "3 large cloves garlic, peeled and halved lengthwise",
        "2 tablespoons olive oil",
        "Kosher salt and freshly cracked black pepper to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Broil",
        "Backyard BBQ",
        "Dinner",
        "Mint",
        "Lamb Chop",
        "Grill",
        "Grill/Barbecue",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Broiled Double-Thick Lamb Rib Chops with Slicked-Up Store-Bought Mint Jelly Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/broiled-double-thick-lamb-rib-chops-with-slicked-up-store-bought-mint-jelly-sauce-104368"
}
