{
    "directions": [
        "Soak porcini in boiling-hot water until softened, 15 to 20 minutes. Drain in a paper-towel lined sieve set over a bowl, reserving soaking liquid. Rinse porcini well to remove any grit, then drain, pat dry, and coarsely chop.",
        "Mash half of garlic to a paste with salt and stir together with yogurt and pepper to taste. Coat chicken with yogurt and let marinate 20 minutes.",
        "While chicken is marinating, cook shallot and remaining garlic in oil in a large nonstick skillet over moderate heat, stirring frequently, until softened, 2 to 3 minutes. Stir in porcini, then add cabbage, 1 tablespoon each dill and parsley, reserved soaking liquid, and salt and pepper to taste. Braise, covered, over moderate heat until cabbage is barely tender, 8 to 10 minutes, and stir in remaining dill and parsley. Keep warm.",
        "Preheat broiler and broiler pan.",
        "Lightly brush hot broiler pan with oil and broil chicken about 4 inches from heat 4 to 6 minutes on each side, or until just cooked through.",
        "Cut each breast into 3 pieces and arrange over porcini and cabbage."
    ],
    "ingredients": [
        "1 ounce dried porcini mushrooms",
        "1 1/2 cups boiling-hot water",
        "4 garlic cloves, minced",
        "1/2 teaspoon salt",
        "1/4 cup plain low-fat yogurt",
        "4 (6-ounce) boneless skinless chicken breast halves, trimmed",
        "1 shallot, chopped",
        "1 teaspoon olive oil",
        "2 1/2 cups thinly sliced Savoy cabbage (6 ounces)",
        "2 tablespoons chopped fresh dill",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "Garnish: fresh parsley and dill sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Leafy Green",
        "Mushroom",
        "Poultry",
        "Braise",
        "Broil",
        "Marinate",
        "Low Fat",
        "Winter",
        "Cabbage",
        "Gourmet"
    ],
    "title": "Broiled Chicken Over Braised Porcini and Savoy Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/broiled-chicken-over-braised-porcini-and-savoy-cabbage-102731"
}
