{
    "directions": [
        "Preheat broiler. Line large baking sheet with foil. Remove and discard mushroom stems. Scoop out and discard tough inside centers where mushroom stems were attached. Brush both sides of mushrooms generously with olive oil. Place mushrooms, dark gill side up, on prepared baking sheet. Sprinkle mushrooms with minced garlic, then sprinkle generously with salt and pepper. Broil mushrooms about 5 inches from heat source until beginning to soften, about 5 minutes. Turn mushrooms over; broil until tender when pierced with knife, about 7 minutes longer. (Can be made 2 hours ahead. Let stand at room temperature. Before continuing, rewarm in 350°F oven until heated through, about 10 minutes.)",
        "Whisk eggs, 2 tablespoons grated Parmesan cheese, chopped rosemary, salt, and pepper in large bowl to blend. Melt 5 tablespoons butter in heavy large skillet over medium-low heat. Add eggs to skillet and stir gently in circular motion with wooden spoon or heat-resistant rubber spatula, releasing cooked eggs from bottom of skillet and allowing uncooked portion of eggs to flow underneath. Cook until eggs are set but still soft, about 4 minutes total. Dot with remaining 1 tablespoon butter.",
        "Arrange hot portobello mushrooms, gill side up, on plates. Top with eggs, dividing equally. Sprinkle with remaining 2 tablespoons grated Parmesan cheese, dividing equally, and serve."
    ],
    "ingredients": [
        "6 4- to 5-inch-diameter portobello mushrooms",
        "Olive oil",
        "3 garlic cloves, minced",
        "12 large eggs",
        "4 tablespoons grated Parmesan cheese",
        "1 1/2 teaspoons chopped fresh rosemary",
        "3/4 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "6 tablespoons (3/4 stick) butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Mushroom",
        "Breakfast",
        "Brunch",
        "Broil",
        "Vegetarian",
        "Quick & Easy",
        "Parmesan",
        "Rosemary",
        "Fall",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Broiled Portobello Topped with Creamy Scrambled Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/broiled-portobello-topped-with-creamy-scrambled-eggs-104936"
}
