{
    "directions": [
        "Cook bacon in a 10- to 12-inch heavy skillet over moderate heat, stirring occasionally, until golden, about 5 minutes. Transfer bacon with a slotted spoon to paper towels to drain, then pour off all but 1/4 cup fat (add additional olive oil if bacon doesn't render enough fat). Add onion to skillet and cook over moderate heat, stirring occasionally, until onion is softened and beginning to brown on edges, about 6 minutes. Stir in bacon, raisins, vinegar, sugar, and 1/4 teaspoon salt and boil until liquid is reduced to about 1/3 cup, about 1 minute. Remove from heat and keep warm, covered.",
        "Preheat broiler and oil baking pans.",
        "Arrange 2 trout, opened and skin side down, in each pan. Brush flesh of fish with 2 teaspoons oil (total) and sprinkle with pepper and remaining 1/4 teaspoon salt.",
        "Broil 1 pan of fish about 4 inches from heat until just cooked through, 2 to 3 minutes, then loosely cover with foil to keep warm and broil second pan of fish in same manner. Spoon bacon mixture down center of each fish and drizzle with remaining juices from skillet."
    ],
    "ingredients": [
        "4 thick bacon slices (7 ounces), cut crosswise into 1/8-inch-wide strips",
        "2 cups coarsely chopped red onion",
        "1/2 cup golden raisins (3 ounces)",
        "1/2 cup red-wine vinegar",
        "2 teaspoons sugar",
        "1/2 teaspoon salt",
        "4 (10- to 12-ounce) whole rainbow trout, cleaned and boned, leaving heads and tails intact (butterflied), or 8 fillets",
        "2 teaspoons olive oil plus additional if necessary",
        "1/4 teaspoon black pepper",
        "Special equipment: 2 (15- by 10-inch) shallow baking pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Onion",
        "Pork",
        "Broil",
        "Quick & Easy",
        "Vinegar",
        "Raisin",
        "Bacon",
        "Trout",
        "Gourmet"
    ],
    "title": "Broiled Trout with Bacon, Onions, and Raisins",
    "url": "http://www.epicurious.com/recipes/food/views/broiled-trout-with-bacon-onions-and-raisins-237658"
}
