{
    "directions": [
        "Put shrimp in a large resealable plastic bag. Whisk olive oil, lemon juice, Worcestershire sauce, garlic, oregano, salt, and black pepper in a small bowl. Reserve 1/2 cup marinade for vegetables; pour remainder over shrimp and turn to coat. Seal bag. Marinate for 10 minutes.",
        "Preheat oven to 450 degrees F (230 degrees C). Place 1 rack in center position and another 4 inches from broiler. Line a baking sheet with aluminum foil and spray with cooking spray.",
        "Toss chickpeas, tomatoes, cucumber, and onion with reserved 1/2 cup marinade on the prepared baking sheet and spread in an even layer.",
        "Roast on center rack until vegetables begin to pucker and brown, 15 to 20 minutes.",
        "Remove baking sheet from oven and turn oven to broil. Push vegetables to the middle of the pan. Remove shrimp from marinade, allowing excess liquid to drip off, brush off garlic, and set on top of vegetables. Discard marinade.",
        "Broil shrimp on top rack, flipping once, until bright pink and cooked through, 1 to 2 minutes per side.",
        "Serve shrimp and vegetables with pan juices on top of romaine lettuce; top with feta cheese and parsley."
    ],
    "ingredients": [
        "2 pounds large shrimp, peeled and deveined",
        "6 tablespoons extra-virgin olive oil",
        "1/4 cup lemon juice",
        "2 tablespoons Worcestershire sauce",
        "4 cloves garlic, minced",
        "2 teaspoons dried oregano",
        "1 teaspoon kosher salt",
        "1/4 teaspoon ground black pepper",
        "cooking spray",
        "1 (15 ounce) can chickpeas, drained and rinsed",
        "1 1/2 cups cherry tomatoes",
        "1 English cucumber, chopped",
        "1 red onion, chopped",
        "8 cups chopped romaine lettuce",
        "1 cup crumbled feta cheese",
        "1/4 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Broiled Shrimp and Veggie Salad",
    "url": "http://allrecipes.com/recipe/256107/broiled-shrimp-and-veggie-salad/"
}
