{
    "directions": [
        "Place lime, orange, and strawberry gelatin mixes into 3 separate 9x9-inch glass dishes.",
        "Pour 1 cup boiling water into each flavor of gelatin mix; stir the gelatin until dissolved.",
        "Pour 1 cup cold water into each flavor of gelatin, stir to combine, and refrigerate the 3 flavors of gelatin until set, at least 4 hours.",
        "Heat pineapple juice in a saucepan until hot but not simmering. Stir unflavored gelatin into pineapple juice until dissolved. Refrigerate pineapple juice mixture until cool and thickened, about 30 minutes. Stir occasionally.",
        "Mix graham cracker crumbs, melted butter, and brown sugar together in a bowl. Set 1 cup of crumb mixture aside for garnish. Press remaining 2 cups crumb mixture into the bottom of a 9x13-inch cake pan to make a crust.",
        "Pour cream into a large metal mixing bowl and beat with an electric mixer until the cream is fluffy and forms soft peaks, about 3 minutes. Slowly beat sugar into whipped cream, 1 or 2 tablespoons at a time; beat in vanilla extract.",
        "Cut the different flavors of gelatin into cubes. Use a thin spatula to lift the cubes away from the bottom of the dish and loosen them.",
        "Very gently fold the thickened pineapple juice and gelatin cubes into the whipped cream mixture until thoroughly combined. Spoon into the graham cracker crust.",
        "Sprinkle the cake with reserved graham cracker crumb mixture.",
        "Refrigerate until set, at least 3 hours to overnight."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/250x250/856266.jpg",
    "ingredients": [
        "1 (3 ounce) package lime flavored Jell-O® mix",
        "1 (3 ounce) package orange flavored Jell-O® mix",
        "1 (3 ounce) package strawberry flavored Jell-O®",
        "3 cups boiling water, divided",
        "3 cups cold water, divided",
        "1 cup canned pineapple juice",
        "1 (.25 ounce) package unflavored gelatin",
        "2 1/2 cups graham cracker crumbs",
        "1/2 cup butter, melted",
        "1/2 cup brown sugar",
        "2 cups chilled heavy cream",
        "1/2 cup white sugar",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Broken Glass Cake",
    "url": "http://allrecipes.com/recipe/220153/broken-glass-cake/"
}