{
    "directions": [
        "Stir goat cheese, 2 tablespoons hazelnut oil, 1/4 teaspoon rosemary, and lemon peel in small bowl to blend. Season lightly with salt and pepper.",
        "Place sheet of plastic wrap on work surface. Place 1 slice ham in center of plastic. Spread generous 2 tablespoons goat cheese mixture evenly over ham. Place single layer of spinach leaves over cheese mixture. Top spinach with second ham slice. Repeat layering 2 more times. Starting at 1 long side and using plastic wrap as aid, roll up ham jelly-roll style. Place additional ham slice over seam to cover exposed cheese and spinach leaves (roll will be about 1 1/2 to 2 inches in diameter). Wrap tightly in plastic. Repeat with remaining ham, cheese, and spinach to form second roll. Chill until firm, at least 6 hours. (Can be prepared 2 days ahead. Keep chilled.)",
        "Whisk 1/2 cup hazelnut oil, 1/4 teaspoon rosemary, Sherry vinegar, shallot, and sugar in small bowl. Season dressing with salt and pepper.",
        "Toss lettuces with 1/4 cup dressing and 1/4 cup hazelnuts. Mound salad in center of 8 plates. Unwrap ham rolls. Slice each roll into twelve 1/2-inch-thick rounds. Arrange 3 rounds around each salad; sprinkle salad with remaining nuts, drizzle dressing around salad and over ham rounds, and serve."
    ],
    "ingredients": [
        "8 ounces soft fresh goat cheese, room temperature",
        "2 tablespoons plus 1/2 cup hazelnut oil or olive oil",
        "1/2 teaspoon finely minced fresh rosemary, divided",
        "1/4 teaspoon finely grated lemon peel",
        "10 thin 7x3 1/2-inch slices Serrano ham or prosciutto (about 7 ounces)",
        "1 cup stemmed baby spinach leaves",
        "3 tablespoons Sherry wine vinegar",
        "3 tablespoons minced shallot",
        "1 teaspoon sugar",
        "10 cups (packed) assorted red and bronze lettuces, coarsely torn",
        "1/2 cup chopped husked toasted hazelnuts, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Leafy Green",
        "Pork",
        "No-Cook",
        "Christmas",
        "Cocktail Party",
        "Goat Cheese",
        "Rosemary",
        "Winter",
        "Family Reunion",
        "Prosciutto",
        "Hazelnut"
    ],
    "title": "Bronze and Red Lettuce Salad with Serrano Ham and Goat Cheese Spirals",
    "url": "http://www.epicurious.com/recipes/food/views/bronze-and-red-lettuce-salad-with-serrano-ham-and-goat-cheese-spirals-231273"
}
