{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Whisk the butter and the chocolate over low heat in a heavy medium saucepan until the chocolate is almost melted. Remove the pan from the heat and whisk until the chocolate is fully melted and the mixture is smooth. Whisk in the sugar, then the eggs, one at a time. Stir in the flour and salt with a flexible rubber spatula. Stir in the nut pieces. Scrape the batter into the prepared Biscotti Crumb Crust. Press a ring of walnut halves, if using, into the batter around the top edge.",
        "Place the pie on a baking sheet and bake until the outer 2 to 3 inches are slightly puffed and dry looking and the center is set, 35 minutes. A wooden skewer inserted into the center should come out with some moist batter still attached. Cool the pie completely on a rack.",
        "Cut the pie into wedges and serve with ice cream or whipped cream, if using.",
        "Preheat the oven to 350 degrees F. Blend the biscotti, butter and sugar in a food processor until the crumbs are moist and stick together when pressed. Firmly press the crumb mixture over the bottom and up the sides of a 9-inch glass pie dish, building up a high rim. Bake the crust until golden and feels firm to the touch, 15 minutes. Cool the crust completely."
    ],
    "ingredients": [
        "6 tablespoons unsalted butter, diced",
        "3 ounces unsweetened chocolate, chopped",
        "1 1/4 cups packed dark brown sugar (about 9 ounces)",
        "3 eggs, at room temperature",
        "3/4 cup flour",
        "1/4 teaspoon fine salt",
        "1/2 cup walnut pieces, toasted",
        "Biscotti Crumb Crust, recipe follows",
        "Walnut halves, optional",
        "Ice cream or sweetened whipped cream, optional",
        "One 5.5-ounce box biscotti (about 8), coarsely broken",
        "1/2 stick unsalted butter, chilled and diced",
        "1/4 cup packed dark brown sugar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Pie",
        "Chocolate",
        "Pie Recipes",
        "Baking",
        "Dessert",
        "Brownie",
        "Nut Recipes"
    ],
    "title": "Brownie-Walnut Pie",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/brownie-walnut-pie-recipe"
}
