{
    "directions": [
        "Heat 1 tablespoon oil in a medium saucepan over medium heat. Add 1/4 of onion and cook, stirring occasionally, until softened, about 5 minutes. Add rice and stir to coat. Add 2 cups water and season with salt. Bring to a boil, reduce heat to low, cover, and cook until rice is just tender, 40-50 minutes.",
        "Remove from heat. Let stand, covered, for 10 minutes. Fluff rice with a fork. Fold in 1/4 cup cilantro; season with salt and pepper.",
        "While rice is cooking, heat remaining 1 tablespoon oil in a medium saucepan over medium heat. Add 2/3 of remaining onion. Cook, stirring occasionally, until onion has softened, about 5 minutes.",
        "Add coriander and cumin; stir 1 minute. Add beans and broth; season with salt and pepper. Bring to a boil, reduce heat, and simmer, occasionally mashing beans, until thickened, 8-10 minutes.",
        "Pulse chiles, garlic, ginger, lime zest, lime juice, and remaining onion in a blender until a chunky sauce forms. Season salsa with salt.",
        "Serve rice with beans; top with salsa, avocado, cheese, 1/4 cup cilantro, and lime wedges."
    ],
    "ingredients": [
        "2 tablespoons olive oil, divided",
        "1 medium onion, chopped, divided",
        "1 cup brown rice",
        "Kosher salt",
        "1/2 cup coarsely chopped fresh cilantro, divided",
        "Freshly ground black pepper",
        "1 teaspoon ground coriander",
        "1 teaspoon ground cumin",
        "2 15-ounce cans black beans, rinsed",
        "1 cup low-sodium vegetable broth or water",
        "2 red jalapeños or Fresno or Holland chiles, stemmed, halved, seeded",
        "1 garlic clove",
        "1 tablespoon chopped peeled ginger",
        "1 tablespoon finely grated lime zest",
        "1/4 cup fresh lime juice",
        "1 avocado, halved, pitted, chopped",
        "1/4 cup crumbled Cotija cheese or feta",
        "Lime wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Ginger",
        "Rice",
        "Vegetarian",
        "Quick & Easy",
        "Dinner",
        "Avocado",
        "Hot Pepper",
        "Healthy",
        "Chile Pepper",
        "Sugar Conscious"
    ],
    "title": "Brown Rice and Beans with Ginger Chile Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/brown-rice-and-beans-with-ginger-chile-salsa-51155420"
}
