{
    "directions": [
        "Bring vegetable broth and water to a boil in a saucepan over high heat. Add asparagus, reduce heat to low, and simmer until just tender, 2 to 3 minutes. Use a slotted spoon to transfer asparagus to a bowl of ice water; let chill for 5 minutes. Drain and set aside. Meanwhile, cover saucepan and keep broth mixture at a near-simmer on low heat.",
        "Heat olive oil in large skillet over medium heat. Stir in onion and garlic; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add rice and cook, stirring gently, until toasted and fragrant, 4 to 5 minutes.",
        "Pour 1 cup of the hot broth mixture into the rice and cook, stirring constantly, until liquid is almost absorbed. Adjust heat if necessary to maintain a simmer. Repeat, using 1/2 cup liquid at a time, until rice is just beginning to become tender, about 25 minutes.",
        "Stir in diced carrots. Continue adding broth and stirring rice mixture until carrots are just tender, about 20 minutes more. Mix in zucchini; if broth mixture gets low, add hot water as needed. Cook and stir, adding broth, until rice is tender, about 5 minutes.",
        "Mix in drained asparagus and peas and cook until heated through, 2 to 3 minutes,  Add Parmesan and butter, stirring until butter melts. Season to taste with salt and pepper. Pour in an additional 1/2 cup hot broth to the finished risotto for a softer consistency, if desired."
    ],
    "ingredients": [
        "1 quart vegetable broth, or as needed",
        "5 cups water, or as needed",
        "1/2 pound asparagus, cut into 2-inch pieces",
        "2 tablespoons olive oil",
        "1 cup finely chopped onion",
        "2 cloves garlic, finely chopped",
        "2 cups short-grain brown rice",
        "2 carrots, peeled and diced",
        "2 zucchini, diced",
        "1/2 cup green peas, thawed if frozen",
        "2/3 cup grated Parmesan cheese",
        "1 tablespoon butter",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Brown Rice and Vegetable Risotto",
    "url": "http://allrecipes.com/recipe/230892/brown-rice-and-vegetable-risotto/"
}
