{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Lightly butter and flour cake pan, knocking out excess flour.",
        "Peel and core apples, then cut into 1/2-inch-thick wedges.",
        "Spread softened butter in an even layer over bottom of a 12-inch heavy skillet and sprinkle with brown sugar. Add apple wedges and cook over moderate heat, without stirring, until sugar is melted and apples start to give off liquid, about 10 minutes. Cook, stirring occasionally, until apples are just tender and juices become syrupy, about 30 minutes more.",
        "Pour syrup from skillet into a small heatproof bowl, then sauté apples, stirring occasionally, until caramelized and very tender, about 30 minutes more. Return syrup to apples and cook until heated through, about 2 minutes.",
        "Whisk together flour, baking powder, baking soda, salt, and spices in a bowl.",
        "Beat together butter and brown sugar in a large bowl with an electric mixer at medium speed until pale and fluffy. Beat in egg until combined. Add maple syrup, sour cream, and vanilla and beat until combined well. Reduce speed to low and add flour mixture, then mix until just incorporated.",
        "Spread batter in cake pan and bake until cake is golden brown and a wooden pick or skewer inserted in center comes out clean, 35 to 40 minutes. Cool in pan on a rack 10 minutes.",
        "Beat cream with sour cream and sugar using cleaned beaters at high speed until it just holds soft peaks.",
        "Run a thin knife around edge of pan, then invert cake onto a plate and cut into squares. Serve warm or at room temperature, topped with warm apple mixture and cream."
    ],
    "ingredients": [
        "8 Gala apples (3 1/2 pounds)",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "3/4 cup packed light brown sugar",
        "1 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon freshly grated nutmeg",
        "1/8 teaspoon ground cloves",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1/3 cup packed light brown sugar",
        "1 large egg",
        "1/2 cup dark amber or Grade B maple syrup",
        "1/2 cup sour cream",
        "1 teaspoon vanilla",
        "1 1/4 cups chilled heavy cream",
        "1/2 cup sour cream",
        "2 tablespoons sugar",
        "Special equipment: an 8-inch square nonstick cake pan (2 inches deep)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Fruit",
        "Breakfast",
        "Dessert",
        "Bake",
        "Stew",
        "Christmas",
        "Thanksgiving",
        "Apple",
        "Vanilla",
        "Fall",
        "Winter",
        "Sour Cream",
        "Maple Syrup",
        "Simmer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Brown-Sugar Spice Cake with Cream and Caramelized Apples",
    "url": "http://www.epicurious.com/recipes/food/views/brown-sugar-spice-cake-with-cream-and-caramelized-apples-233995"
}
