{
    "directions": [
        "Rinse and drain brown rice and bring to a boil in a saucepan with water and a pinch of sea salt. Reduce heat to low, cover pan, and simmer rice for 30 minutes. Rice will not be dry.",
        "Meanwhile, stir rice vinegar, cider vinegar, mirin, sugar, and 1/2 teaspoon sea salt in a bowl until sugar and salt have dissolved. Set the vinegar mixture aside.",
        "Stir quinoa into rice and cooking liquid, bring to a boil, and reduce heat to low again; simmer until rice and quinoa are both tender and liquid is absorbed, about 15 more minutes. Transfer rice and quinoa into a large bowl and gently mix the vinegar mixture into the rice, spreading the grains out a little as you mix to help dry and cool the rice and quinoa. Let rice mixture cool until warm, about 10 minutes of stirring and fanning.",
        "Place a nori sheet onto a sushi mat. With wet fingers, lightly press about 1/4 the rice mixture onto the nori sheet in an even layer, leaving about 1/2-inch uncovered at the top of the sheet. Place about 1/4 the shredded carrot, cucumber strips, and avocado slices in a line across the bottom of the rice.",
        "Pick up the edge of the bamboo rolling sheet, fold the bottom edge of the sheet up, enclosing the filling, and tightly roll the sushi into a thick cylinder. Once the sushi is rolled, wrap it in the mat and gently squeeze to compact it tightly. Unwrap the roll and cut into 6 pieces to serve; repeat with remaining ingredients to make 4 rolls."
    ],
    "image": "https://images.media-allrecipes.com/images/79591.png",
    "ingredients": [
        "2/3 cup short-grain brown rice",
        "2 1/3 cups water",
        "1 pinch sea salt",
        "2 tablespoons rice vinegar",
        "1 tablespoon cider vinegar",
        "1 tablespoon mirin (Japanese sweet wine) (optional)",
        "2 tablespoons turbinado sugar",
        "1/2 teaspoon sea salt",
        "1/2 cup quinoa",
        "4 sheets nori (dry seaweed)",
        "1/2 carrot, shredded",
        "1/2 cucumber, cut into thin strips",
        "1 avocado - peeled, pitted, and cut into thin strips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Brown Rice and Quinoa Sushi Rolls",
    "url": "http://allrecipes.com/recipe/221927/brown-rice-and-quinoa-sushi-rolls/"
}