{
    "directions": [
        "Using tip of small paring knife, scrape vanilla seeds from pod into 5-quart saucepan. Add cream, brown sugar, and cinnamon sticks and bring to a simmer over moderate heat.",
        "Remove from heat and let steep, uncovered, 20 minutes. Using slotted spoon, remove cinnamon sticks, then let cream cool to room temperature.",
        "In small saucepan over moderate heat, place 1 cup cream mixture. Add 2 packages gelatin and whisk until dissolved, about 3 minutes. Whisk mixture into remaining cooled cream. Spoon mixture into 10 wine glasses, leaving a 3/4-inch space at top of each. Chill until firm, about 4 hours. (Can be prepared up to 1 day ahead. Refrigerate until ready to use.)",
        "Meanwhile, in medium saucepan over moderate heat, heat 1 cup cider until hot, but not boiling. Remove from heat and add remaining package of gelatin, whisking until dissolved, about 2 minutes. In large bowl, stir together cider-gelatin mixture and remaining 1 1/2 cups cider. Cool to room temperature.",
        "When custards are firm, spoon 4 tablespoons cider mixture into each wine glass. Return to refrigerator and chill until firm, about 1 hour."
    ],
    "ingredients": [
        "1/4 fresh vanilla bean, split lengthwise",
        "8 cups (2 quarts) heavy cream",
        "1 cup packed, light brown sugar",
        "2 whole cinnamon sticks",
        "3 (1/4 ounce) envelopes powdered gelatin (about 3 scant tablespoons)",
        "2 1/2 cups apple cider"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Fruit",
        "Dessert",
        "Thanksgiving",
        "Apple",
        "Fall",
        "Chill",
        "Cinnamon",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Brown Sugar & Cinnamon Panna Cotta with Apple Cider Gelée",
    "url": "http://www.epicurious.com/recipes/food/views/brown-sugar-cinnamon-panna-cotta-with-apple-cider-gelee-235927"
}
