{
    "directions": [
        "Preheat oven to 450°F and lightly oil 2 large shallow roasting pans.",
        "Remove meat from bones where possible and cut into 1-inch pieces. If using breast bones, cut apart. In roasting pans arrange bones and meat in one layer and roast in upper and lower thirds of oven, switching pans halfway through roasting, until bones are golden brown, 30 to 45 minutes.",
        "Into a 14-quart stockpot put bones, meat, and 8 quarts water. (Alternatively, divide bones, meat, and 8 quarts water between two 7- to 8-quart kettles.) Discard fat from roasting pans. Immediately add 1/2 cup water to each pan, scraping up brown bits, and add to stockpot or kettles. Bring liquid to a tremble, about 190°F., and cook at 190°F. (skim froth frequently during first hour of cooking) 12 to 14 hours.",
        "While stock is cooking, separately cut carrots, onions, and white and pale green parts of leeks into 1-inch pieces. In a bowl of cold water wash leeks well and lift from water into a colander to drain. In an oiled large shallow roasting pan arrange carrots, onions, and leeks in one layer and roast in middle of oven until golden brown, 20 to 30 minutes. Cool vegetables and chill, covered.",
        "Add roasted vegetables and remaining ingredients to stock during last 2 hours of cooking.",
        "Pour stock in batches through a large fine sieve into an 8-quart kettle and discard solids. Skim off fat. (Alternatively, cool stock, uncovered, and chill, covered. Scrape congealed fat from chilled stock.) Gently simmer stock, skimming froth occasionally, until reduced to about 2 quarts, about 1 hour. Cool stock, uncovered, and chill, covered. Stock keeps, covered and chilled, 1 week or, frozen in airtight containers, 3 months. If desired, pour cooled stock into ice-cube trays with 1-ounce cups and freeze. Frozen cubes keep in heavy-duty sealable plastic bags 3 months."
    ],
    "ingredients": [
        "10 pounds meaty veal bones",
        "8 quarts plus 1 cup water",
        "1 pound carrots",
        "1 pound onions",
        "4 large leeks",
        "4 fresh thyme sprigs (optional)",
        "4 large fresh flat-leafed parsley sprigs (optional)",
        "2 Turkish bay leaves or 1/2 California bay leaf",
        "1 tablespoon black peppercorns (optional)",
        "1 tablespoon tomato paste (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Onion",
        "Roast",
        "Veal",
        "Leek",
        "Carrot",
        "Thyme",
        "Parsley",
        "Gourmet"
    ],
    "title": "Brown Veal Stock",
    "url": "http://www.epicurious.com/recipes/food/views/brown-veal-stock-100593"
}
