{
    "directions": [
        "Add rice to large pot of boiling salted water. Cover partially and cook until just tender, about 30 minutes. Drain well. Transfer to large bowl and cool to room temperature, stirring occasionally.",
        "Place zucchini and onion slices in shallow dish. Mix 1/4 cup oil, 2 tablespoons soy sauce and 2 tablespoons Worcestershire sauce in small bowl. Pour over vegetables. Let stand 30 minutes, turning once.",
        "Prepare barbecue (medium-high heat). When coals turn white, drain chips, if using, and scatter over coals. When chips begin to smoke, season onion and zucchini with salt and pepper and place on grill. Cover and cook until tender and brown, occasionally turning and basting with marinade, about 8 minutes. Transfer to platter. Cut onion slices into quarters. Cut zucchini crosswise into 1-inch pieces. Add onion and zucchini to rice. Mix in corn.",
        "Whisk orange juice, lemon juice, 1/3 cup oil, 3 tablespoons soy sauce and 1 tablespoon Worcestershire sauce in medium bowl. Pour 1 cup dressing over salad and toss to coat. Stir in parsley. Season with salt and pepper. Serve salad, passing remaining dressing separately."
    ],
    "ingredients": [
        "1 1/2 cups brown rice",
        "4 zucchini, halved lengthwise",
        "1 large red onion, cut crosswise into 3 thick slices",
        "1/4 cup plus 1/3 cup olive oil",
        "5 tablespoons soy sauce",
        "3 tablespoons Worcestershire sauce",
        "1 1/2 cups mesquite wood chips, soaked in cold water 1 hour (optional)",
        "2 cups fresh corn kernels",
        "2/3 cup fresh orange juice",
        "1 tablespoon fresh lemon juice",
        "1/2 cup chopped Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Rice",
        "Vegetable",
        "Vegetarian",
        "High Fiber",
        "Corn",
        "Summer"
    ],
    "title": "Brown Rice, Corn and Grilled Vegetable Salad",
    "url": "http://www.epicurious.com/recipes/food/views/brown-rice-corn-and-grilled-vegetable-salad-641"
}
