{
    "directions": [
        "Preheat oven to 350°F. Butter a 9\"-diameter cake pan and line bottom with a round of parchment paper; butter parchment.",
        "Melt 3/4 cup butter in a medium saucepan over medium heat, then cook, stirring often, until butter foams, then browns (do not let burn), 5–8 minutes. Pour into a medium bowl; let cool. Chill brown butter until cold.",
        "Fit a clean medium saucepan with thermometer and bring maple syrup to a boil over medium-high heat; cook until thermometer registers 265°F (syrup will be thicker and a shade darker). Pour into prepared pan and spread with an offset spatula or a spoon to cover bottom; let cool (syrup will harden as it sits).",
        "Whisk almond flour, polenta, baking powder, and salt in a medium bowl. Using an electric mixer on medium-high speed, beat chilled brown butter and 3/4 cup sugar until very pale and fluffy, 5–7 minutes. Add eggs 1 at a time, beating to blend between additions. Beat until light and fluffy, about 4 minutes. Reduce speed to low, gradually add dry ingredients, and mix just to combine. Scrape batter into pan; smooth top.",
        "Bake until cake is golden brown and pulls away from sides of pan, 50–55 minutes. Transfer pan to a wire rack; let cake cool in pan 20 minutes. Turn out onto rack and let cool completely.",
        "Using an electric mixer, beat heavy cream, sour cream, and remaining 1 tablespoon sugar in a medium bowl until soft peaks form. Serve cake with whipped-cream mixture.",
        "DO AHEAD: Cake can be baked 1 day ahead. Store tightly wrapped at room temperature."
    ],
    "ingredients": [
        "3/4 cup (1 1/2 sticks) unsalted butter, plus more for pan",
        "3/4 cup pure maple syrup",
        "2 cups almond flour or meal",
        "1 cup quick-cooking polenta",
        "1 1/2 teaspoon baking powder",
        "1 teaspoon kosher salt",
        "3/4 cup plus 1 tablespoon sugar",
        "3 large eggs",
        "1/2 cup heavy cream",
        "1/2 cup sour cream",
        "Special equipment: A candy thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Bake",
        "Cornmeal",
        "Maple Syrup",
        "Hominy/Cornmeal/Masa",
        "Butter"
    ],
    "title": "Brown Butter-Polenta Cake with Maple Caramel",
    "url": "http://www.epicurious.com/recipes/food/views/brown-butter-polenta-cake-with-maple-caramel-51210510"
}
