{
    "directions": [
        "Pulse cocoa powder, granulated sugar, salt, and 1 1/4 cups plus 1 tablespoon flour in a food processor to combine. Add butter and shortening and pulse until mixture resembles coarse meal with a few pea-size pieces of butter remaining. Transfer to a large bowl.",
        "Whisk egg yolk, vinegar, and 1/4 cup ice water in a small bowl. Drizzle half of egg mixture over flour mixture and, using a fork, mix gently just until combined. Add remaining egg mixture and mix until dough just comes together (you will have some unincorporated pieces).",
        "Turn out dough onto a lightly floured surface, flatten slightly, and cut into quarters. Stack pieces on top of one another, placing unincorporated dry pieces of dough between layers, and press down to combine. Repeat process twice more (all pieces of dough should be incorporated at this point). Form dough into a 1\"-thick disk. Wrap in plastic; chill at least 1 hour.",
        "DO AHEAD: Dough can be made 2 days ahead. Keep chilled, or freeze up to 3 months.",
        "Roll out disk of dough on a lightly floured surface into a 14\" round. Transfer to a 9\" pie dish. Lift up edge and allow dough to slump down into dish. Trim, leaving about 1\" overhang. Fold overhang under and crimp edge. Chill in freezer 15 minutes.",
        "Place a rack in middle of oven and preheat to 350°F. Line pie with parchment paper or heavy-duty foil, leaving a 1 1/2\" overhang. Fill with pie weights or dried beans. Bake until crust is dry around the edge, about 20 minutes. Remove paper and weights and bake until surface of crust looks dry, 5–10 minutes. Brush bottom and sides of crust with 1 beaten egg. Return to oven and bake until dry and set, about 3 minutes longer. (Brushing crust with egg and baking will prevent a soggy crust.)",
        "Whisk pumpkin purée, sour cream, bourbon, cinnamon, salt, ginger, nutmeg, allspice, mace, if using, and remaining 3 eggs in a large bowl; set aside.",
        "Pour maple syrup into a small saucepan; scrape in seeds from vanilla bean (reserve pod for another use) or add vanilla extract and bring syrup to a boil. Reduce heat to medium-high and simmer, stirring occasionally, until mixture is thickened and small puffs of steam start to release, about 3 minutes. Remove from heat and add cream in 3 additions, stirring with a wooden spoon after each addition until smooth. Gradually whisk hot maple cream into pumpkin mixture.",
        "Place pie dish on a rimmed baking sheet and pour in filling. Bake pie, rotating halfway through, until set around edge but center barely jiggles, 50–60 minutes. Transfer pie dish to a wire rack and let pie cool.",
        "Just before serving, sprinkle pie with granulated sugar and, using a kitchen torch, brûlée until sugar is melted and dark brown.",
        "DO AHEAD: Pie can be baked 1 day ahead (do not brûlée). Cover and chill."
    ],
    "ingredients": [
        "1/4 cup plus 1 tablespoon Dutch-process unsweetened cocoa powder",
        "3 1/2 tablespoons granulated sugar",
        "1 teaspoon kosher salt",
        "1 1/4 cups plus 1 tablespoon all-purpose flour plus more for dusting",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into pieces",
        "2 tablespoons chilled vegetable shortening, cut into pieces",
        "1 large egg yolk",
        "1/2 teaspoon apple cider vinegar",
        "All-purpose flour (for dusting)",
        "4 large eggs",
        "1 15-ounce can pure pumpkin purée",
        "1/4 cup sour cream",
        "2 tablespoons bourbon",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon ground allspice",
        "1/8 teaspoon ground mace (optional)",
        "3/4 cup pure maple syrup, preferably grade B",
        "1/2 vanilla bean, split lengthwise, or 1 teaspoon vanilla extract",
        "1 cup heavy cream",
        "2 tablespoons granulated sugar",
        "Special equipment: A kitchen torch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Pumpkin",
        "Fall",
        "Christmas Eve",
        "Potluck",
        "Maple Syrup",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Brûléed Bourbon-Maple Pumpkin Pie",
    "url": "http://www.epicurious.com/recipes/food/views/bruleed-bourbon-maple-pumpkin-pie-51198720"
}
