{
    "directions": [
        "On lightly floured surface, gently roll each sheet of puff pastry into a 12-inch square. Lay 1 sheet puff pastry into a deep-dish pie plate or springform pan; set aside.",
        "Melt 1/4 cup butter in a large skillet until sizzling. Add potatoes, onion, 1/4 teaspoon salt, and 1/4 teaspoon pepper. Cover and cook over medium-high heat, turning occasionally, until potatoes are lightly browned, crisp, and tender, 12 to 15 minutes. Remove from heat and set aside.",
        "Combine the eggs, parsley, a pinch of salt and pepper, and 2 tablespoons water in a bowl and whisk well. Melt 1 tablespoon butter in a clean skillet over medium heat until butter sizzles.",
        "Pour half of omelet mixture (3/4 cup) into heated skillet. Cook over medium heat. As omelet mixture sets, lift edges slightly with spatula to allow uncooked portion to flow underneath. Continue cooking until set, about 2 to 3 minutes. Slide omelet onto cookie sheet. Repeat with remaining tablespoon of butter and omelet mixture.",
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Layer ingredients into pie plate on top of puff pastry in the following order: one of the omelets, 4 ounces ham, half of the fried potatoes, and 1 cup shredded cheese. Top with remaining potatoes, ham, cheese, and omelet. Cover the torte with the remaining sheet of puff pastry. Press together edges of both sheets of puff pastry to form a rim; trim off excess. Crimp or flute edges. The torte can now be refrigerated overnight (see Cook's Note).",
        "In small bowl, whisk together 1 egg and 1 tablespoon water; brush over puff pastry.",
        "Bake in preheated oven until the pastry is a rich golden brown, 30 to 35 minutes. Let stand at least 5 minutes; cut into wedges. You may serve the torte warm or at room temperature."
    ],
    "ingredients": [
        "1 (17.5 ounce) package frozen puff pastry sheets, thawed",
        "Potatoes:",
        "1/4 cup butter",
        "6 red potatoes, peeled and sliced 1/8 inch thick",
        "1 onion, thinly sliced into rings",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "Omelet:",
        "2 tablespoons butter, divided",
        "6 eggs",
        "1/4 cup chopped fresh parsley",
        "1 pinch salt",
        "1 pinch black pepper",
        "2 tablespoons water",
        "Filling:",
        "8 ounces cooked ham, thinly sliced",
        "2 cups shredded Cheddar cheese, divided",
        "1 egg",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Brunch Omelet Torte",
    "url": "http://allrecipes.com/recipe/24139/brunch-omelet-torte/"
}
