{
    "directions": [
        "In a bowl whisk together the egg white and 1 tablespoon of the cornstarch, add the chicken, and let the mixture stand for 10 minutes. In a large saucepan of boiling salted water cook the Brussels sprouts for 2 1/2 minutes, or until they are just crisp-tender, drain them in a colander, and refresh them under cold water.",
        "Heat a wok over moderately high heat and in it heat the peanut oil until it is hot but not smoking. Add the chicken, drained, stir-fry it for 45 seconds to 1 minute, or until it is opaque and just firm, and transfer it with a slotted spoon to a bowl. Heat the oil remaining in the wok until it is hot but not smoking and in it stir-fry the shallot, the garlic, and the gingerroot for 30 seconds. Add the bell pepper and stir-fry the mixture for 2 minutes. Add the scallions and the Brussels sprouts and stir-fry the mixture for 1 minute. In a small bowl whisk together the soy sauce, the sugar, the vinegar, the broth, the sesame oil, the remaining 1 teaspoon cornstarch, and the cold water, make a well in the center of the vegetables, and whisk the soy sauce mixture into the well. Bring the liquid to a boil, stir together the vegetable mixture to combine it well,and simmer it for 1 minute. Stir in the chicken and the water chestnuts, season the stir-fry with salt and pepper, and cook it for 30 seconds, or until the chicken is heated through."
    ],
    "ingredients": [
        "1 large egg white",
        "1 tablespoon plus 1 teaspoon cornstarch",
        "1 whole boneless skinless chicken breast (about 3/4 pound), cut into 3/4-inch pieces",
        "2 pints Brussels sprouts, trimmed and halved or, if large, quartered",
        "1/4 cup peanut or vegetable oil",
        "1 shallot, minced",
        "1 garlic clove, minced",
        "1 tablespoon plus 1 teaspoon minced peeled fresh gingerroot",
        "1 red bell pepper, cut into 3/4-inch pieces",
        "6 scallions, cut diagonally into 3/4-inch pieces (about 1 1/4 cups)",
        "3 tablespoons soy sauce",
        "1 teaspoon sugar",
        "1 1/2 tablespoons rice vinegar (available at Oriental markets and many supermarkets)",
        "1/3 cup chicken broth",
        "1 teaspoon Oriental sesame oil",
        "1 teaspoon cold water",
        "an 8-ounce can water chestnuts, sliced thin, blanched in boiling water for 30 seconds, and refreshed under cold water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Stir-Fry",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Fall",
        "Brussel Sprout",
        "Gourmet"
    ],
    "title": "Brussels Sprout and Chicken Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/brussels-sprout-and-chicken-stir-fry-10662"
}
