{
    "directions": [
        "Whisk oyster sauce, soy sauce, vinegar, and 1/4 cup water in a small bowl; set sauce aside.",
        "Heat 2 tablespoons oil in a large skillet over medium-high heat. Add brussels sprouts and cook, tossing occasionally, until golden brown, about 4 minutes. Cover and cook until crisp-tender, about 3 minutes longer. Transfer to a plate; wipe out skillet.",
        "Season steak with salt. Heat 1 tablespoon oil in same skillet over high heat until just beginning to smoke. Add steak in a single layer; cook until browned, about 3 minutes. Turn and cook until nearly cooked through, about 30 seconds. Add to brussels sprouts.",
        "Heat remaining 1 tablespoon oil in same skillet. Add scallion whites, garlic, and ginger and stir until fragrant, about 1 minute, adjusting heat as needed. Add carrots and chile and cook, tossing occasionally, until carrots are slightly softened, about 2 minutes.",
        "Return brussels sprouts and steak to skillet and add reserved sauce. Cook, tossing occasionally, until sauce is thickened, about 3 minutes. Serve with steamed rice and garnish with scallion greens."
    ],
    "ingredients": [
        "3 tablespoons oyster sauce",
        "3 tablespoons reduced-sodium soy sauce",
        "2 tablespoons unseasoned rice vinegar",
        "4 tablespoons vegetable oil, divided",
        "1 pound brussels sprouts, halved",
        "8 ounces flank or skirt steak, thinly sliced against the grain",
        "Kosher salt",
        "4 scallions, whites chopped, greens sliced",
        "3 garlic cloves, sliced",
        "2 tablespoons chopped peeled ginger",
        "2 medium carrots, peeled, thinly sliced on a diagonal",
        "1 Fresno chile or jalapeño, sliced into rings",
        "Steamed rice (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Stir-Fry",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Steak",
        "Winter",
        "Healthy",
        "Low Cholesterol",
        "Brussel Sprout",
        "Quick and Healthy",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Brussels Sprouts and Steak Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/brussels-sprouts-and-steak-stir-fry-51148620"
}
