{
    "directions": [
        "Blanch salt pork in a large saucepan of boiling water for 1 minute. Using a slotted spoon, transfer salt pork to a paper towel- lined plate to drain. Set aside. DO AHEAD: Salt pork can be blanched 1 day ahead. Cover and chill.",
        "Cook salt pork in a large heavy skillet over medium heat, stirring occasionally, until about 3/4 cup fat is rendered, 10-12 minutes. Carefully strain drippings into a small bowl; return 2 tablespoons drippings and pork to pan.",
        "Increase heat to medium-high and cook, stirring occasionally, until salt pork is browned and crisp, 5-6 minutes. Transfer to paper towels to drain.",
        "Reduce heat to medium. Add 2 tablespoons drippings to skillet; add shallots, cut sides down. Cook, turning once or twice, until tender and browned, 10-12 minutes. Season with salt and pepper. Transfer shallots to a serving platter.",
        "Increase heat to medium-high. Add 2 tablespoons more salt pork drippings to skillet. Working in 2 batches and adding 2 more tablespoons drippings between batches, cook brussels sprouts, turning occasionally, until tender and browned. Transfer brussels sprouts to platter with shallots. DO AHEAD: Shallots and brussels sprouts can be made 1 hour ahead. Let stand at room temperature. Rewarm shallots and brussels sprouts together in same skillet over medium heat before continuing.",
        "Drizzle shallots and brussels sprouts with 1 tablespoon pickle juice. Season to taste with salt and pepper and 1 tablespoon more pickle juice, if desired. Scatter salt pork over."
    ],
    "ingredients": [
        "1 cup 1/4\" cubes salt pork or pancetta (about 8 ounces)",
        "2 large shallots, peeled, quartered (about 1 1/2 cups)",
        "Kosher salt and freshly ground black pepper",
        "1 1/2 pounds brussels sprouts, outer leaves removed, trimmed, halved",
        "1-2 tablespoons juice from jarred dill pickles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Side",
        "Sauté",
        "Thanksgiving",
        "High Fiber",
        "Fall",
        "Winter",
        "Low Cholesterol",
        "Brussel Sprout",
        "Shallot",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Brussels Sprouts with Shallots and Salt Pork",
    "url": "http://www.epicurious.com/recipes/food/views/brussels-sprouts-with-shallots-and-salt-pork-51124240"
}
