{
    "directions": [
        "Make the caponata: In a heavy skillet heat 2 tablespoons of the oil over moderately high heat until it hot but not smoking, in it cook the eggplant, stirring, for 3 to 5 minutes, or until it is tender, and transfer it to a bowl. To the skillet add the remaining 2 tablespoons oil and in it cook the onion and the celery over moderate heat, stirring, for 5 minutes. Add the olives, the capers, the vinegar, the sugar, the raisins, the pine nuts, and the tomatoes and cook the mixture, covered, stirring occasionally, for 5 to 10 minutes, or until it is cooked through and the celery is tender, and transfer it to the bowl. Stir in the parsley, let the caponata cool, and chill it, covered,overnight. Season the caponata with salt and pepper.",
        "Make the bruschetta: Grill the bread on an oiled rack set about 4 inches over glowing coals for 1 minute on each side, brush the toasts on one side with the oil, and sprinkle them with salt to taste.",
        "Top each toast generously with some of the caponata, arrange 2 or 3 toasts on each of 4 plates, and garnish each serving with the parsley sprigs."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "3-1/2 cups 1/4-inch dice unpeeled eggplant (about 1-1/4 pounds)",
        "3/4 cup finely chopped onion",
        "1/3 cup finely chopped celery",
        "1/3 cup chopped pitted green olives",
        "3 tablespoons chopped drained bottled capers",
        "1/4 cup red-wine vinegar",
        "1-1/2 tablespoons sugar, or to taste",
        "3 tablespoons golden raisins",
        "3 tablespoons pine nuts, toasted lightly",
        "3 plum tomatoes, cut into 1/4-inch diced (about 1 cup)",
        "1/4 cup finely chopped flat-leafed parsley leaves",
        "eight to twelve 1/2-inch-thick diagonal slices of country-style Italian bread",
        "flat-leafed parsley sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Sauté",
        "Vegetarian",
        "Vinegar",
        "Raisin",
        "Pine Nut",
        "Eggplant",
        "Chill",
        "Healthy",
        "Vegan",
        "Capers",
        "Gourmet"
    ],
    "title": "Bruschetta with Caponata",
    "url": "http://www.epicurious.com/recipes/food/views/bruschetta-with-caponata-12343"
}
