{
    "directions": [
        "Cook onions in large pot of boiling salted water until tender, about 5 minutes. Using large strainer, transfer onions to bowl; set aside to cool. Return water to boil; add more salt. Add brussels sprouts and boil until just tender, about 6 minutes. Drain well; cool. Peel onions, leaving core intact. Cut brussels sprouts in half through root end. (Can be prepared 1 day ahead. Combine vegetables in medium bowl; cover and chill.)",
        "Whisk 3 tablespoons horseradish, flour, and allspice in small bowl to blend; whisk in whipping cream. Melt butter in heavy large skillet over medium heat. Add chopped thyme and stir 30 seconds. Add vegetables and sauté until heated through, about 4 minutes. Add cream mixture and cook until vegetables are coated and cream mixture is reduced to glaze, stirring often, about 3 minutes. Season to taste with salt and pepper, adding more horseradish by 1/4 teaspoonfuls, if desired. Transfer vegetables to bowl. Garnish with thyme sprigs, if desired."
    ],
    "ingredients": [
        "1 10-ounce bag very small (1/2- to 3/4-inch-diameter) white pearl onions, unpeeled",
        "1 1/2 pounds small brussels sprouts, trimmed",
        "3 tablespoons (or more) prepared white horseradish",
        "2 teaspoons all purpose flour",
        "1/8 teaspoon ground allspice",
        "3/4 cup whipping cream",
        "3 tablespoons butter",
        "1 teaspoon chopped fresh thyme",
        "Fresh thyme sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Vegetable",
        "Side",
        "Sauté",
        "Thanksgiving",
        "Horseradish",
        "Fall",
        "Brussel Sprout",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Brussels Sprouts and Pearl Onions in Horseradish Cream",
    "url": "http://www.epicurious.com/recipes/food/views/brussels-sprouts-and-pearl-onions-in-horseradish-cream-107298"
}
