{
    "directions": [
        "Preheat oven to 325°F. Spray large sheet of foil with nonstick spray. Place pecans on small rimmed baking sheet. Whisk maple syrup, 1/2 teaspoon coarse salt, and 1/4 teaspoon pepper in small bowl. Add to nuts and toss to coat; spread in single layer. Bake nuts 5 minutes. Stir. Continue to bake nuts until toasted and glaze is bubbling thickly, about 6 minutes. Immediately transfer nuts to prepared foil and separate. Cool completely. DO AHEAD: Can be made 2 days ahead. Store airtight.",
        "Whisk mustard, vinegar, lemon juice, and sugar in small bowl; whisk in oil. Season with coarse salt and pepper.",
        "Bring large pot of water to boil. Add 1 tablespoon coarse salt. Add brussels sprouts. Cook until crisp-tender and still bright green, about 5 minutes. Drain; rinse with cold water. Cool on paper towels. Using processor fitted with 1/8- to 1/4-inch slicing disk, slice brussels sprouts. Transfer to large bowl. DO AHEAD: Dressing and brussels sprouts can be made 1 day ahead. Cover separately; chill.",
        "Toss brussels sprouts with enough dressing to coat. Let marinate 30 to 60 minutes. Mix in some pecans. Place slaw in serving bowl. Top with remaining pecans."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 cup large pecan halves",
        "1/4 cup pure maple syrup",
        "1/2 teaspoon plus 1 tablespoon coarse kosher salt plus additional for seasoning",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 cup whole grain Dijon mustard",
        "2 tablespoons apple cider vinegar",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon sugar",
        "1/4 cup vegetable oil",
        "1 1/2 pounds brussels sprouts, trimmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mustard",
        "Side",
        "Marinate",
        "Thanksgiving",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Pecan",
        "Fall",
        "Healthy",
        "Brussel Sprout",
        "Potluck",
        "Maple Syrup",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Brussels Sprout Slaw with Mustard Dressing and Maple-Glazed Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/brussels-sprout-slaw-with-mustard-dressing-and-maple-glazed-pecans-355785"
}
