{
    "directions": [
        "Put oven rack in upper third of oven and preheat oven to 450°F.",
        "Toss Brussels sprouts with oil, garlic, salt, and pepper, then spread out in 1 layer in 2 large shallow baking pans (17 by 12 inches). Roast, stirring occasionally and switching position of pans halfway through roasting, until tender and browned, 25 to 35 minutes.",
        "Heat oil in a 10-inch heavy skillet over moderate heat until temperature measures 250°F (see cooks' note, below), then fry shallots in 3 batches, stirring occasionally, until golden brown, 3 to 5 minutes per batch (watch closely, as shallots can burn easily). Quickly transfer with a slotted spoon to paper towels to drain, spreading in a single layer. (Shallots will crisp as they cool.) Pour off oil from skillet (do not clean).",
        "Heat 5 tablespoons butter in skillet over moderately high heat until foam subsides, then sauté mushrooms, stirring occasionally, until golden brown and tender, about 7 minutes.",
        "Add wine, thyme, salt, and pepper and boil, uncovered, stirring occasionally, until liquid is reduced to a glaze, about 2 minutes. Add water (1/2 cup) and remaining tablespoon butter and simmer, swirling skillet, until butter is melted. Transfer to a serving dish and stir in Brussels sprouts. Sprinkle with some of shallots and serve with remaining shallots on the side."
    ],
    "ingredients": [
        "3 lb Brussels sprouts, trimmed and halved lengthwise",
        "1/4 cup olive oil",
        "1/2 tablespoon minced garlic",
        "1 teaspoon salt",
        "1 cup vegetable oil",
        "1/2 lb large shallots (about 6), cut crosswise into 1/8-inch-thick slices and separated into rings (2 1/2 cups)",
        "3/4 stick (6 tablespoons) unsalted butter",
        "1 1/4 lb mixed fresh wild mushrooms such as chanterelle and oyster, trimmed, quartered if large",
        "1/4 cup dry white wine",
        "1 tablespoon chopped fresh thyme",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/2 cup water",
        "Special equipment: a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Mushroom",
        "Vegetable",
        "Side",
        "Roast",
        "Sauté",
        "Christmas",
        "Thanksgiving",
        "Fall",
        "Winter",
        "Brussel Sprout",
        "Shallot",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Brussels Sprouts with Shallots and Wild Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/brussels-sprouts-with-shallots-and-wild-mushrooms-236410"
}
