{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.",
        "Place the Brussels sprouts in a saucepan with about 1 inch of water. Bring to a boil, cover, and simmer over medium-low heat until they are bright green and tender, 5 to 7 minutes. Remove from the heat, drain, and allow to cool.",
        "Mix the lemon juice, balsamic vinegar, honey, olive oil, salt, and black pepper in a bowl; set aside.",
        "Place the cooled Brussels sprouts into the work bowl of a food processor. Add basil, onion, walnuts, and almonds; process until the mixture is finely chopped, about 15 seconds. Remove Brussels sprouts mixture to a bowl, and mix in the feta cheese and lemon juice mixture to form a moist filling.",
        "Lay the 2 sheets of puff pastry out on a work surface. Divide the filling in half, and spoon and pat half the filling on each square. Leave about 3/4 inch of puff pastry bare at one end of the square. Roll each square up into a roll, and pinch the unfilled end of the pastry sheet closed. Place the filled rolls onto the prepared baking sheet, seam sides down.",
        "Bake in the preheated oven until golden brown, about 20 minutes. Serve hot."
    ],
    "ingredients": [
        "15 Brussels sprouts, trimmed and cut in half",
        "2 tablespoons fresh lemon juice",
        "3 tablespoons balsamic vinegar, or to taste",
        "1 teaspoon honey, or to taste",
        "1/4 cup olive oil",
        "salt and ground black pepper to taste",
        "1/4 cup chopped fresh basil",
        "1 small white onion, chopped",
        "1/4 cup walnuts",
        "1/4 cup almonds",
        "1 (6 ounce) container sheep-milk feta cheese, crumbled",
        "2 (8 inch) square sheets of frozen puff pastry, thawed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Brussels Sprouts and Feta Pastry Roll",
    "url": "http://allrecipes.com/recipe/216810/brussels-sprouts-and-feta-pastry-roll/"
}
