{
    "directions": [
        "Preheat oven to 425°F. Stir 6 tablespoons oil, garlic, rosemary, 1 teaspoon coarse salt, and 1 teaspoon pepper in large bowl to blend. Add tomato quarters and stir to coat. Let stand 5 minutes. Line rimmed baking sheet with foil. Lift tomatoes from marinade and arrange, cut side down, on prepared baking sheet (reserve marinade for toasts).",
        "Roast tomatoes until skin is browned and blistered and tomatoes are very tender, about 35 minutes. Cool tomatoes on sheet. Maintain oven temperature.",
        "Meanwhile, arrange bread slices on another rimmed baking sheet. Brush top of each with reserved marinade (including garlic and rosemary bits).",
        "Roast bread until top is golden, 10 to 12 minutes. Cool toasts on sheet.",
        "Spread 1 tablespoon ricotta cheese on each toast; sprinkle with pepper. Fold prosciutto halves over and place on ricotta. Arrange 2 tomato quarters atop prosciutto. Whisk lemon juice and remaining 1 teaspoon oil in medium bowl to blend; season with salt and pepper. Add microgreens and toss to coat. Top bruschetta with microgreens. Arrange on platter and serve."
    ],
    "ingredients": [
        "6 tablespoons plus 1 teaspoon extra-virgin olive oil",
        "2 large garlic cloves, minced",
        "2 teaspoons finely chopped fresh rosemary",
        "1 teaspoon coarse kosher salt",
        "1 teaspoon freshly ground black pepper",
        "6 large plum tomatoes (about 1 1/2 pounds), quartered lengthwise",
        "12 1/2-inch-thick diagonally cut baguette slices (each 3 to 4 inches long)",
        "12 tablespoons ricotta cheese, divided",
        "6 thin prosciutto slices, cut in half crosswise",
        "1 teaspoon fresh lemon juice",
        "1 cup microgreens or baby arugula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Appetizer",
        "Side",
        "Bake",
        "High Fiber",
        "Backyard BBQ",
        "Buffet",
        "Ricotta",
        "Rosemary",
        "Summer",
        "Prosciutto",
        "Party",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Bruschetta with Rosemary, Roasted Plum Tomatoes, Ricotta and Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/bruschetta-with-rosemary-roasted-plum-tomatoes-ricotta-and-prosciutto-360252"
}
