{
    "directions": [
        "To make the pineapple glaze, in a small saucepan over medium heat, combine the pineapple, brown sugar, vinegar, garam masala and tomato paste. Bring to a simmer, then reduce the heat to medium-low to maintain a low simmer. Cook, stirring occasionally, until the liquid has reduced and the mixture is the consistency of marmalade, 35 to 40 minutes. Let cool for 10 minutes. Transfer to a blender and puree on high speed until the glaze is completely smooth, about 30 seconds. Transfer to a bowl and let cool to room temperature. Refrigerate until ready to use. (The glaze can be stored in an airtight container for up to 1 week.)",
        "Preheat an oven to 350°F. Lightly oil a 2-lb. loaf pan.",
        "To make the meat loaf, in a small bowl, stir together the oats and milk; set aside. In a large nonstick fry pan over medium heat, warm 1 tsp. of the oil. Add the mushrooms and cook, stirring occasionally, until lightly browned, about 5 minutes. Add the thyme, sage, rosemary and garlic and cook, stirring constantly, until fragrant, about 2 minutes. Transfer to a bowl.",
        "In the same pan over medium heat, warm the remaining 1 tsp. oil. Add the onion, carrot, celery and celery root and cook, stirring occasionally, until the vegetables just begin to soften, 6 to 8 minutes. Transfer to the bowl with the mushrooms and let cool for 10 minutes.",
        "In the bowl of an electric mixer fitted with the flat beater, combine the ground beef, eggs, salt, pepper, Worcestershire sauce and mustard. Beat on medium-low speed until just combined, about 20 seconds. Add the oat mixture and vegetable mixture and beat until well combined, about 30 seconds.",
        "Transfer the mixture to the prepared loaf pan. Spread the pineapple glaze evenly on top of the meat loaf. Bake until an instant-read thermometer inserted into the center of the meat loaf registers 160°F, about 1 hour. Let the meat loaf rest for 10 minutes, then turn it out onto a cutting board and cut into slices. Serves 6.",
        "Recipe by Chef Bryan Voltaggio"
    ],
    "ingredients": [
        "2 cups diced pineapple",
        "3 Tbs. firmly packed light brown sugar",
        "2 Tbs. rice vinegar",
        "1/2 tsp. garam masala",
        "2 Tbs. tomato paste",
        "",
        "1 cup quick-cooking oats",
        "1 cup low-fat milk",
        "2 tsp. canola oil",
        "1 cup diced shiitake mushroom caps",
        "1 Tbs. fresh thyme leaves",
        "1 tsp. thinly sliced fresh sage",
        "1 tsp. finely chopped fresh rosemary",
        "3 garlic cloves, thinly sliced",
        "3/4 cup diced yellow onion",
        "1/2 cup diced carrot",
        "1/2 cup diced celery",
        "1/2 cup diced celery root",
        "2 lb. ground beef (85% lean)",
        "2 eggs, lightly beaten",
        "1 Tbs. kosher salt",
        "1/2 tsp. freshly ground pepper",
        "1 tsp. Worcestershire sauce",
        "1 tsp. Dijon mustard"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Bryan Voltaggio’s Meat Loaf",
    "url": "http://www.williams-sonoma.com/recipe/bryan-voltaggios-meat-loaf.html"
}
