{
    "directions": [
        "Microwave rosemary on high in 20-second intervals until leaves are brittle, about 60 seconds. Remove leaves and grind to a fine powder with a spice mill or mortar and pestle; you should have about 1 teaspoon (Alternatively, very finely chop leaves.)",
        "Cook guanciale in a large skillet over medium heat, stirring often, until guanciale is browned and crisp, 10–12 minutes. Transfer to a bowl with a slotted spoon.",
        "Cook onion in same skillet over medium heat, stirring often, until softened and golden brown, 8–10 minutes. Return all but 2 tablespoons guanciale to skillet and add tomatoes, red pepper flakes, and rosemary powder. Bring to a boil, reduce heat, and simmer, stirring occasionally, until sauce is thickened, 5–8 minutes.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente, 8–10 minutes. Drain pasta, reserving 1 cup pasta cooking liquid",
        "Add pasta and 1/2 cup pasta cooking liquid to sauce. Cook over medium heat, tossing and adding more cooking liquid as needed, until sauce coats pasta, about 2 minutes.",
        "Serve pasta topped with Pecorino and remaining 2 tablespoons guanciale and drizzled with oil."
    ],
    "ingredients": [
        "1 sprig rosemary",
        "4 ounces guanciale (salt-cured pork jowl) or pancetta, very thinly sliced",
        "1/2 medium red onion, finely chopped",
        "1 15-ounce can crushed tomatoes",
        "1 teaspoon crushed red pepper flakes",
        "12 ounces bucatini",
        "Kosher salt",
        "1 ounce Pecorino, finely grated",
        "Olive oil (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Pork",
        "Tomato",
        "Rosemary"
    ],
    "title": "Bucatini with Tomato, Guanciale, and Chile",
    "url": "http://www.epicurious.com/recipes/food/views/bucatini-with-tomato-guanciale-and-chile-51248450"
}
