{
    "directions": [
        "1. Bring a large pot of salted water to a boil for pasta. In a large skillet over medium-high heat, add the olive oil. Add the sausage. Cook and crumble with a wooden spoon until the sausage is well browned, about 4 minutes. Reduce the heat to medium, add the onion, red bell pepper, and yellow bell pepper and cook until wilted, about 8 minutes, adding a splash of pasta water if the pan seems dry at any point.",
        "2. Add the garlic and cook until fragrant, about 1 minute. Pour in the wine and reduce, about 2 minutes. Add the tomatoes and 2 cups pasta water. Stir in the oregano and season with salt and red pepper flakes. Adjust the heat to maintain a simmer and cook until thick and flavorful, about 20 minutes.",
        "3. When the sauce is almost ready, add the bucatini to the boiling water. When the pasta is al dente, remove it with tongs and add directly to the sauce, reserving the pasta water. Add the parsley. Toss to coat the pasta in the sauce, adding a splash of pasta water if the pasta seems dry. Remove the skillet from the heat, sprinkle with the grated Grana Padano, toss, and serve."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "8 ounces sweet Italian turkey sausage (2 links), removed from casings",
        "1 large onion, sliced (about 11/2 cups)",
        "1 medium red bell pepper, sliced (about 1 1/2 cups)",
        "1 medium yellow bell pepper, sliced (about 1 1/2 cups)",
        "4 garlic cloves, thinly sliced",
        "1/4 cup dry white wine",
        "1 (28-ounce) can whole San Marzano tomatoes, crushed by hand",
        "1 teaspoon dried oregano, preferably Sicilian on the branch",
        "Kosher salt",
        "Crushed red pepper flakes",
        "1 pound bucatini",
        "1/2 cup fresh Italian parsley leaves, chopped",
        "1/2 cup freshly grated Grana Padano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "turkey",
        "Low Fat",
        "Kid-Friendly",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Bell Pepper",
        "Healthy",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Bucatini with Sausage and Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/bucatini-with-sausage-and-peppers-56389445"
}
