{
    "directions": [
        "Cook pancetta in medium skillet over medium heat until brown, stirring often, about 8 minutes. Using slotted spoon, transfer pancetta to paper towels; drain. Pour off all but 2 tablespoons drippings from skillet. Add cream, garlic, and crushed pepper to drippings in skillet; bring to boil. Set aside.",
        "Heat oil in heavy large skillet over medium-high heat. Add zucchini; sauté until tender, stirring occasionally, about 10 minutes. Transfer to large plate. Season to taste with salt and pepper. (Pancetta, cream mixture, and zucchini can be made 2 hours ahead. Let stand at room temperature.)",
        "Cook pasta in large pot of boiling salted water until just tender but still firm to bite. Drain well. Return pasta to pot.",
        "Meanwhile, place eggs in their shell in small bowl. Add enough hot water to cover. Let stand 5 minutes. Crack eggs into large bowl and whisk to blend. Bring cream mixture to boil in skillet. Gradually whisk hot cream mixture into eggs. Mix in 1/2 cup Parmesan cheese.",
        "Add sauce to pasta and toss over medium heat until sauce coats pasta (do not boil). Add pancetta and zucchini and toss to heat through. Season with salt and pepper. Serve, passing remaining cheese."
    ],
    "ingredients": [
        "6 ounces sliced pancetta or bacon, cut into 1/4-inch-wide strips",
        "1/2 cup whipping cream",
        "1 garlic clove, finely chopped",
        "1/4 teaspoon dried crushed red pepper",
        "2 tablespoons olive oil",
        "1 1/2 pounds zucchini, thinly sliced",
        "1 pound bucatini or spaghetti",
        "3 large eggs",
        "1 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Pasta",
        "Vegetable",
        "Appetizer",
        "Sauté",
        "Parmesan",
        "Bacon",
        "Zucchini",
        "Summer",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Bucatini Carbonara with Zucchini",
    "url": "http://www.epicurious.com/recipes/food/views/bucatini-carbonara-with-zucchini-106322"
}
