{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch jelly roll pan with 1 teaspoon butter and line with parchment paper. Grease parchment paper with 1 teaspoon butter.",
        "Whisk flour, cocoa powder, and salt together in a small bowl.",
        "Combine egg yolks, 1/4 cup confectioners' sugar, and vanilla extract in a bowl; beat with an electric mixer on medium-high speed until pale yellow, 3 to 4 minutes.",
        "Clean the beaters of the electric mixer. Beat egg whites in a bowl on medium-high speed until foamy, 1 to 2 minutes. Gradually add 1/2 cup confectioners' sugar and beat until stiff peaks form, 2 to 3 minutes more.",
        "Fold egg yolk mixture gently into the egg whites. Fold flour mixture in gradually until batter is smooth.",
        "Pour batter into the prepared jelly roll pan and spread evenly with an offset spatula.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 8 to 10 minutes. Let cool, about 30 minutes.",
        "Combine 1 cup heavy cream, 3 tablespoons confectioners' sugar, and sour cream in a bowl; blend with an electric mixer on medium-high speed until stiff, 1 to 2 minutes.",
        "Turn the jelly roll pan so the shorter side faces you. Spread whipped cream over the cake, leaving a 2-inch border at the top. Roll up cake toward the uncovered border, letting the parchment paper fall away as you roll. Place roll seam-side down on a serving platter.",
        "Place 1/2 cup heavy cream in a small saucepan over medium-low heat until warmed through, 3 to 5 minutes. Remove from heat and stir in chocolate chips. Let stand until chocolate softens, about 3 minutes. Stir with a spatula or wooden spoon until ganache is smooth and creamy.",
        "Drizzle chocolate ganache over rolled cake. Let stand until set, about 5 minutes. Run a fork through the ganache to create a tree bark effect."
    ],
    "ingredients": [
        "Cake:",
        "2 teaspoons butter",
        "1/3 cup all-purpose flour, sifted",
        "1/3 cup unsweetened cocoa powder",
        "1/4 teaspoon fine salt",
        "4 eggs, separated",
        "3/4 cup confectioners' sugar, divided",
        "1 teaspoon vanilla extract",
        "Whipped Cream Filling:",
        "1 cup heavy whipping cream",
        "3 tablespoons confectioners' sugar",
        "1 tablespoon sour cream",
        "Chocolate Ganache:",
        "1/2 cup heavy whipping cream",
        "8 ounces dark chocolate chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Buche de Noel (Yule Log)",
    "url": "http://allrecipes.com/recipe/255736/buche-de-noel-yule-log/"
}
