{
    "directions": [
        "Whisk eggs, sugar, and salt in a large bowl to combine. Whisk in milk, followed by all-purpose flour, then buckwheat flour. Blend batter with 4 Tbsp. butter just to incorporate. Strain through a fine-mesh sieve into a medium bowl. Cover and chill batter at least 12 hours to allow flour to hydrate.",
        "Let batter sit at room temperature 1 hour before cooking.",
        "Stir briskly to reincorporate flour that will have settled to the bottom. Batter should be the consistency of heavy cream (adjust with more flour if too thin or milk if too thick). Heat a 10\" nonstick skillet over medium. Brush skillet lightly with remaining 1 Tbsp. butter. Lift pan away from heat and pour 1/4 cup batter in the middle of skillet and quickly swirl pan to distribute batter evenly. Cook until crêpe begins to set and edges brown, about 2 minutes. Carefully loosen with a heatproof rubber spatula, flip, and cook until other side is lightly browned, about 1 minute. Stir batter to reincorporate; make another crêpe with 1/4 cup batter. (Recipe yields enough batter for 8 crêpes; reserve extra for coming days.)",
        "Preheat oven to 450°F. Heat oil in a medium skillet over medium-high. Add leeks, season with salt, and cook, stirring occasionally, until beginning to soften (do not let brown), about 5 minutes. Add cream, lemon zest, lemon juice, and cayenne; season with salt. Bring to a simmer; cook until leeks are very soft and most of cream has reduced, 6–8 minutes.",
        "Place 2 crêpes on a parchment-lined baking sheet. Evenly spread 1/4 cup warm leek mixture over each crêpe, leaving a 2\" border around edges. Make a well in the center and crack 1 egg into each; season with salt. Bake until egg whites are cooked through but yolks are still runny, 6–8 minutes. Remove from oven and fold edges of crêpes up and in toward centers. Top with dill and black pepper.",
        "Batter can be made 2 days ahead. Keep chilled."
    ],
    "ingredients": [
        "3 large eggs",
        "1 tablespoon sugar",
        "1/4 teaspoon kosher salt",
        "2 cups whole milk",
        "3/4 cup all-purpose flour",
        "1/2 cup buckwheat flour or all-purpose flour",
        "4 tablespoons unsalted butter, melted, plus 1 tablespoon room temperature",
        "2 tablespoons olive oil",
        "2 medium leeks, white and pale-green parts only, halved lengthwise, thinly sliced",
        "Kosher salt",
        "1/2 cup heavy cream",
        "1/4 teaspoon finely grated lemon zest",
        "1/2 teaspoon fresh lemon juice",
        "Pinch of cayenne pepper",
        "2 large eggs",
        "Chopped dill (for serving)",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Crêpe",
        "Breakfast",
        "Brunch",
        "Egg",
        "Leek",
        "Bake",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Buckwheat Crêpes With Creamy Leeks and Baked Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/buckwheat-crepes-with-creamy-leeks-and-baked-eggs"
}
