{
    "directions": [
        "Position a rack in the center of the oven and preheat the oven to 425°F. Line a baking sheet with two layers of parchment paper.",
        "In a large bowl, thoroughly whisk the flours, sugar, baking powder, and salt. Make a well in the center and pour the cream into it (set the measuring cup aside) and add the grated frozen butter. Use a rubber spatula to push the dry ingredients from the sides of the bowl into the well, cutting and turning the mixture just until the dry ingredients are almost entirely moistened and the dough looks rough and shaggy. Gather the dough into a ball and knead it gently against the sides of the bowl five or so times, pressing loose pieces into the dough, until it just holds together (it should not be smooth) and the bowl is fairly clean.",
        "Turn the dough out onto a lightly floured board and pat into a circle about 3/4-inch thick. Using the biscuit cutter or an overturned glass, and re-patting the dough as needed, cut the dough into 8 even rounds. Place them at least 1 inch apart on the baking sheet. Brush the tops with the cream left in the bottom of the measuring cup or with a little milk, and sprinkle generously with turbinado sugar.",
        "Bake the shortcakes until the tops are just barely golden brown, 10 to 12 minutes. Immediately transfer to a wire rack to cool.",
        "Set a medium saucepan with 2 cups water over high heat and bring to a boil. Remove from heat, add tea bags, and let steep 3 minutes. Remove tea bags and add apricots, honey, and vanilla bean. Return to stove and bring to a simmer over medium-low heat; cook until the apricots are soft and the liquid has reduced to a thick syrup, 15 to 20 minutes. Remove vanilla bean.",
        "Meanwhile, in the chilled bowl of a stand mixer fitted with the whisk attachment, or using a medium mixing bowl and a handheld electric mixer or a whisk, whip the cream, adding the sugar as it begins to thicken. Continue beating until it holds a soft shape—not too stiff. (The cream can be covered and refrigerated for up to several hours. If liquid separates from the cream, whisk briefly before using.)",
        "To assemble the shortcakes, gently pull each shortcake apart horizontally into two equal halves. Place the bottom halves on serving plates. Top each with a generous scoop of apricot compote (about 2 tablespoons) and a dollop of whipped cream. Cover with the tops of the biscuits and serve."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons (5 ounces) all-purpose flour",
        "1/4 cup plus 2 tablespoons (1.75 ounces) buckwheat flour",
        "1/4 cup granulated sugar",
        "1 3/4 teaspoons baking powder, sifted if lumpy",
        "1/2 teaspoon salt",
        "1 cup heavy cream, plus extra for brushing",
        "2 tablespoons unsalted butter, frozen at least 1 hour and grated on a box grater",
        "Turbinado sugar, for sprinkling",
        "1 cup (6 ounces) dried apricots, sliced in half lengthwise",
        "2 Earl Grey teabags",
        "1 vanilla bean, slit lengthwise",
        "3 tablespoons honey",
        "1 1/4 cups heavy cream",
        "1 tablespoon granulated sugar",
        "Stand mixer with whisk attachment, electric hand mixer, or whisk (for whipped cream), 2 1/4-inch round biscuit cutter or equally sized straight-sided glass"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Tea",
        "Dessert",
        "Kid-Friendly",
        "Apricot",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Buckwheat Shortcakes with Earl-Grey Apricot Compote and Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/buckwheat-shortcakes-with-earl-grey-apricot-compote-and-whipped-cream-51262530"
}
