{
    "directions": [
        "Preheat oven to 350°F. Coat an 8 1/2x4 1/2\" loaf pan with nonstick spray, then line with parchment, letting it hang over on both of the longer sides. Whisk whole wheat flour, buckwheat flour, cinnamon, salt, baking soda, and baking powder in a medium bowl.",
        "Mash bananas and brown sugar in a large bowl until virtually no lumps of banana remain and brown sugar is dissolved. Mix in eggs, oil, and sour cream. Add dry ingredients and mix in with a rubber spatula. Scrape batter into prepared pan and smooth top.",
        "Bake cake until the top springs back when gently pressed and a tester inserted into the center comes out clean, 55–65 minutes. Transfer pan to a wire rack and let cake cool in pan 30 minutes. Turn out cake onto rack and let cool completely.",
        "Whisk cream cheese, yogurt, and salt in a large bowl until no lumps remain. Sift powdered sugar through a fine-mesh sieve into bowl and whisk vigorously to combine, then stir in espresso powder.",
        "Cake can be baked 4 days ahead. Store airtight at room temperature.\nFrosting can be made 3 days ahead. Cover and chill."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 cup whole wheat flour",
        "1/2 cup buckwheat flour or whole wheat flour",
        "2 teaspoons ground cinnamon",
        "1 teaspoon kosher salt",
        "1 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "4 very ripe bananas",
        "2/3 cup (packed) dark brown sugar",
        "2 large eggs, beaten to blend",
        "1/2 cup olive oil",
        "1/2 cup sour cream",
        "4 ounces cream cheese, room temperature",
        "1/2 cup plain Greek yogurt",
        "Pinch of kosher salt",
        "1/3 cup powdered sugar",
        "1/2 teaspoon espresso powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Banana",
        "Whole Wheat",
        "Healthy",
        "Breakfast",
        "Cream Cheese",
        "Yogurt",
        "Coffee",
        "Cake",
        "Dessert",
        "Brunch",
        "Potluck"
    ],
    "title": "Buckwheat Banana Cake With Yogurt-Espresso Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/buckwheat-banana-cake-with-yogurt-espresso-frosting"
}
