{
    "directions": [
        "Whisk first 5 ingredients in medium bowl.",
        "Place milk and butter in small saucepan. Stir over low heat until butter melts and thermometer registers 110°F (if mixture gets too warm, cool until temperature returns to 110°F). Pour warm milk mixture into flour mixture and whisk until smooth. Cover with plastic wrap and let stand in warm draft-free area until doubled in volume, 1 to 1 1/2 hours.",
        "Whisk buckwheat batter to deflate; then whisk in eggs. Do ahead Can be prepared 1 day ahead. Transfer to large bowl. Cover; chill (may increase in volume; rewhisk before using).",
        "Preheat oven to 200°F. Heat griddle or large skillet over medium heat. Brush lightly with melted butter. Working in batches, pour 2 tablespoons batter for each blini onto griddle, spacing apart. Cook until bubbles form on top and begin to pop, about 1 1/2 minutes. Turn blinis; cook until golden brown on bottom, about 1 1/2 minutes. Transfer to baking sheet. Tent with foil and place in oven to keep warm while cooking remaining blinis. Do ahead Blinis can be made 1 day ahead. Cool, cover, and chill. Brush blinis lightly with melted butter and rewarm on baking sheet in 350°F oven 5 minutes.",
        "Arrange warm blinis on platter. Spoon 1 rounded teaspoon crème fraîche atop each. Top with smoked salmon. Garnish with salmon roe and dill sprigs and serve."
    ],
    "ingredients": [
        "1/2 cup all purpose flour",
        "1/3 cup buckwheat flour",
        "4 teaspoons sugar",
        "1 1/4 teaspoons active dry yeast",
        "1/4 teaspoon (generous) salt",
        "1 cup whole milk",
        "3 tablespoons butter, cut into cubes",
        "2 large eggs, lightly beaten",
        "Melted butter",
        "Crème fraîche",
        "1 (4-ounce) package thinly sliced smoked salmon",
        "Salmon roe",
        "Fresh dill sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Herb",
        "Bake",
        "Cocktail Party",
        "Salmon"
    ],
    "title": "Buckwheat Blinis with Smoked Salmon and Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/buckwheat-blinis-with-smoked-salmon-and-creme-fraiche-236163"
}
