{
    "directions": [
        "Score flesh side of salmon fillet at 1 1/2-inch intervals 1/2 inch deep in crisscross pattern; sprinkle with salt and pepper. Heat large nonstick skillet over medium-high heat. Add salmon, skin side down. Cook until skin is lightly browned, 3 minutes. Turn salmon over and partially cook until just warm, 2 to 3 minutes. Transfer to plate. Cut salmon, including skin, into 1/2-inch pieces; cool.",
        "Heat same skillet over medium-high heat. Add 1 tablespoon butter, green onions and 2/3 of smoked salmon. Sauté 2 minutes; add reserved salmon. Toss until heated through. Remove from heat; add lemon juice, capers, and chopped dill. Season with salt and pepper.",
        "Melt 1 teaspoon butter in medium skillet over medium heat. Working with 1 crepe at a time, add to skillet and heat through. Spoon 1/8 of salmon mixture onto bottom third of each crepe. Roll up and place on plate. Garnish with reserved smoked salmon and dill sprigs. Repeat with remaining butter, crepes, and salmon."
    ],
    "ingredients": [
        "1 1-pound salmon fillet with skin",
        "3 tablespoons salted butter, divided",
        "8 green onions, thinly sliced",
        "8 ounces smoked salmon, finely chopped, divided",
        "3 tablespoons fresh lemon juice",
        "2 tablespoons drained capers",
        "2 tablespoons coarsely chopped fresh dill plus sprigs for garnish",
        "8 Basic Buckwheat Crepes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Brunch",
        "Sauté",
        "Low Cal",
        "High Fiber",
        "Salmon",
        "Healthy",
        "Dill",
        "Capers",
        "Lemon Juice",
        "Green Onion/Scallion",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Buckwheat Galettes with Salmon, Capers, and Dill",
    "url": "http://www.epicurious.com/recipes/food/views/buckwheat-galettes-with-salmon-capers-and-dill-357254"
}
