{
    "directions": [
        "Bring chicken broth and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and broth is absorbed, 15 to 20 minutes.",
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Spread sweet potato and red onion onto a baking sheet. Drizzle 1 tablespoon olive oil over mixture and season with salt and pepper; toss to coat.",
        "Bake in the preheated oven until sweet potatoes are tender, 20 to 25 minutes.",
        "Heat 1 tablespoon olive oil in a skillet over medium heat; cook and stir 2 cloves garlic and ginger until fragrant, about 1 minute. Add chicken and cook until no longer pink in the center and the juices run clear, about 6 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cut chicken into 1-inch pieces.",
        "Whisk 1 garlic clove, lime juice, peanut butter, soy sauce, and honey together in a bowl. Whisk 1 tablespoon olive oil and sesame oil into mixture until dressing is smooth.",
        "Divide quinoa among bowls; top with chicken, sweet potato mixture, spinach, and avocado. Sprinkle cilantro and sesame seeds over the top and drizzle dressing over each bowl."
    ],
    "ingredients": [
        "3 cups chicken broth",
        "1 1/2 cups quinoa",
        "1 large sweet potato, diced",
        "1 large red onion, diced",
        "1/4 cup olive oil, divided",
        "kosher salt to taste",
        "freshly ground black pepper to taste",
        "3 cloves garlic, minced, divided",
        "1 tablespoon minced fresh ginger root",
        "1 pound skinless, boneless chicken breast halves",
        "1/4 cup lime juice",
        "2 tablespoons smooth peanut butter",
        "1 tablespoon soy sauce",
        "1 tablespoon honey",
        "1 tablespoon sesame oil",
        "2 cups baby spinach",
        "1 avocado - peeled, pitted, and thinly sliced",
        "1 tablespoon chopped fresh cilantro",
        "1 teaspoon toasted sesame seeds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Buddha Bowl",
    "url": "http://allrecipes.com/recipe/256834/buddha-bowl/"
}
