{
    "directions": [
        "Bring 1 cup of water to a boil in a small saucepan over high heat. Add the cinnamon sticks, cloves, and anise seeds. Cover, and set aside to steep for 15 minutes.",
        "Meanwhile, combine 2 tablespoons water with 1/2 cup sugar in a saucepan over medium-high heat. Stir occasionally to dissolve the sugar completely, but stop stirring once the mixture comes to a boil. Stay near the stove to monitor the color, swirling the pan gently to redistribute the caramel as the sugar begins to darken. Cook to about 310 degrees F (160 degrees C), or until the sugar turns light golden brown, then pour into a 9x5 inch loaf pan. Set aside to allow the caramel to harden.",
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Remove the crusts from the day-old bread, tear the bread into cubes, and place into a large mixing bowl. Strain the spice tea through a fine mesh sieve to remove the spices. Add to the bread along with the evaporated milk. Stir to evenly moisten, and set aside for 10 minutes. Whisk the eggs in a large mixing bowl along with 1 1/2 cups of sugar, the vanilla extract, salt, and melted butter. Stir in the moistened bread mixture until evenly mixed. Pour into the loaf pan over the caramel.",
        "Line a roasting pan with a damp kitchen towel.  Place the loaf pan on the towel, inside roasting pan, and place roasting pan on oven rack.  Fill roasting pan with boiling water to reach halfway up the sides of the loaf pan.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour and 15 minutes. Cool in the pan for about an hour, then refrigerate until cold, 2 hours more. When ready, invert the budin onto a serving plate. The caramel will have turned to a syrup and will cover the budin like a sauce."
    ],
    "ingredients": [
        "1 cup water",
        "2 (3 inch) cinnamon sticks",
        "15 whole cloves",
        "1 teaspoon anise seed",
        "2 tablespoons water",
        "1/2 cup white sugar",
        "1 (1 pound) loaf day-old bread",
        "4 cups evaporated milk",
        "4 eggs",
        "1 1/2 cups white sugar",
        "1 teaspoon vanilla extract",
        "3/4 teaspoon salt",
        "1/4 cup butter, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Budin (Puerto Rican Bread Pudding)",
    "url": "http://allrecipes.com/recipe/165102/budin-puerto-rican-bread-pudding/"
}
