{
    "directions": [
        "Preheat oven to 375°F.",
        "Coarsely chop three fourths pancetta and in a large heavy skillet cook over moderate heat until crisp and golden, transferrng to paper towels to drain. Cool pancetta and reserve fat in skillet. Finely chop cooked pancetta. Finely chop onions and mince garlic. Cut celery and carrot into 1/4–inch dice.",
        "In skillet cook onions, garlic, celery, and carrots in reserved fat over moderate heat, stirring occasionally, until onions are softened. While onion mixture is cooking, coarsely chop parsley.",
        "In a large bowl stir together chopped pancetta, onion mixture, parsley, 1/2 cup ketchup, salt, and pepper, Worcestershire sauce, bread crumbs, buffalo, and eggs until just combined (do not overmix). In a shallow 13- by 9-inch baking pan form mixture into a 10- by 5-inch oval loaf and spread remaining 1/4 cup ketchup onto it. Drape remaining pancetta over loaf.",
        "Bake meat loaf in middle of oven 1 hour and 10 minutes, or until a meat thermometer inserted 2 inches into center registers 160°F. Let meat loaf stand 10 minutes and slice.",
        "Serve meat loaf with whipped potatoes."
    ],
    "ingredients": [
        "1 pound sliced pancetta (Italian unsmoked cured bacon)",
        "2 medium onions",
        "4 garlic cloves",
        "2 celery ribs",
        "1 carrot",
        "1/2 cup fresh flat-leafed parsley leaves",
        "3/4 cup ketchup",
        "3/4 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 tablespoon Worcestershire sauce",
        "1 3/4 cups fine fresh bread crumbs",
        "2 pounds ground buffalo* or ground beef sirloin",
        "2 large eggs",
        "Accompaniment: olive oil and garlic whipped potatoes",
        "Available at some butcher shops and supermarkets and by mail order from Denver Buffalo Company: (800) 289-2833 or (303) 831-1299."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Buffalo",
        "Bacon",
        "Winter",
        "Gourmet"
    ],
    "title": "Buffalo and Pancetta Meat Loaf",
    "url": "http://www.epicurious.com/recipes/food/views/buffalo-and-pancetta-meat-loaf-14928"
}
