{
    "directions": [
        "Position an oven rack in the center of the oven and preheat the oven to 375 degrees F. Place the chicken in a 13-by-9-inch baking dish. Toss with the hot sauce, celery salt, 4 tablespoons melted butter and black pepper to taste. Bake until the chicken is tender and cooked through, about 30 minutes. Increase the oven temperature to 425 degrees F.",
        "Shred the chicken and transfer to a medium bowl, along with any juices from the baking dish. Cover loosely with plastic wrap, and set aside. Wipe out the baking dish with a paper towel and brush with 1 tablespoon melted butter. Set aside.",
        "Meanwhile, in a medium skillet over medium heat, melt 6 tablespoons butter. Add the panko and cayenne and season with some salt. Saute until deeply golden, stirring constantly, 4 to 6 minutes. Remove from the heat and add the thyme. Stir to combine and set aside.",
        "Bring a large pot of water to a boil and salt it generously. Add the pasta and cook to slightly less than al dente, about 3 minutes less than the package instructions. Drain.",
        "In a medium pot over medium heat, melt the remaining 3 tablespoons butter. When the foaming subsides, add the celery and onion. Cook until softened, 4 minutes. Add the flour and stir to coat. Continue to cook, stirring, 1 minute. Gradually add the milk, whisking continuously, and bring to a simmer. Add the Cheddar, gruyere and Parmigiano-Reggiano and whisk until the cheeses are melted and the sauce is smooth. Season to taste with salt and pepper.",
        "Add the pasta to the cheese sauce and stir to coat evenly. Transfer to the prepared baking dish. Top with the chicken mixture and half of the blue cheese. Sprinkle with the breadcrumbs and bake until bubbling around the edges and completely warmed through, 15 to 20 minutes.",
        "Top with the remaining crumbles of blue cheese and celery leaves. Serve immediately."
    ],
    "ingredients": [
        "2 pounds boneless skinless chicken thighs, trimmed of excess fat",
        "1/2 cup hot sauce, such as Frank's",
        "1 tablespoon celery salt",
        "14 tablespoons unsalted butter",
        "Freshly ground black pepper",
        "1 1/2 cups panko",
        "1 teaspoon cayenne pepper",
        "Kosher salt",
        "1 tablespoon thyme leaves",
        "1 pound pasta, such as elbow macaroni, strozzapreti or campanelle",
        "3 stalks celery, including leaves, finely chopped, plus additional leaves, chopped, for serving",
        "1 yellow onion, finely chopped",
        "1/2 cup all-purpose flour",
        "5 cups whole milk",
        "1 1/2 cups (6 ounces) coarsely grated sharp white Cheddar",
        "1 1/2 cups (6 ounces) coarsely grated gruyere",
        "1 cup finely grated Parmigiano-Reggiano",
        "6 ounces blue cheese, crumbled into large pieces"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Macaroni and Cheese",
        "Cheese",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes"
    ],
    "title": "Buffalo Chicken Mac 'n' Cheese",
    "url": "http://www.foodnetwork.com/recipes/eddie-jackson/buffalo-chicken-mac-n-cheese"
}
