{
    "directions": [
        "For the wings: Preheat the oven to 400 degrees F. Line 1 large or 2 small rimmed baking sheets with foil.",
        "Whisk together the flour, cayenne and salt in a large bowl.",
        "Heat 2 inches of oil in a large, heavy-bottomed pot over medium heat until a deep-fry thermometer registers 375 degrees F. Working in 3 batches, dredge the wings in the flour mixture and fry until lightly browned, 10 to 12 minutes per batch. Transfer the wings with a slotted spoon to a paper-towel-lined plate. (Make sure the oil returns to the proper temperature before frying each batch.)",
        "Combine the butter, hot sauce and lemon juice in a large bowl. Toss the fried wings in the hot sauce mixture; transfer the wings and sauce to the prepared baking sheet(s). Bake, flipping the wings occasionally, until they are crispy and have absorbed most of the sauce, about 35 minutes.",
        "For the blue cheese dressing: Whisk together the mayonnaise, half-and-half, sour cream, lemon juice, salt, Worcestershire and 1/4 cup of the blue cheese in a medium bowl until smooth. Gently stir in the remaining 1/4 cup blue cheese and season with pepper to taste. Use immediately, or refrigerate for up to 3 days. (Makes about 2 1/2 cups dressing.)",
        "Transfer the wings to a serving platter and serve with the blue cheese dressing and celery and carrot sticks."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1/2 teaspoon cayenne",
        "1/2 teaspoon fine salt",
        "Vegetable oil, for frying",
        "2 pounds chicken wings, split at the joint, wingtips removed and discarded",
        "1/2 cup unsalted butter, melted",
        "1/4 cup hot sauce, or to taste",
        "2 tablespoons fresh lemon juice",
        "1 cup mayonnaise",
        "1/2 cup half-and-half",
        "2 tablespoons sour cream",
        "1 tablespoon fresh lemon juice",
        "1/4 teaspoon Worcestershire sauce",
        "1/2 cup crumbled blue cheese, such as Maytag (about 3 ounces)",
        "Kosher salt and freshly ground black pepper",
        "Celery sticks, for serving",
        "Carrot sticks, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Appetizer",
        "Appetizer",
        "American",
        "Chicken Wing",
        "Blue Cheese",
        "Cheese",
        "Deep-Frying"
    ],
    "title": "Buffalo-Style Chicken Wings",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/buffalo-style-chicken-wings-recipe"
}
