{
    "directions": [
        "Roast bell pepper on rack of a gas burner over high heat, turning with tongs, until skin is blackened, 12 to 15 minutes. (Or broil pepper on a broiler pan about 5 inches from heat, turning occasionally, about 15 minutes.)",
        "Transfer to a bowl and cover tightly, then let stand 20 minutes. When cool enough to handle, peel pepper, discarding stem and seeds, and coarsely chop. Purée pepper in a blender with dressing, garlic, paprika, and salt until smooth, then transfer to a bowl and chill, covered, until ready to serve.",
        "Peel onions and trim root ends slightly, leaving onions whole, then halve lengthwise and cut halves lengthwise into 1/2-inch-thick wedges. Insert 1 wooden pick through each wedge to hold layers together while grilling, then put onions in a bowl.",
        "Heat vinegar, sugar, and salt in a small nonreactive heavy saucepan over moderate heat, stirring, until sugar is dissolved. Pour pickling liquid over onions, stirring occasionally to coat with liquid, and let stand 5 minutes (onions will brighten in color), then drain onions and pat dry.",
        "Prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderate. Grill onions on a lightly oiled grill rack, covered only if using a gas grill, turning over once, until tender, about 5 minutes total. Remove and discard wooden picks.",
        "Sprinkle salt and pepper on both sides of burgers, then grill burgers on lightly oiled grill rack, covered only if using a gas grill, turning over once with a spatula, 5 to 6 minutes total for medium-rare. Meanwhile, grill English muffins, turning over once with tongs, until toasted, about 3 minutes total. Serve burgers on muffins topped with sauce and onions."
    ],
    "ingredients": [
        "1 red bell pepper",
        "low-fat buttermilk dressing",
        "1 small garlic clove, chopped",
        "Rounded 1/4 teaspoon hot Spanish smoked paprika*",
        "1/4 teaspoon salt",
        "2 small red onions (1/2 lb total)",
        "1/2 cup cider vinegar",
        "1/4 cup sugar",
        "1 teaspoon salt",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 lb ground buffalo**, formed into 4 (1/2-inch-thick) patties",
        "4 English muffins, split in half",
        "Special equipment: about 20 wooden picks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Onion",
        "Low Cal",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Buffalo",
        "Bell Pepper",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Gourmet"
    ],
    "title": "Buffalo Burgers with Pickled Onions and Smoky Red Pepper Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/buffalo-burgers-with-pickled-onions-and-smoky-red-pepper-sauce-109519"
}
