{
    "directions": [
        "Combine pomegranate molasses and oil in small bowl. Using garlic press, press garlic into mixture and whisk to blend. Season dressing to taste with salt and pepper.",
        "Heat oil in heavy large skillet over medium heat. Add chopped onion and sauté until translucent, about 6 minutes. Add bulgur; stir 1 minute. Add 2 cups warm water, cover, and simmer until water is absorbed, about 5 minutes. Remove from heat. Mix in jalapeño chiles, then black-eyed peas, basil, and green onions. Cover skillet and let stand 5 minutes. Transfer bulgur mixture to large bowl. Mix in dressing. Season salad to taste with salt and pepper. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature.",
        "Just before serving, mix tomatoes into salad and sprinkle with nuts."
    ],
    "ingredients": [
        "1/4 cup pomegranate molasses*",
        "3 tablespoons extra-virgin olive oil",
        "2 large garlic cloves",
        "3 tablespoons olive oil",
        "1 1/2 cups chopped onion",
        "2 cups small grain bulgur (about 10 ounces)**",
        "2 cups warm water",
        "3 red jalapeño chiles, thinly sliced into rounds",
        "1 cup canned black-eyed peas, rinsed, drained (from 15 1/2-ounce can)",
        "1 cup chopped fresh basil (preferably purple basil)",
        "3 large green onions, chopped",
        "2 cups chopped seeded diced plum tomatoes (about 3/4 pound)",
        "1/2 cup walnuts, toasted, chopped",
        "*A thick pomegranate syrup; available at some supermarkets and Middle Eastern markets, and from Adriana's Caravan (adrianascaravan.com).",
        "**Also called cracked wheat; available at supermarkets and natural foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Garlic",
        "Herb",
        "Nut",
        "Onion",
        "Pepper",
        "Tomato",
        "Side",
        "Sauté",
        "Vegetarian",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Bulgur and Black-Eyed Pea Salad with Tomatoes, Onions, and Pomegranate Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/bulgur-and-black-eyed-pea-salad-with-tomatoes-onions-and-pomegranate-dressing-238190"
}
