{
    "directions": [
        "Have all the ingredients at room temperature.",
        "Position a rack in the lower third of an oven and preheat to 325°F. Grease and flour an Easter cake pan; tap out excess flour.",
        "To make the cake, over a sheet of waxed paper, sift together the flour, baking powder and salt; set aside.",
        "In the bowl of an electric mixer fitted with the flat beater, beat the butter on medium speed until creamy and smooth, about 30 seconds. Add the granulated sugar and continue beating until light and fluffy, about 5 minutes, stopping the mixer occasionally to scrape down the sides of the bowl. Add the eggs one at a time, beating well after each addition. Beat in the vanilla until just incorporated, about 1 minute.",
        "Reduce the speed to low and add the flour mixture in three additions, alternating with the milk and beginning and ending with the flour. Beat each addition until just incorporated, stopping the mixer occasionally to scrape down the sides of the bowl.",
        "Spoon the batter into the prepared pan, spreading the batter so the sides are higher than the center. Bake until the cake begins to pull away from the sides of the pan and a toothpick inserted into the center comes out clean, 60 to 65 minutes.",
        "Transfer the pan to a wire rack and let the cake cool upright in the pan for 15 minutes. Invert the pan onto the rack and lift off the pan. Let the cake cool completely, at least 2 hours, before assembling and decorating. Wash and dry the pan.",
        "Meanwhile, prepare the buttercream frosting: In the bowl of an electric mixer fitted with the flat beater, beat together the confectioners' sugar, butter, the 2 Tbs. milk, the vanilla and salt on low speed until combined, about 1 minute. Stop the mixer and scrape down the sides of the bowl. Increase the speed to medium and beat until fluffy, about 3 minutes. If the frosting is dry, add more milk, 1 tsp. at a time, until it is creamy but still holds peaks.",
        "To assemble the bunny cake, return both halves of the cooled cake to the pan. Level the cake by using a serrated knife to gently saw off the part of each cake half that rose above the edge of the pan. Remove one cake half from the pan.",
        "Spread a thin layer of the buttercream frosting, about 1/2 cup, over the cut side of the cake half that is still in the pan. Place the other cake half, cut side down, on top, lining up the edges. Gently press down to secure the two halves. Refrigerate the cake for 1 to 2 hours.",
        "Carefully unmold the cake and place it upright on a cake stand or platter. If the cake is unstable, use a serrated knife to trim the bottom so it is level. Decorate as desired. Serves 16."
    ],
    "ingredients": [
        "3 1/4 cups all-purpose flour",
        "1 3/4 tsp. baking powder",
        "1 1/4 tsp. salt",
        "20 Tbs. (2 1/2 sticks) unsalted butter",
        "2 cups granulated sugar",
        "5 eggs",
        "1 1/4 tsp. vanilla extract",
        "1 cup milk",
        "3 cups confectioners' sugar",
        "8 Tbs. (1 stick) unsalted butter",
        "2 Tbs. milk, plus more as needed",
        "1 tsp. vanilla extract",
        "1/4 tsp. salt"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Bunny with Basket Cake",
    "url": "http://www.williams-sonoma.com/recipe/bunny-with-basket-cake.html"
}
