{
    "directions": [
        "Combine all ingredients in heavy large saucepan. Stir over medium heat until piloncillo cones dissolve, about 5 minutes. Increase heat and boil until syrup thickens enough to coat spoon thinly, about 20 minutes. Strain syrup into bowl. (Syrup can be made 2 days ahead. Cover and refrigerate. Rewarm before using.)",
        "Combine 3/4 cup water, 3/4 cup juice, 1 egg, 3 tablespoons sugar, 3 tablespoons lard, 1 tablespoon rum, and 1/2 teaspoon salt in large bowl; whisk to blend well. Gradually add 5 cups flour, stirring until soft, slightly sticky dough forms. Add more flour by tablespoonfuls if dough is very sticky. Cover bowl with plastic wrap and let dough rest 1 hour.",
        "Turn dough out onto lightly floured surface. Divide dough in half. Divide each half into 8 equal pieces. Shape each piece into round ball. Roll out each piece to 6-inch round. Let dough rounds rest 15 minutes.",
        "Pour enough vegetable oil into heavy large pot to reach depth of 1 inch. Attach deep-fry thermometer and heat oil to 365°F to 370°F. Fry dough rounds, 2 at a time, until golden and puffed, turning rounds occasionally with tongs, about 2 minutes. Transfer buñuelos to paper towels to drain. Arrange buñuelos on platter. Drizzle generously with warm syrup. Serve, passing remaining syrup separately.",
        "*Mexican raw sugar shaped into hard cones. Smaller chunks are sometimes labled panocha. If neither is available, substitute an equal weight of packed dark brown sugar."
    ],
    "ingredients": [
        "4 cups water",
        "4 cones piloncillo* (about 14 ounces), coarsely chopped",
        "1 orange, quartered",
        "1/2 large lime",
        "3 cinnamon sticks",
        "1 tablespoon aniseed",
        "3/4 cup water",
        "3/4 cup orange juice",
        "1 large egg",
        "3 tablespoons sugar",
        "3 tablespoons lard, melted, cooled",
        "1 tablespoon dark rum",
        "1/2 teaspoon salt",
        "5 cups (about) all purpose flour",
        "Vegetable oil (for frying)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Rum",
        "Citrus",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Fry",
        "Cinco de Mayo",
        "Orange",
        "Spring",
        "Anise",
        "Cinnamon",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Bunuelos with Anise Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/bunuelos-with-anise-syrup-108036"
}
