{
    "directions": [
        "Start by cutting up the melons: Trim off the rind of all 3 melons, remove any seeds, and cut the flesh into 1/2-inch dice. Put all of the diced melon in a large mixing bowl.",
        "In a separate bowl, combine the ginger, sesame seeds, lime juice, soy sauce, 1/4 cup of the olive oil, 2 tablespoons of the sugar, and 1/2 teaspoon of the salt. Mix well and pour over the melon. Toss, and let marinate at room temperature while you prepare the rest of the salad.",
        "Put the lentils and 4 cups cold water in a small saucepan set over high heat, and bring to a boil, about 5 minutes. Reduce the heat to low and simmer for 15 minutes. Add 1 teaspoon of the salt and cook for 5 minutes, or until the lentils are tender but not mushy. Drain, rinse with cold water to chill, and then stir into the melon mixture.",
        "Combine the coconut, peanuts, kaffir lime, remaining 1 teaspoon sugar, remaining 1/4 cup olive oil, and remaining 1/4 teaspoon salt in a large sauté pan. Toast the peanut mixture over medium-low heat, stirring it constantly, until the coconut and peanuts have toasted, somewhat unevenly, to a golden brown, 3 to 4 minutes. Remove from the heat and set aside to cool.",
        "Just before serving, add the peanut mixture to the melon mixture and stir gently to combine. Serve in a large bowl, preferably at room temperature."
    ],
    "ingredients": [
        "1/2 small seedless watermelon (2 1/2 pounds)",
        "1/2 ripe cantaloupe melon (1 1/2 pounds)",
        "1/4 ripe honeydew melon (1 pound)",
        "2 (3-inch) pieces young ginger,* peeled and minced (1/3 cup); or 2 (3-inch) pieces regular fresh ginger, peeled and minced (1/3 cup)",
        "1/4 cup sesame seeds, toasted",
        "1/4 cup lime juice (from 3 to 4 limes)",
        "1/4 cup low-sodium soy sauce",
        "1/2 cup extra virgin olive oil",
        "2 tablespoons plus 1 teaspoon sugar",
        "1 3/4 teaspoons kosher salt",
        "1 cup dried green lentils",
        "2 cups wide-flake unsweetened coconut",
        "1 1/4 cups blanched raw peanuts",
        "4 fresh kaffir lime leaves, chopped**"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fruit",
        "Ginger",
        "Vegetarian",
        "Lunch",
        "Melon",
        "Cantaloupe",
        "Honeydew",
        "Watermelon",
        "Lentil",
        "Healthy",
        "Vegan",
        "Soy Sauce",
        "Lime Juice",
        "Pescatarian",
        "Dairy Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Burmese _Gin Thoke_ Melon Salad",
    "url": "http://www.epicurious.com/recipes/food/views/burmese-em-gin-thoke-em-melon-salad-51112760"
}
