{
    "directions": [
        "Roll out the dough 1/8 inch thick on a lightly floured surface and fit it into a 9-inch (1-quart) pie tin. Crimp the edge of the dough decoratively and chill the shell for 30 minutes.",
        "In a heavy saucepan cook the sugar over low heat, undisturbed, until it is melted, cook it over moderately low heat, swirling the pan occasionally, until it is a deep caramel color, and stir in the corn syrup, stirring the mixture until it is combined well. Add the rum and the butter and cook the mixture for 1 minute. Remove the pan from the heat and let the mixture cool until it stops bubbling.",
        "In a bowl whisk together the eggs, the vanilla, and a pinch of salt and add the syrup mixture in a stream, whisking. In another bowl whisk together the pumpkin purée and the ginger and whisk in 1 1/4 cups of the egg mixture. Pour the pumpkin mixture into the prepared shell, arrange the pecan halves decoratively on the mixture, and spoon the remaining egg mixture over the pecans. (The pecans will float to the top.) Bake the pie in the middle of a preheated 350°F. oven for 45 to 50 minutes, until the filling is set and the crust is pale golden, let it cook, and serve it warm or at room temperature with the whipped cream."
    ],
    "ingredients": [
        "1 recipe pâte brisée",
        "1/3 cup sugar",
        "1 cup light corn syrup",
        "2 tablespoons dark rum",
        "2 tablespoons unsalted butter, cut into bits",
        "3 large eggs",
        "1 teaspoon vanilla",
        "2/3 cup fresh pumpkin puree or canned pumpkin puree",
        "1 teaspoon ground ginger",
        "1 cup pecan halves",
        "sweetened whipped cream as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pecan",
        "Pumpkin",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Burnt-Sugar Pecan Pumpkin Pie",
    "url": "http://www.epicurious.com/recipes/food/views/burnt-sugar-pecan-pumpkin-pie-10711"
}
