{
    "directions": [
        "Sprinkle gelatin over milk in a small bowl and let stand 1 minute to soften.",
        "Whisk together confectioners sugar, salt, and 1 cup heavy cream.",
        "Cook granulated sugar in a dry small heavy saucepan over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork, until sugar is melted into a golden caramel. Stir in 1 1/2 teaspoons zest and cook, stirring, until zest is toasted and fragrant, 30 seconds to 1 minute. Stir cream mixture and carefully add to caramel (it will bubble and harden). Cook over moderately low heat, stirring, until caramel is dissolved.",
        "Stir in gelatin mixture and remaining teaspoon zest until gelatin is dissolved. Stir in orange juice, then let stand just until cooled to room temperature. Pour through a fine sieve into a medium bowl.",
        "Beat remaining 1/2 cup heavy cream with an electric mixer until it just holds soft peaks. Whisk sour cream in another bowl until smooth. Fold whipped cream into sour cream, then fold into caramel mixture until combined well.",
        "Spoon into molds and chill until firm, at least 8 hours.",
        "Dip molds in hot water 2 or 3 seconds and run a thin knife around edge of molds to help release panna cotta. Invert onto dessert plates and let stand at room temperature 20 minutes.",
        "While panna cotta is standing, remove peel and white pith from oranges with a sharp knife. Holding oranges over a bowl to catch juices, cut sections free from membranes. Squeeze juice from membranes into bowl and coarsely chop orange sections.",
        "Just before serving, spoon orange pieces and juice over desserts."
    ],
    "ingredients": [
        "1 1/2 teaspoons unflavored gelatin",
        "2 tablespoons whole milk",
        "1/4 cup confectioners sugar",
        "1/8 teaspoon salt",
        "1 1/2 cups heavy cream",
        "1/4 cup granulated sugar",
        "2 1/2 teaspoons finely grated fresh orange zest",
        "1/4 cup fresh orange juice",
        "3/4 cup sour cream",
        "2 navel oranges",
        "Special equipment: 6 (1/2-cup) metal molds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Dairy",
        "Fruit",
        "Dessert",
        "Orange",
        "Winter",
        "Chill",
        "Party",
        "Sour Cream",
        "Gourmet",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Burnt Orange Panna Cotta",
    "url": "http://www.epicurious.com/recipes/food/views/burnt-orange-panna-cotta-103858"
}
