{
    "directions": [
        "To make the vinaigrette, pour the vinegar into a small bowl and whisk in 5 tablespoons of the extra virgin olive oil. Season to taste with salt and pepper. Set aside.",
        "Cut the carrots crosswise in half, then cut the halves into thick rough sticks. Toss in a bowl with 3 tablespoons of the olive oil, the thyme, and salt and pepper to taste.",
        "Heat a chapa or large cast-iron skillet over high heat. Working in batches if necessary, add the carrots in a single layer and cook, without turning, until they are charred on the bottom and almost burned, 3 to 5 minutes. Turn with a spatula and cook on the other side for 2 to 3 minutes more, adjusting the heat as necessary, until they are crunchy on the outside and tender within. Transfer to a tray. Wipe out the skillet, if using, and set aside.",
        "Combine the parsley and arugula on a large serving platter and toss lightly with half the vinaigrette. Place the carrots on top.",
        "Reheat the chapa or skillet to very high heat and coat with the remaining 1 to 2 tablespoons olive oil. Immediately add the slices of goat cheese: be careful—the oil may spatter. As soon as you see the cheese blacken on the bottom, remove the slices with a thin spatula and invert onto the carrots. Toss the garlic chips over the salad and drizzle with the remaining vinaigrette."
    ],
    "ingredients": [
        "2 tablespoons red wine vinegar",
        "1/2 cup plus 1 to 2 tablespoons extra virgin olive oil",
        "Coarse salt and freshly ground black pepper",
        "8 medium carrots (about 1 1/4 pounds), peeled",
        "1 tablespoon chopped fresh thyme",
        "1 small bunch flat-leaf parsley, leaves only",
        "2 bunches arugula, trimmed, washed, and dried",
        "6 ounces Bûcheron or similar goat cheese, sliced 1/2 inch thick",
        "Crispy Garlic Chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Leafy Green",
        "Herb",
        "Vegetable",
        "Side",
        "Vegetarian",
        "Dinner",
        "Goat Cheese",
        "Arugula",
        "Root Vegetable",
        "Carrot",
        "Parsley",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Burnt Carrots with Goat Cheese, Parsley, Arugula, and Crispy Garlic Chips",
    "url": "http://www.epicurious.com/recipes/food/views/burnt-carrots-with-goat-cheese-parsley-arugula-and-crispy-garlic-chips-354729"
}
