{
    "directions": [
        "In a food processor, combine the 2 Tbs. olive oil, 4 oz. of the arugula, the pistachios and the garlic and pulse a few times until the arugula is roughly chopped. Add the Parmigiano-Reggiano and turn on the processor. Slowly drizzle in the 1/4 cup olive oil until a smooth paste forms, adding more olive oil as needed. Do not overprocess. Scrape the pesto into a bowl. Taste and adjust the seasonings with salt and pepper. Set the pesto aside.",
        "Bring a large pot of salted water to a boil over high heat. Have ready a bowl of salted ice water. Remove the strings from the sugar snap peas. Trim the woody ends off the asparagus and peel just up to the tip of each spear.",
        "Add the snap peas to the boiling water and cook for 10 seconds, then transfer to the ice bath. Add the asparagus to the boiling water and cook until slightly pliable, about 2 minutes, then transfer to the ice bath. Drain the snap peas and asparagus and place on towels to dry.",
        "Transfer the snap peas and asparagus to a large bowl, add the pesto and toss to coat well. Place the remaining 1 oz. arugula in a small bowl and lightly dress with olive oil, lemon juice, salt and pepper.",
        "To serve, cut each burrata ball in half and lightly season with salt and pepper. Place 3 asparagus spears on each of 4 plates. Place a burrata half next to the asparagus and pile a few snap peas on each plate. Scatter a few of the arugula leaves around the plates and serve immediately. Serves 4.",
        "Recipe by Billy Allin, Chef/Owner of Cakes & Ale Restaurant/Bar and The Bakery at Cakes & Ale."
    ],
    "ingredients": [
        "2 Tbs. plus 1/4 cup extra-virgin olive oil, plus more as needed",
        "5 oz. small peppery arugula leaves (about 5 cups)",
        "1/4 cup pistachios, toasted",
        "1 garlic clove, minced",
        "2 Tbs. grated Parmigiano-Reggiano cheese",
        "Kosher salt and freshly ground pepper, to taste",
        "1/2 lb. sugar snap peas",
        "1 bunch asparagus",
        "Lemon juice, to taste",
        "2 burrata cheese balls, each 4 oz."
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Burrata with Asparagus, Sugar Snap Peas and Pistachio-Arugula Pesto",
    "url": "http://www.williams-sonoma.com/recipe/burrata-with-asparagus-sugar-snap-peas-and-pesto.html"
}
