{
    "directions": [
        "Begin by preparing the olive-oil-fried croutons. Heat a heavy-bottomed sauté pan over medium-high heat. Add 1 cup of the olive oil, the thyme, and garlic. Once the oil has been seasoned for approximately 1 minute, remove the herbs. Add the torn bread, and gently fry while stirring occasionally until thoroughly golden brown and crisp, about 5 minutes. Using a slotted spoon, remove the bread from the pan, drain completely on paper towels to keep the croutons from becoming soggy, and season with salt and pepper. (You may reserve the oil for up to two weeks for similar uses.)",
        "In a small bowl, whisk the vinegar with a small pinch of salt until dissolved, then whisk in the 2 tablespoons of olive oil and set aside.",
        "Just before serving, to keep the bread salad from becoming soggy, place the peeled mini tomatoes in a small bowl, add the cucumber, red onion (to your liking), parsley leaves, basil, and the croutons. Dress the salad with approximately 3 tablespoons of the vinaigrette.",
        "Fan a few of the sliced tomatoes just to the left of the center of each of 8 small plates. Drizzle the slices with some of the remaining vinaigrette, then place a small pile of the marinated mini tomatoes to the right of the slices. Spoon out the burrata right between the two, fluffing the plate with the arugula as garnish around the outside. Drizzle the burrata with extra-virgin olive oil, and season the plate with sea salt and a few turns of the pepper mill."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons extra-virgin olive oil, plus more for drizzling",
        "3 sprigs thyme",
        "1 large clove garlic, smashed",
        "3 slices rustic sourdough bread, torn into tiny pieces",
        "Sea salt and cracked black pepper to taste",
        "2 tablespoons white balsamic vinegar or red wine vinegar",
        "2 pints mini Japanese heirloom tomatoes, blanched and shocked, then peeled",
        "1/4 hothouse cucumber, split lengthwise, seeded and very thinly sliced (on a mandoline if possible)",
        "1/2 small red onion, thinly julienned",
        "3 sprigs flat-leaf parsley, leaves only",
        "1 sprig basil, leaves only",
        "4 medium-ripe Japanese beefsteak/heirloom tomatoes, thinly sliced in rounds and kept together",
        "1 (16-ounce) tub fresh burrata cheese",
        "1 large bunch (about 6 ounces) wild or baby arugula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Garlic",
        "Leafy Green",
        "Herb",
        "Onion",
        "Tomato",
        "Vegetable",
        "Fry",
        "Mozzarella",
        "Basil",
        "Arugula",
        "Summer",
        "Thyme"
    ],
    "title": "Burrata, Japanese Tomatoes, Panzanella, Wild Arugula",
    "url": "http://www.epicurious.com/recipes/food/views/burrata-japanese-tomatoes-panzanella-wild-arugula-237836"
}
