{
    "directions": [
        "Preheat oven to 375°F. Line large rimmed baking sheet with parchment paper. Arrange baguette slices on prepared baking sheet and brush both sides of bread with some oil. Bake until light golden and almost crisp, about 15 minutes. Transfer toasts to platter and cool. Reserve baking sheet with parchment. Maintain oven temperature.",
        "Toss tomatoes, 1 tablespoon oil, and 1/2 teaspoon coarse salt in medium bowl. Spread tomatoes on parchment-lined baking sheet, spacing apart. Place garlic cloves and rosemary sprig atop tomatoes. Roast until tomatoes and garlic are soft, 35 to 40 minutes. Cool slightly; peel garlic, then finely chop tomatoes, garlic, and rosemary leaves. Transfer mixture to small bowl; stir in 1 tablespoon oil. Season tomato salsa with coarse salt and pepper.",
        "Using on/off turns, coarsely chop all olives with chopped basil in processor. Transfer to another small bowl; add 2 tablespoons oil and season olive salsa to taste with pepper. DO AHEAD: Toasts, tomato salsa, and olive salsa can be made 1 day ahead. Store toasts in resealable plastic bag at room temperature. Cover and chill tomato salsa and olive salsa separately. Bring to room temperature before serving.",
        "Place burrata cheese balls in center of large platter. Cut large X in top of each, revealing creamy center. Spoon tomato salsa into center of 1 burrata cheese ball and olive salsa into center of second. Drizzle with additional oil. Garnish with basil and rosemary sprigs. Serve with toasts.",
        "* A soft, fresh Italian cheese made from mozzarella and cream; available at some supermarkets and at specialty foods stores and Italian markets."
    ],
    "ingredients": [
        "1 baguette, cut on diagonal into 1/3-inch-thick slices",
        "2/3 cup (about) extra-virgin olive oil",
        "3 large plum tomatoes, quartered lengthwise",
        "1/2 teaspoon coarse kosher salt plus additional for seasoning",
        "2 unpeeled garlic cloves",
        "1 5-inch-long fresh rosemary sprig plus additional sprigs for garnish",
        "1/3 cup Kalamata olives, pitted",
        "1/3 cup pimiento-stuffed green olives",
        "2 tablespoons chopped fresh basil plus sprigs for garnish",
        "2 8-ounce balls fresh burrata cheese* or fresh mozzarella cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Cheese",
        "Olive",
        "Tomato",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Summer",
        "Party",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Burrata Cheese with Tomato Salsa and Olive Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/burrata-cheese-with-tomato-salsa-and-olive-salsa-359332"
}
