{
    "directions": [
        "Whisk buttermilk, onion powder, parsley, tarragon, sage, paprika, and 1 teaspoon cayenne pepper in a bowl. Place chicken breast pieces in buttermilk mixture, stir to coat, and marinate in refrigerator at least 8 hours (up to 2 days). Drain chicken pieces in a colander.",
        "Mix 2 cups all-purpose flour, garlic salt, onion salt, 1 teaspoon cayenne pepper, salt, and black pepper in a heavy, resealable plastic bag. Whisk eggs with 2 tablespoons milk in a bowl; season with salt and black pepper.",
        "Heat grapeseed oil in a large, heavy skillet over medium-high heat until a pinch of flour dropped into the oil sizzles. Place 1/2 cup all-purpose flour into a shallow bowl.",
        "Press chicken pieces into unseasoned flour, dip into egg mixture, and place into plastic bag of seasoned flour. Close bag and shake to coat chicken.",
        "Fry coated chicken in hot oil until golden brown, 8 to 12 minutes on the first side and 6 to 8 minutes on the second side. Drain on a rack.",
        "Drain oil, leaving 1/4 cup oil in skillet. Reduce heat to medium. Whisk quick-mixing flour and milk into hot oil until combined. Bring gravy to a simmer and cook, whisking constantly, until thickened and creamy, about 5 minutes. Season with salt and white pepper. Serve gravy with fried chicken."
    ],
    "ingredients": [
        "2 cups buttermilk",
        "1 teaspoon onion powder",
        "1/4 cup chopped fresh parsley",
        "1/4 cup chopped fresh tarragon",
        "1/4 cup chopped fresh sage",
        "1 teaspoon paprika",
        "1 teaspoon ground cayenne pepper",
        "2 skinless, boneless chicken breast halves, halved",
        "2 cups all-purpose flour",
        "1 teaspoon garlic salt",
        "1 teaspoon onion salt",
        "1 teaspoon ground cayenne pepper",
        "salt and ground black pepper to taste",
        "2 eggs",
        "2 tablespoons whole milk",
        "ground black pepper to taste",
        "2 cups grapeseed oil for frying",
        "1/2 cup all-purpose flour",
        "1/2 cup quick-mixing flour (such as Wondra®)",
        "2 cups whole milk",
        "1 pinch salt and ground white pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Burton's Southern Fried Chicken with White Gravy",
    "url": "http://allrecipes.com/recipe/231442/burtons-southern-fried-chicken-with/"
}
