{
    "directions": [
        "Arrange beef shank and ribs in bottom of very large pot. Top with leeks, celery, and carrot. Scatter spices, herbs, and garlic over. Pour in 12 cups cold water (or more if needed just to cover). Sprinkle lightly with salt. Bring to gentle boil over medium-high heat. Reduce heat to medium-low. Simmer uncovered until meat is very tender, adjusting heat as necessary to maintain simmer and avoid boiling, 2 3/4 to 3 hours. Season broth with additional salt and pepper. DO AHEAD: Can be made 1 day ahead. Cool 1 hour at room temperature. Chill uncovered until cold, then cover and keep chilled. Spoon off any fat and return to simmer to rewarm before serving.",
        "Steam potatoes until tender, 18 to 20 minutes; transfer to large bowl. Steam carrots until tender, 8 to 10 minutes; add to bowl with potatoes. Reserve steamer. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Resteam potatoes and carrots until heated through, about 8 minutes.",
        "Using tongs, transfer meat to work surface. Slice meats thickly or cut into pieces. Arrange warm meats on large platter. Arrange steamed vegetables alongside. Serve with Sauce Ravigote ."
    ],
    "ingredients": [
        "4 pounds cross-cut beef shank pieces with bone (each about 2 inches thick)",
        "1 to 1 1/4 pounds beef short ribs",
        "2 large leeks, white and pale green parts only, split lengthwise",
        "2 large celery stalks, halved",
        "1 large carrot, peeled",
        "12 whole black peppercorns",
        "8 whole allspice berries",
        "6 large fresh thyme sprigs",
        "5 large fresh Italian parsley sprigs",
        "1 Turkish bay leaf",
        "3 garlic cloves, peeled",
        "12 cups (or more) cold water",
        "3 pounds medium Yukon Gold potatoes, peeled, quartered",
        "8 large carrots, peeled, cut into 2-inch pieces",
        "Sauce Ravigote"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Potato",
        "Steam",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Lunch",
        "Beef Shank",
        "Leek",
        "Carrot",
        "Simmer",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Butcher's Salad with Sauce Ravigote",
    "url": "http://www.epicurious.com/recipes/food/views/butchers-salad-with-sauce-ravigote-358552"
}
