{
    "directions": [
        "To roast the squash, preheat the oven to 350°F.",
        "With a vegetable peeler, remove the skin from the squash. Carefully cut the squash in half lengthwise. Scoop out and discard the seeds. Place the squash on a baking sheet and drizzle with the olive oil. Roast the squash until it is soft and caramelized, about 30 minutes.",
        "To make the soup, in a large soup pot over medium heat, melt the butter and then add the shallots, garlic, salt, white pepper, and spice purse. Cook until the shallots are soft and translucent, about 3 minutes. Add the wine and cook until the mixture is reduced by half, about 3 minutes. Add the squash, sugar, stock, and cream. Cook until all of the flavors meld together, 20 to 30 minutes. Remove the spice purse and season with the cinnamon, nutmeg, and licorice root.",
        "Puree the soup in a blender, being careful not to overload the blender with the hot soup. (Before turning on the machine, be sure the lid is tightly secured and covered with a towel to prevent the hot mixture from escaping.)",
        "Strain through a fine strainer and serve with Spiced Crème Fraîche."
    ],
    "ingredients": [
        "3 pounds butternut squash",
        "1 tablespoon extra-virgin olive oil",
        "2 tablespoons unsalted butter",
        "2 cups sliced shallots",
        "1/3 cup smashed garlic cloves",
        "1 teaspoon fine sea salt",
        "1/2 teaspoon ground white pepper",
        "1 spice purse (1 bay leaf, 1 thyme sprig, 1 star anise, 4 whole peppercorns wrapped in cheesecloth and tied closed with kitchen string)",
        "1/2 cup white wine",
        "1 tablespoon sugar (optional)",
        "8 cups vegetable stock",
        "1/2 cup heavy cream",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon freshly grated nutmeg",
        "1/4 teaspoon freshly grated licorice root (optional)",
        "Spiced Crème Fraîche , for accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Vegetable",
        "Thanksgiving",
        "Vegetarian",
        "Spice",
        "Squash",
        "Butternut Squash",
        "Fall",
        "Shallot"
    ],
    "title": "Butternut Squash Soup with Spiced Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-soup-with-spiced-creme-fraiche-51112680"
}
