{
    "directions": [
        "Trim stem and cut butternut squash in half lengthwise. Place in a microwave-safe dish, cover with plastic wrap, and microwave until tender, about 8 minutes. Transfer to paper towels to cool. Discard skin and set squash aside.",
        "Whisk mascarpone cheese, 1/2 cup Parmigiano-Reggiano cheese, eggs, salt, and black pepper in a bowl until smooth. Whisk in butternut squash until blended.",
        "Whisk in 1/2 cup flour until just incorporated. Whisk in remaining 1/2 cup flour, stirring until flour just disappears. Cover and refrigerate for at least 8 hours or overnight.",
        "Bring a large pot of salted water to a boil.",
        "Melt about 1/3 of the butter in large nonstick skillet; remove from heat.",
        "Scoop out approximately 1 1/2 teaspoons of the butternut squash dough with a spoon. Using a second spoon, push the dough off the first spoon and into the boiling water. Repeat with remaining dough, working in batches of 12 to 15 gnocchi at a time. When a gnocchi rise to the surface, cook for 1 additional minute, then transfer with a slotted spoon to the melted butter in the skillet.",
        "Place the skillet over medium-high heat; cook gnocchi until golden brown on one side, about 3 minutes. Season with cayenne pepper, salt, and black pepper. Turn gnocchi over and stir in sage leaves. Cook until second side is golden, 2 to 3 minutes. Transfer to plate and drizzle with browned butter from the skillet. Garnish with 1 tablespoon Parmigiano-Reggiano cheese and serve."
    ],
    "ingredients": [
        "1 pound butternut squash",
        "1 cup mascarpone cheese",
        "1/2 cup finely grated Parmigiano-Reggiano cheese",
        "2 large eggs",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "1 cup all-purpose flour, divided",
        "1/2 cup unsalted butter",
        "1 pinch cayenne pepper",
        "salt and ground black pepper to taste",
        "1/4 cup thinly sliced fresh sage leaves",
        "1 tablespoon finely grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Butternut Mascarpone Gnocchi",
    "url": "http://allrecipes.com/recipe/222339/butternut-mascarpone-gnocchi/"
}
