{
    "directions": [
        "Place the cubed squash in a medium saucepan with the water and a pinch of salt and bring to a boil over high heat. Lower the heat to medium, cover, and steam until the squash is tender, about 6 minutes. Remove the squash with a slotted spoon and then add the green beans to the pan. Repeat the process, topping up the water if needed.",
        "Return the squash to the pan with the green beans and any remaining cooking liquid. Add the coconut milk and a little more salt if necessary. Bring to a boil and immediately turn the heat down to low. Simmer the curry, uncovered, until slightly thickened, about 8 minutes—don’t allow the mixture to come to a rolling boil or it will curdle. Do not stir because the squash may start disintegrating; shake the pan if you need to mix the ingredients.",
        "Transfer the curry to a serving dish.",
        "Make the tadka: Heat the oil in a small skillet or butter warmer over high heat. When the oil begins to smoke, add the mustard seeds, covering the pan with a lid or spatter screen. After the mustard seeds stop sputtering, add the chiles and cashews and shake the pan over medium heat until the cashews are toasted and lightly browned. Pour this over the curry and serve."
    ],
    "ingredients": [
        "8 ounces butternut squash, peeled and chopped into 1-inch cubes",
        "1/2 cup water",
        "Salt",
        "8 ounces green beans, trimmed and chopped into 1-inch pieces",
        "1 cup canned coconut milk",
        "2 tablespoons canola oil",
        "1/4 teaspoon mustard seeds",
        "2 medium green serrano chiles, minced",
        "3 tablespoons coarsely chopped cashews"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Quick and Healthy",
        "Quick & Easy",
        "Butternut Squash",
        "Green Bean",
        "Cashew",
        "Chile Pepper",
        "Vegetarian",
        "Vegan",
        "Wheat/Gluten-Free",
        "Curry"
    ],
    "title": "Butternut Squash and Green Beans in a Coconut-Milk Curry",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-and-green-beans-in-a-coconut-milk-curry"
}
