{
    "directions": [
        "Preheat oven to 350°F. Toast pumpkin seeds on a rimmed baking sheet, tossing once, until fragrant and slightly darkened, 8–10 minutes. Transfer to a plate and let cool.",
        "Increase oven temperature to 400°F. Line rimmed baking sheet with foil. Cut potato in half lengthwise. Using a medium-size, quick-release ice cream scoop or heavy spoon, scoop out flesh, leaving a small divot down the center. Reserve potato filling.",
        "Place potato halves and parsnip in a large heatproof bowl; cover with plastic wrap. Microwave on high 5 minutes. Carefully check to see if vegetables are fork tender; if not, re-cover and microwave in 1-minute bursts until tender. (Alternatively, roast potato halves and parsnip on a rimmed baking sheet in a 400°F oven until fork-tender, about 50 minutes for parsnip and 30 minutes for potatoes. Let cool slightly.)",
        "Meanwhile, cut squash in half lengthwise, remove seeds, and discard. Scoop out flesh, leaving a divot deep enough to fit potato inside and at least a 1/2\" border on all sides. Reserve squash filling.",
        "Using a fork, pierce insides of squash and potato halves, then pierce parsnip all over.",
        "Pulse garlic and thyme in a food processor, scraping down sides as necessary. Add paprika, 1/4 cup oil, and 1 Tbsp. kosher salt and continue to pulse until a thick paste forms, about 1 minute. Transfer to a small bowl.",
        "Working in batches, pulse squash and potato filling in food processor until coarsely chopped, about 30 seconds. Transfer to a large bowl. Pulse 4 oz. mushrooms in food processor until coarsely chopped, about 30 seconds. Transfer to same bowl and stir to combine.",
        "Heat 1 Tbsp. garlic-oil mixture in a large nonstick skillet over medium until fragrant, about 30 seconds. Add vegetable purée and cook, stirring occasionally, until mixture is browned and moisture releases, about 12 minutes. Return to bowl and let cool.",
        "Add eggs, Parmesan, breadcrumbs, cranberries, 3 Tbsp. parsley, 1/4 tsp. kosher salt, 1/4 tsp. pepper, and 1/4 cup pumpkin seeds to bowl and mix to combine.",
        "Place squash halves, cut side up, on prepared baking sheet. Using a pastry brush, coat inside with garlic-oil mixture. Using the back of a spoon, press 1 cup vegetable mixture into each half until interior is fully coated.",
        "Nestle potato halves, cut side up, inside squash halves. Brush with garlic-oil mixture. Using the back of a spoon, press 6 Tbsp. vegetable mixture into each half until interior is fully coated. Discard remaining vegetable mixture.",
        "Trim parsnip to fit inside 1 potato half. Brush parsnip with garlic-oil mixture and place inside.",
        "Cut 3 (18\") lengths of kitchen twine. Slip twine under 1 squash half, then top with second squash half so cut sides face each other, and press down to seal. Tightly tie twine around squash to secure. Brush top with garlic-oil mixture, reserving remaining mixture, and season with 1/2 tsp. kosher salt. Wrap squash tightly in foil and place in center of baking sheet. Using 2 loaf pans or small metal bowls turned upside down, keep squash secure on baking sheet.",
        "Bake vegducken, carefully flipping halfway through, until squash is tender, 1 hour–1 hour, 20 minutes. Let rest 15 minutes.",
        "Meanwhile, heat 1 Tbsp. reserved garlic-oil mixture in a medium pot over medium-low until beginning to brown and smells fragrant, about 30 seconds. Cook shallot, bay leaves, and remaining 12 oz. mushrooms, stirring occasionally, until mushrooms are tender and beginning to brown, about 5 minutes. Add broth, bring to a simmer, and cook 30 minutes.",
        "Strain mushroom mixture through a fine-mesh sieve into a large bowl; wipe out pot. Cook flour and remaining 2 Tbsp. oil in pot over medium heat, stirring constantly, until nutty brown and thickened, about 8 minutes.",
        "Add wine, bring to a simmer, and cook 3 minutes. Add mushroom broth, 1 Tbsp. parsley, 1/4 tsp. kosher salt, and 1/4 tsp. pepper, and return to a simmer. Season to taste.",
        "Place vegducken on a cutting board and cut into 1\" slices with a serrated knife, transferring to serving plates as you go. Spoon gravy over. Top with remaining 1/4 cup pepitas and 2 Tbsp. parsley. Season with sea salt and serve."
    ],
    "ingredients": [
        "1/2 cup raw pumpkin seeds (pepitas)",
        "1 (8\"-long) sweet potato (about 1 pound)",
        "1 (6\"-long) parsnip, peeled (about 2 ounces)",
        "1 (9\"-long) butternut squash (about 4 1/2 pounds)",
        "4 garlic cloves",
        "1 teaspoon thyme leaves",
        "1 teaspoon paprika",
        "6 tablespoons olive oil, divided",
        "1 tablespoon plus 1 teaspoon kosher salt, plus more",
        "16 ounces cremini mushrooms, coarsely chopped, divided",
        "2 large eggs",
        "1 cup finely grated Parmesan",
        "1/2 cup fresh breadcrumbs",
        "1/3 cup dried cranberries",
        "6 tablespoons coarsely chopped parsley, divided",
        "1/2 teaspoon freshly ground black pepper, divided, plus more",
        "2 shallots, quartered",
        "2 bay leaves",
        "4 cups homemade or store-bought low-sodium vegetable broth",
        "2 tablespoons all-purpose flour",
        "1/2 cup dry white wine",
        "Flaky sea salt",
        "Kitchen twine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetarian",
        "Thanksgiving",
        "Fall",
        "Butternut Squash",
        "Parsnip",
        "Sweet Potato/Yam",
        "Roast",
        "Mushroom",
        "Garlic"
    ],
    "title": "Butternut Squash Vegducken With Mushroom-Cranberry Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-vegducken-with-mushroom-cranberry-stuffing-recipe"
}
