{
    "directions": [
        "Combine the shiitake mushrooms and water in a bowl, assuring the mushrooms are covered with water; allow to soak until the mushrooms have softened, about 30 minutes. Drain and reserve the liquid for later use.",
        "Preheat an oven to 375 degrees F (190 degrees C).",
        "Toss the butternut squash, olive oil, and maple syrup together in a bowl until the squash is evenly coated. Spread onto a baking sheet.",
        "Roast the squash in the preheated oven until tender yet retains its shape, about 30 minutes; set aside.",
        "Bring the vegetable stock and the reserved liquid from the mushrooms to a simmer in a saucepan over medium heat.",
        "Melt the butter in a large skillet over medium heat; when the butter begins to foam, stir the onion into the butter and cook until the onions are soft and golden, 5 to 7 minutes. Stir the wild rice and the Arborio rice through the onions until evenly mixed and coated. Add the white wine and mushrooms to the onion; cook, stirring occasionally, until the liquid has been absorbed, 7 to 10 minutes.",
        "Pour enough of the simmering stock mixture into the skillet to cover the rice; cook and stir until the liquid is nearly completely absorbed. Continue adding stock about 3/4 cups at a time, allowing each batch to absorb into the mixture before adding the next. Cook and stir until the rice is tender, about 35 minutes total. Add the butternut squash; cook until the squash is hot, 2 to 3 minutes. Reduce heat to low. Quickly stir the Gorgonzola cheese and parsley into the mixture until the risotto is moist and creamy; remove from heat. Season with salt and pepper; serve immediately."
    ],
    "ingredients": [
        "3 ounces dried sliced shiitake mushrooms",
        "4 cups water",
        "4 cups cubed butternut squash",
        "2 tablespoons olive oil",
        "1 tablespoon maple syrup (optional)",
        "4 cups vegetable stock",
        "3 tablespoons butter",
        "1 large onion, finely chopped",
        "1 cup wild rice",
        "2 cups Arborio rice",
        "1 cup dry white wine",
        "1 (4 ounce) container crumbled Gorgonzola cheese",
        "salt and ground black pepper to taste",
        "1/2 cup chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Butternut Squash and Shiitake Mushroom Wild Rice Risotto",
    "url": "http://allrecipes.com/recipe/216496/butternut-squash-and-shiitake-mushroo/"
}
