{
    "directions": [
        "Preheat the oven according to cake mix package instructions. Coat a 9-by-13-inch baking dish with cooking spray.",
        "For the butterscotch sauce: Melt the butter in a medium skillet over medium heat. Add the brown sugar and stir to coat. Cook, stirring, until the butter gets frothy, 2 minutes. Add the cream and cook, whisking, until slightly thickened, 5 minutes. Cool to room temperature and then stir in the vanilla",
        "For the batter: Prepare the batter according to cake mix box instructions and pour into the prepared baking dish. Drizzle in the cooled butterscotch sauce and mix to swirl. Set aside.",
        "For the filling: Combine the ricotta, mascarpone, eggs, sugar and salt in a stand mixer fitted with the whisk attachment. Whisk until smooth. Gently pour the filling onto the cake batter so the top is completely white.",
        "Bake until a skewer inserted in the center of the cake comes out clean and the yellow cake layer has risen to the top of the baking dish, about 50 minutes. Let the cake cool before frosting.",
        "For the frosting: Just before serving, combine the mascarpone, butterscotch pudding mix, sugar and milk in a stand mixer and mix until smooth. Using an offset spatula, spread the frosting evenly over the entire cake. Serve."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "1/2 cup light brown sugar",
        "1/2 cup heavy cream",
        "1 teaspoon vanilla extract",
        "Nonstick cooking spray",
        "1 box yellow cake mix",
        "3 1/2 cups ricotta cheese",
        "1/2 cup mascarpone",
        "3 large eggs",
        "3/4 cup sugar",
        "1/8 teaspoon kosher salt",
        "1 1/4 cups mascarpone (10 ounces)",
        "One 3.9-ounce package butterscotch pudding mix",
        "1 tablespoon sugar",
        "1 cup whole milk"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cake",
        "Cheese",
        "Ricotta",
        "Dessert"
    ],
    "title": "Butterscotch Love Cake",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/butterscotch-love-cake"
}
