{
    "directions": [
        "Pulse flour, butter, sage, and sea salt in a food processor until mixture resembles coarse meal. Drizzle ice water evenly over mixture and pulse until it just forms a ball. (Do not overwork dough, or pastry will be tough.) Gently press dough into a 5-inch disk and chill, wrapped in plastic wrap, until firm, at least 1 hour.",
        "Preheat oven to 500°F with rack in middle.",
        "Toss squash with sea salt and 1 Tbsp oil and arrange in 1 layer in a 17-by 12-inch shallow baking pan. Roast, stirring once halfway through roasting, until golden brown on edges and undersides, 20 to 25 minutes. Remove squash from oven and reduce oven temperature to 375°F.",
        "Meanwhile, wash leeks, then cook in remaining 2 tablespoons oil with a pinch of sea salt in a 10-inch heavy skillet over medium heat, partially covered, stirring occasionally, until tender, 10 to 15 minutes. Transfer to a large bowl to cool slightly. Add squash, goat cheese, and 1/4 teaspoon pepper and toss gently.",
        "Roll out dough into a 13-inch round on a lightly floured surface with a lightly floured rolling pin. Transfer to a baking sheet. 3Arrange filling in an even layer in center of dough, leaving a 2- to 3-inch border. Fold dough in on itself to cover outer rim of filling, pleating dough as necessary. Brush pastry with beaten egg and bake galette until crust is cooked through and golden on edges, 35 to 45 minutes. Cool on baking sheet on a rack 10 minutes before serving."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1 stick cold unsalted butter, cut into 1/2-inch cubes",
        "1 tablespoon chopped sage leaves",
        "1/2 teaspoon fine sea salt",
        "4 to 6 tablespoons ice-cold water",
        "1 large egg, lightly beaten",
        "1 (2-pound) butternut squash, peeled, seeded, and cut into 2- by 1/4-inch slices (4 cups)",
        "1/2 teaspoon fine sea salt",
        "3 tablespoons olive oil, divided",
        "2 leeks (white and pale green parts only), thinly sliced crosswise",
        "6 ounces soft mild goat cheese, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Bake",
        "Dinner",
        "Goat Cheese",
        "Butternut Squash",
        "Butter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Butternut Squash Galette",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-galette-351429"
}
