{
    "directions": [
        "Preheat oven to 375°F. Mix breadcrumbs, thyme, lemon zest, 1 cup butter, and 1 Tbsp. salt in a medium bowl with a rubber spatula to combine. Transfer butter mixture to a disposable pastry bag without a tip or a resealable plastic bag. Cut off the tip of pastry bag (or snip off one corner if using a plastic bag).",
        "Starting at the neck end of the chicken, gently slide your fingers between skin and breast to loosen skin; continue into the thigh and leg to fully separate skin from meat without tearing.",
        "Squeeze butter mixture under the skin on top of breasts and work it over breasts, thighs, and drumsticks so everything is evenly covered with butter. Rub outside of skin with remaining 1/2 cup butter; season chicken all over with salt. Tie legs together with kitchen twine. Transfer chicken to a wire rack set inside a rimmed baking sheet.",
        "Place chicken in oven and pour 1/2 cup water into baking sheet (this will prevent juices from scorching). Roast until skin is dark golden brown and an instant-read thermometer inserted into the thickest part of a thigh registers 165°F, 45–55 minutes. Transfer to a cutting board; let rest at least 10 minutes before carving."
    ],
    "ingredients": [
        "1 cup fresh coarse brioche or challah breadcrumbs",
        "2 tablespoons chopped thyme",
        "1 teaspoon finely grated lemon zest",
        "1 1/2 cups (3 sticks) unsalted butter, room temperature, divided",
        "1 tablespoon kosher salt, plus more",
        "1 (3 1/2–4-pound) chicken"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breadcrumbs",
        "Butter",
        "Dinner",
        "Roast",
        "Chicken",
        "Thyme",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Buttery Roast Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/buttery-roast-chicken"
}
