{
    "directions": [
        "Blend eggs, egg yolk, buttermilk, and milk in a blender until smooth. Add rye flour, all-purpose flour, salt, and 2 tablespoons sugar and blend well. With blender on low, gradually stream in melted butter. Strain batter through a fine-mesh sieve into a large measuring cup or medium bowl.",
        "Heat 1/2 teaspoon butter in a medium nonstick skillet over medium heat until foamy. Pour 1/4 cup batter into skillet and swirl to coat bottom of pan. Cook crepe until lacy and golden brown on one side, about 2 minutes. Carefully flip crepe and cook on other side until just cooked through, about 1 minute longer; transfer to a plate. Repeat 7 times with remaining batter and stack crepes, placing a piece of parchment paper between each as you go to prevent sticking (you should have about 8 crepes).",
        "Just before serving, heat 1 teaspoon butter in a large skillet over medium-high heat. Fold 2 crepes in half and place side by side in skillet; sprinkle with 1 teaspoon sugar total, then flip. Cook until sugar is beginning to caramelize, about 1 minute. Repeat with remaining crepes. Serve with lemons for squeezing over.",
        "DO AHEAD: Crepes can be made 2 days ahead. Cover and chill."
    ],
    "ingredients": [
        "2 large eggs",
        "1 large egg yolk",
        "3/4 cup buttermilk",
        "1/4 cup milk",
        "1/2 cup rye flour",
        "1/4 cup all-purpose flour",
        "1/4 teaspoons kosher salt",
        "2 tablespoons plus 4 teaspoons sugar",
        "1/4 cup unsalted butter, melted, plus 8 teaspoons, room temperature",
        "Lemon wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Buttermilk",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Buttermilk Rye Crepes",
    "url": "http://www.epicurious.com/recipes/food/views/buttermilk-rye-crepes-51223980"
}
