{
    "directions": [
        "Cut each cheese round into 8 wedges. Place eggs in small bowl. Place cornmeal in another bowl; sprinkle with salt and pepper. Working in batches, dip cheese into eggs, then into cornmeal, turning to coat. Press cornmeal gently to adhere. Place on baking sheet. Freeze 1 hour.",
        "Cook pancetta in heavy large saucepan over medium heat until crisp, about 8 minutes. Using slotted spoon, transfer pancetta to paper towels. Add onion to drippings in pan; sauté until just tender, about 4 minutes. Add butternut squash, broth and chilies; simmer until squash is tender, stirring occasionally, about 20 minutes. Mix in corn; simmer until tender, about 8 minutes. Transfer 3 1/2 cups soup to blender; puree. Mix puree into remaining soup in pan. Season with salt and pepper. (Pancetta and soup can be made 8 hours ahead. Cover pancetta; chill. Chill soup uncovered until cold, then cover and keep chilled. Bring pancetta to room temperature before continuing.) Heat oil in large nonstick skillet over medium-high heat. Add frozen cheese; brown well, about 1 minute per side.",
        "Meanwhile, bring soup to simmer. Mix in sage. Ladle soup into bowls. Top with pancetta and cheese croutons."
    ],
    "ingredients": [
        "4 ounces chilled soft fresh goat cheese (such as Montrachet), cut into 1-inch-thick rounds",
        "2 large eggs, beaten to blend",
        "1/2 cup yellow cornmeal",
        "4 ounces 1/4-inch-thick slices pancetta or 4 thick bacon slices, chopped",
        "1 medium onion, chopped",
        "1 2 1/4-pound butternut squash, peeled, seeded, coarsely chopped",
        "4 1/2 cups canned roasted-garlic chicken broth or low-salt chicken broth",
        "2 teaspoons minced canned chipotle chilies*",
        "1 16-ounce bag frozen sweet white corn (unthawed)",
        "2 tablespoons olive oil",
        "2 teaspoons minced fresh sage"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Dairy",
        "Appetizer",
        "Thanksgiving",
        "Goat Cheese",
        "Bacon",
        "Corn",
        "Hot Pepper",
        "Butternut Squash",
        "Fall",
        "Simmer"
    ],
    "title": "Butternut-Corn Chowder with Goat Cheese Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-corn-chowder-with-goat-cheese-croutons-102511"
}
