{
    "directions": [
        "Place the cabbage, ginger and garlic in the bowl of a food processor and pulse until finely chopped. Place the cabbage mixture in a large bowl.",
        "Using your hands, fold the ground pork into the cabbage mixture just enough to combine. Evenly sprinkle it with the salt and fold it in. Gently fold the butter into the mixture until thoroughly combined.",
        "To assemble the mandu, place about 2 tablespoons of the filling in the center of each wrapper. Be careful not to overfill or the filling could leak while cooking. (If your wrappers are small, decrease the amount of filling per dumpling; the mandu should be full but not hard to close.) Dip your fingertip in a glass of water and paint the edge of the wrapper. Fold the wrapper over to form a half-moon and pinch the edges together to seal. (This is the easiest fold, for simplicity's sake, but you can fold your mandu in a number of fancy ways, like the pros do.) Mandu can be cooked right away or frozen for later (see below).",
        "In a large pot, bring a few cups of water to a boil over high heat and insert a lightly oiled steaming basket above the water; do not submerge it. Carefully place the dumplings in the basket in one layer. Cover and steam for 5 to 7 minutes, or until the wrapper is a little translucent and the filling feels firm. Serve immediately with kimchi and soy sauce.",
        "Coat a sauté pan with some vegetable or sesame oil and place over medium heat. When the oil is shimmering-hot, place the fresh or thawed mandu in the pan, just enough to fit comfortably in one layer, and sauté each side for a few minutes until golden brown and cooked through. Serve with kimchi and soy sauce."
    ],
    "ingredients": [
        "2 cups green cabbage, roughly chopped",
        "2-inch knob of ginger, minced",
        "4 garlic cloves, minced",
        "2 pounds ground pork (80 percent lean)",
        "1 tablespoon kosher salt",
        "1 pound (4 sticks) unsalted butter, cut into chunks and softened to room temperature",
        "45 refrigerated or frozen and thawed round Asian dumpling wrappers",
        "Fresh Napa Cabbage Kimchi for serving",
        "Light soy sauce, for serving",
        "Vegetable or sesame oil, as needed (optional, for panfrying)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Kid-Friendly",
        "Cabbage",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Butter Mandu (Butter Dumplings)",
    "url": "http://www.epicurious.com/recipes/food/views/butter-mandu-butter-dumplings-56390029"
}
