{
    "directions": [
        "Stir buttermilk and polenta in medium bowl to blend. Cover and let stand at room temperature overnight. Preheat oven to 350°F. Cook bacon in heavy large skillet until crisp. Using slotted spoon, transfer bacon to paper towels to drain. Spoon 2 tablespoons bacon drippings into 13x9x2-inch metal baking pan. Tilt pan to coat bottom and sides of pan with bacon drippings. Place baking pan in oven until bacon drippings are hot, about 6 minutes.",
        "Meanwhile, sift flour, baking powder, salt and baking soda into large bowl. Stir in brown sugar. Whisk eggs, honey and melted butter in another large bowl to blend. Stir in polenta mixture. Add to dry ingredients. Stir just until blended. Stir in corn kernels. Transfer batter to prepared hot baking pan. Sprinkle bacon over batter, then press bacon gently to submerge slightly. Bake corn bread until tester inserted into center comes out clean and top is golden, about 45 minutes. Transfer to rack. Cool 15 minutes. (Can be prepared 8 hours ahead. Cool completely. Cover and let stand at room temperature.) Cut corn bread into squares and serve warm or at room temperature."
    ],
    "ingredients": [
        "2 cups buttermilk",
        "1 1/4 cups polenta (coarse cornmeal)*",
        "8 ounces bacon (about 10 slices), cut into 1/2-inch pieces",
        "1 cups all purpose flour",
        "1 1/2 tablespoons baking powder",
        "1 teaspoon salt",
        "1/4 teaspoon baking soda",
        "1/2 cup (packed) golden brown sugar",
        "3 large eggs",
        "2 tablespoons honey",
        "2 tablespoons (1/4 stick) butter, melted",
        "2 1/2 cups frozen corn kernels, thawed (about 13 ounces)",
        "*Available at Italian markets, natural foods stores and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Dairy",
        "Egg",
        "Pork",
        "Bake",
        "Thanksgiving",
        "Bacon",
        "Cornmeal",
        "Corn",
        "Hominy/Cornmeal/Masa"
    ],
    "title": "Buttermilk Corn Bread with Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/buttermilk-corn-bread-with-bacon-102516"
}
