{
    "directions": [
        "Preheat oven to 450°F.",
        "Halve squash lengthwise and discard seeds. Peel one half and cut into 1/4-inch dice. Put remaining half, cut side down, in an oiled shallow baking pan with diced squash and season with salt and pepper. Bake squash in middle of oven, stirring diced squash occasionally, until tender and browned lightly, 15 to 20 minutes. Holding halved squash in a kitchen towel, scoop out flesh and chop coarse.",
        "In a saucepan bring broth and water to a simmer and keep at a bare simmer.",
        "In another saucepan cook onion, garlic, and gingerroot in butter over moderately low heat, stirring, until softened. Stir in rice and cook over moderate heat, stirring constantly, about 1 minute. Add wine and cook, stirring, until absorbed. Stir in 1/4 cup broth and cook, stirring constantly, and keeping at a simmer throughout, until absorbed. Continue simmering and adding broth, about 1/4 cup at a time, stirring constantly and letting each addition be absorbed before adding next, until about half of broth has been added. Stir in diced and chopped squash and continue simmering and adding broth in same manner until rice is tender and creamy-looking but still al dente, about 18 minutes. Stir in chives and salt and pepper to taste.",
        "Spoon risotto into 2 shallow serving bowls and garnish with chives and Parmesan curls."
    ],
    "ingredients": [
        "1 small butternut squash (about 1 1/2 pounds)",
        "1 3/4 cups chicken broth",
        "1/2 cup water",
        "1 small onion, chopped (about 1/2 cup)",
        "1 large garlic clove, sliced thin",
        "1 1/4 teaspoons minced peeled fresh gingerroot",
        "3 tablespoons unsalted butter",
        "1/2 cup Arborio or long-grain rice",
        "1/4 cup dry white wine",
        "2 tablespoons chopped fresh chives",
        "Garnish: chopped fresh chives and Parmesan curls shaved with a vegetable peeler from a 1/4-pound piece of Parmesan at room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Vegetable",
        "Side",
        "Fall",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Butternut Squash Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-risotto-13081"
}
