{
    "directions": [
        "Preheat oven to 375°F. Line a large rimmed baking sheet with parchment paper. Gently roll out 1 sheet of frozen puff pastry, thawed (from a 17.3-ounce package) on a lightly floured surface to a 10\" square (just enough to even out). Transfer to prepared sheet.",
        "Brush pastry with 1 large egg beaten with 1 teaspoon water. Arrange twelve 1/8\"-thick rounds peeled butternut squash (cut from squash's neck) over pastry, overlapping as needed and leaving a 1/2\" border. Place another sheet of parchment paper over squash. Set another large rimmed baking sheet over the tart. (This will weigh down the pastry dough and steam the squash slices.)",
        "Bake until bottom of pastry begins to brown and top begins to puff, about 10 minutes.",
        "Remove top baking sheet and discard top sheet of parchment paper. Brush squash slices with 1 tablespoon olive oil and season with kosher salt. Return tart, uncovered, to oven and bake until pastry is deep golden brown and cooked through, 25-30 minutes longer.",
        "Meanwhile, combine 1/4 cup honey, 1 thinly sliced Fresno, jalapeño, or red Thai chile, and 2 tablespoons water in a small saucepan. Bring to a boil over medium heat (add another thinly sliced chile if more heat is desired). Boil until thickened slightly and syrupy, about 6 minutes.",
        "Line a plate with paper towels. Heat 2 tablespoons olive oil in a small skillet until just beginning to smoke. Add 12 fresh sage leaves; fry until crisp, about 30 seconds. Transfer to paper towels to drain.",
        "Slice tart. Arrange 1/4 cup shaved Parmesan on top; drizzle with chile-infused honey. Garnish with fried sage leaves and a few grinds of black pepper."
    ],
    "ingredients": [
        "1 sheet of frozen puff pastry, thawed (from a 17.3-ounce package)",
        "1 large egg beaten with 1 teaspoon water",
        "12 1/8\"-thick rounds peeled butternut squash",
        "kosher salt",
        "1/4 cup honey",
        "1 thinly sliced Fresno, jalapeño, or red Thai chile",
        "3 tablespoons olive oil",
        "12 fresh sage leaves",
        "1/4 cup shaved Parmesan",
        "black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Vegetable",
        "Appetizer",
        "Brunch",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Low Cal",
        "Squash",
        "Butternut Squash",
        "Fall",
        "Winter",
        "Shower",
        "Sage",
        "Party",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Butternut Squash Tart with Fried Sage",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-tart-with-fried-sage-51117300"
}
