{
    "directions": [
        "Preheat oven to 400°F. Place butternut squash cubes and olive oil in large bowl; sprinkle with coarse kosher salt and ground pepper and toss to coat. Spread out squash cubes on large rimmed baking sheet. Roast until just tender and beginning to brown, stirring occasionally, about 35 minutes.",
        "Meanwhile, melt 3 tablespoons butter in heavy medium skillet over medium-low heat. Add sliced leeks and chopped sage; sprinkle with salt and pepper. Sauté until tender but not brown, about 15 minutes. Coat 11x7-inch baking dish with remaining 1 tablespoon butter. Spread half of leek mixture over bottom of prepared baking dish. Sprinkle with half of squash and half of cheese. Repeat layering with leeks, squash, and cheese. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Preheat oven to 375°F. Pour cream evenly over gratin. Sprinkle with toasted chopped hazelnuts. Bake uncovered until gratin is heated through and cream is bubbling, about 30 minutes (40 minutes if previously chilled)."
    ],
    "ingredients": [
        "3 1/2 pounds butternut squash (about 2 medium), peeled, seeded, cut into 3/4- to 1-inch cubes (8 cups)",
        "2 tablespoons olive oil",
        "Coarse kosher salt",
        "4 tablespoons (1/2 stick) butter, divided",
        "3 cups sliced leeks (white and pale green parts only)",
        "1 1/2 teaspoons chopped fresh sage",
        "1 5.5-ounce log soft fresh goat cheese",
        "1 cup heavy whipping cream",
        "1/2 cup hazelnuts, toasted, husked, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Side",
        "Bake",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Casserole/Gratin",
        "Goat Cheese",
        "Tree Nut",
        "Butternut Squash",
        "Fall",
        "Hazelnut",
        "Potluck",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Butternut Squash Gratin with Goat Cheese and Hazelnuts",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-gratin-with-goat-cheese-and-hazelnuts-240412"
}
