{
    "directions": [
        "For the burger: Preheat the oven to 350 degrees F.",
        "Place the bacon on a rimmed baking sheet and bake until golden brown but not completely crisp, 15 to 20 minutes. Keep warm for the burgers.",
        "For the beer cheese sauce: Meanwhile, melt the butter in a heavy-bottom saucepan over medium heat. Add the onions and cook until soft, 2 to 3 minutes. Add the flour and cook, stirring, until the roux starts to brown, about 2 minutes. Whisk in the beer until smooth.",
        "Reduce the heat and cook until the beer begins to reduce and the alcohol is cooked out, 4 to 5 minutes. Add the cream and garlic and continue to cook, stirring continuously, until the sauce thickens, about 10 minutes. Remove from the heat and season with 1/2 teaspoon salt and some pepper; gradually whisk in the cheeses until melted completely. Keep warm. Note: This recipe makes about 4 cups of cheese sauce, more than needed for the burgers. Refrigerate the extra for up to 3 days.",
        "To make the burgers, cut the butter into four 1/2-inch thick pieces and set aside, taking care to keep them cold. In a medium bowl, gently fold the ground beef with 1 to 2 teaspoons salt and some pepper to season, and divide into four equal portions. Form each portion of meat into a ball and press your thumb into the center. Place a cold slice of butter into each indent and cover over with some meat, pressing each ball into a patty so the butter is in the center. Hold the patties on a plate for cooking.",
        "Heat a grill pan over medium high heat, and brush with oil. When the pan is hot, add the patties, spacing them evenly. Cook on one side until browned, about 5 minutes, and then flip the patties and cook to desired doneness, adding the cheese slices in the last 2 minutes.",
        "Butter both sides of the pretzel buns and place on the grill pan, cut-side down. Grill until golden brown and toasted. Place the buns onto plates, and place the patties onto the toasted buns. Top each burger with 2 bacon slices and 1/4 cup beer cheese sauce. Serve immediately."
    ],
    "ingredients": [
        "8 slices bacon",
        "4 tablespoons unsalted butter, plus additional for toasting buns",
        "2 pounds ground chuck",
        "Kosher salt and freshly ground pepper",
        "2 tablespoons vegetable oil",
        "4 thick slices Cheddar or American cheese",
        "4 pretzel buns",
        "4 tablespoons unsalted butter",
        "1 small onion, finely chopped",
        "4 tablespoons all-purpose flour",
        "2 cups light beer, such as lager",
        "1 1/2 cups heavy cream",
        "1 clove garlic, grated",
        "Kosher salt and freshly ground black pepper",
        "6 ounces grated sharp Cheddar",
        "6 ounces grated Swiss cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef",
        "Burger",
        "Meat",
        "Cheeseburger",
        "Beer",
        "Cheese",
        "Bacon Recipes",
        "Main Dish Recipes"
    ],
    "title": "Butter Burger with Beer Cheese Sauce and Bacon",
    "url": "http://www.foodnetwork.com/recipes/trisha-yearwood/butter-burger-with-beer-cheese-sauce-and-bacon"
}
