{
    "directions": [
        "Preheat oven to 425°F. and lightly grease a baking sheet.",
        "Put squash halves, flesh sides down, an baking sheet and roast in middle of oven 30 minutes, or until flesh is very tender. When squash is cool enough to handle, scoop out flesh into a bowl and discard skin. Mash squash with a fork until smooth.",
        "While squash is roasting, in a skillet cook onion and sage in butter with salt and pepper to taste over moderate heat, stirring, 5 minutes, or until onion is golden brown. Stir in garlic and cook, stirring, 1 minute.",
        "Cool onion mixture slightly and add to squash. Add goat cheese and stir to combine well.",
        "In a 6-quart kettle bring 5 quarts salted water to a gentle boil for ravioli.",
        "Put 1 won ton wrapper on a lightly floured surface, keeping remaining wrappers in plastic wrap, and mound 1 tablespoon filling in center. Lightly brush edges of wrapper with water and put a second wrapper over first, pressing down around filling to force out air and seal edges well. If desired, trim excess dough with a round cutter or sharp knife. Transfer ravioli to a dry kitchen towel. Make more ravioli with remaining wrappers and filling in same manner, transferring as formed to towel and turning occasionally to dry slightly.",
        "In skillet cook butter with hazelnuts over moderate heat until butter begins to brown, about 3 minutes, and immediately remove from heat (nuts will continue to cook). Season hazelnut butter with salt and pepper and keep warm, covered.",
        "Cook ravioli in 3 batches in gently boiling eater 6 minutes, or until they rise to surface and are tender (do not let water boil vigorously once ravioli have been added). Carefully transfer ravioli as cooked with a slotted spoon to a large shallow baking pan and add enough cooking water to reach 1/2 inch up side of pan. Keep ravioli warm, covered.",
        "Transfer ravioli with a slotted spoon ) letting excess cooking liquid drip off) to 6 plates and top with hazelnut brown-butter sauce."
    ],
    "ingredients": [
        "a 2-pound butternut squash, halved lengthwise and seeded",
        "1 medium onion, chopped (about 1 1/2 cups)",
        "1 1/2 teaspoons ground sage",
        "1 tablespoon unsalted butter",
        "1 garlic clove, minced",
        "3 ounces aged goat cheese, grated (about 2/3)",
        "60 won ton wrappers, thawed if frozen",
        "1 stick (1/2 cup) unsalted butter",
        "1/3 cup hazelnuts,toasted lightly and skinned and chopped coarse"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Appetizer",
        "Roast",
        "Goat Cheese",
        "Butternut Squash",
        "Winter",
        "Sage",
        "Hazelnut",
        "Boil",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Butternut Squash, Sage, and Goat Cheese Ravioli with Hazelnut Brown-Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-sage-and-goat-cheese-ravioli-with-hazelnut-brown-butter-sauce-14287"
}
