{
    "directions": [
        "Preheat oven to 400°F. Toss squash with 1 tablespoon oil on rimmed baking sheet. Sprinkle with coarse salt; bake until squash is tender, turning with spatula occasionally, 20 to 25 minutes.",
        "Whisk eggs in large bowl. Add half and half, wine, mustard, and 1 1/2 teaspoons coarse salt; whisk to blend. Add baguette pieces; fold gently into egg mixture. Let soak 30 minutes, stirring occasionally.",
        "Meanwhile, heat 2 tablespoons oil in large pot over medium-high heat. Add shallots and sauté until soft, stirring frequently, about 5 minutes. Add kale; cover and cook 2 minutes. Uncover and stir until kale is wilted but still bright green, about 5 minutes (kale will be a bit crunchy).",
        "Reduce oven temperature to 350°F.",
        "Generously butter 13x9x2-inch baking dish. Using slotted spoon, transfer half of bread from egg mixture to prepared baking dish, arranging to cover most of dish. Spoon half of kale over bread. Spoon half of squash over bread and kale; sprinkle with half of cheese. Repeat with remaining bread, kale, squash, and cheese. Pour remaining egg mixture over bread pudding.",
        "Cover bread pudding with foil. Bake 20 minutes. Remove foil; bake uncovered until custard is set and bread feels springy to touch, about 20 minutes longer.",
        "Preheat broiler; broil pudding until cheese browns slightly, about 2 minutes. Cool 5 minutes and serve."
    ],
    "ingredients": [
        "2 pounds peeled seeded butternut squash, cut into 1-inch cubes (about 6 cups)",
        "3 tablespoons olive oil, divided",
        "1 1/2 teaspoons coarse kosher salt plus additional for sprinkling",
        "7 large eggs",
        "2 1/4 cups half and half",
        "6 tablespoons dry white wine",
        "1 1/2 teaspoons Dijon mustard",
        "1 day-old baguette (do not remove crust), torn into 1-inch pieces (about 10 cups)",
        "1 cup chopped shallots (about 4 large)",
        "2 bunches Tuscan kale (about 1 pound), ribs removed, kale coarsely chopped",
        "8 ounces extra-sharp cheddar cheese, coarsely grated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Side",
        "Bake",
        "Broil",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Cheddar",
        "Kale",
        "Butternut Squash",
        "Fall",
        "Shallot",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Butternut Squash and Cheddar Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-and-cheddar-bread-pudding-355792"
}
