{
    "directions": [
        "Heat a pot of water to boil for the pasta. Salt the water then add the pasta and cook to al dente or, with a bite to it.",
        "While pasta cooks, heat a medium heavy bottomed pot over medium heat. Add the extra-virgin olive oil and butter. When the butter melts into the oil, add the thyme and grate the onion directly into the pot with a hand held grater or Microplane. Cook the grated onion in butter and oil 1 to 2 minutes, then add flour and cook together 1 to 2 more minutes. Whisk in stock, then combine with butternut squash until warmed through and smooth. Stir in cream or half-and-half and bring sauce to a bubble. Stir in cheeses in a figure 8 motion and season the completed sauce with salt, nutmeg and pepper. Taste to adjust seasonings.",
        "Drain cooked pasta well and combine with sauce. Serve alongside chicken sammies and top with thyme leaves picked from remaining sprigs (Boo would also have a little extra sprinkle of that cheese, please!)"
    ],
    "ingredients": [
        "1 pound macaroni with lines, such as tubatini or mini penne rigate",
        "Salt",
        "1 tablespoon extra-virgin olive oil, 1 turn of the pan",
        "2 tablespoons butter",
        "1/2 medium onion",
        "2 tablespoons chopped fresh thyme leaves, plus a few sprigs for garnish",
        "3 tablespoons all-purpose flour",
        "2 cups chicken stock",
        "1 (10 ounce) box frozen cooked butter nut squash, defrosted",
        "1 cup cream or half-and-half",
        "2 cups (8 ounces) sharp Cheddar, grated",
        "1/2 cup grated Parmigiano-Reggiano, a couple of handfuls",
        "1/4 teaspoon ground nutmeg, eyeball it",
        "Black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Side Dish Recipes",
        "Easy Recipes",
        "American",
        "Macaroni and Cheese",
        "Pasta Recipes",
        "Cheese",
        "Cheddar",
        "Dairy Recipes",
        "Squash",
        "Vegetable",
        "Butternut Squash",
        "Fall"
    ],
    "title": "Butternut Squash Mac and Cheese",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/butternut-squash-mac-and-cheese-recipe"
}
