{
    "directions": [
        "Crumble the compressed yeast into a small bowl, and mix in 2 teaspoons of sugar. Set aside. In a small saucepan, heat milk until a skin forms on the top. Remove from heat, and set aside to cool slightly.",
        "Place 1 cup of butter and remaining 1/2 cup of sugar into a large bowl. Pour the hot milk over them, and stir until butter is melted. Let the mixture cool to just above body temperature. Beat in the eggs, one at a time mixing well after each one, then stir in the yeast mixture. Add 3 cups of flour, and mix until well blended. Gradually mix in the remaining flour, mixing as well as you can. The dough will be sticky. Cover the bowl with a towel, and let rise in a warm place until doubled in size, about 1 hour.",
        "After the dough has risen, punch down, cover, and refrigerate overnight.",
        "Divide the dough into four pieces. Use one piece at a time, leaving the rest in the refrigerator. On a lightly floured surface, roll the piece of dough out into a 12 inch circle. Spread about 2 tablespoons of butter over the surface. Cut into 8 wedges, as you would a pizza. Roll each wedge starting at the wide end, and ending at the point. Place onto a lightly greased cookie sheet, and bend the ends so that they are crescent shaped. Cover with a towel, and let rise in a warm place until doubled. This will take about 2 hours because the dough is cold.",
        "Preheat the oven to 375 degrees F (190 degrees C). Bake for 15 minutes in the preheated oven, or until golden."
    ],
    "ingredients": [
        "1 (0.6 ounce) cake compressed fresh yeast",
        "2 teaspoons white sugar",
        "1 1/2 cups milk",
        "1 cup butter",
        "1/2 cup white sugar",
        "3 eggs",
        "5 1/2 cups bread flour",
        "1 teaspoon salt",
        "1/2 cup butter, softened"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Butterhorns",
    "url": "http://allrecipes.com/recipe/60779/butterhorns/"
}
