{
    "directions": [
        "Quarter squash lengthwise and discard seeds. Peel squash carefully and cut into 3/4-inch pieces. In a large heavy skillet cook squash in oil over moderate heat, stirring occasionally, 2 minutes. Add water and salt to taste and simmer, covered, until squash is just tender, about 10 minutes. Simmer squash, uncovered, until almost all water is evaporated, about 5 minutes. In a food processor purée squash with salt and pepper to taste. Squash purée may be made 1 day ahead and chilled, covered.",
        "Preheat oven to 400°F.",
        "Lightly brush a large baking sheet with some butter and put 1 sheet phyllo on butter. Lightly brush phyllo with some remaining butter and sprinkle with 1 tablespoon Parmesan. Put another sheet of phyllo over cheese, pressing it firmly so that it adheres to bottom layer. Butter, sprinkle with cheese, and layer remaining phyllo in the same manner, ending with a sheet of phyllo. Lightly brush top sheet with remaining butter. Fold in all sides 1/4 inch, pressing to top sheet, and fold up a 1/4-inch border, crimping corners.",
        "Spread squash purée evenly on phyllo crust and top with bacon, rosemary, scallion greens, and onion.",
        "Bake pizza in middle of oven until crust is golden, about 15 minutes."
    ],
    "ingredients": [
        "a 1 1/2-pound butternut squash",
        "1 tablespoon vegetable oil",
        "1/2 cup water",
        "3/4 stick (6 tablespoons) unsalted butter, melted and kept warm",
        "10 sheets phyllo, stacked between 2 sheets wax paper and covered with a kitchen towel",
        "9 tablespoons freshly grated Parmesan cheese (about 2 ounces)",
        "6 slices bacon, cut into 1/2-inch pieces, cooked until crisp, and drained",
        "1 tablespoon fresh rosemary leaves, minced",
        "6 scallion greens, chopped",
        "1 small red onion, sliced thin and separated into pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Appetizer",
        "Bake",
        "Rosemary",
        "Bacon",
        "Butternut Squash",
        "Chill",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Butternut Squash, Bacon, and Rosemary Phyllo Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-bacon-and-rosemary-phyllo-pizza-11095"
}
