{
    "directions": [
        "Preheat oven to 425°F. Line large rimmed baking sheet with foil. Spray foil with nonstick spray. Brush cut side of squash halves with 2 tablespoons oil. Place 2 sage leaves on cut side of each half. Place garlic clove in each cavity. Sprinkle with salt and pepper. Turn squash, cut side down, on prepared sheet. Roast until tender and brown in spots, about 1 hour. Cool on sheet.",
        "Discard sage leaves; reserve garlic. Spoon enough roasted squash into large measuring cup to measure 4 cups packed (reserve any remaining squash for another use); add garlic. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Heat 2 tablespoons oil in medium skillet over medium heat. Add shallots and sauté until soft, about 5 minutes. Scrape shallot mixture into processor; add 4 cups squash with garlic, breadcrumbs, cumin, baking powder, 1 teaspoon salt, and 1/2 teaspoon pepper. Blend until just smooth, occasionally scraping down sides of bowl. Transfer squash mixture to large bowl; mix in eggs.",
        "Add enough oil to heavy large skillet to coat bottom generously; heat over mediumhigh heat. Working in batches of 7 or 8 and adding more oil as needed, drop 1 heaping tablespoonful batter for each latke into skillet. Dip back of fork into oil in skillet and flatten batter to 21/2-inch rounds. Fry latkes until brown, about 2 minutes per side. Transfer latkes to rimmed baking sheets. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Rewarm uncovered in 350°F oven 15 minutes.",
        "Serve latkes with yogurt sauce."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 2-pound butternut squash, halved lengthwise, seeded",
        "4 tablespoons olive oil (not extravirgin), divided, plus additional for frying",
        "8 large fresh sage leaves",
        "4 garlic cloves, peeled",
        "1 cup chopped shallots (about 6)",
        "3/4 cup fine dry unseasoned breadcrumbs",
        "1 teaspoon ground cumin",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "3 large eggs, beaten to blend",
        "Sage and Pine Nut Yogurt Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Hanukkah",
        "Vegetarian",
        "High Fiber",
        "Butternut Squash",
        "Sage"
    ],
    "title": "Butternut Squash Latkes with Sage and Pine Nut Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-latkes-with-sage-and-pine-nut-yogurt-sauce-350788"
}
