{
    "directions": [
        "To make the dough, in a food processor, combine the flour, sugar and salt and pulse briefly. Add the butter and pulse until the mixture resembles coarse meal. Transfer the mixture to a large bowl. Using a fork, stir in 4 Tbs. of the ice water. The dough should start to come together into a rough mass. Squeeze a small piece of dough with your fingers; if it doesn’t hold together without crumbling, stir in the remaining water, 1 Tbs. at a time. Gather the dough into a ball on a large sheet of plastic wrap. Press the dough into a disk, wrap tightly, and refrigerate until chilled and firm, at least 1 hour or up to 2 days.",
        "Position one rack in the lower third of an oven and another rack 3 to 4 inches below the heating element, and preheat the oven to 375°F.",
        "On a lightly floured work surface, roll out the dough into a 12-inch circle about 1/4 inch thick. Prick the dough all over with a fork. Using a 3 1/2-inch round pastry cutter, cut out 12 circles. Gently press each circle into a cup of a 12-cup muffin pan (the dough will not reach the top of the cup) and freeze for about 30 minutes. Bake the tartlet shells on the lower rack until they turn a light golden, 12 to 15 minutes. Transfer the pan to a wire rack and let the tartlet shells cool completely.",
        "In a nonreactive saucepan, combine the buttermilk, cream and lemon juice. In a small bowl, whisk together the sugar, cornstarch and salt. Add the sugar mixture to the saucepan along with the egg yolks and whisk to blend. Cook over medium heat, whisking constantly, until the mixture reaches a simmer and is as thick as pudding, about 6 minutes. Strain the mixture through a fine-mesh sieve into a large liquid measuring cup, then whisk in the butter until blended.",
        "Pour about 2 Tbs. filling into each tartlet shell. Bake the tartlets on the lower rack until the filling is dry on top but still jiggles slightly in the center when gently shaken, about 15 minutes. Preheat the broiler, transfer the tartlets to the upper rack, and broil until the tops are spotty brown, about 1 1/2 minutes. Let the tartlets cool in the pan for about 5 minutes, then transfer them to the wire rack and let cool completely.",
        "To serve, top the tartlets with the berries and arrange on a platter or plates. Makes 12 tartlets.",
        "Adapted from Williams-Sonoma",
        "New Flavors for Desserts",
        ", by Raquel Pelzel (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour, plus more for dusting",
        "1 1/2 Tbs. sugar",
        "1/4 tsp. salt",
        "6 Tbs. (3/4 stick) cold unsalted butter, cut into 1/2-inch cubes",
        "4 to 6 Tbs. ice water",
        "",
        "1 1/2 cups buttermilk",
        "1/2 cup heavy cream",
        "2 tsp. fresh lemon juice",
        "1 cup sugar",
        "1 1/2 Tbs. cornstarch",
        "Pinch of salt",
        "2 egg yolks, at room temperature",
        "1 Tbs. unsalted butter",
        "1/2 pint fresh berries, such as raspberries or strawberries"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Buttermilk Tartlets with Fresh Spring Berries",
    "url": "http://www.williams-sonoma.com/recipe/buttermilk-tartlets-berries.html"
}
