{
    "directions": [
        "In a bowl with a pastry blender or in a food processor blend or pulse together flour, butter, shortening, and salt until mixture resembles coarse meal. Add 2 tablespoons ice water and toss with a fork or pulse until water is incorporated. Add enough remaining ice water, 1 tablespoon at a time, tossing or pulsing to incorporate, until mixture begins to form a dough. On a work surface smear dough in 3 or 4 forward motions with heel of hand to slightly develop gluten in flour and make dough easier to work with. Form dough into a ball and flatten to form a disk. Chill dough, wrapped in plastic wrap, 1 hour. Makes enough dough for a single-crust 9- to 10-inch pie.",
        "On a lightly floured surface roll out dough into an 11-inch round (about 1/8 inch thick) and fit into a 9-inch (1-quart) metal pie plate, crimping edge decoratively. Prick shell all over with a fork and chill 30 minutes.",
        "Preheat oven to 375°F.",
        "Line shell with foil and fill with pie weights or beans. Bake shell in middle of oven 15 minutes. Carefully remove foil and pie weights or beans and bake shell 5 minutes more, or until pale golden. Cool shell on a rack.",
        "In a large heavy saucepan bring milk just to a boil and remove pan from heat. In a large heatproof bowl whisk together yolks, whole egg, cornstarch, and brown sugar until combined well. Gradually whisk in hot milk and pour mixture into pan. Cook mixture over moderately high heat, whisking constantly, until it just comes to a boil and is thickened. Remove pastry cream from heat and, scraping with a spatula, force through a fine sieve set over another large heatproof bowl. Whisk in butter until incorporated.",
        "In a very small saucepan sprinkle gelatin over water and let stand about 1 minute to soften. Heat gelatin mixture over low heat until gelatin is dissolved. Stir gelatin mixture into pastry cream and cool.",
        "In a dry heavy saucepan cook granulated sugar over moderate heat, without stirring, until it begins to melt. Continue cooking sugar, stirring with a fork, until melted and swirl pan until caramel is a deep golden. Remove pan from heat and carefully add 1/3 cup heavy cream down side of pan (caramel will bubble up and steam). Return pan to heat and simmer, stirring, until caramel is dissolved. Stir in vanilla, Scotch, and salt until combined and cool sauce. Stir sauce into pastry cream until combined well.",
        "In a bowl beat 1/2 cup remaining heavy cream until it just holds stiff peaks and fold into pastry cream. Cut 2 bananas into 1/4-inch slices and fold into pastry cream. Pour filling into shell and chill, covered loosely, 4 hours or overnight.",
        "Beat remaining 1/2 cup heavy cream until it just holds stiff peaks and spread on pie. Cut remaining banana into 1/4-inch slices and arrange decoratively on pie."
    ],
    "ingredients": [
        "pastry dough for a single-crust 9- to 10-inch (recipe follows)",
        "pie weights or dried beans for weighting shell",
        "1 1/4 cups milk",
        "2 large egg yolks",
        "1 large whole egg",
        "3 tablespoons cornstarch",
        "3 tablespoons firmly packed brown sugar",
        "2 tablespoons unsalted butter, softened",
        "1 1/2 teaspoons unflavored gelatin",
        "3 tablespoons cold water",
        "2/3 cup granulated sugar",
        "1 1/3 cups heavy cream",
        "2 teaspoons vanilla",
        "2 to 3 tablespoons Scotch",
        "1/4 teaspoon salt",
        "3 firm-ripe bananas",
        "1 1/4 cups all-purpose flour",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits",
        "2 tablespoons cold vegetable shortening",
        "1/4 teaspoon salt",
        "2 to 4 tablespoons ice water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Scotch",
        "Dairy",
        "Dessert",
        "Bake",
        "Banana",
        "Winter",
        "Gourmet"
    ],
    "title": "Butterscotch Banana Pie",
    "url": "http://www.epicurious.com/recipes/food/views/butterscotch-banana-pie-11450"
}
