{
    "directions": [
        "Melt butter with oil in large pot over medium-high heat. Add onions, parsley, and sage; sauté until onions are softened, about 5 minutes. Add squash and coarse salt; sauté until squash softens and onions are golden, about 6 minutes. Add garlic; stir 1 minute. Add 5 cups stock; bring to boil. Reduce heat, cover, and simmer until squash is very soft, about 25 minutes. Cool slightly.",
        "Working in batches, puree soup in blender, allowing some texture to remain. Return soup to pot. Thin with stock, if desired. Season with pepper and more salt, if desired. DO AHEAD: Can be made 1 day ahead. Chill uncovered until cold, then cover and chill. Rewarm before serving.",
        "Place bread in processor; blend until fine crumbs form but some slightly coarser crumbs remain. Cook butter in large nonstick skillet over medium heat until golden, about 2 minutes. Add breadcrumbs and sage. Cook until crumbs are crisp, stirring frequently, about 10 minutes. Remove from heat and cool. DO AHEAD: Can be made 4 hours ahead. Let stand uncovered at room temperature.",
        "Ladle soup into bowls. Sprinkle with breadcrumbs."
    ],
    "ingredients": [
        "1 1/2 tablespoons butter",
        "1 1/2 tablespoons olive oil",
        "2 cups chopped onions",
        "2 tablespoons chopped fresh Italian parsley",
        "2 teaspoons chopped fresh sage",
        "4 cups 1/2-inch cubes peeled seeded butternut squash",
        "1 1/2 teaspoons coarse sea salt",
        "1 garlic clove, minced",
        "5 to 6 cups Chicken Stock or 5 to 6 cups purchased organic chicken broth",
        "2 crustless slices fresh whole grain wheat bread, torn",
        "4 teaspoons butter",
        "1 tablespoon finely chopped fresh sage"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Food Processor",
        "Thanksgiving",
        "Low Cal",
        "High Fiber",
        "Lunch",
        "Butternut Squash",
        "Winter",
        "Healthy",
        "Sage",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Butternut Squash and Sage Soup with Sage Breadcrumbs",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-and-sage-soup-with-sage-breadcrumbs-241346"
}
