{
    "directions": [
        "Mix sugar, lime juice, and salt in heavy large saucepan. Add pears and toss gently to coat. Cover and cook over medium-low heat until pears are just tender, stirring occasionally, 10 to 12 minutes. Transfer mixture to bowl. DO AHEAD: Can be made 1 day ahead. Chill until cold, then cover and keep chilled.",
        "Preheat oven to 350°F. Butter and flour 9-inch-diameter cake pan with 2-inch-high sides; line pan with round of parchment paper. Sift first 9 ingredients into medium bowl. Using electric mixer, beat butter in large bowl until fluffy. Gradually add sugar, beating until smooth. Beat in eggs 1 at a time, beating to blend between additions. Scrape in seeds from vanilla bean and add lime peel; beat to blend. Beat in flour mixture in 4 additions alternately with buttermilk in 3 additions, scraping down bowl occasionally. Transfer batter to prepared pan.",
        "Bake cake until beginning to brown on top and tester inserted into center comes out clean, about 30 minutes. Cool cake in pan on cooling rack. DO AHEAD: Cake can be made 1 day ahead. Cover and let stand at room temperature.",
        "Cut around pan sides to loosen cake. Turn cake out onto rack; peel off parchment and turn right side up onto platter. Sift powdered sugar over. Cut into wedges. Serve with pear compote and dollop of crème fraîche.",
        "A brown, star-shaped seedpod that's available in the spice section of some supermarkets and at specialty foods stores and Asian markets.",
        "** Available at most supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "2 tablespoons sugar",
        "1 tablespoon fresh lime juice",
        "Large pinch of salt",
        "3 Bosc pears (about 1 1/2 pounds total), peeled, quartered, cored, cut into 1/2-inch cubes",
        "1 cup plus 1 tablespoon all purpose flour",
        "1/4 cup cornstarch",
        "1/2 teaspoon salt",
        "1/2 teaspoon (scant) baking powder",
        "1/4 teaspoon baking soda",
        "1/8 teaspoon ground allspice",
        "1/8 teaspoon ground ginger",
        "1/8 teaspoon ground black pepper",
        "1/8 teaspoon ground whole star anise*",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "3/4 cup sugar",
        "2 large eggs",
        "1 3-inch piece vanilla bean, split lengthwise",
        "1/4 teaspoon finely grated lime peel",
        "3/4 cup buttermilk",
        "Powdered sugar",
        "1 1/2 cups crème fraîche**"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Easter",
        "High Fiber",
        "Pear",
        "Spice",
        "Buttermilk",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Buttermilk Spice Cake with Pear Compote and Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/buttermilk-spice-cake-with-pear-compote-and-creme-fraiche-357493"
}
