{
    "directions": [
        "Place 1/4 cup cold water in a small bowl and sprinkle gelatin over; let stand until softened, about 10 minutes.",
        "Meanwhile, combine cream, sugar, and salt in a small saucepan; scrape in seeds from vanilla bean and add pod. Bring just to a simmer. Add softened gelatin and stir until dissolved. Remove cream mixture from heat; let cool.",
        "Remove vanilla pod from cream mixture; discard. Whisk in buttermilk, then crème fraîche. Divide mixture among eight 6-ounce jars, ramekins, or glasses. Chill until set, at least 2 hours.",
        "Place strawberries, sugar, and 2 1/2 cups rhubarb in a medium heatproof bowl; stir to combine and cover tightly with plastic wrap, crimping plastic wrap just under rim of bowl. Set bowl over a saucepan of simmering water (plastic wrap should not touch saucepan) and cook, without stirring, until mixture looks pale and soft, 40-45 minutes.",
        "Strain mixture through a fine-mesh sieve into a measuring cup (do not push mixture through or jelly will be cloudy); discard solids. Add water, if needed, so liquid measures 1 cup.",
        "Place 2 tablespoons cold water in a small bowl and sprinkle gelatin over; let stand until softened, about 10 minutes.",
        "Meanwhile, bring rhubarb-strawberry liquid to a boil in a small saucepan. Add remaining 1/2 cup rhubarb and cook, stirring occasionally, until tender, about 3 minutes; remove from heat.",
        "Add softened gelatin to saucepan and stir until dissolved. Let jelly cool completely.",
        "Top chilled panna cotta with jelly, dividing equally. Cover and chill until jelly is firm, 2-4 hours.",
        "DO AHEAD: Panna cotta can be made 3 days ahead. Keep chilled."
    ],
    "ingredients": [
        "1 1/4 teaspoons unflavored powdered gelatin",
        "1 1/4 cups heavy cream",
        "1/3 cup sugar",
        "1/4 teaspoons kosher salt",
        "1/4 vanilla bean, halved lengthwise",
        "1 1/4 cups buttermilk",
        "1 cup crème fraîche or sour cream",
        "6 ounces strawberries, hulled (about 1 cup)",
        "1/4 cup sugar",
        "12 ounces rhubarb, trimmed, sliced 1/4\" thick (about 3 cups), divided",
        "1/2 teaspoons unflavored powdered gelatin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Dessert",
        "Strawberry",
        "Spring",
        "Chill",
        "Rhubarb",
        "Buttermilk",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Buttermilk Panna Cotta with Rhubarb-Strawberry Jelly",
    "url": "http://www.epicurious.com/recipes/food/views/buttermilk-panna-cotta-with-rhubarb-strawberry-jelly-51161400"
}
