{
    "directions": [
        "Bring broth to simmer in medium saucepan. Reduce heat to low and cover to keep warm. Melt 2 tablespoons butter in heavy large saucepan over medium heat. Add onion and garlic; sauté until tender, about 6 minutes. Add barley; stir until coated with butter, about 1 minute. Add 1/2 cup broth; simmer, stirring often, until broth is absorbed, about 3 minutes. Add remaining broth 1/2 cup at a time, allowing broth to be absorbed before adding more and stirring frequently until barley is tender but still firm to bite and risotto is creamy, about 45 minutes.",
        "Meanwhile, melt 2 tablespoons butter in medium skillet over medium-high heat. Add mushrooms and sauté until soft, about 5 minutes. Season to taste with salt and pepper. Add mushrooms, Parmesan cheese, herbs, and remaining 2 tablespoons butter to risotto; stir to combine. Season to taste with salt and pepper. Divide risotto among bowls and serve."
    ],
    "ingredients": [
        "6 1/2 cups low-salt chicken broth",
        "6 tablespoons unsalted European-style butter",
        "1 medium onion, finely chopped",
        "2 medium garlic cloves, minced",
        "2 cups pearl barley (about 13 ounces), rinsed, drained",
        "1 6-ounce package 3-inch-diameter portobello mushrooms, stemmed, gills scraped, caps sliced",
        "1/2 cup freshly grated Parmesan cheese (about 1 1/2 ounces)",
        "1 tablespoon chopped fresh chives",
        "1 tablespoon chopped fresh Italian parsley",
        "1 tablespoon chopped fresh basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Appetizer",
        "Side",
        "Sauté",
        "Parmesan",
        "Basil",
        "Barley",
        "Fall",
        "Chive",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Buttery Barley Risotto with Parmesan Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/buttery-barley-risotto-with-parmesan-cheese-108541"
}
