{
    "directions": [
        "Combine frozen cherries and preserves in medium saucepan. Bring to boil over medium-high heat, stirring until cherries begin to thaw and juices form. Boil gently until sauce thickens slightly, about 3 minutes. Remove sauce from heat; stir in almond extract.",
        "Preheat oven to 300°F. Whisk flour, sugar, baking powder, and salt in medium bowl to blend. Whisk in buttermilk, then 6 tablespoons melted butter. Heat waffle iron according to manufacturer's instructions. Brush waffle iron grids lightly on both sides with some of remaining melted butter. Pour 1/2 cup (or more) waffle batter (depending on size of waffle iron grid) over each grid. Close waffle iron and cook until waffles are crisp and golden on both sides. Transfer waffles to rack set over baking sheet and keep warm in oven. Repeat cooking with remaining batter, brushing waffle iron with melted butter between batches as needed.",
        "Place waffles on plates. Top with whipped cream and cherry sauce."
    ],
    "ingredients": [
        "1 12-ounce bag frozen pitted dark sweet cherries (do not thaw)",
        "1 cup cherry preserves",
        "1/2 teaspoon almond extract",
        "2 cups all purpose flour",
        "3 tablespoons sugar",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon (scant) salt",
        "2 cups buttermilk",
        "9 tablespoons unsalted butter, melted, divided",
        "Lightly sweetened whipped cream or plain yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Brunch",
        "Dessert",
        "Christmas",
        "Kid-Friendly",
        "Quick & Easy",
        "Yogurt",
        "Mother's Day",
        "Father's Day",
        "Almond",
        "Jam or Jelly",
        "Buttermilk",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Buttermilk Waffles with Cherry-Almond Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/buttermilk-waffles-with-cherry-almond-sauce-351550"
}
