{
    "directions": [
        "Preheat an oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil.",
        "Place squash, cut-side up, on the prepared baking sheet. Cover squash with aluminum foil.",
        "Bake in the preheated oven until squash is tender, 45 minutes to 1 hour 15 minutes.",
        "Heat 1 1/2 teaspoons olive oil in a skillet over medium heat; cook and stir mushrooms and garlic in the hot oil until mushrooms are tender, 5 to 10 minutes. Remove skillet from heat.",
        "Heat remaining 1 1/2 teaspoons olive oil in a separate skillet over medium heat; cook and stir onion in the hot oil until softened, about 5 minutes. Add spinach to onion; cook until spinach is heated through, 3 to 5 minutes. Remove skillet from heat.",
        "Heat 6 cups milk in a 5-quart saucepan over medium heat; cook and stir until milk is simmering, about 5 minutes. Whisk remaining 1 cup milk and cornstarch together in a bowl until smooth; stir into simmering milk. Bring milk mixture to just under a boil, stirring constantly with a wooden spoon and scraping bottom of pot to prevent scorching, until milk mixture has thickened into a sauce, about 5 minutes; remove pot from heat.",
        "Whisk 1 1/2 cups Parmesan cheese, honey, nutmeg, sage, salt, and pepper into sauce until smooth. Cover pot with a lid and keep warm over low heat.",
        "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain.",
        "Reduce oven temperature to 375 degrees F (190 degrees C).",
        "Scrape flesh from butternut squash into a bowl; stir with a fork until evenly mashed. Stir ginger, salt, and pepper into mashed butternut squash.",
        "Spoon about 1 cup white sauce into the bottom of a 9x13-inch baking dish; arrange a layer of noodles atop white sauce. Layer 1/2 butternut squash mixture, 1/5 remaining white sauce, noodles, spinach mixture, 1/5 white sauce, noodles, 1/2 the mozzarella cheese, mushroom mixture, 1/5 white sauce, noodles, remaining 1/2 butternut squash mixture, 1/5 the white sauce, remaining noodles, remaining 1/5 white sauce, remaining mozzarella cheese, 1/2 cup Parmesan cheese, respectively. Cover dish with aluminum foil and place dish on a baking sheet.",
        "Bake in the preheated oven for 30 minutes. Remove cover and bake until bubbling and cheese is browned, about 15 more minutes. Let stand for 10 minutes before serving."
    ],
    "ingredients": [
        "1 butternut squash, halved and seeded",
        "1 tablespoon olive oil, divided, or as needed",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1 teaspoon minced garlic",
        "1 onion, chopped",
        "1 (10 ounce) package frozen chopped spinach, thawed and drained",
        "7 cups milk, divided",
        "1/2 cup cornstarch",
        "2 cups grated Parmesan cheese, divided",
        "1 tablespoon honey",
        "1/4 teaspoon ground nutmeg",
        "4 fresh sage leaves, shredded, or to taste",
        "salt and ground black pepper to taste",
        "1 (16 ounce) package lasagna noodles",
        "1/4 teaspoon minced fresh ginger",
        "2 cups shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Butternut Squash Lasagna",
    "url": "http://allrecipes.com/recipe/234860/butternut-squash-lasagna/"
}
