{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F.",
        "Roast squash, cut sides down, in a lightly oiled shallow baking pan until neck is tender, about 1 hour. Remove from oven and reduce oven temperature to 325°F. Cool squash to warm.",
        "Butter an 8- by 2-inch round cake pan. Line bottom with a round of parchment or wax paper and butter paper.",
        "Scoop flesh from squash, discarding skin, and purée in a food processor until smooth, about 45 seconds. Put 2 cups purée in a bowl, then whisk in whole eggs, 1 cup half-and-half, 2 tablespoons cheese, 1 1/4 teaspoons salt, and 1/2 teaspoon black pepper until combined.",
        "Pour squash mixture into cake pan and bake in a water bath until just set and a wooden pick or skewer comes out almost clean, 45 minutes to 1 hour. Remove from water bath and cool flan in pan on a rack 15 minutes. Invert a flat plate over flan, then invert flan onto plate and carefully remove parchment.",
        "Meanwhile, bring whole sage leaves and remaining cup half-and-half just to a simmer in a 1- to 2-quart heavy saucepan, then remove from heat and let steep, covered, 10 minutes.",
        "Remove sage, carefully squeezing leaves to extract liquid, and discard leaves.",
        "Whisk yolks into half-and-half and cook over moderately low heat, stirring constantly with a wooden spoon, until sauce is thick enough to coat back of spoon and registers 170 to 175°F on thermometer, about 4 minutes (do not let boil).",
        "Immediately pour sauce through a fine-mesh sieve into a bowl, then add remaining 1/2 cup cheese and chopped sage, stirring until cheese is melted. Stir in 1/4 teaspoon salt and 1/2 teaspoon pepper.",
        "Cut flan into wedges with a thin knife, wiping knife clean after each slice. Serve flan with sauce."
    ],
    "ingredients": [
        "1 (2 1/2 pound) butternut squash, halved lengthwise and seeded",
        "4 large eggs plus 2 yolks",
        "2 cups half-and-half",
        "1 1/8 ounce finely grated Parmigiano-Reggiano (1/2 cup plus 2 tablespoons)",
        "4 large fresh sage leaves plus 2 teaspoons finely chopped sage",
        "Special equipment: a candy or instant-read thermometer",
        "Garnish: fresh sage leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Cheese",
        "Egg",
        "Vegetable",
        "Side",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Parmesan",
        "Butternut Squash",
        "Fall",
        "Sage",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Butternut Squash Flan with Parmesan Sage Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-flan-with-parmesan-sage-sauce-230738"
}
