{
    "directions": [
        "Preheat oven to 350° F. Line large-rimmed baking sheet with parchment paper or nonstick liner.",
        "Place squash cut-side down on baking sheet and roast until completely tender when pierced with knife, 40 to 50 minutes. When cool enough to handle, scoop out flesh, discarding skin, and measure 1 1/2 cups into food processor. (Reserve remainder for another use.)",
        "Scrape squash flesh from its skin, place 1 1/2 cups in food processor, and set aside.",
        "In double boiler or metal bowl, pour warm milk over pan of simmering water until until steaming, add to squash in processor and purée until very smooth, 1 to 3 minutes. Add egg whites, eggs, maple syrup, vanilla, ginger, cinnamon, nutmeg, cloves and process until smooth, about 30 seconds to 1 minute.",
        "Divide batter evenly among 18 (3-ounce) or 9 (5-ounce) ramekins or custard cups. Place ramekins in large roasting pan and add enough hot water to pan to come halfway up sides of ramekins. Cover entire pan with foil and bake until flans are set in the middle, 22 to 25 minutes for 3-ounce ramekins or 32 to 35 minutes for 5-ounce ramekins.",
        "Transfer roasting pan to cooling rack and let flans rest in water, uncovered, until room temperature, then remove ramekins from water and refrigerate until thoroughly chilled, about 3 hours.",
        "Serve flans in ramekins, or slide flexible knife around side of each ramekin, pulling up slightly from bottom to break seal, then cover with dessert plate and invert to unmold. Garnish with fruit and mint sprigs and serve."
    ],
    "ingredients": [
        "1 small butternut squash (about 1 1/2 pounds), halved length-wise and seeded",
        "1 1/2 cups whole milk",
        "4 large egg whites",
        "2 large eggs",
        "1/4 cup maple syrup",
        "3 tablespoons pure vanilla extract",
        "1 1/2 teaspoons ground ginger",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "Garnish: fresh berries, kiwi or orange slices, and mint sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Dairy",
        "Egg",
        "Vegetable",
        "Dessert",
        "Bake",
        "Roast",
        "Vegetarian",
        "Butternut Squash",
        "Healthy",
        "Maple Syrup",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Butternut Squash Flan",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-flan-236647"
}
