{
    "directions": [
        "Mix 4 cups of flour, white sugar, yeast, and salt together in the work bowl of a stand mixer fitted with a dough hook.",
        "Whisk 3 eggs in a separate bowl. Melt butter in a saucepan over low heat and whisk buttermilk into melted butter; heat until an instant-read thermometer reads 120 degrees F (49 degrees C). Whisk buttermilk mixture into beaten eggs and cool the mixture to 110 degrees F (43 degrees C).",
        "Beat egg mixture into flour mixture on medium-low speed to make a firm, elastic dough, about 10 minutes. If dough doesn't separate from the sides of the mixing bowl during kneading, beat in 1/4 cup more flour.",
        "Turn dough out onto a work surface and knead for 1 minute; form into a ball and place into a buttered bowl, turning dough around to lightly coat with butter. Cover bowl with plastic wrap and let rise in a warm place until doubled, about 2 hours.",
        "Preheat oven to 350 degrees F (175 degrees C). Butter the outer edge of an 8-inch cake pan.",
        "Stir cream cheese, 1 cup confectioners' sugar, 2 tablespoons flour, lemon juice, vanilla extract, and nutmeg in a bowl until filling is smooth.",
        "Punch down dough and turn out onto a lightly floured piece of parchment paper. Roll dough into a 10x28-inch rectangle. Spread cream cheese filling over the rectangle, leaving a 1-inch border along each edge. Lift an edge of the parchment paper sheet to roll dough into a log shape, starting at a 28-inch edge. Pinch seams closed to seal in filling, keeping roll on the parchment paper.",
        "Wrap the filled dough around the outside of the buttered 8-inch cake pan to form the dough into a ring; pinch the edges closed. Use parchment paper to lift the cake and cake pan and slide a baking sheet beneath the parchment. Gently free cake pan, leaving the ring-shaped cake. Whisk 1 egg with water in a small bowl; brush cake with egg wash.",
        "Bake king cake in the preheated oven until golden brown, about 40 minutes. Let cake cool.",
        "Stir 1 cup confectioners' sugar, corn syrup, and milk in a bowl; mix in 1 teaspoon lemon juice, or amount needed to thin icing to a thick but slightly runny texture. Drizzle king cake with icing."
    ],
    "ingredients": [
        "Sweet dough:",
        "4 cups all-purpose flour",
        "1/2 cup white sugar",
        "1 (.25 ounce) package rapid rise yeast",
        "1 1/4 teaspoons salt",
        "3 eggs at room temperature",
        "6 tablespoons butter",
        "3/4 cup Bulgarian-style buttermilk",
        "1/4 cup all-purpose flour (optional)",
        "Cream cheese filling:",
        "1 (8 ounce) package cream cheese at room temperature",
        "1 cup confectioners' sugar",
        "2 tablespoons all-purpose flour",
        "2 tablespoons lemon juice",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon ground nutmeg",
        "Egg wash:",
        "1 egg",
        "1/4 cup water",
        "Icing:",
        "1 cup confectioners' sugar",
        "4 teaspoons corn syrup",
        "4 teaspoons milk",
        "1 teaspoon lemon juice, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Buttermilk King Cake with Cream Cheese Filling",
    "url": "http://allrecipes.com/recipe/231289/buttermilk-king-cake-with-cream-chees/"
}
