{
    "directions": [
        "In small bowl, sprinkle gelatin over 3 tablespoons water. Let stand until gelatin softens, about 1 minute.",
        "In heavy, medium saucepan over moderate heat, whisk together cream and sugar. Scrape in seeds from vanilla bean; add bean. Heat, whisking occasionally, until sugar dissolves, about 2 minutes. Remove from heat and whisk in gelatin and buttermilk. Strain through fine-mesh sieve into medium, nonreactive bowl, discarding vanilla bean. Cover surface with plastic wrap and let rest at room temperature 15 minutes.",
        "Divide mixture among ramekins and refrigerate until set, at least 8 hours or overnight.",
        "In medium bowl, using electric mixer or whisk, beat cream until stiff peaks form.",
        "In large nonreactive metal bowl, using electric mixer or whisk, whisk together egg yolks and sugar until light and pale yellow, about 1 minute. Set bowl over saucepan of barely simmering water and whisk in wine. Cook, whisking constantly and being careful not to let mixture steam, until mixture thickens and instant-read thermometer inserted into center registers 140°F, about 5 minutes.",
        "Remove bowl from saucepan and continue to whisk until mixture cools, 2 to 3 minutes. Fold in orange liqueur, then gently fold in whipped cream.",
        "Using thin sharp knife, cut around inside edge of each ramekin to loosen. Dip bottom of 1 ramekin into bowl of very warm water 6 seconds. Place dessert plate upside-down atop ramekin and invert, gently lifting off ramekin to allow panna cotta to settle onto plate. Repeat to unmold remaining panna cottas.",
        "Arrange berries atop and around each panna cotta and spoon sabayon over berries. If desired, use kitchen blowtorch to lightly brown sabayon and serve immediately."
    ],
    "ingredients": [
        "3/4 teaspoon powdered unflavored gelatin (1/4-ounce envelope)",
        "1/2 cup heavy cream",
        "1/4 cup sugar",
        "1 vanilla bean, split lengthwise",
        "1 cup well-shaken buttermilk",
        "1/2 cup heavy cream",
        "3 large egg yolks",
        "2 tablespoons sugar",
        "2 tablespoons sweet dessert wine, such as sauterne",
        "1 tablespoon orange liqueur such as Grand Marnier",
        "1/2 cup mixed fresh berries such as blackberries, blueberries, and raspberries",
        "1/4 cup fresh strawberries, hulled and quartered",
        "Special equipment: 4 (4- to 6-ounce) ramekins, kitchen blowtorch (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Dessert",
        "Blackberry",
        "Blueberry",
        "Raspberry",
        "Strawberry",
        "Chill",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Buttermilk Panna Cotta with Berries and Vanilla Sabayon",
    "url": "http://www.epicurious.com/recipes/food/views/buttermilk-panna-cotta-with-berries-and-vanilla-sabayon-240801"
}
