{
    "directions": [
        "Preheat oven to 425°F. Toss squash, 2 tablespoons oil, and sugar in a large bowl. Season with salt and pepper. Arrange in a single layer on a rimmed baking sheet. Roast, tossing occasionally, until squash is golden and tender, 25-30 minutes. Let cool on sheet.",
        "Heat 1 1/2 tablespoons oil in a small skillet over medium-high heat. Add sage; cook until edges begin to curl and turn dark green, 1-2 minutes. Using a slotted spoon, carefully transfer to paper towels to drain. Mix ricotta and lemon zest in a small bowl. Season with salt and pepper. DO AHEAD: Butternut squash, sage leaves, and ricotta can be made 1 day ahead. Cover and chill squash. Store sage airtight at room temperature. Cover and chill ricotta mixture. Bring squash to room temperature before serving.",
        "Spread 1 tablespoon of ricotta mixture on each baguette slice. Top each with a few squash cubes. Drizzle crostini with lemon juice and olive oil. Sprinkle with salt and pepper. Top crostini with 2 fried sage leaves each."
    ],
    "ingredients": [
        "1 2-pound butternut squash, peeled, seeded, cut into 1/2\" cubes (about 4 cups)",
        "3 1/2 tablespoons extra-virgin olive oil, divided, plus more for drizzling",
        "1 1/2 teaspoons (packed) light brown sugar",
        "Coarse sea salt and freshly ground black pepper",
        "24 fresh sage leaves",
        "3/4 cup fresh ricotta",
        "1/2 teaspoon finely grated lemon zest",
        "12 3/8\"-thick baguette slices, toasted",
        "Fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Cocktail Party",
        "Quick & Easy",
        "Ricotta",
        "Butternut Squash",
        "Fall",
        "Shower",
        "Sage",
        "Party",
        "Hors D'Oeuvre",
        "Wedding",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Butternut Squash, Ricotta, and Sage Crostini",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-ricotta-and-sage-crostini-367711"
}
