{
    "directions": [
        "Cook bacon in a 6-quart heavy pot over medium heat, stirring occasionally, until crisp, then transfer with a slotted spoon to paper towels to drain, reserving 2 tablespoons fat in pot. (Add vegetable oil if your bacon is very lean and doesn't yield enough fat.)",
        "Cook celery, carrot, and onion in fat in pot over low heat, covered, stirring occasionally, until softened but not browned, 10 to 12 minutes. Add cinnamon and cook, uncovered, stirring, 1 minute.",
        "While vegetables are cooking, peel potatoes and coarsely chop. Peel and core 1 apple and coarsely chop.",
        "Stir squash, potato, chopped apple, stock, 2 cups water, 1 teaspoon salt and 1/2 teaspoon pepper into onion mixture, then simmer, uncovered, stirring occasionally, until vegetables are very tender, 15 to 20 minutes.",
        "Puree soup in 4 batches in a blender (use caution when blending hot liquids), then heat in cleaned pot over medium low heat, stirring occasionally. (Add additional 1/2 cup water to thin, if necessary.)",
        "While soup is heating, cut enough of remaining apple into thin matchsticks (about 1 1/2-inches long) to measure about 1/2 cup.",
        "Serve soup topped with sour cream, bacon, and apple matchsticks."
    ],
    "ingredients": [
        "6 slices bacon, cut crosswise into 1/2-inch pieces",
        "2 celery ribs, chopped",
        "1 carrot, chopped",
        "1 medium onion, chopped",
        "1/4 teaspoon cinnamon",
        "3/4 pound boiling potatoes",
        "2 medium Granny Smith apples (about 3/4 pound total)",
        "1 1/2 pounds butternut squash, peeled, seeded, and cut into 1/2-inch pieces (3 1/2 to 4 cups)",
        "2 cups reduced-sodium chicken stock or broth",
        "2 to 2 1/2 cups water",
        "Sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Appetizer",
        "Thanksgiving",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Apple",
        "Bacon",
        "Squash",
        "Butternut Squash",
        "Fall",
        "Healthy",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Butternut Squash & Apple Soup",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-apple-soup-365210"
}
