{
    "directions": [
        "Position rack in middle of oven and preheat to 425°F. Whisk sugar, baking powder, kosher salt, baking soda, and 3 cups flour in a large bowl. Cut in butter using a pastry cutter or 2 butter knives until pea-sized lumps form. Stir in buttermilk until a shaggy dough forms.",
        "Gather dough into a ball. On a lightly floured surface, press into an 8\" square. Fold sides over like a letter. Turn 90º and fold sides again, forming a small square. Press or roll to an 8\" square and repeat once, adding flour as needed to prevent sticking.",
        "Pat dough into a scant 3/4\" round. Cut out rounds with 2 1/2\" cutter; transfer to a parchment-lined rimmed baking sheet. Gather scraps and repeat patting and cutting (you should have 14). Freeze until chilled, about 15 minutes.",
        "Bake biscuits, rotating sheet halfway through, until golden brown, 22–24 minutes.",
        "Stir butter, honey, and 2 tsp. sea salt in a medium bowl until well combined.",
        "Top biscuits with Honey Butter and sprinkle with sea salt; serve warm or at room temperature."
    ],
    "ingredients": [
        "1 tablespoon plus 1 1/2 teaspoons sugar",
        "4 teaspoons baking powder",
        "1 1/2 teaspoons kosher salt",
        "1/2 teaspoon baking soda",
        "3 cups all-purpose flour, plus more for surface",
        "3/4 cup plus 2 Tbsp. (1 3/4 sticks) chilled unsalted butter, cut into small cubes",
        "1 1/4 cups buttermilk",
        "1/2 cup (1 stick) unsalted butter, softened",
        "2 tablespoons honey",
        "2 teaspoons flaky sea salt, plus more for serving",
        "A 2 1/2-inch-diameter round cutter or glass"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Biscuit",
        "Side",
        "Bread",
        "Buttermilk",
        "Honey",
        "Butter",
        "Kid-Friendly",
        "Bake",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Buttermilk Biscuits With Honey Butter",
    "url": "http://www.epicurious.com/recipes/food/views/buttermilk-biscuits-with-honey-butter"
}
