{
    "directions": [
        "Fill a large pot with water and bring to a boil over high heat. Boil squash until very tender, 8-10 minutes.  Lift squash out of water with a slotted spoon; cool slightly and peel. Combine cooked squash, garlic, 1/2 cup cream, 2 tablespoons butter, and 1 teaspoon rosemary in a food processor; process until squash is smooth. Salt to taste.",
        "Bring the water back to a boil, adding more if necessary. Stir in the shell pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still very firm to the bite, about 10 minutes. Drain well in a colander set in the sink.",
        "Preheat an oven to 375 degrees F (190 degrees C).",
        "Heat olive oil in a large skillet. Stir in red onion and brown sugar. Cook and stir over low heat, until onion is very soft and sweet, about 15 minutes. Remove from skillet; reserve.  Melt 1/4 cup butter in the same skillet.  Sprinkle flour into butter and stir until incorporated. Pour in 3 1/2 cups cream; whisk in goat cheese and remaining 1 teaspoon rosemary. Cook until sauce is thick, 4-6 minutes. Stir in the reserved onions.",
        "Spray a 9 x 13-inch baking pan with cooking spray.  Scatter spinach over bottom of dish.  Stuff pasta shells evenly with butternut squash mixture and place atop spinach.  Bake shells in preheated oven until hot, about 10 minutes.  Top with sauce, and sprinkle with parsley to serve."
    ],
    "ingredients": [
        "2 butternut squash, quartered and seeded",
        "3 cloves garlic",
        "1/2 cup cream",
        "2 tablespoons butter",
        "1 teaspoon minced rosemary",
        "salt to taste",
        "1 (16 ounce) package jumbo pasta shells",
        "1 tablespoon olive oil",
        "1 red onion, sliced thin",
        "2 tablespoons brown sugar",
        "1/4 cup butter",
        "3 tablespoons all-purpose flour",
        "3 1/2 cups cream",
        "2 tablespoons goat cheese",
        "1 teaspoon chopped fresh rosemary",
        "cooking spray",
        "1 (10 ounce) bag spinach",
        "1 tablespoon chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Butternut Squash Stuffed Shells",
    "url": "http://allrecipes.com/recipe/213065/butternut-squash-stuffed-shells/"
}
