{
    "directions": [
        "Mix buttermilk, curry powder, 3 teaspoons salt, and pepper in large bowl. Add chicken; turn to coat. Cover; chill at least 4 hours or overnight.",
        "Remove chicken from refrigerator. Line 2 baking sheets with paper towels. Mix flour, chili powder, and 3/4 teaspoon salt in shallow dish. Mix tomatoes and next 3 ingredients in another large bowl.",
        "Add enough canola oil to 12-inch skillet to reach depth of 1/2 inch. Heat over medium-high heat to 375°F. Remove 6 chicken pieces from buttermilk mixture. Dip in flour mixture and turn to coat; shake off excess. Add chicken, skin side down, to skillet. Reduce heat to medium-low. Cover; cook until brown, about 12 minutes. Turn chicken over. Cook uncovered until cooked through, about 5 minutes for breasts and 10 minutes for legs and thighs; transfer to paper towels. Repeat with remaining chicken. (Salad and chicken can be made 2 hours ahead. Let stand at room temperature.)",
        "Add spinach to tomato salad; season with salt and pepper. Divide salad among plates; top with chicken."
    ],
    "ingredients": [
        "1 1/2 cups buttermilk",
        "3 tablespoons curry powder",
        "3 3/4 teaspoons kosher salt, divided",
        "1 1/2 teaspoons ground black pepper",
        "3 whole chicken legs, cut into leg and thigh pieces",
        "6 chicken breast halves with skin and ribs",
        "1 1/2 cups all purpose flour",
        "2 teaspoons chili powder",
        "1 1/2 pounds cherry tomatoes, halved",
        "1/4 cup extra-virgin olive oil",
        "2 tablespoons minced shallot",
        "4 teaspoons balsamic vinegar",
        "3 cups (about) canola oil",
        "12 cups baby spinach leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Tomato",
        "Fry",
        "Marinate",
        "Curry",
        "Spinach",
        "Summer"
    ],
    "title": "Buttermilk Fried Chicken with Spinach Tomato Salad",
    "url": "http://www.epicurious.com/recipes/food/views/buttermilk-fried-chicken-with-spinach-tomato-salad-232559"
}
