{
    "directions": [
        "Stir 3/4 cup sugar and 1/4 cup water in heavy medium saucepan over low heat until sugar dissolves. Increase heat to high and boil without stirring until syrup turns deep amber color, occasionally brushing down sides of pan with wet pastry brush and swirling pan. Remove from heat. Add cream (mixture will bubble vigorously). Stir until smooth. Set caramel sauce aside.",
        "Mix brown sugar, cornstarch, and salt in heavy medium saucepan. Gradually whisk in milk. Stir over medium-low heat until mixture thickens and boils, about 8 minutes. Remove from heat. Whisk in caramel sauce.",
        "Whisk egg yolks in large bowl to blend. Gradually whisk 1 cup warm caramel mixture into yolks. Gradually whisk yolk mixture back into caramel mixture in saucepan. Bring to simmer over medium heat. Gradually whisk in butter, Scotch, and vanilla.",
        "Divide pudding among 8 parfait glasses. Chill until cold, at least 6 hours and up to 1 day. Top puddings with banana slices, whipped cream, and toffee bits."
    ],
    "ingredients": [
        "3/4 cup sugar",
        "1/4 cup water",
        "1/4 cup whipping cream",
        "1/2 cup (packed) golden brown sugar",
        "1/3 cup cornstarch",
        "1 teaspoon salt",
        "3 cups whole milk",
        "4 large egg yolks",
        "1/4 cup (1/2 stick) unsalted butter, cut into small pieces, room temperature",
        "2 tablespoons Scotch",
        "1 teaspoon vanilla extract",
        "4 bananas, sliced",
        "Whipped cream",
        "1/2 cup English toffee bits"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Scotch",
        "Dairy",
        "Fruit",
        "Dessert",
        "Banana",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Butterscotch Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/butterscotch-pudding-107528"
}
