{
    "directions": [
        "Toast mustard, cumin, and fennel seeds in a large pot over medium-low heat, tossing often, until fragrant and mustard seeds are starting to pop, about 1 minute. Add salt, brown sugar, peppercorns, bay leaves, and 2 cups water. Bring to a simmer, stirring to dissolve sugar and salt. Remove pan from heat and add 8 cups ice water, then chicken pieces. Cover pot with plastic wrap and chill chicken at least 8 hours and up to 1 day.",
        "Place 2 cups flour in a shallow bowl. Whisk cornstarch, pepper, garlic powder, onion powder, paprika, fennel, 1 Tbsp. or 1 1/2 tsp. salt, and remaining 4 cups flour in another shallow bowl to combine. Whisk eggs and buttermilk in a third shallow bowl to combine.",
        "Remove chicken pieces from brine and pat dry; discard brine. Working with 1 piece at a time, dredge chicken in plain flour, shaking off excess, then dip in egg mixture, allowing excess to drip back into bowl. Transfer chicken to bowl with seasoned flour and coat, packing all around chicken and firmly into cracks and crevices; shake off excess. Place chicken on 2 wire racks set inside rimmed baking sheets.",
        "Pour oil into a large pot to come halfway up sides. Fit pot with thermometer and heat oil over medium-high until thermometer registers 350°F. Working in 4 batches, fry chicken, turning often with tongs and adjusting heat to maintain temperature, until brown and an instant-read thermometer inserted into the thickest part of chicken registers 165°F for dark meat and 160°F for white meat, 10–14 minutes per batch. Transfer chicken to clean wire racks and let rest 10 minutes.",
        "Serve fried chicken with barbecue sauce and pickles.",
        "Chicken can be dredged 2 hours ahead. Chill uncovered on rimmed baking sheets. Chicken can be fried 2 hours ahead. Let sit uncovered at room temperature. Reheat in a 250°F oven if desired."
    ],
    "ingredients": [
        "1 teaspoon brown mustard seeds",
        "1 teaspoon cumin seeds",
        "1 teaspoon fennel seeds",
        "5 ounces kosher salt (1/2 cup Diamond Crystal or 1/4 cup Morton)",
        "1/2 cup (packed) light brown sugar",
        "1 teaspoon black peppercorns",
        "2 bay leaves",
        "2 (3 1/2–4-pound) chickens, cut into 8 pieces each",
        "6 cups all-purpose flour, divided",
        "1 tablespoon cornstarch",
        "1 tablespoon freshly ground black pepper",
        "1 tablespoon garlic powder",
        "1 tablespoon onion powder",
        "1 tablespoon smoked paprika",
        "1 1/2 teaspoon ground fennel or finely ground fennel seeds",
        "1 tablespoon Diamond Crystal or 1 1/2 teaspoons Morton kosher salt, plus more",
        "2 large eggs, beaten to blend",
        "2 cups buttermilk",
        "Vegetable oil (for frying; about 6 cups)",
        "White Barbecue Sauce and bread-and-butter pickles (for serving)",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Deep-Fry",
        "Fry",
        "Buttermilk",
        "North Carolina",
        "Dinner"
    ],
    "title": "Buttermilk Fried Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/buttermilk-fried-chicken"
}
