{
    "directions": [
        "Preheat the oven to 350°F.",
        "Place squash in a large pot with enough water to cover the squash by 2 inches. Add 1 teaspoon salt and bring to a boil. Cover and cook over medium-low heat until soft, about 12 to 14 minutes. Remove butternut squash with a slotted spoon and place in a blender with 1/4 cup of the liquid it was cooked in. Reserve an additional 1 cup of liquid and set aside.",
        "In a medium nonstick skillet, add the oil and saut¿he shallots and garlic over medium-low heat until soft and golden, about 4 to 5 minutes. Add pureed butternut squash, season with 1/4 teaspoon salt and a pinch of fresh cracked pepper adding about 1/2 cup to 3/4 cup of the reserved liquid to thin out the sauce until smooth. Stir in the parmesan cheese and set aside.",
        "In a medium bowl, combine the spinach, ricotta, the remaining 1/2 cup Parmesan, egg, 1/4 teaspoon salt, and the black pepper.",
        "Ladle about 1/2 cup of the butternut sauce into the bottom of a 9 ¿13-inch baking dish.",
        "Put a piece of wax paper on a work surface and lay the cooked lasagna noodles out on it. Make sure the noodles are dry. Spread 1/3 cup of the ricotta mixture over each noodle. Carefully roll them up and put them seam side down in the baking dish. Ladle the remaining sauce over the lasagna rolls and top each with 1 tablespoon mozzarella. Tightly cover the dish with foil.",
        "Bake until the inside is heated through and the cheese is melted, about 40 minutes."
    ],
    "ingredients": [
        "1 pound peeled butternut squash, diced",
        "kosher salt",
        "1 teaspoon olive oil",
        "1/4 cup minced shallots",
        "2 cloves garlic, minced",
        "2 1/2 tablespoons fresh grated parmesan cheese",
        "10 ounces frozen chopped spinach, cooked according to package directions, cooled, and squeezed dry",
        "1 3/4 cups (15 ounces) fat-free ricotta cheese",
        "1/2 cup grated Parmesan cheese",
        "1 large egg",
        "1/2 teaspoon kosher salt",
        "Freshly cracked black pepper",
        "9 lasagna noodles, wheat or gluten-free, cooked",
        "9 tablespoons shredded part skim mozzarella cheese (about 3 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Low Carb",
        "Low Fat",
        "Kid-Friendly",
        "Low Cal",
        "Dinner",
        "Butternut Squash",
        "Healthy",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Butternut Squash Lasagna Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-lasagna-rolls-51252500"
}
