{
    "directions": [
        "Preheat oven to 350°F. Line baking pan with parchment paper, leaving a 1\" overhang on long sides of pan. Whisk flour, baking powder, and salt in a medium bowl; set aside. Stir butter in a medium skillet over medium heat until browned bits form at bottom of pan, 7-8 minutes. Transfer to a medium bowl. Add brown sugar. Using an electric mixer, beat until well combined and mixture resembles wet sand, 2-3 minutes. Add eggs and vanilla; beat until fluffy and well combined, about 2 minutes. Add dry ingredients; beat until smooth (batter will be thick). Using an offset or regular spatula, evenly spread batter in prepared pan.",
        "Bake blondie until golden brown, edges pull away from sides of pan, and a tester inserted into center comes out with a few moist crumbs attached, 20-25 minutes. Let cool completely in pan on a wire rack.",
        "Preheat oven to 350°F. Line a rimmed baking sheet with parchment paper. Spread peanuts over sheet in an even layer. Bake, stirring frequently, until golden brown and fragrant, 5-7 minutes. Set aside.",
        "Stir sugar and 1/2 cup water in a large saucepan over medium-low heat until sugar dissolves. Increase heat; boil without stirring, occasionally swirling pan and brushing down sides with a wet pastry brush, until caramel is deep amber, 12-15 minutes. Add honey; return to a boil, stirring often, about 1 minute longer. Add butter; stir until blended. Add cream (mixture will bubble vigorously); whisk until smooth. Stir in peanuts and pretzels. Pour over cooled blondie. Chill until cool, about 30 minutes.",
        "Run a knife around short sides of pan to release blondie. Using parchment-paper overhang, lift from pan. Cut lengthwise into 4 strips. Cut each strip crosswise into 10 bars. DO AHEAD: Chill for up to 1 week in an airtight container. Bring to room temperature before serving."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "2 teapsoons baking powder",
        "1 teaspoon kosher salt",
        "3/4 cup (1 1/2 sticks) unsalted butter",
        "2 cups (packed) light brown sugar",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "4 cups roasted unsalted peanuts",
        "2 cups sugar",
        "1/4 cup honey",
        "1/4 cup (1/2 stick) unsalted butter",
        "1/2 cup heavy cream",
        "1 1/2 cups 1 1/2\"-wide thin twisted pretzels, coarsely crushed",
        "A 13x9x2\" metal baking pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Christmas",
        "Kid-Friendly",
        "Low Sodium",
        "Back to School",
        "Peanut",
        "Birthday",
        "Shower",
        "Christmas Eve",
        "Party",
        "Potluck",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Butterscotch Blondie Bars With Peanut-Pretzel Caramel",
    "url": "http://www.epicurious.com/recipes/food/views/butterscotch-blondie-bars-with-peanut-pretzel-caramel-368950"
}
