{
    "directions": [
        "Melt butter in large skillet over medium-high heat. Add onions; sauté until soft, about 8 minutes. Increase heat to high; add mushrooms and cook until tender, stirring constantly, about 3 minutes. Season with salt and pepper. Transfer mushroom mixture to bowl; set aside.",
        "Add squash, broth, 3 tablespoons thyme, and 3 tablespoons sage to same skillet. Cover and simmer over medium heat until squash is just tender, about 6 minutes. Uncover and cook until squash is very soft but still retains shape, about 5 minutes. Season with salt and pepper.",
        "Mix ricotta, 2 cups mozzarella cheese, 1 1/2 cups Parmesan cheese, and remaining 1 tablespoon thyme and 1 tablespoon sage in large bowl. Season to taste with salt and pepper; mix in eggs.",
        "Brush 13x9x2-inch glass or ceramic baking dish with oil. Spread 1 cup ricotta mixture over bottom. Arrange 3 noodles on top. Spread 13/4 cups ricotta mixture over noodles. Arrange 1 1/3 cups squash mixture over. Sprinkle with 1/2 cup mushrooms and 1 cup mozzarella. Top with 3 noodles, then 1 3/4 cups ricotta mixture, half of remaining squash, 1/2 cup mushrooms, and remaining 1 cup mozzarella. Repeat with noodles, 1 3/4 cups ricotta mixture, remaining squash, and remaining mushrooms. Top with 3 noodles. Spread remaining ricotta mixture over; sprinkle with remaining Parmesan. Cover with oiled foil.",
        "Preheat oven to 350°F. Bake lasagna, covered, 35 minutes. Uncover; bake until heated through, about 25 minutes longer. Let stand 10 minutes before serving. (The lasagna can be assembled one day ahead and refrigerated.)"
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter",
        "2 1/2 cups chopped onions",
        "1/2 pound crimini (baby bella) mushrooms, sliced (about 3 cups)",
        "2 pounds butternut squash, peeled, seeded, cut into 1/4-inch-thick slices (about 5 1/2 cups)",
        "1 14-ounce can vegetable broth",
        "4 tablespoons chopped fresh thyme, divided",
        "4 tablespoons sliced fresh sage, divided",
        "3 15-ounce containers whole-milk ricotta cheese",
        "4 cups grated mozzarella cheese, divided",
        "2 cups grated Parmesan cheese, divided",
        "4 large eggs",
        "Olive oil",
        "1 9-ounce package no-boil lasagna noodles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Vegetable",
        "Bake",
        "Vegetarian",
        "Fall"
    ],
    "title": "Butternut Squash and Mushroom Lasagna",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-and-mushroom-lasagna-231091"
}
