{
    "directions": [
        "Preheat the oven to 400 degrees.",
        "Peel the butternut squash, remove the seeds, and cut it into 3/4-inch cubes. You should have about 6 cups. Place the squash on a sheet pan and toss it with the olive oil, 1 teaspoon salt, and 1/2 teaspoon pepper. Roast for 25 to 30 minutes, tossing once, until very tender. Set aside.",
        "Meanwhile, heat the chicken stock in a small covered saucepan. Leave it on low heat to simmer.",
        "In a heavy-bottomed pot or Dutch oven, melt the butter and saute the pancetta and shallots on medium-low heat for 10 minutes, until the shallots are translucent but not browned. Add the rice and stir to coat the grains with butter. Add the wine and cook for 2 minutes. Add 2 full ladles of stock to the rice plus the saffron, 1 teaspoon salt, and 1/2 teaspoon pepper. Stir, and simmer until the stock is absorbed, 5 to 10 minutes. Continue to add the stock, 2 ladles at a time, stirring every few minutes. Each time, cook until the mixture seems a little dry, then add more stock. Continue until the rice is cooked through, but still al dente, about 30 minutes total. Off the heat, add the roasted squash cubes and Parmesan cheese. Mix well and serve."
    ],
    "ingredients": [
        "1 butternut squash (2 pounds)",
        "2 tablespoons olive oil",
        "Kosher salt and freshly ground black pepper",
        "6 cups chicken stock, preferably homemade",
        "6 tablespoons (3/4 stick) unsalted butter",
        "2 ounces pancetta, diced",
        "1/2 cup minced shallots (2 large)",
        "1 1/2 cups Arborio rice (10 ounces)",
        "1/2 cup dry white wine",
        "1 teaspoon saffron threads",
        "1 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Butternut Squash Risotto",
        "Butternut Squash",
        "Risotto Recipes",
        "Vegetable",
        "Italian",
        "Rice Recipes",
        "Appetizer",
        "Main Dish Recipes",
        "Lunch",
        "Roasting"
    ],
    "title": "Saffron Risotto with Butternut Squash",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/butternut-squash-risotto-recipe"
}
