{
    "directions": [
        "Preheat oven to 375  degrees F (190 degrees C). Pour 1 cup of water into 9x13 baking dish.",
        "Place the butternut squash into the prepared baking dish, cut side down.",
        "Bake in preheated oven until squash is easily pierced with a fork, about 45 minutes.",
        "Meanwhile, place the rice and remaining 1 cup of water into a saucepan. Bring to a boil, uncovered, over medium-high heat. Reduce heat to low, cover, and simmer until water is absorbed and rice is fluffy, about 20 minutes. Remove from the heat and fluff with a fork.",
        "Heat the olive oil in a large soup pot over medium-high heat. Stir in the onion, and cook until tender and transparent, about 5 minutes. Mix in the turkey sausage; cook until crumbly and evenly browned. Drain any excess fat. Stir in the cooked rice and corn.",
        "Scoop out cooked squash and place in a blender or bowl of a food processor. Discard squash peels. Pour chicken broth into the blender or bowl of a food processor with the squash. Blend until smooth, about 1 minute.",
        "Stir squash mixture into the sausage mixture until well blended. Season with pepper, and salt to taste. If desired, stir in the heavy cream. Simmer soup over medium heat until heated through, about 15 minutes, but do not boil."
    ],
    "ingredients": [
        "2 cups water",
        "1/2 cup long grain white rice",
        "1 unpeeled butternut squash, halved and seeded",
        "1 tablespoon olive oil",
        "1 large yellow onion, chopped",
        "1 1/4 pounds spicy turkey sausage, casings removed",
        "1 cup frozen corn",
        "2 (13.75 ounce) cans chicken broth",
        "salt to taste",
        "1 tablespoon ground black pepper, or to taste",
        "salt, to taste",
        "1/2 cup heavy cream (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Butternut Squash and Spicy Sausage Soup",
    "url": "http://allrecipes.com/recipe/150317/butternut-squash-and-spicy-sausage-so/"
}
