{
    "directions": [
        "Preheat oven to 350°F. Line bottom of 9-inch-diameter springform pan with 3-inch-high sides with foil. Butter and flour foil. Blend first 4 ingredients in processor until nuts are finely chopped. Add butter, yolk and extract and blend until mixture begins to gather together. Press onto bottom (not sides) of prepared pan. Bake until golden about 25 minutes. Transfer to rack. Cool 10 minutes. Release cake pan sides from crust. Gently turn out crust onto rack; peel off foil and cool. Place crust back into pan and reattach pan sides. Maintain oven temperature.",
        "Using electric mixer, beat cream cheese, 1 1/4 cups sugar, Scotch and vanilla in large bowl until well blended. Add eggs 1 at a time, beating just until combined. Pour into crust-lined pan. Bake cheesecake until set at edges but center 3-inch area still moves slightly when pan is shaken, about 50 minutes. Place on rack; cool 10 minutes.",
        "Mix sour cream with remaining 1/4 cup sugar. Spoon sour cream mixture over cheesecake. Bake 10 minutes. Transfer cheesecake to rack and cool 10 minutes. Run small sharp knife around top edge of pan to loosen cake. Chill overnight. (Can be made 2 days ahead.)",
        "Stir sugar and 2/3 cup Scotch in heavy large saucepan over medium heat until sugar dissolves. Increase heat and boil without stirring until syrup turns golden, occasionally brushing down sides of pan with pastry brush dipped into water and swirling pan. Add 2/3 cup cream and butter (mixture will bubble) and stir until smooth. Cool 10 minutes. Stir in 1 tablespoon Scotch. Let stand until cool but still pourable, about 2 hours. Mix in 1/2 cup almonds.",
        "Spoon all but 1/2 cup butterscotch topping over cheesecake (reserve remainder for another use). Sprinkle with remaining 1/4 cup chopped almonds. Refrigerate up to 1 hour.",
        "Run sharp knife around pan sides to loosen cake. Release pan sides. Spoon cream into pastry bag fitted with star tip. Pipe cream over top edge of cake."
    ],
    "ingredients": [
        "1 cup unbleached all purpose flour",
        "1/3 cup sugar",
        "1/4 cup almonds, toasted",
        "1/4 teaspoon salt",
        "7 tablespoons chilled unsalted butter, cut into pieces",
        "1 egg yolk",
        "1/4 teaspoon almond extract",
        "4 8-ounce packages cream cheese, room temperature",
        "1 1/2 cups sugar",
        "1/4 cup Scotch whisky",
        "1 tablespoon vanilla extract",
        "4 large eggs",
        "2 cups sour cream",
        "2 cups sugar",
        "2/3 cup plus 1 tablespoon Scotch whisky",
        "2/3 cup whipping cream",
        "1/4 cup (1/2 stick) unsalted butter",
        "3/4 cup very coarsely chopped toasted almonds (about 3 1/2 ounces)",
        "Sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Cheese",
        "Dairy",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Almond",
        "Whiskey",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Butterscotch Almond Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/butterscotch-almond-cheesecake-1824"
}
