{
    "directions": [
        "Sterilize the jars and lids in boiling water for at least 5 minutes.",
        "Bring apples, water, and butter to a boil in a large pot. Reduce heat to low, cover, and simmer until apples are softened, about 8 minutes. Mix in brown sugar, white sugar, pectin powder, and butter flavoring. Bring to a full rolling boil, stirring often. Cook at a boil for 2 minutes without stirring.",
        "Pack the apple jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Let stand 8 hours to overnight before use. Store in a cool, dark area; refrigerate opened jars."
    ],
    "ingredients": [
        "8 half-pint canning jars with lids and rings",
        "8 cups Granny Smith apples - peeled, cored, and chopped",
        "1/3 cup water",
        "1 tablespoon butter",
        "3 cups brown sugar",
        "2 cups white sugar",
        "1 1/2 (1.75 ounce) packages powdered fruit pectin",
        "1 tablespoon clear butter flavoring (such as Wilton®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Buttery Caramel Apple Jam",
    "url": "http://allrecipes.com/recipe/228921/buttery-caramel-apple-jam/"
}
