{
    "directions": [
        "Preheat oven to 350 degrees F. Heat olive oil in a medium saucepan over medium heat. When hot, add the shallot and cook until slightly softened, about 3 minutes. Mix in the chopped garlic and cook for an additional minute, until fragrant. Add squash and water. Cover the pan and cook for about 15 to 20 minutes until squash has softened. Remove from heat; set aside.",
        "Melt butter in a large saucepan over medium heat. Add flour and stir, cooking flour for about 1 minute. In a steady stream, pour in the milk and whisk vigorously until the bechamel sauce has thickened and is very smooth, about 5 to 7 minutes. Season with salt and pepper.",
        "Ladle about 1 cup of the bechamel sauce into a blender. Add the squash in batches, and blend until very smooth, adding more bechamel sauce if more liquid is needed. Be sure to allow steam to escape as you process. This can also be done with an immersion blender.",
        "Pour the butternut squash bechamel sauce mixture back into the pot holding the remaining bechamel sauce; stir until combined. In a small skillet, cook the chorizo over medium heat, breaking it up into crumbles as it cooks. Set aside.",
        "To assemble the lasagna, ladle about 1/4 cup of butternut squash bechamel sauce into the bottom of a 9x13 inch baking dish. Spread the sauce around evenly and top with 3 lasagna sheets, laying them side by side. Top with about 1/2 cup of the sauce, spreading it into one even layer. Then add a few spoonfuls of chorizo crumbles and a handful of Monterey Jack. Repeat the layering process a few more times until all but three lasagna sheets are used -- about 3 layers. Finally, top the lasagna with the last 3 lasagna sheets, a handful of Monterey Jack, and all of the Parmesan cheese.",
        "Cover the baking dish with Reynolds Wrap(R) Aluminum Foil and bake for 15 minutes at 350 degrees F. Uncover and transfer the lasagna to the broiler, cooking about 5 minutes until the top is golden brown. Top with fresh cilantro. Slice and serve. Lasagna stays good in the refrigerator (and heats up nicely!) for up to 3 days."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 shallot, peeled and roughly chopped",
        "2 cloves garlic, peeled and roughly chopped",
        "1 (1 1/2) pound butternut squash - peeled, seeded and cut into 1-inch cubes",
        "1/2 cup water",
        "1/3 cup butter",
        "1/3 cup all-purpose flour",
        "3 1/2 cups whole milk",
        "Salt and freshly ground black pepper to taste",
        "1/2 pound chorizo sausage links, casing removed",
        "1 pound lasagna sheets",
        "2 1/2 cups shredded Monterey Jack cheese",
        "1/2 cup grated Parmesan cheese",
        "1/4 cup chopped fresh cilantro leaves, for garnish",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Butternut Squash Chorizo Lasagna",
    "url": "http://allrecipes.com/recipe/244893/butternut-squash-chorizo-lasagna/"
}
