{
    "directions": [
        "Steam squash until just tender, about 5 minutes. Transfer to bowl. Steam broccoli until crisp-tender, about 4 minutes. Transfer to another bowl; set aside.",
        "Spray four 1 1/4-cup custard cups with nonstick spray. Bring broth and rice to boil in heavy large saucepan. Reduce heat to low, cover and cook until rice is tender but some liquid remains, stirring often, about 20 minutes. Uncover; stir until rice is creamy, about 2 minutes. Meanwhile, heat 1 tablespoon oil in medium nonstick skillet over medium-high heat. Add onion; sauté until golden, about 5 minutes. Add parsley, thyme, and 1 minced garlic clove; sauté 1 minute. Add squash and sun-dried tomatoes; stir to heat through. Mix vegetable mixture and feta into rice. Season with salt and pepper. Divide hot rice mixture among prepared custard cups; press down with back of spoon to compact. Unmold 1 rice timbale onto each of 4 plates.",
        "Heat 1 tablespoon oil in large nonstick skillet over medium-high heat. Add 3 garlic cloves and broccoli; sauté until heated through, about 2 minutes. Spoon broccoli around timbales and serve."
    ],
    "ingredients": [
        "2 cups 1/2-inch pieces peeled butternut squash (about 1 pound)",
        "3 cups trimmed broccoli florets",
        "Nonstick vegetable oil spray",
        "2 1/2 cups canned vegetable broth",
        "1 cup Arborio rice or medium-grain white rice",
        "2 tablespoons olive oil",
        "1 cup chopped onion",
        "2 tablespoons chopped fresh parsley",
        "1 teaspoon chopped fresh thyme",
        "4 garlic cloves, minced",
        "2 tablespoons chopped drained oil-packed sun-dried tomatoes",
        "1/3 cup crumbled feta cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Side",
        "Sauté",
        "Vegetarian",
        "Feta",
        "Broccoli",
        "Butternut Squash",
        "Fall",
        "Healthy",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Butternut Squash and Rice Timbales",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-and-rice-timbales-105789"
}
