{
    "directions": [
        "Place the pears in a bowl with the lemon juice, cover with water, and set aside.",
        "In a large saucepan, heat the olive oil over high heat until lightly smoking. Add the onion, celery, and carrot, and sauté for 2 to 3 minutes, or until the onion is translucent. Add the garlic and ginger and sauté for 1 minute longer, stirring constantly. Add the white wine and reduce the liquid until the pan is almost dry, about 3 minutes.",
        "Drain half of the pears, reserving the other half in the lemon water for garnish. Add the drained pears to the pan with the squash, potato, and stock and bring to a boil. Reduce the heat to a simmer and cook for 30 minutes, or until the squash is tender. Transfer half of the soup in batches to a blender and puree until smooth. Strain through a fine-mesh sieve back into the saucepan with the unpureed mixture. Add the orange juice, lemon juice, cream, salt, and the reserved pears and gently warm the chowder through (do not boil). The chowder can be made 1 day ahead."
    ],
    "ingredients": [
        "2 Anjou or Bosc pears, peeled, cored, and diced",
        "Juice of 2 lemons",
        "2 tablespoons olive oil",
        "1 cup peeled and diced Vidalia or Spanish onion",
        "1 stalk celery, diced",
        "1 small carrot, peeled and diced",
        "1 tablespoon minced garlic",
        "1 teaspoon peeled minced fresh ginger",
        "1/2 cup dry white wine",
        "2 small butternut squash, peeled, seeded, and diced (about 3 cups)",
        "1 baking potato (about 12 ounces), peeled and diced",
        "5 cups Vegetable Stock or store-bought",
        "1/4 cup freshly squeezed orange juice",
        "1 tablespoon freshly squeezed lemon juice",
        "1/2 cup heavy cream",
        "Salt to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Citrus",
        "Ginger",
        "Onion",
        "Appetizer",
        "Thanksgiving",
        "Vegetarian",
        "Pear",
        "Butternut Squash",
        "Fall",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Butternut Squash Chowder with Pears and Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-chowder-with-pears-and-ginger-104135"
}
