{
    "directions": [
        "Preheat an oven to 425ºF (220ºC). Line a baking sheet with aluminum foil.",
        "In a bowl, toss the squash with 1 Tbs. of the olive oil and season with salt and pepper. Transfer to the prepared baking sheet. Roast until the squash is tender, 20 to 30 minutes.",
        "In a large bowl, whisk together the eggs, salt and pepper. Fold in the 2 tsp. sage, the 2 Tbs. parsley and the pecorino romano.",
        "In the deep half of a large frittata pan over medium-high heat, warm 1 Tbs. of the olive oil. Add the sausage and cook, breaking up the large pieces, until well browned, about 8 minutes. Drain on paper towels.",
        "In the same pan over medium heat, warm 2 Tbs. of the olive oil. Add the onion and cook, stirring occasionally, until tender, 6 to 8 minutes. Add the kale and cook, stirring occasionally, until wilted, 2 to 3 minutes. Season with salt and pepper. Add the squash and sausage to the pan.",
        "In the shallow pan over medium heat, warm the remaining 1 tsp. olive oil. Add the egg mixture to the deep pan, stirring to evenly distribute the vegetables. Place the shallow pan upside down on top of the deep pan, and cook until the edges of the frittata are golden and the center is beginning to set, 4 to 6 minutes.",
        "Uncover the pan and run a spatula around the edge of the frittata. Cover with the shallow pan and flip the frittata into the shallow pan. Dollop the top of the frittata with the ricotta cheese. Cover and cook until the eggs are set, 4 to 5 minutes.",
        "Slide the frittata onto a cutting board and garnish with sage and parsley. Let the frittata rest for 5 minutes, then cut into slices and serve. Serves 8.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "1/2 small butternut squash, seeded, peeled and cut crosswise\n  into 1/4-inch (6-mm) half-moons",
        "4 Tbs. (2 fl. oz./60 ml) plus 1 tsp. olive oil",
        "Kosher salt and freshly ground pepper, to taste",
        "12 eggs",
        "2 tsp. chopped fresh sage, plus more for garnish",
        "2 Tbs. chopped fresh flat-leaf parsley, plus more for garnish",
        "1 cup (4 oz./125 g) finely grated pecorino romano cheese",
        "1/2 lb. (250 g) bulk sweet Italian sausage",
        "1 small yellow onion, diced",
        "1/2 bunch Tuscan kale, stemmed and cut into 1-inch (2.5-cm)\n  strips",
        "1/2 cup (4 oz./125 g) ricotta cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Butternut Squash, Kale and Sausage Frittata",
    "url": "http://www.williams-sonoma.com/recipe/butternut-squash-kale-frittata.html"
}
