{
    "directions": [
        "Preheat oven to 350°F.",
        "Place squash cut side down on rimmed one-inch-deep sheet pan. Add 2 cups water and roast until squash is very tender, about 45 minutes. Remove from oven, drain off any remaining water, and let cool.",
        "Meanwhile, in heavy, 12-quart pot over moderate heat, melt butter. Add onions, garlic, celery, 3 tablespoons salt, and 1 teaspoon pepper and sauté until onions are soft, about 10 minutes. Add apples and sauté until tender, about 3 to 4 minutes. Add apple cider and bring to boil. Reduce heat and simmer uncovered until liquid is reduced by half.",
        "When squash is cool enough to handle, scoop out flesh and add to soup. Add stock and remaining tablespoon salt, raise heat to high, and bring to boil. Reduce heat and simmer uncovered until all vegetables are tender, about 25 minutes.",
        "In double boiler over medium heat, heat cheese and heavy cream, stirring occasionally, until melted, about 10 minutes. Keep warm.",
        "In dry, heavy, 9- to 10-inch cast iron skillet over moderate heat, toast pumpkin seeds, stirring constantly, until puffed and golden, 4 to 5 minutes. Transfer to bowl.",
        "Working in batches, purée soup in blender until very smooth, then return to pot. Set over moderate heat and return to simmer.",
        "To serve, ladle hot soup into bowls, drizzle with blue cheese mixture, and sprinkle with toasted pumpkin seeds. Serve immediately."
    ],
    "ingredients": [
        "6 pounds butternut squash, split lengthwise and seeded",
        "1 cup (2 sticks) unsalted butter",
        "1 medium onion, finely chopped",
        "2 garlic cloves, finely chopped",
        "1 celery rib, finely chopped",
        "4 tablespoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "3 apples (Braeburn, Fuji, or Gala), peeled, cored, and sliced thinly",
        "3 cups apple cider",
        "1 gallon vegetable stock",
        "1/2 pound blue cheese",
        "1/2 cup heavy cream",
        "2 tablespoons green (hulled) pumpkin seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Blender",
        "Fruit",
        "Roast",
        "Sauté",
        "Thanksgiving",
        "Vegetarian",
        "Blue Cheese",
        "Apple",
        "Butternut Squash",
        "Fall",
        "Double Boiler"
    ],
    "title": "Butternut Squash & Apple Soup with Melted Blue Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-apple-soup-with-melted-blue-cheese-235924"
}
