{
    "directions": [
        "Heat oil in large skillet over medium-high heat. Add sausage. Sauté until cooked through, about 6 minutes. Using slotted spoon, transfer to bowl. Add diced fennel, leeks, and shallots to skillet. Sauté 8 minutes. Add garlic and wine. Boil 3 minutes, scraping up browned bits. Scrape into bowl with sausage. Cool. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
        "Mix breadcrumbs, Parmesan, and ricotta into stuffing. Whisk eggs, sage, rosemary, 1 teaspoon salt, pepper, and fennel fronds in bowl. Stir into stuffing.",
        "Mix fennel seeds, rosemary, salt, and pepper, then oil in small bowl. Rinse turkey; pat dry. Place turkey, skin side down, on work surface. Spread half of fennel oil over flesh side. Turn turkey over onto large rimmed baking sheet. Tuck wing tips under.",
        "Starting at neck end, run fingers gently under skin of breast, thigh, and legs. Spread stuffing under skin. Massage to even out thickness of stuffing. Spread fennel oil over turkey skin.",
        "Set rack at lowest position in oven and preheat to 350°F. Pour 1 cup stock or broth onto baking sheet under turkey.",
        "Roast turkey until thermometer inserted into thickest part of thigh registers 160°F to 165°F, adding stock by cupfuls if pan is dry, 2 to 2 1/2 hours. Transfer turkey to platter; let rest 30 to 45 minutes. Reserve baking sheet with juices. While turkey rests, prepare Fennel Pan Gravy . Serve turkey with gravy.",
        "Prepare barbecue (medium heat). Remove top grill rack. If using charcoal, light briquettes in chimney. When covered with white ash, push to opposite sides of bottom rack. Place disposable aluminum pan in center of rack (you will need to light additional briquettes, checking every 30 minutes during grilling time). Replace top rack. If using 3-burner gas grill, light burners on left and right sides, leaving center burner off. If using 2-burner gas grill, light burner on 1 side; place disposable pan over unlit side.",
        "Place turkey, skin side up, on rack over pan; cover. Insert instant-read thermometer into hole in hood. Maintain temperature at 350°F on charcoal grill by opening and closing vents or adjusting temperature on gas grill with controls. Grill until thermometer inserted into thickest part of thigh registers 160°F to 165°F, tenting with foil if browning too quickly, 13/4 to 2 hours. Transfer turkey to platter; let rest 30 to 45 minutes (internal temperature will rise 5 to 10 degrees).",
        "Serve grilled turkey with Mixed- Mushroom and Tarragon Gravy."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1 1/2 pounds sweet Italian sausages, casings removed, broken into pieces",
        "2 medium fresh fennel bulbs, trimmed, diced, plus 1/4 cup chopped fronds",
        "2 cups chopped leeks (white and pale green parts only)",
        "1/2 cup chopped shallots",
        "5 garlic cloves, thinly sliced",
        "1/2 cup dry white wine",
        "2 cups fresh breadcrumbs made from crustless country-style French bread",
        "1 cup freshly grated Parmesan cheese",
        "1 cup whole-milk ricotta cheese",
        "2 large eggs",
        "2 teaspoons chopped fresh sage",
        "2 teaspoons chopped fresh rosemary",
        "1 teaspoon salt",
        "3/4 teaspoon ground black pepper",
        "1 tablespoon fennel seeds, ground",
        "2 teaspoons minced fresh rosemary",
        "1 tablespoon salt",
        "2 teaspoons ground black pepper",
        "3 tablespoons olive oil",
        "1 12- to 14-pound turkey; neck, heart, and gizzard reserved for Ultimate Turkey Stock Turkey Stock",
        "2 cups (or more) Ultimate Turkey Stock or low-salt chicken broth",
        "Fresh Fennel Pan Gravy if roasting the turkey, or Mixed-Mushroom and Tarragon Gravy if grilling the turkey",
        "Special equipment: Charcoal chimney (if grilling) 13x9x2-inch disposable aluminum baking pan (to catch drips; if grilling)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Ricotta",
        "Sausage",
        "Fennel",
        "Fall",
        "Grill",
        "Grill/Barbecue",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Butterflied Turkey with Fennel, Sausage, and Ricotta Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/butterflied-turkey-with-fennel-sausage-and-ricotta-stuffing-361749"
}
