{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place the squash cut side up on a baking sheet. Place 1 tablespoon butter in the hollow of each half. Sprinkle with salt and pepper to taste. Cover the squash with a sheet of aluminum foil tucking in the edges.",
        "Bake squash in preheated oven until tender and easily pierced with a fork, 45 to 65 minutes.",
        "Scoop the cooked squash into a bowl, and mash until smooth. Mix in the allspice, nutmeg, cinnamon, and Parmesan cheese until well blended. Season to taste with salt and pepper.",
        "Fill a deep pot with lightly salted water and bring to a boil.",
        "To make the ravioli, place a wonton wrapper on a clean, flat surface. Brush edges with the egg white. Place about 1 tablespoon of the squash mixture in the middle of the wonton. Cover with a second wonton wrapper. Repeat with remaining wonton wrappers and squash mixture until all have been used.",
        "Drop the ravioli into the boiling water, and cook for 3 to 5 minutes, or until tender. Remove, drain, and keep warm until sauce is prepared.",
        "To make the sauce, melt the butter in a skillet over medium heat. Stir in the sage. Continue to cook and stir until the sage is crispy but not browned. Add salt and pepper to taste. Place 6 to 8 raviolis on serving plates, and drizzle with sauce."
    ],
    "ingredients": [
        "1 large butternut squash - halved lengthwise, peeled and seeded",
        "2 teaspoons butter",
        "salt and ground black pepper to taste",
        "1/2 teaspoon allspice",
        "1/2 teaspoon ground nutmeg",
        "2 teaspoons ground cinnamon",
        "1/2 cup Parmesan cheese",
        "50 wonton wrappers",
        "1 teaspoon egg white, lightly beaten",
        "Sauce",
        "1/4 cup unsalted butter",
        "1/4 cup chopped fresh sage leaves",
        "salt and freshly ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Butternut Squash Ravioli with Sage-Brown Butter Sauce",
    "url": "http://allrecipes.com/recipe/65892/butternut-squash-ravioli-with-sage-br/"
}
