{
    "directions": [
        "Mix cream and milk in large bowl. Whisk egg, egg yolks, and cornstarch in medium bowl. Stir sugar, 1/2 cup water, and salt in heavy large pot over medium-low heat until sugar dissolves. Increase heat to medium-high and boil without stirring until mixture turns thick, syrupy, and dark amber, occasionally swirling pot and brushing down sides with wet pastry brush, about 7 minutes. Immediately whisk in cream mixture (mixture will bubble vigorously). Stir to dissolve caramel bits. Bring mixture to boil, watching closely to prevent mixture from bubbling over, then reduce heat to medium. Gradually whisk half of hot caramel mixture into egg mixture. Return mixture to pot, whisking to blend. Whisk over medium heat until custard boils and is very thick, about 2 minutes. Remove from heat. Add butter and rum; stir until melted and smooth. Strain.",
        "Divide custard among ten 6-ounce glasses or cups. Chill uncovered until cold, about 4 hours. DO AHEAD: Can be made 1 day ahead. Cover and keep refrigerated.",
        "Place 1/2 cup cream in small saucepan. Scrape in seeds from vanilla bean; add bean. Bring to simmer over medium heat. Add butter and set aside. Stir sugar, corn syrup, and 2 tablespoons water in heavy large saucepan over medium-low heat until sugar dissolves. Increase heat to medium-high and boil without stirring until mixture turns medium amber color, occasionally swirling pan and brushing down sides with wet pastry brush, about 6 minutes. Immediately whisk in cream mixture (mixture will bubble vigorously). Stir to dissolve caramel bits. Set pan in large bowl of ice water to cool. Discard vanilla bean. DO AHEAD: Caramel sauce can be made 1 day ahead. Cover and chill.",
        "Using electric mixer, beat remaining 1/4 cup cream in medium bowl until peaks form. Add crme frache and beat until soft peaks form. Place 1 budino on each of 10 plates. Reheat caramel sauce just until warm. Spoon 1 tablespoon caramel sauce over each budino. Spoon dollop of whipped crème fraîche over and sprinkle with fleur de sel.",
        "*A type of sea salt; available at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "3 cups heavy whipping cream",
        "1 1/2 cups whole milk",
        "1 large egg",
        "3 large egg yolks",
        "1/4 cup cornstarch",
        "1 cup plus 2 tablespoons (packed) dark brown sugar",
        "1/2 cup water",
        "1 1/2 teaspoons coarse kosher salt",
        "5 tablespoons unsalted butter",
        "1 1/2 tablespoons dark rum",
        "3/4 cup heavy whipping cream, divided",
        "1 1-inch piece vanilla bean, halved lengthwise",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1/2 cup sugar",
        "2 tablespoons light corn syrup",
        "2 tablespoons water",
        "3/4 cup crème fraîche or sour cream",
        "Fleur de sel*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Egg",
        "Dessert",
        "Vanilla",
        "Winter",
        "Chill",
        "Sour Cream",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Butterscotch Budino with Whipped Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/butterscotch-budino-with-whipped-creme-fraiche-239847"
}
