{
    "directions": [
        "Preheat oven to 350°F. Butter and flour pan. Whisk baking soda, salt, and 2 cups flour in a medium bowl; set aside.",
        "Preheat oven to 350°F. Butter and flour pan. Whisk baking soda, salt, and 2 cups flour in a medium bowl; set aside.",
        "Using an electric mixer, beat sugar and 1 1/4 cups butter in another medium bowl until light and fluffy, about 4 minutes. Add eggs one at a time, beating to blend between additions and scraping down sides of bowl.",
        "Reduce mixer speed to low and, with motor running, add dry ingredients in 3 additions alternating with buttermilk in 2 additions, beginning and ending with dry ingredients. Scrape batter into prepared pan.",
        "Bake until cake is golden and a tester inserted into the center comes out clean, 40-45 minutes. Transfer pan to a wire rack and let cake cool before turning out.",
        "DO AHEAD: Cake can be made 2 days ahead. Store tightly wrapped at room temperature.",
        "Bring milk and sugar to a boil in a small saucepan over medium heat, stirring to dissolve sugar; reduce heat and simmer gently, whisking occasionally, until mixture measures a scant 1/4 cup, 20-25 minutes. Transfer to a small bowl; let cool (it will thicken as it sits). Whisk in crème fraîche, cover, and chill.",
        "DO AHEAD: Jam can be made 2 days ahead. Keep chilled.",
        "Bring cherries, gin, sugar, juniper berries, and 1 cup water to a boil in a medium saucepan; reduce heat and simmer until liquid is syrupy, 6-8 minutes. Let cool.",
        "Spoon a few dollops of jam onto plates. Tear cake into pieces and arrange around jam. Top with cherries and fennel fronds.",
        "DO AHEAD: Cherries can be poached 3 days ahead. Cover and chill."
    ],
    "ingredients": [
        "1 1/4 cups (2 1/2 sticks) unsalted butter, room temperature, plus more",
        "2 cups all-purpose flour plus more",
        "1 teaspoon baking soda",
        "1 teaspoon kosher salt",
        "1 cup sugar",
        "2 large eggs",
        "1 cup buttermilk",
        "1 cup whole milk",
        "1/2 cup sugar",
        "1 cup crème fraîche",
        "1 cup dried tart cherries",
        "1 cup gin",
        "1/2 cup sugar",
        "2 teaspoons juniper berries",
        "Fennel fronds (for serving)",
        "Special equipment: A 9\"-diameter cake pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Gin",
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Cherry",
        "Buttermilk",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Buttermilk Cake with Sour Milk Jam and Gin-Poached cherries",
    "url": "http://www.epicurious.com/recipes/food/views/buttermilk-cake-with-sour-milk-jam-and-gin-poached-cherries-51187430"
}
