{
    "directions": [
        "Cook onion in butter in a deep 12-inch heavy skillet over moderate heat, stirring occasionally, until golden, about 10 minutes. Add squash, garlic, salt, and white pepper and cook, stirring occasionally, until squash is just tender, about 15 minutes. Remove from heat and stir in parsley, sage, and nuts. Cool filling.",
        "Cook garlic in butter in a 3-quart heavy saucepan over moderately low heat, stirring, 1 minute. Whisk in flour and cook roux, whisking, 3 minutes. Add milk in a stream, whisking. Add bay leaf and bring to a boil, whisking constantly, then reduce heat and simmer, whisking occasionally, 10 minutes. Whisk in salt and white pepper and remove from heat. Discard bay leaf. (Cover surface of sauce with wax paper if not using immediately.)",
        "Preheat oven to 425°F.",
        "Toss cheeses together. Spread 1/2 cup sauce in a buttered 13- by 9- by 2-inch glass baking dish (or other shallow 3-quart baking dish) and cover with 3 pasta sheets, leaving spaces between sheets. Spread with 2/3 cup sauce and one third of filling, then sprinkle with a heaping 1/2 cup cheese. Repeat layering 2 more times, beginning with pasta sheets and ending with cheese. Top with remaining 3 pasta sheets, remaining sauce, and remaining cheese.",
        "Tightly cover baking dish with buttered foil and bake lasagne in middle of oven 30 minutes. Remove foil and bake until golden and bubbling, 10 to 15 minutes more. Let lasagne stand 15 to 20 minutes before serving."
    ],
    "ingredients": [
        "1 large onion, chopped",
        "3 tablespoons unsalted butter",
        "3 lb butternut squash, peeled, seeded, and cut into 1/2-inch pieces",
        "1 teaspoon minced garlic",
        "1 teaspoon salt",
        "1/4 teaspoon white pepper",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "4 teaspoons chopped fresh sage",
        "1 cup hazelnuts (4 oz), toasted , loose skins rubbed off with a kitchen towel, and coarsely chopped",
        "1 teaspoon minced garlic",
        "3 tablespoons unsalted butter",
        "5 tablespoons all-purpose flour",
        "5 cups milk",
        "1 bay leaf (not California)",
        "1 teaspoon salt",
        "1/8 teaspoon white pepper",
        "1/2 lb fresh mozzarella, coarsely grated (2 cups)",
        "1 cup finely grated Parmigiano-Reggiano (3 oz)",
        "12 (7- by 3 1/2-inch) sheets no-boil lasagne (1/2 lb)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Pasta",
        "Vegetable",
        "Bake",
        "Christmas",
        "Vegetarian",
        "Buffet",
        "Casserole/Gratin",
        "Butternut Squash",
        "Fall",
        "Winter",
        "Hazelnut",
        "Gourmet"
    ],
    "title": "Butternut Squash and Hazelnut Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-and-hazelnut-lasagne-105911"
}
