{
    "directions": [
        "Using the side of a chef's knife, mash jalapeño, lime zest, and orange zest with a pinch of salt on a cutting board to a paste. Transfer to a medium bowl and mix in shallot, orange juice, lime juice, fish sauce, and soy sauce. Season dressing with salt and pepper.",
        "Season trout with salt and pepper. Heat 1 tablespoon oil in a large skillet over medium-high. Cook 1 trout, skin side down, until golden brown and crisp, about 4 minutes (flesh will be nearly cooked through). Remove from heat, turn fish, and let sit until cooked through, about 1 minute more. Transfer trout to a platter. Wipe out skillet; repeat with remaining trout and 1 tablespoon oil.",
        "Toss lettuce, celery, celery leaves (if using), cilantro, mint, and 3 tablespoons dressing in a large bowl; season with salt and pepper. Top trout with salad and spoon remaining dressing over."
    ],
    "ingredients": [
        "1/2 jalapeño, with seeds, very finely chopped",
        "1 tablespoon finely grated lime zest",
        "1 tablespoon finely grated orange zest",
        "Kosher salt",
        "1 small shallot, thinly sliced into rings",
        "1/4 cup fresh orange juice",
        "3 tablespoons fresh lime juice",
        "1 tablespoon fish sauce (such as nam pla or nuoc nam)",
        "1 tablespoon soy sauce",
        "Freshly ground black pepper",
        "2 (14–16-ounce) whole butterflied rainbow trout",
        "2 tablespoons vegetable oil",
        "4 Little Gem, butter lettuce, or romaine hearts, leaves separated",
        "2 celery stalks, preferably with leaves, leaves reserved, stalks thinly sliced on a diagonal",
        "1 cup cilantro leaves with tender stems",
        "1/2 cup mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Trout",
        "Celery",
        "Summer",
        "Healthy",
        "Soy Sauce",
        "Lettuce"
    ],
    "title": "Butterflied Trout with Spicy Lettuce, Celery, and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/butterflied-trout-with-spicy-lettuce-celery-and-herbs-56389767"
}
