{
    "directions": [
        "Preheat oven to 425°F with rack in middle.",
        "Brush cut sides of squash with oil and sprinkle with 1/4 teaspoon each of salt and pepper (total). Roast in a shallow baking pan until golden brown and tender, 30 to 45 minutes. Cool to room temperature, then use a spoon to scoop out flesh, transferring it to a medium bowl and discarding rind. Stir in cheese, nutmeg, bread crumbs, and salt and pepper to taste.",
        "Quarter dough. Cover 3 pieces with plastic wrap. Pat out remaining piece into a flat rectangle; dust with flour.",
        "Set rollers of pasta machine on widest setting. Feed rectangle, a short side first, through rollers. Fold rectangle in thirds, like a letter, and feed it, a short side first, through rollers. Repeat 6 or 7 more times, folding dough in thirds and feeding it through rollers, a short side first each time, dusting with flour to prevent sticking.",
        "Turn dial to next (narrower) setting and feed dough through rollers without folding, a short side first. Continue to feed dough through without folding, making space between rollers narrower each time, until the second- or third-narrowest setting is used. (Do not roll too thin or pasta will tear when filled.)",
        "Put pasta sheet on a lightly floured surface and cut into 3-inch squares. Place a rounded teaspoon of filling in center of each square, then lightly moisten edges of square with water and fold in half to form a triangle, pressing down firmly but gently around filling to seal and forcing out any air. Bring 2 opposite corners together, overlapping ends, to make a small ring, then press them together. Transfer to a lightly floured kitchen towel (not terry cloth). Make more cappellacci with remaining pieces of dough and remaining filling, transferring to kitchen towel.",
        "Cook cappellacci in a pasta pot of simmering salted water (2 tablespoons salt for 4 quarts water) until al dente, 6 to 8 minutes. Gently drain pasta.",
        "Meanwhile, heat butter in a heavy medium skillet over medium heat, swirling, until golden brown, then cook sage, stirring, until sage is crisp and butter is deep golden brown. Stir in lemon juice and salt and pepper to taste.",
        "Serve cappellacci with sauce."
    ],
    "ingredients": [
        "Pasta dough",
        "1 pound butternut squash, halved and seeds discarded",
        "2 teaspoons extra-virgin olive oil",
        "3 tablespoons grated Parmigiano-Reggiano",
        "1/8 teaspoon grated nutmeg",
        "1 tablespoon fine dry bread crumbs",
        "5 tablespoons unsalted butter, cut into pieces",
        "1 1/2 tablespoons chopped sage",
        "1/4 teaspoon fresh lemon juice",
        "Equipment: a pasta machine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta Maker",
        "Roast",
        "Vegetarian",
        "Dinner",
        "Butternut Squash",
        "Sage",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Butternut Squash Cappellacci with Sage Brown Butter",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-cappellacci-with-sage-brown-butter-241985"
}
