{
    "directions": [
        "In a large bowl stir together water and yeast and let stand until foamy, about 5 minutes. Stir in flour and salt and blend until mixture forms a dough, adding additional tablespoon water if too dry. On a lightly floured surface knead dough about 10 minutes, or until smooth and elastic. (Alternatively, dough may be made in a standing electric mixer. In bowl of mixer make dough as described above. With dough hook knead dough about 5 minutes, or until smooth and elastic.)",
        "Put dough in a very lightly oiled deep bowl, turning to coat, and let rise, covered loosely, in a warm place 1 1/2 hours, or until doubled in bulk. Punch down dough and divide into 4 equal pieces. Dough keeps, each piece put in a small, sealable plastic bag and sealed, pressing out excess air, chilled overnight or frozen 2 weeks. If dough is frozen, thaw overnight in refrigerator before using. Makes enough dough for four 12- by 6-inch oval pizzas.",
        "Preheat oven to 450°F.",
        "In a bowl toss squash with oil and salt and pepper to taste. Spread squash in one layer in a shallow baking pan and roast in middle of oven, stirring once halfway through roasting, 15 minutes, or until lightly browned. Remove pan from oven and loosen squash with a metal spatula. Squash may be roasted 1 day ahead and chilled, covered.",
        "In a medium heavy saucepan stir together milk and flour and bring to a simmer over moderate heat, stirring constantly. Simmer sauce, stirring, 2 minutes and stir in nutmeg and salt to taste. Sauce may be made 1 day ahead and chilled, covered.",
        "Increase temperature to 500°F.",
        "On a work surface sprinkled with 1 teaspoon cornmeal roll out 1 piece of dough into a 12- by 6-inch oval and transfer to a baking sheet. Repeat with remaining cornmeal and dough, ending up with 2 ovals on each of 2 baking sheets.",
        "Spread sauce on dough ovals, leaving a 1/2-inch border around edge of each pizza, and sprinkle with Parmesan, squash, chopped sage, garlic, and pepper.",
        "Bake pizzas in lower and middle thirds of oven 15 minutes, or until crusts are crisp and pale golden. Garnish pizzas with sage sprigs."
    ],
    "ingredients": [
        "a 2 1/4-pound butternut squash, peeled, seeded, and cut into 1/2-inch cubes",
        "1 teaspoon vegetable oil",
        "1 1/2 cups low-fat (1%) milk",
        "2 tablespoons all-purpose flour",
        "a pinch freshly grated nutmeg",
        "4 teaspoons yellow cornmeal",
        "2/3 cup freshly grated Parmesan (about 2 ounces)",
        "1 tablespoon chopped fresh sage leaves",
        "1 large garlic clove, minced",
        "freshly ground black pepper to taste",
        "Garnish: fresh sage sprigs",
        "3/4 cup warm water (110°- 115°F.) plus additional tablespoon if necessary",
        "1 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Parmesan",
        "Butternut Squash",
        "Fall",
        "Sage",
        "Gourmet"
    ],
    "title": "Butternut Squash, Parmesan, and Sage Pizzas",
    "url": "http://www.epicurious.com/recipes/food/views/butternut-squash-parmesan-and-sage-pizzas-11360"
}
