{
    "directions": [
        "Sift flour, salt, baking powder, and baking soda together in a mixing bowl.",
        "Slice the butter into 1/8-inch to 1/4-inch pieces. Put the butter pieces in the flour and mix with your hands, gently rubbing the flour and butter together between your fingers without directly touching the butter to avoid melting it. Mix until the butter pieces are dime-size and covered by the flour mixture.",
        "Stir buttermilk into the flour mixture; mix just until ingredients are combined and form into a ball.",
        "Line a baking sheet with parchment paper.",
        "Dust work surface and top of dough with flour. Roll out dough into a 3/4-inch-thick rectangle. Fold into thirds (like a letter) using a bench scraper, if needed. Turn dough a half turn, and roll back into a 3/4 inch thick rectangle. Repeat twice more, folding and rolling dough a total of three times.",
        "Fold the dough into thirds once more and transfer the dough to the prepared pan. Cover with plastic wrap and refrigerate 20 minutes.",
        "Place the dough on the work surface and roll it out again to 3/4 inch thickness. Use a cookie or biscuit cutter to cut the dough into rounds.",
        "Place the biscuits about 1 inch apart on parchment-lined sheet pan. Cover biscuits and refrigerate for at least 20 minutes.",
        "Preheat oven to 500 degrees F (260 degrees C).",
        "Brush the tops of the biscuits with buttermilk. Place biscuits in preheated oven.",
        "Immediately reduce oven temperature to 375 degrees F (190 degrees C).",
        "Bake until biscuits are lightly browned and golden all around (any lighter and they will be doughy inside), 12 to 15 minutes. Allow biscuits to cool for 5 minutes; serve warm."
    ],
    "ingredients": [
        "3 1/2 cups all-purpose flour",
        "1 teaspoon salt",
        "2 teaspoons baking powder",
        "1/4 teaspoon baking soda",
        "1 1/2 cups cold LAND O LAKES® Butter",
        "1 1/2 cups cold buttermilk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Buttery Buttermilk Biscuits",
    "url": "http://allrecipes.com/recipe/247262/buttery-buttermilk-biscuits/"
}
